{
  "title": "Billionaires Build",
  "title_zh": "[待翻译] Billionaires Build",
  "url": "https://www.paulgraham.com/ace.html",
  "filename": "ace.html",
  "date": "2020-12-01",
  "id": 61,
  "content": {
    "success": true,
    "paragraphs": [
      "December 2020As I was deciding what to write about next, I was surprised to find that two separate essays I'd been planning to write were actually the same.The first is about how to ace your Y Combinator interview.",
      "There has been so much nonsense written about this topic that I've been meaning for years to write something telling founders the truth.The second is about something politicians sometimes say — that the only way to become a billionaire is by exploiting people — and why this is mistaken.Keep reading, and you'll learn both simultaneously.I know the politicians are mistaken because it was my job to predict which people will become billionaires.",
      "I think I can truthfully say that I know as much about how to do this as anyone. If the key to becoming a billionaire — the defining feature of billionaires — was to exploit people, then I, as a professional billionaire scout, would surely realize this and look for people who would be good at it, just as an NFL scout looks for speed in wide receivers.But aptitude for exploiting people is not what Y Combinator looks for at all.",
      "In fact, it's the opposite of what they look for. I'll tell you what they do look for, by explaining how to convince Y Combinator to fund you, and you can see for yourself.What YC looks for, above all, is founders who understand some group of users and can make what they want.",
      "This is so important that it's YC's motto: \"Make something people want.\"A big company can to some extent force unsuitable products on unwilling customers, but a startup doesn't have the power to do that.",
      "A startup must sing for its supper, by making things that genuinely delight its customers. Otherwise it will never get off the ground.Here's where things get difficult, both for you as a founder and for the YC partners trying to decide whether to fund you.",
      "In a market economy, it's hard to make something people want that they don't already have. That's the great thing about market economies. If other people both knew about this need and were able to satisfy it, they already would be, and there would be no room for your startup.Which means the conversation during your YC interview will have to be about something new: either a new need, or a new way to satisfy one.",
      "And not just new, but uncertain. If it were certain that the need existed and that you could satisfy it, that certainty would be reflected in large and rapidly growing revenues, and you wouldn't be seeking seed funding.So the YC partners have to guess both whether you've discovered a real need, and whether you'll be able to satisfy it.",
      "That's what they are, at least in this part of their job: professional guessers. They have 1001 heuristics for doing this, and I'm not going to tell you all of them, but I'm happy to tell you the most important ones, because these can't be faked; the only way to \"hack\" them would be to do what you should be doing anyway as a founder.The first thing the partners will try to figure out, usually, is whether what you're making will ever be something a lot of people want.",
      "It doesn't have to be something a lot of people want now. The product and the market will both evolve, and will influence each other's evolution. But in the end there has to be something with a huge market.",
      "That's what the partners will be trying to figure out: is there a path to a huge market? [1]Sometimes it's obvious there will be a huge market. If Boom manages to ship an airliner at all, international airlines will have to buy it.",
      "But usually it's not obvious. Usually the path to a huge market is by growing a small market. This idea is important enough that it's worth coining a phrase for, so let's call one of these small but growable markets a \"larval market.\"The perfect example of a larval market might be Apple's market when they were founded in 1976.",
      "In 1976, not many people wanted their own computer. But more and more started to want one, till now every 10 year old on the planet wants a computer (but calls it a \"phone\").The ideal combination is the group of founders who are \"living in the future\" in the sense of being at the leading edge of some kind of change, and who are building something they themselves want.",
      "Most super-successful startups are of this type. Steve Wozniak wanted a computer. Mark Zuckerberg wanted to engage online with his college friends. Larry and Sergey wanted to find things on the web. All these founders were building things they and their peers wanted, and the fact that they were at the leading edge of change meant that more people would want these things in the future.But although the ideal larval market is oneself and one's peers, that's not the only kind.",
      "A larval market might also be regional, for example. You build something to serve one location, and then expand to others.The crucial feature of the initial market is that it exist. That may seem like an obvious point, but the lack of it is the biggest flaw in most startup ideas.",
      "There have to be some people who want what you're building right now, and want it so urgently that they're willing to use it, bugs and all, even though you're a small company they've never heard of. There don't have to be many, but there have to be some.",
      "As long as you have some users, there are straightforward ways to get more: build new features they want, seek out more people like them, get them to refer you to their friends, and so on. But these techniques all require some initial seed group of users.So this is one thing the YC partners will almost certainly dig into during your interview.",
      "Who are your first users going to be, and how do you know they want this? If I had to decide whether to fund startups based on a single question, it would be \"How do you know people want this?\"The most convincing answer is \"Because we and our friends want it.\" It's even better when this is followed by the news that you've already built a prototype, and even though it's very crude, your friends are using it, and it's spreading by word of mouth.",
      "If you can say that and you're not lying, the partners will switch from default no to default yes. Meaning you're in unless there's some other disqualifying flaw.That is a hard standard to meet, though.",
      "Airbnb didn't meet it. They had the first part. They had made something they themselves wanted. But it wasn't spreading. So don't feel bad if you don't hit this gold standard of convincingness. If Airbnb didn't hit it, it must be too high.In practice, the YC partners will be satisfied if they feel that you have a deep understanding of your users' needs.",
      "And the Airbnbs did have that. They were able to tell us all about what motivated hosts and guests. They knew from first-hand experience, because they'd been the first hosts. We couldn't ask them a question they didn't know the answer to.",
      "We ourselves were not very excited about the idea as users, but we knew this didn't prove anything, because there were lots of successful startups we hadn't been excited about as users. We were able to say to ourselves \"They seem to know what they're talking about.",
      "Maybe they're onto something. It's not growing yet, but maybe they can figure out how to make it grow during YC.\" Which they did, about three weeks into the batch.The best thing you can do in a YC interview is to teach the partners about your users.",
      "So if you want to prepare for your interview, one of the best ways to do it is to go talk to your users and find out exactly what they're thinking. Which is what you should be doing anyway.This may sound strangely credulous, but the YC partners want to rely on the founders to tell them about the market.",
      "Think about how VCs typically judge the potential market for an idea. They're not ordinarily domain experts themselves, so they forward the idea to someone who is, and ask for their opinion. YC doesn't have time to do this, but if the YC partners can convince themselves that the founders both (a) know what they're talking about and (b) aren't lying, they don't need outside domain experts.",
      "They can use the founders themselves as domain experts when evaluating their own idea.This is why YC interviews aren't pitches. To give as many founders as possible a chance to get funded, we made interviews as short as we could: 10 minutes.",
      "That is not enough time for the partners to figure out, through the indirect evidence in a pitch, whether you know what you're talking about and aren't lying. They need to dig in and ask you questions.",
      "There's not enough time for sequential access. They need random access. [2]The worst advice I ever heard about how to succeed in a YC interview is that you should take control of the interview and make sure to deliver the message you want to.",
      "In other words, turn the interview into a pitch. ⟨elaborate expletive⟩. It is so annoying when people try to do that. You ask them a question, and instead of answering it, they deliver some obviously prefabricated blob of pitch.",
      "It eats up 10 minutes really fast.There is no one who can give you accurate advice about what to do in a YC interview except a current or former YC partner. People who've merely been interviewed, even successfully, have no idea of this, but interviews take all sorts of different forms depending on what the partners want to know about most.",
      "Sometimes they're all about the founders, other times they're all about the idea. Sometimes some very narrow aspect of the idea. Founders sometimes walk away from interviews complaining that they didn't get to explain their idea completely.",
      "True, but they explained enough.Since a YC interview consists of questions, the way to do it well is to answer them well. Part of that is answering them candidly. The partners don't expect you to know everything.",
      "But if you don't know the answer to a question, don't try to bullshit your way out of it. The partners, like most experienced investors, are professional bullshit detectors, and you are (hopefully) an amateur bullshitter.",
      "And if you try to bullshit them and fail, they may not even tell you that you failed. So it's better to be honest than to try to sell them. If you don't know the answer to a question, say you don't, and tell them how you'd go about finding it, or tell them the answer to some related question.If you're asked, for example, what could go wrong, the worst possible answer is \"nothing.\" Instead of convincing them that your idea is bullet-proof, this will convince them that you're a fool or a liar.",
      "Far better to go into gruesome detail. That's what experts do when you ask what could go wrong. The partners know that your idea is risky. That's what a good bet looks like at this stage: a tiny probability of a huge outcome.Ditto if they ask about competitors.",
      "Competitors are rarely what kills startups. Poor execution does. But you should know who your competitors are, and tell the YC partners candidly what your relative strengths and weaknesses are. Because the YC partners know that competitors don't kill startups, they won't hold competitors against you too much.",
      "They will, however, hold it against you if you seem either to be unaware of competitors, or to be minimizing the threat they pose. They may not be sure whether you're clueless or lying, but they don't need to be.The partners don't expect your idea to be perfect.",
      "This is seed investing. At this stage, all they can expect are promising hypotheses. But they do expect you to be thoughtful and honest. So if trying to make your idea seem perfect causes you to come off as glib or clueless, you've sacrificed something you needed for something you didn't.If the partners are sufficiently convinced that there's a path to a big market, the next question is whether you'll be able to find it.",
      "That in turn depends on three things: the general qualities of the founders, their specific expertise in this domain, and the relationship between them. How determined are the founders? Are they good at building things?",
      "Are they resilient enough to keep going when things go wrong? How strong is their friendship?Though the Airbnbs only did ok in the idea department, they did spectacularly well in this department. The story of how they'd funded themselves by making Obama- and McCain-themed breakfast cereal was the single most important factor in our decision to fund them.",
      "They didn't realize it at the time, but what seemed to them an irrelevant story was in fact fabulously good evidence of their qualities as founders. It showed they were resourceful and determined, and could work together.It wasn't just the cereal story that showed that, though.",
      "The whole interview showed that they cared. They weren't doing this just for the money, or because startups were cool. The reason they were working so hard on this company was because it was their project.",
      "They had discovered an interesting new idea, and they just couldn't let it go.Mundane as it sounds, that's the most powerful motivator of all, not just in startups, but in most ambitious undertakings: to be genuinely interested in what you're building.",
      "This is what really drives billionaires, or at least the ones who become billionaires from starting companies. The company is their project.One thing few people realize about billionaires is that all of them could have stopped sooner.",
      "They could have gotten acquired, or found someone else to run the company. Many founders do. The ones who become really rich are the ones who keep working. And what makes them keep working is not just money.",
      "What keeps them working is the same thing that keeps anyone else working when they could stop if they wanted to: that there's nothing else they'd rather do.That, not exploiting people, is the defining quality of people who become billionaires from starting companies.",
      "So that's what YC looks for in founders: authenticity. People's motives for starting startups are usually mixed. They're usually doing it from some combination of the desire to make money, the desire to seem cool, genuine interest in the problem, and unwillingness to work for someone else.",
      "The last two are more powerful motivators than the first two. It's ok for founders to want to make money or to seem cool. Most do. But if the founders seem like they're doing it just to make money or just to seem cool, they're not likely to succeed on a big scale.",
      "The founders who are doing it for the money will take the first sufficiently large acquisition offer, and the ones who are doing it to seem cool will rapidly discover that there are much less painful ways of seeming cool.",
      "[3]Y Combinator certainly sees founders whose m.o. is to exploit people. YC is a magnet for them, because they want the YC brand. But when the YC partners detect someone like that, they reject them. If bad people made good founders, the YC partners would face a moral dilemma.",
      "Fortunately they don't, because bad people make bad founders. This exploitative type of founder is not going to succeed on a large scale, and in fact probably won't even succeed on a small one, because they're always going to be taking shortcuts.",
      "They see YC itself as a shortcut.Their exploitation usually begins with their own cofounders, which is disastrous, since the cofounders' relationship is the foundation of the company. Then it moves on to the users, which is also disastrous, because the sort of early adopters a successful startup wants as its initial users are the hardest to fool.",
      "The best this kind of founder can hope for is to keep the edifice of deception tottering along until some acquirer can be tricked into buying it. But that kind of acquisition is never very big. [4]If professional billionaire scouts know that exploiting people is not the skill to look for, why do some politicians think this is the defining quality of billionaires?I think they start from the feeling that it's wrong that one person could have so much more money than another.",
      "It's understandable where that feeling comes from. It's in our DNA, and even in the DNA of other species.If they limited themselves to saying that it made them feel bad when one person had so much more money than other people, who would disagree?",
      "It makes me feel bad too, and I think people who make a lot of money have a moral obligation to use it for the common good. The mistake they make is to jump from feeling bad that some people are much richer than others to the conclusion that there's no legitimate way to make a very large amount of money.",
      "Now we're getting into statements that are not only falsifiable, but false.There are certainly some people who become rich by doing bad things. But there are also plenty of people who behave badly and don't make that much from it.",
      "There is no correlation — in fact, probably an inverse correlation — between how badly you behave and how much money you make.The greatest danger of this nonsense may not even be that it sends policy astray, but that it misleads ambitious people.",
      "Can you imagine a better way to destroy social mobility than by telling poor kids that the way to get rich is by exploiting people, while the rich kids know, from having watched the preceding generation do it, how it's really done?I'll tell you how it's really done, so you can at least tell your own kids the truth.",
      "It's all about users. The most reliable way to become a billionaire is to start a company that grows fast, and the way to grow fast is to make what users want. Newly started startups have no choice but to delight users, or they'll never even get rolling.",
      "But this never stops being the lodestar, and bigger companies take their eye off it at their peril. Stop delighting users, and eventually someone else will.Users are what the partners want to know about in YC interviews, and what I want to know about when I talk to founders that we funded ten years ago and who are billionaires now.",
      "What do users want? What new things could you build for them? Founders who've become billionaires are always eager to talk about that topic. That's how they became billionaires.Notes[1] The YC partners have so much practice doing this that they sometimes see paths that the founders themselves haven't seen yet.",
      "The partners don't try to seem skeptical, as buyers in transactions often do to increase their leverage. Although the founders feel their job is to convince the partners of the potential of their idea, these roles are not infrequently reversed, and the founders leave the interview feeling their idea has more potential than they realized.[2] In practice, 7 minutes would be enough.",
      "You rarely change your mind at minute 8. But 10 minutes is socially convenient.[3] I myself took the first sufficiently large acquisition offer in my first startup, so I don't blame founders for doing this.",
      "There's nothing wrong with starting a startup to make money. You need to make money somehow, and for some people startups are the most efficient way to do it. I'm just saying that these are not the startups that get really big.[4] Not these days, anyway.",
      "There were some big ones during the Internet Bubble, and indeed some big IPOs.Thanks to Trevor Blackwell, Jessica Livingston, Robert Morris, Geoff Ralston, and Harj Taggar for reading drafts of this."
    ],
    "word_count": 3374,
    "paragraph_count": 65
  },
  "processed_at": "2025-07-26T19:03:26.099015",
  "paragraphs": [
    {
      "original": "December 2020As I was deciding what to write about next, I was surprised to find that two separate essays I'd been planning to write were actually the same.The first is about how to ace your Y Combinator interview.",
      "translated": "2020年12月，在我决定接下来要写什么的时候，我惊讶地发现我计划写的两篇不同的文章实际上是同一主题。第一篇是关于如何在Y Combinator面试中表现出色。"
    },
    {
      "original": "There has been so much nonsense written about this topic that I've been meaning for years to write something telling founders the truth.The second is about something politicians sometimes say — that the only way to become a billionaire is by exploiting people — and why this is mistaken.Keep reading, and you'll learn both simultaneously.I know the politicians are mistaken because it was my job to predict which people will become billionaires.",
      "translated": "关于这个话题，已经写了很多无稽之谈，多年来我一直打算写点东西来告诉创始人真相。第二点是关于政客们有时会说的一句话——成为亿万富翁的唯一途径是剥削他人——以及为什么这是错误的。继续读下去，你将同时了解这两点。我知道政客们错了，因为预测谁会成为亿万富翁曾经是我的工作。"
    },
    {
      "original": "I think I can truthfully say that I know as much about how to do this as anyone. If the key to becoming a billionaire — the defining feature of billionaires — was to exploit people, then I, as a professional billionaire scout, would surely realize this and look for people who would be good at it, just as an NFL scout looks for speed in wide receivers.But aptitude for exploiting people is not what Y Combinator looks for at all.",
      "translated": "我想我可以诚实地说我在这方面知道的不比任何人少。如果成为亿万富翁的关键——亿万富翁的决定性特征——是剥削他人，那么作为一位专业的亿万富翁发掘者，我肯定能意识到这一点，并寻找那些擅长于此的人，就像NFL球探寻找外接手的速度一样。但Y Combinator根本不是在寻找剥削他人的能力。"
    },
    {
      "original": "In fact, it's the opposite of what they look for. I'll tell you what they do look for, by explaining how to convince Y Combinator to fund you, and you can see for yourself.What YC looks for, above all, is founders who understand some group of users and can make what they want.",
      "translated": "事实上，这与他们寻找的恰恰相反。我来告诉你他们真正寻找的是什么，通过解释如何说服Y Combinator为你提供资金，你可以自己判断。YC最看重的是那些理解某一用户群体并能满足他们需求的创始人。"
    },
    {
      "original": "This is so important that it's YC's motto: \"Make something people want.\"A big company can to some extent force unsuitable products on unwilling customers, but a startup doesn't have the power to do that.",
      "translated": "这非常重要，以至于成为了YC的座右铭：“做出人们想要的东西。”大公司可以在某种程度上将不适合的产品强加给不愿意的客户，但初创公司没有这样的实力。"
    },
    {
      "original": "A startup must sing for its supper, by making things that genuinely delight its customers. Otherwise it will never get off the ground.Here's where things get difficult, both for you as a founder and for the YC partners trying to decide whether to fund you.",
      "translated": "一家初创公司必须通过创造真正令客户满意的产品来赢得生存。否则，它将永远无法起步。这正是难点所在，无论是对于你这位创始人，还是对于试图决定是否资助你的YC合伙人。"
    },
    {
      "original": "In a market economy, it's hard to make something people want that they don't already have. That's the great thing about market economies. If other people both knew about this need and were able to satisfy it, they already would be, and there would be no room for your startup.Which means the conversation during your YC interview will have to be about something new: either a new need, or a new way to satisfy one.",
      "translated": "在市场经济中，很难创造出人们还没有但又确实需要的东西。这就是市场经济的伟大之处。如果其他人既知道这种需求又能满足它，他们早就已经这样做了，也就没有你的创业公司的立足之地。这意味着在你参加YC面试时，讨论的内容必须是新的东西：要么是一个新的需求，要么是一种新的满足需求的方式。"
    },
    {
      "original": "And not just new, but uncertain. If it were certain that the need existed and that you could satisfy it, that certainty would be reflected in large and rapidly growing revenues, and you wouldn't be seeking seed funding.So the YC partners have to guess both whether you've discovered a real need, and whether you'll be able to satisfy it.",
      "translated": "不仅是新的，而且是不确定的。如果需求的存在以及你能够满足这种需求是确定的，这种确定性将会体现在快速增长的收入上，你就不会去寻求种子资金。因此，YC的合伙人必须猜测你是否发现了一个真实的需求，以及你是否能够满足这个需求。"
    },
    {
      "original": "That's what they are, at least in this part of their job: professional guessers. They have 1001 heuristics for doing this, and I'm not going to tell you all of them, but I'm happy to tell you the most important ones, because these can't be faked; the only way to \"hack\" them would be to do what you should be doing anyway as a founder.The first thing the partners will try to figure out, usually, is whether what you're making will ever be something a lot of people want.",
      "translated": "至少在他们工作的这一部分，他们就是专业的猜测者。他们有1001种启发式方法来做这件事，我不会告诉你所有这些方法，但我很乐意告诉你最重要的一些，因为这些是无法伪造的；唯一“破解”它们的方法就是作为创始人你应该做的事情。合伙人通常会试图弄清楚的第一件事就是，你正在做的东西将来是否会成为很多人想要的东西。"
    },
    {
      "original": "It doesn't have to be something a lot of people want now. The product and the market will both evolve, and will influence each other's evolution. But in the end there has to be something with a huge market.",
      "translated": "这不一定要是现在很多人想要的东西。产品和市场都会发展，并且会相互影响对方的发展。但最终必须有一个巨大的市场。"
    },
    {
      "original": "That's what the partners will be trying to figure out: is there a path to a huge market? [1]Sometimes it's obvious there will be a huge market. If Boom manages to ship an airliner at all, international airlines will have to buy it.",
      "translated": "这就是合作伙伴将要努力解决的问题：是否存在一个巨大的市场？有时，巨大的市场显而易见。如果Boom能够成功交付一款客机，国际航空公司就不得不购买它。"
    },
    {
      "original": "But usually it's not obvious. Usually the path to a huge market is by growing a small market. This idea is important enough that it's worth coining a phrase for, so let's call one of these small but growable markets a \"larval market.\"The perfect example of a larval market might be Apple's market when they were founded in 1976.",
      "translated": "但通常这并不明显。通常通往巨大市场的路径是从小市场开始成长。这个想法足够重要，值得创造一个短语来描述，所以让我们把这种小但可成长的市场称为“幼虫市场”。苹果公司在1976年成立时的市场可能就是“幼虫市场”的完美例子。"
    },
    {
      "original": "In 1976, not many people wanted their own computer. But more and more started to want one, till now every 10 year old on the planet wants a computer (but calls it a \"phone\").The ideal combination is the group of founders who are \"living in the future\" in the sense of being at the leading edge of some kind of change, and who are building something they themselves want.",
      "translated": "1976年，没有多少人想要自己的电脑。但越来越多的人开始想要一台，直到现在，地球上每个10岁的孩子都想要一台电脑（但他们称之为“手机”）。最理想的情况是，创始人团队处于某种变革的前沿，即“生活在未来”，并且他们正在构建自己想要的东西。"
    },
    {
      "original": "Most super-successful startups are of this type. Steve Wozniak wanted a computer. Mark Zuckerberg wanted to engage online with his college friends. Larry and Sergey wanted to find things on the web. All these founders were building things they and their peers wanted, and the fact that they were at the leading edge of change meant that more people would want these things in the future.But although the ideal larval market is oneself and one's peers, that's not the only kind.",
      "translated": "大多数超级成功的初创公司都是这种类型。史蒂夫·沃兹尼亚克想要一台计算机。马克·扎克伯格想要与他的大学朋友在线互动。拉里和谢尔盖想要在网上找到东西。所有这些创始人都在构建他们自己和同龄人想要的东西，而他们处于变化的前沿这一事实意味着将来会有更多人想要这些东西。但尽管理想的初始市场是自己和同龄人，这并不是唯一的类型。"
    },
    {
      "original": "A larval market might also be regional, for example. You build something to serve one location, and then expand to others.The crucial feature of the initial market is that it exist. That may seem like an obvious point, but the lack of it is the biggest flaw in most startup ideas.",
      "translated": "一个初始市场也可能是区域性的，例如。你先建立一个服务于某个地点的产品，然后扩展到其他地方。初始市场的关键特征是它必须存在。这听起来可能是一个显而易见的观点，但缺乏这一点是大多数创业想法最大的缺陷。"
    },
    {
      "original": "There have to be some people who want what you're building right now, and want it so urgently that they're willing to use it, bugs and all, even though you're a small company they've never heard of. There don't have to be many, but there have to be some.",
      "translated": "必须有一些人现在就想要你正在构建的东西，并且他们渴望得到它，以至于愿意使用它，即使它存在各种问题，即使你们是一家他们从未听说过的初创公司。不需要有很多这样的人，但必须有一些。"
    },
    {
      "original": "As long as you have some users, there are straightforward ways to get more: build new features they want, seek out more people like them, get them to refer you to their friends, and so on. But these techniques all require some initial seed group of users.So this is one thing the YC partners will almost certainly dig into during your interview.",
      "translated": "只要你有一些用户，就有直接的方法来获取更多用户：开发他们想要的新功能，寻找更多类似的人，让他们向朋友推荐你，等等。但这些方法都需要一些初始的种子用户。所以这是YC的合伙人几乎一定会在面试中探讨的一个问题。"
    },
    {
      "original": "Who are your first users going to be, and how do you know they want this? If I had to decide whether to fund startups based on a single question, it would be \"How do you know people want this?\"The most convincing answer is \"Because we and our friends want it.\" It's even better when this is followed by the news that you've already built a prototype, and even though it's very crude, your friends are using it, and it's spreading by word of mouth.",
      "translated": "你的第一批用户将会是谁，你怎么知道他们需要这个？如果我必须根据一个问题来决定是否资助初创公司，那这个问题就是：“你怎么知道人们需要这个？”最令人信服的答案是：“因为我们和我们的朋友需要它。”当这个答案后面跟着一个消息，说你们已经构建了一个原型，尽管它非常粗糙，但你的朋友们已经在使用它，并且它正在通过口碑传播时，那就更好了。"
    },
    {
      "original": "If you can say that and you're not lying, the partners will switch from default no to default yes. Meaning you're in unless there's some other disqualifying flaw.That is a hard standard to meet, though.",
      "translated": "如果你能这样说而且没有撒谎，合作伙伴的态度就会从默认的“不”转变为默认的“是”。也就是说，除非有其他不合格的因素，否则你就是被接受的。不过，这是一个很难达到的标准。"
    },
    {
      "original": "Airbnb didn't meet it. They had the first part. They had made something they themselves wanted. But it wasn't spreading. So don't feel bad if you don't hit this gold standard of convincingness. If Airbnb didn't hit it, it must be too high.In practice, the YC partners will be satisfied if they feel that you have a deep understanding of your users' needs.",
      "translated": "Airbnb 并没有达到这个标准。他们完成了第一步，创造了一个连他们自己都想要的产品。但这个产品并没有广泛传播。所以，如果你没有达到这个令人信服的黄金标准，也不要感到沮丧。如果连 Airbnb 都没有达到，那这个标准一定太高了。实际上，YC 的合伙人只要感觉到你对用户需求有深刻理解就会感到满意。"
    },
    {
      "original": "And the Airbnbs did have that. They were able to tell us all about what motivated hosts and guests. They knew from first-hand experience, because they'd been the first hosts. We couldn't ask them a question they didn't know the answer to.",
      "translated": "而Airbnb的创始人确实做到了这一点。他们能够详细地告诉我们是什么驱使房东和房客。他们从亲身经历中了解这些，因为他们自己就是最早的房东。我们问他们的任何问题，他们都能对答如流。"
    },
    {
      "original": "We ourselves were not very excited about the idea as users, but we knew this didn't prove anything, because there were lots of successful startups we hadn't been excited about as users. We were able to say to ourselves \"They seem to know what they're talking about.",
      "translated": "我们自己作为用户对此并不感到非常兴奋，但我们知道这并不能说明什么，因为我们对许多成功的初创公司也从未感到过兴奋。我们能够对自己说：“他们似乎知道自己在说什么。”"
    },
    {
      "original": "Maybe they're onto something. It's not growing yet, but maybe they can figure out how to make it grow during YC.\" Which they did, about three weeks into the batch.The best thing you can do in a YC interview is to teach the partners about your users.",
      "translated": "也许他们真的发现了什么。虽然现在还没有增长，但也许他们能找到让它增长的方法，就像他们在YC的第三周时做到的那样。在YC面试中，你能做的最好的事情就是让合伙人了解你的用户。"
    },
    {
      "original": "So if you want to prepare for your interview, one of the best ways to do it is to go talk to your users and find out exactly what they're thinking. Which is what you should be doing anyway.This may sound strangely credulous, but the YC partners want to rely on the founders to tell them about the market.",
      "translated": "所以，如果你想为面试做准备，最好的方法之一就是去和你的用户交谈，了解他们的真实想法。其实，你本来就应该这样做。这听起来可能有点不可思议，但YC的合伙人们希望依赖创始人来告诉他们关于市场的信息。"
    },
    {
      "original": "Think about how VCs typically judge the potential market for an idea. They're not ordinarily domain experts themselves, so they forward the idea to someone who is, and ask for their opinion. YC doesn't have time to do this, but if the YC partners can convince themselves that the founders both (a) know what they're talking about and (b) aren't lying, they don't need outside domain experts.",
      "translated": "考虑一下风险投资家通常如何评估一个想法的潜在市场。他们通常自己不是该领域的专家，所以他们会将这个想法转给某个专家，并征求他们的意见。YC没有时间这样做，但如果YC的合伙人能够说服自己，创始人既（a）了解他们在说什么，（b）没有撒谎，他们就不需要外部领域的专家。"
    },
    {
      "original": "They can use the founders themselves as domain experts when evaluating their own idea.This is why YC interviews aren't pitches. To give as many founders as possible a chance to get funded, we made interviews as short as we could: 10 minutes.",
      "translated": "他们可以在评估自己的想法时，将创始人自己作为领域专家。这就是为什么YC的面试不是推销。为了给尽可能多的创始人提供获得资金的机会，我们将面试时间尽可能缩短：10分钟。"
    },
    {
      "original": "That is not enough time for the partners to figure out, through the indirect evidence in a pitch, whether you know what you're talking about and aren't lying. They need to dig in and ask you questions.",
      "translated": "这不足以让合作伙伴通过演讲中的间接证据来判断你是否了解自己在说什么，并且没有撒谎。他们需要深入挖掘并提问。"
    },
    {
      "original": "There's not enough time for sequential access. They need random access. [2]The worst advice I ever heard about how to succeed in a YC interview is that you should take control of the interview and make sure to deliver the message you want to.",
      "translated": "没有足够的时间进行顺序访问。他们需要随机访问。我听过的关于如何在YC面试中成功的最糟糕的建议就是你应该掌控面试，确保传达你想要传达的信息。"
    },
    {
      "original": "In other words, turn the interview into a pitch. ⟨elaborate expletive⟩. It is so annoying when people try to do that. You ask them a question, and instead of answering it, they deliver some obviously prefabricated blob of pitch.",
      "translated": "换句话说，把面试变成推销。⟨详述的脏话⟩。当人们试图这样做时，真是令人厌烦。你问他们一个问题，但他们却不回答，反而给出一段显然预先准备好的推销说辞。"
    },
    {
      "original": "It eats up 10 minutes really fast.There is no one who can give you accurate advice about what to do in a YC interview except a current or former YC partner. People who've merely been interviewed, even successfully, have no idea of this, but interviews take all sorts of different forms depending on what the partners want to know about most.",
      "translated": "它真的很快就会耗掉10分钟。除了现任或前任YC合伙人，没有人能给你关于YC面试该做什么的准确建议。那些仅仅被面试过的人，即使成功了，也不知道这一点，因为面试会根据合伙人最想了解的内容而采取各种不同的形式。"
    },
    {
      "original": "Sometimes they're all about the founders, other times they're all about the idea. Sometimes some very narrow aspect of the idea. Founders sometimes walk away from interviews complaining that they didn't get to explain their idea completely.",
      "translated": "有时它们全都围绕着创始人，有时则全都围绕着创意。有时是创意的某个非常具体的方面。创始人有时会在面试后抱怨，他们没有机会完全解释他们的创意。"
    },
    {
      "original": "True, but they explained enough.Since a YC interview consists of questions, the way to do it well is to answer them well. Part of that is answering them candidly. The partners don't expect you to know everything.",
      "translated": "确实，但他们解释得足够清楚了。由于YC面试是由问题组成的，因此表现好的方法就是回答好这些问题。这其中一部分是坦诚地回答。合伙人并不期望你什么都知道。"
    },
    {
      "original": "But if you don't know the answer to a question, don't try to bullshit your way out of it. The partners, like most experienced investors, are professional bullshit detectors, and you are (hopefully) an amateur bullshitter.",
      "translated": "但是，如果你不知道问题的答案，不要试图胡编乱造。合伙人，像大多数有经验的投资者一样，是专业的胡言乱语检测者，而你（希望）只是一个业余的胡言乱语者。"
    },
    {
      "original": "And if you try to bullshit them and fail, they may not even tell you that you failed. So it's better to be honest than to try to sell them. If you don't know the answer to a question, say you don't, and tell them how you'd go about finding it, or tell them the answer to some related question.If you're asked, for example, what could go wrong, the worst possible answer is \"nothing.\" Instead of convincing them that your idea is bullet-proof, this will convince them that you're a fool or a liar.",
      "translated": "如果你试图糊弄他们却失败了，他们甚至可能不会告诉你你失败了。所以，最好诚实一些，而不是试图说服他们。如果你不知道某个问题的答案，就说你不知道，并告诉他们你会如何寻找答案，或者告诉他们一些相关问题的答案。例如，如果你被问到可能会出什么问题，最糟糕的回答就是“什么都不会出问题”。这不会让他们相信你的想法是无懈可击的，反而会让他们认为你是个傻瓜或骗子。"
    },
    {
      "original": "Far better to go into gruesome detail. That's what experts do when you ask what could go wrong. The partners know that your idea is risky. That's what a good bet looks like at this stage: a tiny probability of a huge outcome.Ditto if they ask about competitors.",
      "translated": "最好详细说明可能的糟糕情况。当你询问专家可能会出什么问题时，他们就会这样做。合作伙伴知道你的想法有风险。在这个阶段，一个好的赌注看起来就是：巨大结果的微小概率。同样，如果他们问到竞争对手也是如此。"
    },
    {
      "original": "Competitors are rarely what kills startups. Poor execution does. But you should know who your competitors are, and tell the YC partners candidly what your relative strengths and weaknesses are. Because the YC partners know that competitors don't kill startups, they won't hold competitors against you too much.",
      "translated": "竞争对手很少是导致初创企业失败的原因。执行不力才是。但你应该知道你的竞争对手是谁，并坦诚地告诉YC的合伙人你们的相对优势和劣势。因为YC的合伙人知道竞争对手不会杀死初创企业，所以他们不会因为竞争对手而过于苛责你。"
    },
    {
      "original": "They will, however, hold it against you if you seem either to be unaware of competitors, or to be minimizing the threat they pose. They may not be sure whether you're clueless or lying, but they don't need to be.The partners don't expect your idea to be perfect.",
      "translated": "然而，如果你似乎对竞争对手一无所知，或者在淡化他们构成的威胁，他们会对此持有异议。他们可能不确定你是无知还是在撒谎，但这一点并不重要。合伙人并不期望你的想法是完美的。"
    },
    {
      "original": "This is seed investing. At this stage, all they can expect are promising hypotheses. But they do expect you to be thoughtful and honest. So if trying to make your idea seem perfect causes you to come off as glib or clueless, you've sacrificed something you needed for something you didn't.If the partners are sufficiently convinced that there's a path to a big market, the next question is whether you'll be able to find it.",
      "translated": "这是种子投资。在这个阶段，他们所能期望的只是有前景的假设。但他们确实希望你能表现出深思熟虑和诚实。所以，如果你为了让你的想法显得完美而显得轻率或无知，你就为了你不需要的东西牺牲了你需要的东西。如果合伙人足够确信有一条通往大市场的道路，下一个问题就是你是否能找到这条道路。"
    },
    {
      "original": "That in turn depends on three things: the general qualities of the founders, their specific expertise in this domain, and the relationship between them. How determined are the founders? Are they good at building things?",
      "translated": "这又取决于三个方面：创始人的综合素质、他们在该领域的具体专长，以及他们之间的关系。创始人有多坚定？他们是否擅长构建事物？"
    },
    {
      "original": "Are they resilient enough to keep going when things go wrong? How strong is their friendship?Though the Airbnbs only did ok in the idea department, they did spectacularly well in this department. The story of how they'd funded themselves by making Obama- and McCain-themed breakfast cereal was the single most important factor in our decision to fund them.",
      "translated": "他们是否足够坚韧，能够在遇到困难时继续前进？他们的友谊有多牢固？虽然Airbnbs在创意方面表现一般，但在这一方面他们表现得非常出色。他们通过制作奥巴马和麦凯恩主题的早餐麦片来筹集资金的故事，是我们决定资助他们的最重要因素。"
    },
    {
      "original": "They didn't realize it at the time, but what seemed to them an irrelevant story was in fact fabulously good evidence of their qualities as founders. It showed they were resourceful and determined, and could work together.It wasn't just the cereal story that showed that, though.",
      "translated": "当时他们并没有意识到，但这个看似无关紧要的故事实际上是他们作为创始人品质的极好证据。它展示了他们机智果断，能够团结合作。不过，证明这一点的不仅仅是这个早餐麦片的故事。"
    },
    {
      "original": "The whole interview showed that they cared. They weren't doing this just for the money, or because startups were cool. The reason they were working so hard on this company was because it was their project.",
      "translated": "整个采访表明他们是在乎的。他们并不是为了钱，也不是因为创业公司很酷才这样做。他们如此努力地经营这家公司，是因为这是他们的项目。"
    },
    {
      "original": "They had discovered an interesting new idea, and they just couldn't let it go.Mundane as it sounds, that's the most powerful motivator of all, not just in startups, but in most ambitious undertakings: to be genuinely interested in what you're building.",
      "translated": "他们发现了一个有趣的新想法，而且他们根本无法放弃。尽管听起来很平常，但这却是最强大的动力源泉，不仅在创业公司中如此，在大多数雄心勃勃的事业中也是如此：真正对你正在构建的东西感兴趣。"
    },
    {
      "original": "This is what really drives billionaires, or at least the ones who become billionaires from starting companies. The company is their project.One thing few people realize about billionaires is that all of them could have stopped sooner.",
      "translated": "这正是驱动亿万富翁的力量，至少对于那些通过创办公司成为亿万富翁的人来说是如此。公司就是他们的项目。很少有人意识到，所有的亿万富翁其实都可以更早停止。"
    },
    {
      "original": "They could have gotten acquired, or found someone else to run the company. Many founders do. The ones who become really rich are the ones who keep working. And what makes them keep working is not just money.",
      "translated": "他们本可以被收购，或者找其他人来经营公司。许多创始人都是这样做的。那些真正变得富有的人是那些继续工作的人。而让他们继续工作的原因不仅仅是金钱。"
    },
    {
      "original": "What keeps them working is the same thing that keeps anyone else working when they could stop if they wanted to: that there's nothing else they'd rather do.That, not exploiting people, is the defining quality of people who become billionaires from starting companies.",
      "translated": "让他们继续工作的原因和让其他人继续工作的原因是一样的，即使他们想停下来也可以：因为他们没有其他更想做的事情。这，而不是剥削他人，才是那些从创业中成为亿万富翁的人的决定性品质。"
    },
    {
      "original": "So that's what YC looks for in founders: authenticity. People's motives for starting startups are usually mixed. They're usually doing it from some combination of the desire to make money, the desire to seem cool, genuine interest in the problem, and unwillingness to work for someone else.",
      "translated": "所以，YC 在寻找创始人时看重的是真实性。人们创办初创公司的动机通常是混合的。他们通常是从赚钱的欲望、显得酷的愿望、对问题的真正兴趣以及不愿意为他人工作的意愿中某几种组合来创业的。"
    },
    {
      "original": "The last two are more powerful motivators than the first two. It's ok for founders to want to make money or to seem cool. Most do. But if the founders seem like they're doing it just to make money or just to seem cool, they're not likely to succeed on a big scale.",
      "translated": "最后两个比前两个更有动力。创始人想要赚钱或显得酷是很正常的。大多数人都有这样的想法。但如果创始人看起来只是为了赚钱或只是为了显得酷，他们就不太可能在大规模上取得成功。"
    },
    {
      "original": "The founders who are doing it for the money will take the first sufficiently large acquisition offer, and the ones who are doing it to seem cool will rapidly discover that there are much less painful ways of seeming cool.",
      "translated": "那些为了钱而创业的人会在遇到第一个足够大的收购要约时就接受，而那些为了显得酷而创业的人很快会发现，有更不痛苦的方式来显得酷。"
    },
    {
      "original": "[3]Y Combinator certainly sees founders whose m.o. is to exploit people. YC is a magnet for them, because they want the YC brand. But when the YC partners detect someone like that, they reject them. If bad people made good founders, the YC partners would face a moral dilemma.",
      "translated": "Y Combinator 当然会遇到一些创始人，他们的行事方式是剥削他人。YC 对这些人有吸引力，因为他们想要 YC 的品牌。但当 YC 的合伙人发现这样的人时，他们会拒绝他们。如果坏人也能成为好的创始人，YC 的合伙人就会面临道德困境。"
    },
    {
      "original": "Fortunately they don't, because bad people make bad founders. This exploitative type of founder is not going to succeed on a large scale, and in fact probably won't even succeed on a small one, because they're always going to be taking shortcuts.",
      "translated": "幸运的是，他们不会，因为坏人成不了好创始人。这种剥削型的创始人不会在大规模上取得成功，事实上，即使在小规模上可能也难以成功，因为他们总是会走捷径。"
    },
    {
      "original": "They see YC itself as a shortcut.Their exploitation usually begins with their own cofounders, which is disastrous, since the cofounders' relationship is the foundation of the company. Then it moves on to the users, which is also disastrous, because the sort of early adopters a successful startup wants as its initial users are the hardest to fool.",
      "translated": "他们将YC视为一条捷径。这种利用通常从他们自己的联合创始人开始，这是灾难性的，因为联合创始人之间的关系是公司的基础。然后这种行为转向用户，这也是灾难性的，因为成功的初创公司希望吸引的早期采用者是最难被愚弄的。"
    },
    {
      "original": "The best this kind of founder can hope for is to keep the edifice of deception tottering along until some acquirer can be tricked into buying it. But that kind of acquisition is never very big. [4]If professional billionaire scouts know that exploiting people is not the skill to look for, why do some politicians think this is the defining quality of billionaires?I think they start from the feeling that it's wrong that one person could have so much more money than another.",
      "translated": "这类创始人最好的期望就是让欺诈的建筑摇摇晃晃地维持下去，直到某个收购者被愚弄购买它。但这种收购从来都不会很大。[4]如果专业的亿万富翁侦察员知道剥削他人不是他们应该寻找的技能，为什么一些政客会认为这是亿万富翁的决定性品质？我认为他们是从这种感觉出发的，即一个人拥有比另一个人多得多的钱是不对的。"
    },
    {
      "original": "It's understandable where that feeling comes from. It's in our DNA, and even in the DNA of other species.If they limited themselves to saying that it made them feel bad when one person had so much more money than other people, who would disagree?",
      "translated": "这种感觉的来源是可以理解的。它存在于我们的DNA中，甚至存在于其他物种的DNA中。如果他们仅仅表示当一个人比其他人拥有更多的钱时，他们会感到不舒服，谁会不同意呢？"
    },
    {
      "original": "It makes me feel bad too, and I think people who make a lot of money have a moral obligation to use it for the common good. The mistake they make is to jump from feeling bad that some people are much richer than others to the conclusion that there's no legitimate way to make a very large amount of money.",
      "translated": "这也会让我感到不安，我认为那些赚了很多钱的人有道德义务将其用于公共利益。他们犯的错误是从一些人比其他人富有得多的不安感，直接跳到没有正当方式可以赚取大量财富的结论。"
    },
    {
      "original": "Now we're getting into statements that are not only falsifiable, but false.There are certainly some people who become rich by doing bad things. But there are also plenty of people who behave badly and don't make that much from it.",
      "translated": "现在我们讨论的不仅是可证伪的陈述，而且是错误的陈述。确实有些人通过做坏事变得富有。但也有许多人行为不端，却并没有因此获得多少财富。"
    },
    {
      "original": "There is no correlation — in fact, probably an inverse correlation — between how badly you behave and how much money you make.The greatest danger of this nonsense may not even be that it sends policy astray, but that it misleads ambitious people.",
      "translated": "你的行为恶劣程度与你赚的钱之间没有关联——事实上，可能还存在反向关联。这种荒谬观点的最大危险可能不在于它会误导政策，而在于它会误导有抱负的人。"
    },
    {
      "original": "Can you imagine a better way to destroy social mobility than by telling poor kids that the way to get rich is by exploiting people, while the rich kids know, from having watched the preceding generation do it, how it's really done?I'll tell you how it's really done, so you can at least tell your own kids the truth.",
      "translated": "你能想象出比告诉贫困孩子致富之道是剥削他人更破坏社会流动性的方法吗？而富家子弟则从上一代人的实践中了解了真正的致富之道。我会告诉你真正的致富之道，这样你至少可以对自己的孩子说出真相。"
    },
    {
      "original": "It's all about users. The most reliable way to become a billionaire is to start a company that grows fast, and the way to grow fast is to make what users want. Newly started startups have no choice but to delight users, or they'll never even get rolling.",
      "translated": "这全都是关于用户的。成为亿万富翁最可靠的方法是创办一家快速增长的公司，而快速成长的方法就是做出用户想要的东西。新创公司别无选择，只能取悦用户，否则他们甚至无法起步。"
    },
    {
      "original": "But this never stops being the lodestar, and bigger companies take their eye off it at their peril. Stop delighting users, and eventually someone else will.Users are what the partners want to know about in YC interviews, and what I want to know about when I talk to founders that we funded ten years ago and who are billionaires now.",
      "translated": "但这永远不会停止成为指路明灯，大公司如果忽视这一点将自食其果。一旦不再让用户满意，最终会有人取而代之。用户是YC面试中合作伙伴想要了解的，也是我在与十年前我们资助的、现在已是亿万富翁的创始人交谈时想要了解的。"
    },
    {
      "original": "What do users want? What new things could you build for them? Founders who've become billionaires are always eager to talk about that topic. That's how they became billionaires.Notes[1] The YC partners have so much practice doing this that they sometimes see paths that the founders themselves haven't seen yet.",
      "translated": "用户想要什么？你能为他们创造什么新东西？那些成为亿万富翁的创始人总是乐于谈论这个话题。这正是他们成为亿万富翁的原因。YC的合伙人在这方面有着丰富的经验，有时他们能看到创始人自己尚未发现的路径。"
    },
    {
      "original": "The partners don't try to seem skeptical, as buyers in transactions often do to increase their leverage. Although the founders feel their job is to convince the partners of the potential of their idea, these roles are not infrequently reversed, and the founders leave the interview feeling their idea has more potential than they realized.[2] In practice, 7 minutes would be enough.",
      "translated": "合作伙伴并不会像买家在交易中为了增加自己的筹码而表现出怀疑的态度。尽管创始人觉得他们的任务是说服合作伙伴相信他们想法的潜力，但这些角色经常会被颠倒，创始人离开会谈时会感到他们的想法比他们原先认为的更有潜力。实际上，7分钟就足够了。"
    },
    {
      "original": "You rarely change your mind at minute 8. But 10 minutes is socially convenient.[3] I myself took the first sufficiently large acquisition offer in my first startup, so I don't blame founders for doing this.",
      "translated": "你很少会在第8分钟改变主意。但10分钟在社交上更为方便。[3] 我自己在第一次创业时就接受了第一个足够大的收购要约，所以我不会责怪创始人这样做。"
    },
    {
      "original": "There's nothing wrong with starting a startup to make money. You need to make money somehow, and for some people startups are the most efficient way to do it. I'm just saying that these are not the startups that get really big.[4] Not these days, anyway.",
      "translated": "创办一家初创公司来赚钱并没有错。你总得想办法赚钱，而对某些人来说，初创公司是实现这一目标最有效的方式。我只是说，这些初创公司并不会变得真正庞大。至少在当今这个时代是这样。"
    },
    {
      "original": "There were some big ones during the Internet Bubble, and indeed some big IPOs.Thanks to Trevor Blackwell, Jessica Livingston, Robert Morris, Geoff Ralston, and Harj Taggar for reading drafts of this.",
      "translated": "在互联网泡沫期间，确实有一些大型公司和重要的首次公开募股。感谢Trevor Blackwell、Jessica Livingston、Robert Morris、Geoff Ralston和Harj Taggar审阅本文草稿。"
    }
  ],
  "translation_completed": "2025-07-26T23:10:56.435238",
  "translation_stats": {
    "total_paragraphs": 65,
    "success_count": 65,
    "success_rate": "100.0%"
  }
}