{
  "title": "Before the Startup",
  "title_zh": "[待翻译] Before the Startup",
  "url": "https://www.paulgraham.com/before.html",
  "filename": "before.html",
  "date": "2014-10-01",
  "id": 124,
  "content": {
    "success": true,
    "paragraphs": [
      "Want to start a startup? Get funded by Y Combinator. October 2014(This essay is derived from a guest lecture in Sam Altman's startup class at Stanford. It's intended for college students, but much of it is applicable to potential founders at other ages.)One of the advantages of having kids is that when you have to give advice, you can ask yourself \"what would I tell my own kids?\" My kids are little, but I can imagine what I'd tell them about startups if they were in college, and that's what I'm going to tell you.Startups are very counterintuitive.",
      "I'm not sure why. Maybe it's just because knowledge about them hasn't permeated our culture yet. But whatever the reason, starting a startup is a task where you can't always trust your instincts.It's like skiing in that way.",
      "When you first try skiing and you want to slow down, your instinct is to lean back. But if you lean back on skis you fly down the hill out of control. So part of learning to ski is learning to suppress that impulse.",
      "Eventually you get new habits, but at first it takes a conscious effort. At first there's a list of things you're trying to remember as you start down the hill.Startups are as unnatural as skiing, so there's a similar list for startups.",
      "Here I'm going to give you the first part of it — the things to remember if you want to prepare yourself to start a startup. CounterintuitiveThe first item on it is the fact I already mentioned: that startups are so weird that if you trust your instincts, you'll make a lot of mistakes.",
      "If you know nothing more than this, you may at least pause before making them.When I was running Y Combinator I used to joke that our function was to tell founders things they would ignore. It's really true.",
      "Batch after batch, the YC partners warn founders about mistakes they're about to make, and the founders ignore them, and then come back a year later and say \"I wish we'd listened.\"Why do the founders ignore the partners' advice?",
      "Well, that's the thing about counterintuitive ideas: they contradict your intuitions. They seem wrong. So of course your first impulse is to disregard them. And in fact my joking description is not merely the curse of Y Combinator but part of its raison d'etre.",
      "If founders' instincts already gave them the right answers, they wouldn't need us. You only need other people to give you advice that surprises you. That's why there are a lot of ski instructors and not many running instructors.",
      "[1]You can, however, trust your instincts about people. And in fact one of the most common mistakes young founders make is not to do that enough. They get involved with people who seem impressive, but about whom they feel some misgivings personally.",
      "Later when things blow up they say \"I knew there was something off about him, but I ignored it because he seemed so impressive.\"If you're thinking about getting involved with someone — as a cofounder, an employee, an investor, or an acquirer — and you have misgivings about them, trust your gut.",
      "If someone seems slippery, or bogus, or a jerk, don't ignore it.This is one case where it pays to be self-indulgent. Work with people you genuinely like, and you've known long enough to be sure. ExpertiseThe second counterintuitive point is that it's not that important to know a lot about startups.",
      "The way to succeed in a startup is not to be an expert on startups, but to be an expert on your users and the problem you're solving for them. Mark Zuckerberg didn't succeed because he was an expert on startups.",
      "He succeeded despite being a complete noob at startups, because he understood his users really well.If you don't know anything about, say, how to raise an angel round, don't feel bad on that account.",
      "That sort of thing you can learn when you need to, and forget after you've done it.In fact, I worry it's not merely unnecessary to learn in great detail about the mechanics of startups, but possibly somewhat dangerous.",
      "If I met an undergrad who knew all about convertible notes and employee agreements and (God forbid) class FF stock, I wouldn't think \"here is someone who is way ahead of their peers.\" It would set off alarms.",
      "Because another of the characteristic mistakes of young founders is to go through the motions of starting a startup. They make up some plausible-sounding idea, raise money at a good valuation, rent a cool office, hire a bunch of people.",
      "From the outside that seems like what startups do. But the next step after rent a cool office and hire a bunch of people is: gradually realize how completely fucked they are, because while imitating all the outward forms of a startup they have neglected the one thing that's actually essential: making something people want.",
      "GameWe saw this happen so often that we made up a name for it: playing house. Eventually I realized why it was happening. The reason young founders go through the motions of starting a startup is because that's what they've been trained to do for their whole lives up to that point.",
      "Think about what you have to do to get into college, for example. Extracurricular activities, check. Even in college classes most of the work is as artificial as running laps.I'm not attacking the educational system for being this way.",
      "There will always be a certain amount of fakeness in the work you do when you're being taught something, and if you measure their performance it's inevitable that people will exploit the difference to the point where much of what you're measuring is artifacts of the fakeness.I confess I did it myself in college.",
      "I found that in a lot of classes there might only be 20 or 30 ideas that were the right shape to make good exam questions. The way I studied for exams in these classes was not (except incidentally) to master the material taught in the class, but to make a list of potential exam questions and work out the answers in advance.",
      "When I walked into the final, the main thing I'd be feeling was curiosity about which of my questions would turn up on the exam. It was like a game.It's not surprising that after being trained for their whole lives to play such games, young founders' first impulse on starting a startup is to try to figure out the tricks for winning at this new game.",
      "Since fundraising appears to be the measure of success for startups (another classic noob mistake), they always want to know what the tricks are for convincing investors. We tell them the best way to convince investors is to make a startup that's actually doing well, meaning growing fast, and then simply tell investors so.",
      "Then they want to know what the tricks are for growing fast. And we have to tell them the best way to do that is simply to make something people want.So many of the conversations YC partners have with young founders begin with the founder asking \"How do we...\" and the partner replying \"Just...\"Why do the founders always make things so complicated?",
      "The reason, I realized, is that they're looking for the trick.So this is the third counterintuitive thing to remember about startups: starting a startup is where gaming the system stops working. Gaming the system may continue to work if you go to work for a big company.",
      "Depending on how broken the company is, you can succeed by sucking up to the right people, giving the impression of productivity, and so on. [2] But that doesn't work with startups. There is no boss to trick, only users, and all users care about is whether your product does what they want.",
      "Startups are as impersonal as physics. You have to make something people want, and you prosper only to the extent you do.The dangerous thing is, faking does work to some degree on investors. If you're super good at sounding like you know what you're talking about, you can fool investors for at least one and perhaps even two rounds of funding.",
      "But it's not in your interest to. The company is ultimately doomed. All you're doing is wasting your own time riding it down.So stop looking for the trick. There are tricks in startups, as there are in any domain, but they are an order of magnitude less important than solving the real problem.",
      "A founder who knows nothing about fundraising but has made something users love will have an easier time raising money than one who knows every trick in the book but has a flat usage graph. And more importantly, the founder who has made something users love is the one who will go on to succeed after raising the money.Though in a sense it's bad news in that you're deprived of one of your most powerful weapons, I think it's exciting that gaming the system stops working when you start a startup.",
      "It's exciting that there even exist parts of the world where you win by doing good work. Imagine how depressing the world would be if it were all like school and big companies, where you either have to spend a lot of time on bullshit things or lose to people who do.",
      "[3] I would have been delighted if I'd realized in college that there were parts of the real world where gaming the system mattered less than others, and a few where it hardly mattered at all. But there are, and this variation is one of the most important things to consider when you're thinking about your future.",
      "How do you win in each type of work, and what would you like to win by doing? [4] All-ConsumingThat brings us to our fourth counterintuitive point: startups are all-consuming. If you start a startup, it will take over your life to a degree you cannot imagine.",
      "And if your startup succeeds, it will take over your life for a long time: for several years at the very least, maybe for a decade, maybe for the rest of your working life. So there is a real opportunity cost here.Larry Page may seem to have an enviable life, but there are aspects of it that are unenviable.",
      "Basically at 25 he started running as fast as he could and it must seem to him that he hasn't stopped to catch his breath since. Every day new shit happens in the Google empire that only the CEO can deal with, and he, as CEO, has to deal with it.",
      "If he goes on vacation for even a week, a whole week's backlog of shit accumulates. And he has to bear this uncomplainingly, partly because as the company's daddy he can never show fear or weakness, and partly because billionaires get less than zero sympathy if they talk about having difficult lives.",
      "Which has the strange side effect that the difficulty of being a successful startup founder is concealed from almost everyone except those who've done it.Y Combinator has now funded several companies that can be called big successes, and in every single case the founders say the same thing.",
      "It never gets any easier. The nature of the problems change. You're worrying about construction delays at your London office instead of the broken air conditioner in your studio apartment. But the total volume of worry never decreases; if anything it increases.Starting a successful startup is similar to having kids in that it's like a button you push that changes your life irrevocably.",
      "And while it's truly wonderful having kids, there are a lot of things that are easier to do before you have them than after. Many of which will make you a better parent when you do have kids. And since you can delay pushing the button for a while, most people in rich countries do.Yet when it comes to startups, a lot of people seem to think they're supposed to start them while they're still in college.",
      "Are you crazy? And what are the universities thinking? They go out of their way to ensure their students are well supplied with contraceptives, and yet they're setting up entrepreneurship programs and startup incubators left and right.To be fair, the universities have their hand forced here.",
      "A lot of incoming students are interested in startups. Universities are, at least de facto, expected to prepare them for their careers. So students who want to start startups hope universities can teach them about startups.",
      "And whether universities can do this or not, there's some pressure to claim they can, lest they lose applicants to other universities that do.Can universities teach students about startups? Yes and no.",
      "They can teach students about startups, but as I explained before, this is not what you need to know. What you need to learn about are the needs of your own users, and you can't do that until you actually start the company.",
      "[5] So starting a startup is intrinsically something you can only really learn by doing it. And it's impossible to do that in college, for the reason I just explained: startups take over your life. You can't start a startup for real as a student, because if you start a startup for real you're not a student anymore.",
      "You may be nominally a student for a bit, but you won't even be that for long. [6]Given this dichotomy, which of the two paths should you take? Be a real student and not start a startup, or start a real startup and not be a student?",
      "I can answer that one for you. Do not start a startup in college. How to start a startup is just a subset of a bigger problem you're trying to solve: how to have a good life. And though starting a startup can be part of a good life for a lot of ambitious people, age 20 is not the optimal time to do it.",
      "Starting a startup is like a brutally fast depth-first search. Most people should still be searching breadth-first at 20.You can do things in your early 20s that you can't do as well before or after, like plunge deeply into projects on a whim and travel super cheaply with no sense of a deadline.",
      "For unambitious people, this sort of thing is the dreaded \"failure to launch,\" but for the ambitious ones it can be an incomparably valuable sort of exploration. If you start a startup at 20 and you're sufficiently successful, you'll never get to do it.",
      "[7]Mark Zuckerberg will never get to bum around a foreign country. He can do other things most people can't, like charter jets to fly him to foreign countries. But success has taken a lot of the serendipity out of his life.",
      "Facebook is running him as much as he's running Facebook. And while it can be very cool to be in the grip of a project you consider your life's work, there are advantages to serendipity too, especially early in life.",
      "Among other things it gives you more options to choose your life's work from.There's not even a tradeoff here. You're not sacrificing anything if you forgo starting a startup at 20, because you're more likely to succeed if you wait.",
      "In the unlikely case that you're 20 and one of your side projects takes off like Facebook did, you'll face a choice of running with it or not, and it may be reasonable to run with it. But the usual way startups take off is for the founders to make them take off, and it's gratuitously stupid to do that at 20.",
      "TryShould you do it at any age? I realize I've made startups sound pretty hard. If I haven't, let me try again: starting a startup is really hard. What if it's too hard? How can you tell if you're up to this challenge?The answer is the fifth counterintuitive point: you can't tell.",
      "Your life so far may have given you some idea what your prospects might be if you tried to become a mathematician, or a professional football player. But unless you've had a very strange life you haven't done much that was like being a startup founder.",
      "Starting a startup will change you a lot. So what you're trying to estimate is not just what you are, but what you could grow into, and who can do that?For the past 9 years it was my job to predict whether people would have what it took to start successful startups.",
      "It was easy to tell how smart they were, and most people reading this will be over that threshold. The hard part was predicting how tough and ambitious they would become. There may be no one who has more experience at trying to predict that, so I can tell you how much an expert can know about it, and the answer is: not much.",
      "I learned to keep a completely open mind about which of the startups in each batch would turn out to be the stars.The founders sometimes think they know. Some arrive feeling sure they will ace Y Combinator just as they've aced every one of the (few, artificial, easy) tests they've faced in life so far.",
      "Others arrive wondering how they got in, and hoping YC doesn't discover whatever mistake caused it to accept them. But there is little correlation between founders' initial attitudes and how well their companies do.I've read that the same is true in the military — that the swaggering recruits are no more likely to turn out to be really tough than the quiet ones.",
      "And probably for the same reason: that the tests involved are so different from the ones in their previous lives.If you're absolutely terrified of starting a startup, you probably shouldn't do it. But if you're merely unsure whether you're up to it, the only way to find out is to try.",
      "Just not now. IdeasSo if you want to start a startup one day, what should you do in college? There are only two things you need initially: an idea and cofounders. And the m.o. for getting both is the same.",
      "Which leads to our sixth and last counterintuitive point: that the way to get startup ideas is not to try to think of startup ideas.I've written a whole essay on this, so I won't repeat it all here. But the short version is that if you make a conscious effort to think of startup ideas, the ideas you come up with will not merely be bad, but bad and plausible-sounding, meaning you'll waste a lot of time on them before realizing they're bad.The way to come up with good startup ideas is to take a step back.",
      "Instead of making a conscious effort to think of startup ideas, turn your mind into the type that startup ideas form in without any conscious effort. In fact, so unconsciously that you don't even realize at first that they're startup ideas.This is not only possible, it's how Apple, Yahoo, Google, and Facebook all got started.",
      "None of these companies were even meant to be companies at first. They were all just side projects. The best startups almost have to start as side projects, because great ideas tend to be such outliers that your conscious mind would reject them as ideas for companies.Ok, so how do you turn your mind into the type that startup ideas form in unconsciously?",
      "(1) Learn a lot about things that matter, then (2) work on problems that interest you (3) with people you like and respect. The third part, incidentally, is how you get cofounders at the same time as the idea.The first time I wrote that paragraph, instead of \"learn a lot about things that matter,\" I wrote \"become good at some technology.\" But that prescription, though sufficient, is too narrow.",
      "What was special about Brian Chesky and Joe Gebbia was not that they were experts in technology. They were good at design, and perhaps even more importantly, they were good at organizing groups and making projects happen.",
      "So you don't have to work on technology per se, so long as you work on problems demanding enough to stretch you.What kind of problems are those? That is very hard to answer in the general case. History is full of examples of young people who were working on important problems that no one else at the time thought were important, and in particular that their parents didn't think were important.",
      "On the other hand, history is even fuller of examples of parents who thought their kids were wasting their time and who were right. So how do you know when you're working on real stuff? [8]I know how I know.",
      "Real problems are interesting, and I am self-indulgent in the sense that I always want to work on interesting things, even if no one else cares about them (in fact, especially if no one else cares about them), and find it very hard to make myself work on boring things, even if they're supposed to be important.My life is full of case after case where I worked on something just because it seemed interesting, and it turned out later to be useful in some worldly way.",
      "Y Combinator itself was something I only did because it seemed interesting. So I seem to have some sort of internal compass that helps me out. But I don't know what other people have in their heads. Maybe if I think more about this I can come up with heuristics for recognizing genuinely interesting problems, but for the moment the best I can offer is the hopelessly question-begging advice that if you have a taste for genuinely interesting problems, indulging it energetically is the best way to prepare yourself for a startup.",
      "And indeed, probably also the best way to live. [9]But although I can't explain in the general case what counts as an interesting problem, I can tell you about a large subset of them. If you think of technology as something that's spreading like a sort of fractal stain, every moving point on the edge represents an interesting problem.",
      "So one guaranteed way to turn your mind into the type that has good startup ideas is to get yourself to the leading edge of some technology — to cause yourself, as Paul Buchheit put it, to \"live in the future.\" When you reach that point, ideas that will seem to other people uncannily prescient will seem obvious to you.",
      "You may not realize they're startup ideas, but you'll know they're something that ought to exist.For example, back at Harvard in the mid 90s a fellow grad student of my friends Robert and Trevor wrote his own voice over IP software.",
      "He didn't mean it to be a startup, and he never tried to turn it into one. He just wanted to talk to his girlfriend in Taiwan without paying for long distance calls, and since he was an expert on networks it seemed obvious to him that the way to do it was turn the sound into packets and ship it over the Internet.",
      "He never did any more with his software than talk to his girlfriend, but this is exactly the way the best startups get started.So strangely enough the optimal thing to do in college if you want to be a successful startup founder is not some sort of new, vocational version of college focused on \"entrepreneurship.\" It's the classic version of college as education for its own sake.",
      "If you want to start a startup after college, what you should do in college is learn powerful things. And if you have genuine intellectual curiosity, that's what you'll naturally tend to do if you just follow your own inclinations.",
      "[10]The component of entrepreneurship that really matters is domain expertise. The way to become Larry Page was to become an expert on search. And the way to become an expert on search was to be driven by genuine curiosity, not some ulterior motive.At its best, starting a startup is merely an ulterior motive for curiosity.",
      "And you'll do it best if you introduce the ulterior motive toward the end of the process.So here is the ultimate advice for young would-be startup founders, boiled down to two words: just learn. Notes[1] Some founders listen more than others, and this tends to be a predictor of success.",
      "One of the things I remember about the Airbnbs during YC is how intently they listened.[2] In fact, this is one of the reasons startups are possible. If big companies weren't plagued by internal inefficiencies, they'd be proportionately more effective, leaving less room for startups.[3] In a startup you have to spend a lot of time on schleps, but this sort of work is merely unglamorous, not bogus.[4] What should you do if your true calling is gaming the system?",
      "Management consulting.[5] The company may not be incorporated, but if you start to get significant numbers of users, you've started it, whether you realize it yet or not.[6] It shouldn't be that surprising that colleges can't teach students how to be good startup founders, because they can't teach them how to be good employees either.The way universities \"teach\" students how to be employees is to hand off the task to companies via internship programs.",
      "But you couldn't do the equivalent thing for startups, because by definition if the students did well they would never come back.[7] Charles Darwin was 22 when he received an invitation to travel aboard the HMS Beagle as a naturalist.",
      "It was only because he was otherwise unoccupied, to a degree that alarmed his family, that he could accept it. And yet if he hadn't we probably would not know his name.[8] Parents can sometimes be especially conservative in this department.",
      "There are some whose definition of important problems includes only those on the critical path to med school.[9] I did manage to think of a heuristic for detecting whether you have a taste for interesting ideas: whether you find known boring ideas intolerable.",
      "Could you endure studying literary theory, or working in middle management at a large company?[10] In fact, if your goal is to start a startup, you can stick even more closely to the ideal of a liberal education than past generations have.",
      "Back when students focused mainly on getting a job after college, they thought at least a little about how the courses they took might look to an employer. And perhaps even worse, they might shy away from taking a difficult class lest they get a low grade, which would harm their all-important GPA.",
      "Good news: users don't care what your GPA was. And I've never heard of investors caring either. Y Combinator certainly never asks what classes you took in college or what grades you got in them. Thanks to Sam Altman, Paul Buchheit, John Collison, Patrick Collison, Jessica Livingston, Robert Morris, Geoff Ralston, and Fred Wilson for reading drafts of this.Arabic Translation"
    ],
    "word_count": 4537,
    "paragraph_count": 85
  },
  "processed_at": "2025-07-26T19:05:25.514471",
  "paragraphs": [
    {
      "original": "Want to start a startup? Get funded by Y Combinator. October 2014(This essay is derived from a guest lecture in Sam Altman's startup class at Stanford. It's intended for college students, but much of it is applicable to potential founders at other ages.)One of the advantages of having kids is that when you have to give advice, you can ask yourself \"what would I tell my own kids?\" My kids are little, but I can imagine what I'd tell them about startups if they were in college, and that's what I'm going to tell you.Startups are very counterintuitive.",
      "translated": "想创业吗？那就让Y Combinator给你提供资金吧。2014年10月（本文改编自Sam Altman在斯坦福大学创业课程中的嘉宾讲座，主要面向大学生，但其中很多内容也适用于其他年龄段的潜在创始人。）有一个孩子的优势是，当你需要提供建议时，你可以问自己：“我会告诉自己的孩子什么呢？”我的孩子还很小，但我可以想象如果他们上大学了，我会告诉他们关于创业的什么，而这些就是我要告诉你们的。创业是非常反直觉的。"
    },
    {
      "original": "I'm not sure why. Maybe it's just because knowledge about them hasn't permeated our culture yet. But whatever the reason, starting a startup is a task where you can't always trust your instincts.It's like skiing in that way.",
      "translated": "我不确定为什么。也许只是因为有关它们的知识还没有渗透到我们的文化中。但无论原因是什么，创业是一项你不能总是相信直觉的任务。在这方面，它就像滑雪一样。"
    },
    {
      "original": "When you first try skiing and you want to slow down, your instinct is to lean back. But if you lean back on skis you fly down the hill out of control. So part of learning to ski is learning to suppress that impulse.",
      "translated": "当你第一次尝试滑雪并想减速时，你的本能反应是向后倾。但如果你在滑雪时向后倾，你会失去控制地飞速下山。因此，学习滑雪的一部分是学会抑制这种冲动。"
    },
    {
      "original": "Eventually you get new habits, but at first it takes a conscious effort. At first there's a list of things you're trying to remember as you start down the hill.Startups are as unnatural as skiing, so there's a similar list for startups.",
      "translated": "最终你会养成新的习惯，但一开始需要有意识地努力。一开始，当你开始下坡时，有一系列的事情需要努力记住。创业公司就像滑雪一样不自然，所以创业公司也有一个类似的任务清单。"
    },
    {
      "original": "Here I'm going to give you the first part of it — the things to remember if you want to prepare yourself to start a startup. CounterintuitiveThe first item on it is the fact I already mentioned: that startups are so weird that if you trust your instincts, you'll make a lot of mistakes.",
      "translated": "在这里，我要给你讲第一部分——如果你打算准备创业，需要记住的事情。第一点就是我之前已经提到的事实：初创公司非常特殊，如果你依赖直觉，会犯很多错误。"
    },
    {
      "original": "If you know nothing more than this, you may at least pause before making them.When I was running Y Combinator I used to joke that our function was to tell founders things they would ignore. It's really true.",
      "translated": "如果你对这了解不多，至少在做出决定前可以先停一停。当我经营 Y Combinator 时，我常常开玩笑说我们的工作是告诉创始人一些他们会忽略的事情。这确实是真的。"
    },
    {
      "original": "Batch after batch, the YC partners warn founders about mistakes they're about to make, and the founders ignore them, and then come back a year later and say \"I wish we'd listened.\"Why do the founders ignore the partners' advice?",
      "translated": "一批又一批，YC的合伙人们警告创始人即将犯下的错误，而创始人们却置若罔闻，一年后又回来感叹“真希望当初听了你们的建议。”为什么创始人们会忽略合伙人的建议？"
    },
    {
      "original": "Well, that's the thing about counterintuitive ideas: they contradict your intuitions. They seem wrong. So of course your first impulse is to disregard them. And in fact my joking description is not merely the curse of Y Combinator but part of its raison d'etre.",
      "translated": "好吧，这就是反直觉想法的特点：它们违背你的直觉。看起来是错误的。所以你当然的第一反应是忽略它们。事实上，我开玩笑式的描述不仅是 Y Combinator 的诅咒，也是其存在理由的一部分。"
    },
    {
      "original": "If founders' instincts already gave them the right answers, they wouldn't need us. You only need other people to give you advice that surprises you. That's why there are a lot of ski instructors and not many running instructors.",
      "translated": "如果创始人的直觉已经给他们带来了正确的答案，他们就不需要我们了。你只需要别人给你那些让你感到意外的建议。这就是为什么有很多滑雪教练而没有多少跑步教练的原因。"
    },
    {
      "original": "[1]You can, however, trust your instincts about people. And in fact one of the most common mistakes young founders make is not to do that enough. They get involved with people who seem impressive, but about whom they feel some misgivings personally.",
      "translated": "[1]然而，你可以相信自己对人的直觉。事实上，年轻的创始人最常见的错误之一就是在这方面做得不够。他们会与那些看似令人印象深刻，但在个人层面上却让他们感到有些疑虑的人合作。"
    },
    {
      "original": "Later when things blow up they say \"I knew there was something off about him, but I ignored it because he seemed so impressive.\"If you're thinking about getting involved with someone — as a cofounder, an employee, an investor, or an acquirer — and you have misgivings about them, trust your gut.",
      "translated": "后来事情搞砸了，他们说：“我知道他有点不对劲，但因为他看起来很厉害，我就忽略了。”如果你在考虑与某人合作——无论是作为联合创始人、员工、投资者还是收购方——并且你对他们有疑虑，那就相信你的直觉。"
    },
    {
      "original": "If someone seems slippery, or bogus, or a jerk, don't ignore it.This is one case where it pays to be self-indulgent. Work with people you genuinely like, and you've known long enough to be sure. ExpertiseThe second counterintuitive point is that it's not that important to know a lot about startups.",
      "translated": "如果某人显得不可靠、虚假或是个混蛋，不要忽视这种感觉。在这种情况下，自私一点是有好处的。与你真正喜欢且彼此熟悉足够长时间的人合作。专长第二个反直觉的观点是，对创业公司了解多少并不是那么重要。"
    },
    {
      "original": "The way to succeed in a startup is not to be an expert on startups, but to be an expert on your users and the problem you're solving for them. Mark Zuckerberg didn't succeed because he was an expert on startups.",
      "translated": "在创业公司取得成功的方法不是成为创业领域的专家，而是成为你用户和你为他们解决的问题的专家。马克·扎克伯格之所以成功，并不是因为他对创业公司了如指掌。"
    },
    {
      "original": "He succeeded despite being a complete noob at startups, because he understood his users really well.If you don't know anything about, say, how to raise an angel round, don't feel bad on that account.",
      "translated": "他尽管完全是个创业新手，但还是成功了，因为他非常了解自己的用户。如果你对如何进行天使轮融资一无所知，也无需因此感到沮丧。"
    },
    {
      "original": "That sort of thing you can learn when you need to, and forget after you've done it.In fact, I worry it's not merely unnecessary to learn in great detail about the mechanics of startups, but possibly somewhat dangerous.",
      "translated": "这类事情你可以在需要的时候学习，做完之后就可以忘记了。实际上，我担心不仅没有必要详细了解创业的机制，甚至可能有些危险。"
    },
    {
      "original": "If I met an undergrad who knew all about convertible notes and employee agreements and (God forbid) class FF stock, I wouldn't think \"here is someone who is way ahead of their peers.\" It would set off alarms.",
      "translated": "如果我遇到一个本科生，对可转换债券、雇员协议以及（天哪）F类股票了如指掌，我不会认为“这是个远超同龄人的学生。”这会让我感到警觉。"
    },
    {
      "original": "Because another of the characteristic mistakes of young founders is to go through the motions of starting a startup. They make up some plausible-sounding idea, raise money at a good valuation, rent a cool office, hire a bunch of people.",
      "translated": "因为年轻创始人常犯的一个典型错误就是走创业的过场。他们想出一个听起来合理的想法，以不错的估值筹集资金，租用一个很酷的办公室，雇用一大批人。"
    },
    {
      "original": "From the outside that seems like what startups do. But the next step after rent a cool office and hire a bunch of people is: gradually realize how completely fucked they are, because while imitating all the outward forms of a startup they have neglected the one thing that's actually essential: making something people want.",
      "translated": "从外部看来，这似乎就是初创公司做的事情。但租下一个酷炫的办公室、招来一群员工之后的下一步是：逐渐意识到他们有多么糟糕，因为尽管模仿了初创公司的所有外在形式，他们却忽视了唯一真正重要的事情：做出人们想要的产品。"
    },
    {
      "original": "GameWe saw this happen so often that we made up a name for it: playing house. Eventually I realized why it was happening. The reason young founders go through the motions of starting a startup is because that's what they've been trained to do for their whole lives up to that point.",
      "translated": "我们经常看到这种情况，甚至给它起了个名字：过家家。最终我意识到了其中的原因。年轻创业者之所以会走创业的流程，是因为他们一直以来接受的教育就是如此。"
    },
    {
      "original": "Think about what you have to do to get into college, for example. Extracurricular activities, check. Even in college classes most of the work is as artificial as running laps.I'm not attacking the educational system for being this way.",
      "translated": "想想为了上大学你需要做些什么，比如。课外活动，对。即使在大学课程中，大部分的工作也像跑圈一样不真实。我并不是在抨击教育制度是这样的。"
    },
    {
      "original": "There will always be a certain amount of fakeness in the work you do when you're being taught something, and if you measure their performance it's inevitable that people will exploit the difference to the point where much of what you're measuring is artifacts of the fakeness.I confess I did it myself in college.",
      "translated": "在学习过程中，你所完成的工作总会带有一定的虚假成分，而如果你对他们的表现进行评估，人们不可避免地会利用这种差异，以至于你所测量的很多内容实际上都是这种虚假性的产物。我承认自己在大学时也这么做过。"
    },
    {
      "original": "I found that in a lot of classes there might only be 20 or 30 ideas that were the right shape to make good exam questions. The way I studied for exams in these classes was not (except incidentally) to master the material taught in the class, but to make a list of potential exam questions and work out the answers in advance.",
      "translated": "我发现，在很多课程中，可能只有20或30个概念适合用来出好的考试题目。我为这些课程考试所做的准备，并不是（除了偶尔之外）去掌握课堂上所教的内容，而是列出可能的考试题目，并提前准备好答案。"
    },
    {
      "original": "When I walked into the final, the main thing I'd be feeling was curiosity about which of my questions would turn up on the exam. It was like a game.It's not surprising that after being trained for their whole lives to play such games, young founders' first impulse on starting a startup is to try to figure out the tricks for winning at this new game.",
      "translated": "当我走进最终考试时，我最主要的感受是对哪些问题会出现在试卷上感到好奇。这就像是一种游戏。考虑到这些年轻人接受了一生的训练来玩这样的游戏，他们开始创业时，首先想到的是试图找出赢得这场新游戏的窍门，这并不令人意外。"
    },
    {
      "original": "Since fundraising appears to be the measure of success for startups (another classic noob mistake), they always want to know what the tricks are for convincing investors. We tell them the best way to convince investors is to make a startup that's actually doing well, meaning growing fast, and then simply tell investors so.",
      "translated": "由于融资似乎成为了初创公司成功的衡量标准（这又是典型的初学者错误），他们总是想知道如何说服投资者的诀窍。我们告诉他们，最有效的方法是创建一个真正有发展前景的初创公司，这意味着要发展迅速，然后只需向投资者说明这一点。"
    },
    {
      "original": "Then they want to know what the tricks are for growing fast. And we have to tell them the best way to do that is simply to make something people want.So many of the conversations YC partners have with young founders begin with the founder asking \"How do we...\" and the partner replying \"Just...\"Why do the founders always make things so complicated?",
      "translated": "然后他们想知道快速成长的秘诀是什么。我们必须告诉他们，最好的方法就是做出人们想要的东西。YC的合伙人与年轻的创始人之间的许多对话，往往都是从创始人问“我们怎么……”开始，而合伙人回答“就是……”为什么创始人总是把事情搞得很复杂？"
    },
    {
      "original": "The reason, I realized, is that they're looking for the trick.So this is the third counterintuitive thing to remember about startups: starting a startup is where gaming the system stops working. Gaming the system may continue to work if you go to work for a big company.",
      "translated": "我意识到，原因在于他们是在寻找捷径。所以，这是关于创业公司的第三个反直觉的事情：创业不再是你能玩弄系统的地方。如果你去一家大公司工作，玩弄系统可能仍然有效。"
    },
    {
      "original": "Depending on how broken the company is, you can succeed by sucking up to the right people, giving the impression of productivity, and so on. [2] But that doesn't work with startups. There is no boss to trick, only users, and all users care about is whether your product does what they want.",
      "translated": "根据公司的状况，你可以通过巴结合适的人、营造出生产力旺盛的假象等方式取得成功。[2] 但这一套对初创公司行不通。初创公司没有可以糊弄的老板，只有用户，而用户在意的只有你的产品是否能满足他们的需求。"
    },
    {
      "original": "Startups are as impersonal as physics. You have to make something people want, and you prosper only to the extent you do.The dangerous thing is, faking does work to some degree on investors. If you're super good at sounding like you know what you're talking about, you can fool investors for at least one and perhaps even two rounds of funding.",
      "translated": "创业公司和物理一样不讲人情。你必须做出人们想要的东西，而且只有做到这一点，你才能获得成功。危险的是，伪装在某种程度上对投资者确实有效。如果你非常擅长表现得好像知道自己在说什么，你至少可以骗过一轮，甚至可能两轮的融资。"
    },
    {
      "original": "But it's not in your interest to. The company is ultimately doomed. All you're doing is wasting your own time riding it down.So stop looking for the trick. There are tricks in startups, as there are in any domain, but they are an order of magnitude less important than solving the real problem.",
      "translated": "但这样做对你没好处。公司最终难逃一劫。你只是在浪费自己的时间，随着它一起沉沦。所以别再寻找捷径了。初创企业中确实存在捷径，就像任何领域一样，但它们的重要性远不及解决真正的问题。"
    },
    {
      "original": "A founder who knows nothing about fundraising but has made something users love will have an easier time raising money than one who knows every trick in the book but has a flat usage graph. And more importantly, the founder who has made something users love is the one who will go on to succeed after raising the money.Though in a sense it's bad news in that you're deprived of one of your most powerful weapons, I think it's exciting that gaming the system stops working when you start a startup.",
      "translated": "一个对融资一无所知但做出了用户喜爱的产品的创始人，要比一个精通所有融资技巧但产品使用量停滞不前的创始人更容易筹集到资金。更重要的是，做出用户喜爱的产品的创始人，在筹集到资金后更有可能取得成功。虽然从某种意义上说，这是一条坏消息，因为你失去了一种最有力的武器，但我认为令人兴奋的是，当你开始创业时，那些试图操纵系统的手段就不再有效了。"
    },
    {
      "original": "It's exciting that there even exist parts of the world where you win by doing good work. Imagine how depressing the world would be if it were all like school and big companies, where you either have to spend a lot of time on bullshit things or lose to people who do.",
      "translated": "令人兴奋的是，世界上还存在一些地方，你只要做好工作就能获胜。想象一下，如果整个世界都像学校和大公司那样，你要么得花大量时间在毫无意义的事情上，要么就会输给那些这样做的人，那该有多沮丧。"
    },
    {
      "original": "[3] I would have been delighted if I'd realized in college that there were parts of the real world where gaming the system mattered less than others, and a few where it hardly mattered at all. But there are, and this variation is one of the most important things to consider when you're thinking about your future.",
      "translated": "如果我在大学时就意识到现实世界中有些地方操纵系统的重要性不如其他地方，甚至有少数地方几乎无关紧要，我会非常高兴。但确实存在这样的地方，这种差异是你思考未来时需要考虑的最重要的事情之一。"
    },
    {
      "original": "How do you win in each type of work, and what would you like to win by doing? [4] All-ConsumingThat brings us to our fourth counterintuitive point: startups are all-consuming. If you start a startup, it will take over your life to a degree you cannot imagine.",
      "translated": "你如何在每种工作中取得成功，你希望通过工作取得什么成就？[4] 全身心投入这引出了我们的第四个反直觉的观点：创业公司是全身心投入的。如果你创办一家创业公司，它将以你无法想象的程度占据你的生活。"
    },
    {
      "original": "And if your startup succeeds, it will take over your life for a long time: for several years at the very least, maybe for a decade, maybe for the rest of your working life. So there is a real opportunity cost here.Larry Page may seem to have an enviable life, but there are aspects of it that are unenviable.",
      "translated": "如果你的创业成功了，它将在很长一段时间内占据你的生活：至少几年，可能十年，甚至可能是你整个职业生涯。所以这里确实存在机会成本。拉里·佩奇的生活可能看起来令人羡慕，但其中也有一些不那么令人羡慕的方面。"
    },
    {
      "original": "Basically at 25 he started running as fast as he could and it must seem to him that he hasn't stopped to catch his breath since. Every day new shit happens in the Google empire that only the CEO can deal with, and he, as CEO, has to deal with it.",
      "translated": "基本上，25岁时他开始拼命奔跑，对他来说，从那以后似乎就再也没有喘息的机会。每天，谷歌帝国都会发生新的问题，只有首席执行官才能处理，而作为首席执行官的他，必须应对这些挑战。"
    },
    {
      "original": "If he goes on vacation for even a week, a whole week's backlog of shit accumulates. And he has to bear this uncomplainingly, partly because as the company's daddy he can never show fear or weakness, and partly because billionaires get less than zero sympathy if they talk about having difficult lives.",
      "translated": "如果他哪怕休假一周，就会积压整整一周的烂摊子。他必须默默承受这一切，部分原因是他作为公司的老大，绝不能表现出恐惧或软弱，部分原因是因为亿万富翁谈论生活艰难时，得到的同情少于零。"
    },
    {
      "original": "Which has the strange side effect that the difficulty of being a successful startup founder is concealed from almost everyone except those who've done it.Y Combinator has now funded several companies that can be called big successes, and in every single case the founders say the same thing.",
      "translated": "这产生了一个奇怪的副作用，那就是成功的初创企业创始人所面临的困难几乎对所有人都隐藏了起来，除了那些亲身经历过的人。Y Combinator 现在已经资助了几家可以称为大获成功的公司，而在每一个案例中，创始人们都说出了同样的话。"
    },
    {
      "original": "It never gets any easier. The nature of the problems change. You're worrying about construction delays at your London office instead of the broken air conditioner in your studio apartment. But the total volume of worry never decreases; if anything it increases.Starting a successful startup is similar to having kids in that it's like a button you push that changes your life irrevocably.",
      "translated": "它从来不会变得更容易。问题的本质会改变。你在为你伦敦办公室的建设延期而烦恼，而不是为你单身公寓里坏掉的空调担忧。但担忧的总量从不会减少；事实上，它还会增加。创办一家成功的初创公司就像生孩子一样，就像你按下一个按钮，不可逆转地改变了你的生活。"
    },
    {
      "original": "And while it's truly wonderful having kids, there are a lot of things that are easier to do before you have them than after. Many of which will make you a better parent when you do have kids. And since you can delay pushing the button for a while, most people in rich countries do.Yet when it comes to startups, a lot of people seem to think they're supposed to start them while they're still in college.",
      "translated": "虽然有孩子确实很棒，但在有孩子之前做很多事情都比有孩子之后容易得多。其中很多事情会让你在有了孩子之后成为更好的父母。既然你可以推迟这个决定一段时间，大多数富裕国家的人们都会选择这样做。然而，当谈到创业时，很多人似乎认为他们应该在还在上大学的时候就开始。"
    },
    {
      "original": "Are you crazy? And what are the universities thinking? They go out of their way to ensure their students are well supplied with contraceptives, and yet they're setting up entrepreneurship programs and startup incubators left and right.To be fair, the universities have their hand forced here.",
      "translated": "你疯了吗？大学到底在想什么？他们费尽心思确保学生有足够的避孕措施，却一直在设立创业计划和创业孵化器。话说回来，大学在这里也是不得已而为之。"
    },
    {
      "original": "A lot of incoming students are interested in startups. Universities are, at least de facto, expected to prepare them for their careers. So students who want to start startups hope universities can teach them about startups.",
      "translated": "许多新生对创业感兴趣。大学实际上被期望为他们的职业生涯做好准备。因此，希望创业的学生希望大学能教授他们有关创业的知识。"
    },
    {
      "original": "And whether universities can do this or not, there's some pressure to claim they can, lest they lose applicants to other universities that do.Can universities teach students about startups? Yes and no.",
      "translated": "而无论大学是否能做到这一点，都存在一种压力，迫使它们声称自己能做到，以免失去那些选择其他能提供此类教育的大学的申请者。大学能否教学生关于创业的知识？可以说是，也可以说不是。"
    },
    {
      "original": "They can teach students about startups, but as I explained before, this is not what you need to know. What you need to learn about are the needs of your own users, and you can't do that until you actually start the company.",
      "translated": "他们可以教学生关于创业公司的知识，但正如我之前解释的，这并不是你需要了解的内容。你需要学习的是你自己的用户的需求，而只有在真正开始公司之后，你才能做到这一点。"
    },
    {
      "original": "[5] So starting a startup is intrinsically something you can only really learn by doing it. And it's impossible to do that in college, for the reason I just explained: startups take over your life. You can't start a startup for real as a student, because if you start a startup for real you're not a student anymore.",
      "translated": "所以，创办一家创业公司本质上是只有通过实践才能真正学会的事情。而你在大学里是不可能做到这一点的，原因正如我刚才所说：创业公司会占据你的全部生活。你作为学生是不可能真正开始创办一家创业公司的，因为一旦你真正开始创业，你就不再是学生了。"
    },
    {
      "original": "You may be nominally a student for a bit, but you won't even be that for long. [6]Given this dichotomy, which of the two paths should you take? Be a real student and not start a startup, or start a real startup and not be a student?",
      "translated": "你可能名义上还会当一段时间的学生，但这种状态不会持续太久。[6]面对这种二选一的情况，你应该选择哪条路？是做一个真正意义上的学生而不去创业，还是开始一个真正的创业项目而不再当学生？"
    },
    {
      "original": "I can answer that one for you. Do not start a startup in college. How to start a startup is just a subset of a bigger problem you're trying to solve: how to have a good life. And though starting a startup can be part of a good life for a lot of ambitious people, age 20 is not the optimal time to do it.",
      "translated": "我可以回答你这个问题。不要在大学期间创业。如何创业只是你试图解决的一个更大问题的一部分：如何过上好的生活。尽管对许多有抱负的人来说，创业可以是美好生活中的一部分，但20岁并不是创业的最佳时机。"
    },
    {
      "original": "Starting a startup is like a brutally fast depth-first search. Most people should still be searching breadth-first at 20.You can do things in your early 20s that you can't do as well before or after, like plunge deeply into projects on a whim and travel super cheaply with no sense of a deadline.",
      "translated": "创业就像一场残酷快速的深度优先搜索。大多数人20岁时应该还在进行广度优先的探索。你可以在20岁出头的时候做很多之前或之后都难以做到的事情，比如心血来潮地深入项目，或者毫无截止日期感地极其廉价地旅行。"
    },
    {
      "original": "For unambitious people, this sort of thing is the dreaded \"failure to launch,\" but for the ambitious ones it can be an incomparably valuable sort of exploration. If you start a startup at 20 and you're sufficiently successful, you'll never get to do it.",
      "translated": "对于没有雄心的人来说，这种事情是可怕的“无法启动”，但对于有抱负的人来说，这可能是一种无与伦比的宝贵探索。如果你在20岁时开始创业并且足够成功，你就永远不会有这样的机会了。"
    },
    {
      "original": "[7]Mark Zuckerberg will never get to bum around a foreign country. He can do other things most people can't, like charter jets to fly him to foreign countries. But success has taken a lot of the serendipity out of his life.",
      "translated": "[7]马克·扎克伯格永远不会有在外国闲逛的机会。他可以做许多其他人做不到的事情，比如包机飞往其他国家。但成功已经让他的生活失去了很多偶然性。"
    },
    {
      "original": "Facebook is running him as much as he's running Facebook. And while it can be very cool to be in the grip of a project you consider your life's work, there are advantages to serendipity too, especially early in life.",
      "translated": "Facebook 在操控他，就像他在操控 Facebook 一样。虽然沉浸在你认为是毕生事业的项目中可以非常酷，但在人生的早期，偶然性和随机性也有其优势。"
    },
    {
      "original": "Among other things it gives you more options to choose your life's work from.There's not even a tradeoff here. You're not sacrificing anything if you forgo starting a startup at 20, because you're more likely to succeed if you wait.",
      "translated": "这不仅给了你在选择人生职业时更多的选择。这里甚至没有权衡取舍。如果你20岁时选择不创业，你并没有牺牲什么，因为如果你等待，成功的可能性更大。"
    },
    {
      "original": "In the unlikely case that you're 20 and one of your side projects takes off like Facebook did, you'll face a choice of running with it or not, and it may be reasonable to run with it. But the usual way startups take off is for the founders to make them take off, and it's gratuitously stupid to do that at 20.",
      "translated": "在极少数情况下，如果你20岁，你的某个副项目像Facebook那样迅速走红，你会面临是否全力以赴的选择，而全力以赴可能是合理的。但初创公司通常的起飞方式是由创始人使其起飞，而在20岁时这样做简直是无谓的愚蠢。"
    },
    {
      "original": "TryShould you do it at any age? I realize I've made startups sound pretty hard. If I haven't, let me try again: starting a startup is really hard. What if it's too hard? How can you tell if you're up to this challenge?The answer is the fifth counterintuitive point: you can't tell.",
      "translated": "你应该在任何年龄都尝试吗？我意识到我可能已经把创业说得很难。如果我说得还不够清楚，让我再试一次：创业真的很难。如果它太难了怎么办？你怎么知道你是否能应对这个挑战？答案是第五个反直觉的观点：你无法判断。"
    },
    {
      "original": "Your life so far may have given you some idea what your prospects might be if you tried to become a mathematician, or a professional football player. But unless you've had a very strange life you haven't done much that was like being a startup founder.",
      "translated": "你迄今为止的生活可能让你对如果尝试成为数学家或职业足球运动员的前景有所了解。但除非你度过了非常不同寻常的生活，否则你还没有做过多少与成为创业公司创始人相似的事情。"
    },
    {
      "original": "Starting a startup will change you a lot. So what you're trying to estimate is not just what you are, but what you could grow into, and who can do that?For the past 9 years it was my job to predict whether people would have what it took to start successful startups.",
      "translated": "创业会极大地改变你。因此，你试图评估的不仅仅是你现在的样子，还包括你可能成长为的样子，而谁能做出这样的判断呢？在过去9年里，我的工作就是预测人们是否具备创办成功创业公司的潜力。"
    },
    {
      "original": "It was easy to tell how smart they were, and most people reading this will be over that threshold. The hard part was predicting how tough and ambitious they would become. There may be no one who has more experience at trying to predict that, so I can tell you how much an expert can know about it, and the answer is: not much.",
      "translated": "很容易看出他们有多聪明，而大多数读到这的人都会超过这个门槛。难的是预测他们会变得多么坚韧和有雄心。或许没有人比我更有经验去尝试预测这一点，所以我可以告诉你，即便专家对此了解多少，答案是：并不多。"
    },
    {
      "original": "I learned to keep a completely open mind about which of the startups in each batch would turn out to be the stars.The founders sometimes think they know. Some arrive feeling sure they will ace Y Combinator just as they've aced every one of the (few, artificial, easy) tests they've faced in life so far.",
      "translated": "我学会了对每个批次中哪些初创公司会成为明星保持完全开放的心态。创始人们有时认为他们自己知道。有些人带着一种自信来到这里，认为他们会在Y Combinator中表现得和他们在迄今为止面对的（少数、人为、简单的）测试中一样出色。"
    },
    {
      "original": "Others arrive wondering how they got in, and hoping YC doesn't discover whatever mistake caused it to accept them. But there is little correlation between founders' initial attitudes and how well their companies do.I've read that the same is true in the military — that the swaggering recruits are no more likely to turn out to be really tough than the quiet ones.",
      "translated": "其他人则怀着疑问来到这里，不知道自己是如何被选中的，还希望 YC 不会发现导致接受他们的那个错误。但创始人们的初始态度与他们的公司表现之间几乎没有关联。我读到过，这种情况在军队中也是如此——那些 swaggering（趾高气扬的）新兵并不比那些安静的新兵更有可能成为真正的硬汉。"
    },
    {
      "original": "And probably for the same reason: that the tests involved are so different from the ones in their previous lives.If you're absolutely terrified of starting a startup, you probably shouldn't do it. But if you're merely unsure whether you're up to it, the only way to find out is to try.",
      "translated": "可能正是因为这个原因：这些测试与他们以前的生活中的测试大相径庭。如果你对创业感到极度恐惧，那么你可能不应该去做。但如果你只是不确定自己是否能够胜任，唯一的方法就是尝试。"
    },
    {
      "original": "Just not now. IdeasSo if you want to start a startup one day, what should you do in college? There are only two things you need initially: an idea and cofounders. And the m.o. for getting both is the same.",
      "translated": "暂时不是现在。所以，如果你有一天想创业，在大学期间应该做些什么？你最初只需要两样东西：一个想法和联合创始人。而获得这两样东西的方法是一样的。"
    },
    {
      "original": "Which leads to our sixth and last counterintuitive point: that the way to get startup ideas is not to try to think of startup ideas.I've written a whole essay on this, so I won't repeat it all here. But the short version is that if you make a conscious effort to think of startup ideas, the ideas you come up with will not merely be bad, but bad and plausible-sounding, meaning you'll waste a lot of time on them before realizing they're bad.The way to come up with good startup ideas is to take a step back.",
      "translated": "这引出了我们的第六个也是最后一个反常识的观点：获得创业点子的方法不是刻意去想创业点子。我曾为此写过一篇完整的文章，所以在这里不会重复全部内容。但简而言之，如果你有意识地努力去想创业点子，你想到的点子不仅会很糟糕，而且还会听起来很合理，这意味着你会在意识到它们很糟糕之前浪费大量时间。获得好的创业点子的方法是退一步看问题。"
    },
    {
      "original": "Instead of making a conscious effort to think of startup ideas, turn your mind into the type that startup ideas form in without any conscious effort. In fact, so unconsciously that you don't even realize at first that they're startup ideas.This is not only possible, it's how Apple, Yahoo, Google, and Facebook all got started.",
      "translated": "不要刻意去想创业点子，而是让你的思维变成那种无需任何自觉努力就能产生创业点子的类型。事实上，要达到如此无意识的程度，以至于你一开始甚至没有意识到它们是创业点子。这不仅是可能的，而且是苹果、雅虎、谷歌和脸书等公司起步的方式。"
    },
    {
      "original": "None of these companies were even meant to be companies at first. They were all just side projects. The best startups almost have to start as side projects, because great ideas tend to be such outliers that your conscious mind would reject them as ideas for companies.Ok, so how do you turn your mind into the type that startup ideas form in unconsciously?",
      "translated": "这些公司起初根本没打算成为公司，它们都只是副业。最好的创业公司几乎都必须从副业开始，因为伟大的想法往往是如此特立独行，以至于你的理性思维会将它们拒之门外，认为不适合做成公司。那么，如何让你的大脑变成那种能够无意识地产生创业想法的类型呢？"
    },
    {
      "original": "(1) Learn a lot about things that matter, then (2) work on problems that interest you (3) with people you like and respect. The third part, incidentally, is how you get cofounders at the same time as the idea.The first time I wrote that paragraph, instead of \"learn a lot about things that matter,\" I wrote \"become good at some technology.\" But that prescription, though sufficient, is too narrow.",
      "translated": "（1）学习许多重要的知识，然后（2）致力于你感兴趣的课题（3）与你喜欢和尊敬的人一起工作。顺便说一下，第三部分也是你在构思想法的同时找到共同创始人的方法。我第一次写这段话时，用的是“掌握某项技术”而不是“学习许多重要的知识”。不过，尽管前者足够充分，但范围过于狭窄。"
    },
    {
      "original": "What was special about Brian Chesky and Joe Gebbia was not that they were experts in technology. They were good at design, and perhaps even more importantly, they were good at organizing groups and making projects happen.",
      "translated": "布莱恩·切斯基和乔·杰比亚的特别之处并不在于他们是技术专家。他们擅长设计，也许更重要的是，他们擅长组织团队和推动项目实施。"
    },
    {
      "original": "So you don't have to work on technology per se, so long as you work on problems demanding enough to stretch you.What kind of problems are those? That is very hard to answer in the general case. History is full of examples of young people who were working on important problems that no one else at the time thought were important, and in particular that their parents didn't think were important.",
      "translated": "因此，你不必专门研究技术，只要你致力于那些能够挑战你的难题。那么，什么样的问题才是这样的难题呢？这个问题很难一概而论。历史上充满了年轻人的例子，他们当时在研究的重要问题，其他人并不认为重要，特别是他们的父母不认为这些问题是重要的。"
    },
    {
      "original": "On the other hand, history is even fuller of examples of parents who thought their kids were wasting their time and who were right. So how do you know when you're working on real stuff? [8]I know how I know.",
      "translated": "另一方面，历史上更是充满了父母认为孩子在浪费时间并且他们是对的例子。那么，你怎么知道你是在做真正的事情呢？[8]我知道我是怎么判断的。"
    },
    {
      "original": "Real problems are interesting, and I am self-indulgent in the sense that I always want to work on interesting things, even if no one else cares about them (in fact, especially if no one else cares about them), and find it very hard to make myself work on boring things, even if they're supposed to be important.My life is full of case after case where I worked on something just because it seemed interesting, and it turned out later to be useful in some worldly way.",
      "translated": "真正的问题很有趣，而我有一种自我放纵的倾向，那就是我总是想研究有趣的事情，即使没有人关心（事实上，特别是当没有人关心时），并且很难让自己去做那些枯燥的事情，即使它们被认为是重要的。我的生活中充满了这样的例子：我只是因为某件事看起来有趣而去研究它，而后来发现它在某些实际方面变得有用。"
    },
    {
      "original": "Y Combinator itself was something I only did because it seemed interesting. So I seem to have some sort of internal compass that helps me out. But I don't know what other people have in their heads. Maybe if I think more about this I can come up with heuristics for recognizing genuinely interesting problems, but for the moment the best I can offer is the hopelessly question-begging advice that if you have a taste for genuinely interesting problems, indulging it energetically is the best way to prepare yourself for a startup.",
      "translated": "Y Combinator 本身是我只因为觉得有趣才去做的事情。所以似乎我内心有一种指南针在帮助我。但我不知道其他人脑子里在想什么。也许如果我多思考一下这个问题，可以找出一些识别真正有趣问题的启发式方法，但目前我能提供的最好建议是，如果你对真正有趣的问题有鉴赏力，那么积极地追求这种兴趣是为创业做准备的最佳方式。"
    },
    {
      "original": "And indeed, probably also the best way to live. [9]But although I can't explain in the general case what counts as an interesting problem, I can tell you about a large subset of them. If you think of technology as something that's spreading like a sort of fractal stain, every moving point on the edge represents an interesting problem.",
      "translated": "这也许确实是最好的生活方式。[9]尽管我无法在一般情况下解释什么算作一个有趣的问题，但我可以告诉你其中一大类。如果你把技术想象成像一种分形污渍一样不断扩散，那么边缘上每一个移动的点都代表着一个有趣的问题。"
    },
    {
      "original": "So one guaranteed way to turn your mind into the type that has good startup ideas is to get yourself to the leading edge of some technology — to cause yourself, as Paul Buchheit put it, to \"live in the future.\" When you reach that point, ideas that will seem to other people uncannily prescient will seem obvious to you.",
      "translated": "因此，将你的思维转变为能够产生良好创业点子的一种可靠方法是，让你自己站在某项技术的最前沿——正如保罗·布赫海特所说，让你自己“生活在未来”。当你达到这一点时，那些在其他人看来不可思议地具有预见性的想法，在你看来将变得显而易见。"
    },
    {
      "original": "You may not realize they're startup ideas, but you'll know they're something that ought to exist.For example, back at Harvard in the mid 90s a fellow grad student of my friends Robert and Trevor wrote his own voice over IP software.",
      "translated": "你可能没有意识到它们是创业点子，但你会觉得它们应该是存在的。例如，90年代中期在哈佛，我的朋友罗伯特和特雷弗的一位同届研究生编写了自己的VoIP软件。"
    },
    {
      "original": "He didn't mean it to be a startup, and he never tried to turn it into one. He just wanted to talk to his girlfriend in Taiwan without paying for long distance calls, and since he was an expert on networks it seemed obvious to him that the way to do it was turn the sound into packets and ship it over the Internet.",
      "translated": "他并没有打算将其发展成一家创业公司，也从未尝试将其转变成一家公司。他只是想和他的台湾女友通话而无需支付长途电话费，由于他在网络方面是专家，对他来说，显然将声音转换成数据包并通过互联网传输是实现这一目的的方法。"
    },
    {
      "original": "He never did any more with his software than talk to his girlfriend, but this is exactly the way the best startups get started.So strangely enough the optimal thing to do in college if you want to be a successful startup founder is not some sort of new, vocational version of college focused on \"entrepreneurship.\" It's the classic version of college as education for its own sake.",
      "translated": "他在软件上做的唯一一件事就是和他的女朋友聊天，但这正是最好的创业公司起步的方式。所以，奇怪的是，如果你想成为一名成功的创业创始人，大学里最理想的做法并不是某种新的、以“创业”为重点的职业化大学教育。而是那种以自我教育为目的的经典大学教育。"
    },
    {
      "original": "If you want to start a startup after college, what you should do in college is learn powerful things. And if you have genuine intellectual curiosity, that's what you'll naturally tend to do if you just follow your own inclinations.",
      "translated": "如果你打算大学毕业后创业，那么在大学期间你应该学习有价值的知识。如果你真正拥有求知欲，那么只要你追随自己的兴趣，自然就会这样做。"
    },
    {
      "original": "[10]The component of entrepreneurship that really matters is domain expertise. The way to become Larry Page was to become an expert on search. And the way to become an expert on search was to be driven by genuine curiosity, not some ulterior motive.At its best, starting a startup is merely an ulterior motive for curiosity.",
      "translated": "[10]真正重要的创业成分是领域专长。要成为拉里·佩奇，就必须成为搜索领域的专家。而要成为搜索领域的专家，就必须由真正的 curiosity 驱动，而不是出于某种其他动机。在最好的情况下，创办一家初创公司只不过是好奇心的另一种动机。"
    },
    {
      "original": "And you'll do it best if you introduce the ulterior motive toward the end of the process.So here is the ultimate advice for young would-be startup founders, boiled down to two words: just learn. Notes[1] Some founders listen more than others, and this tends to be a predictor of success.",
      "translated": "你最好在过程接近尾声时引入隐含动机。因此，给年轻创业者最根本的建议可以归纳为两个词：不断学习。有些创始人比其他人更善于倾听，这往往是成功的一个预示。"
    },
    {
      "original": "One of the things I remember about the Airbnbs during YC is how intently they listened.[2] In fact, this is one of the reasons startups are possible. If big companies weren't plagued by internal inefficiencies, they'd be proportionately more effective, leaving less room for startups.[3] In a startup you have to spend a lot of time on schleps, but this sort of work is merely unglamorous, not bogus.[4] What should you do if your true calling is gaming the system?",
      "translated": "关于YC期间的Airbnb，我记忆犹新的是他们倾听的专注程度。[2] 事实上，这也是创业公司能够存在的原因之一。如果大公司没有内部效率低下的问题，它们会更有效率，留给创业公司的空间也就更小了。[3] 在创业公司中，你必须花很多时间处理繁琐的工作，但这种工作只是不那么光鲜，而不是虚假的。[4] 如果你的真正使命是钻系统漏洞，你应该怎么办？"
    },
    {
      "original": "Management consulting.[5] The company may not be incorporated, but if you start to get significant numbers of users, you've started it, whether you realize it yet or not.[6] It shouldn't be that surprising that colleges can't teach students how to be good startup founders, because they can't teach them how to be good employees either.The way universities \"teach\" students how to be employees is to hand off the task to companies via internship programs.",
      "translated": "管理咨询。[5] 公司可能尚未正式成立，但如果你开始拥有大量用户，那么你实际上已经开始了这项事业，无论你是否意识到这一点。[6] 大学无法教导学生如何成为优秀的创业公司创始人，这并不令人惊讶，因为它们也无法教导学生如何成为优秀的员工。大学“教导”学生如何成为员工的方式是通过实习项目将这一任务交给公司。"
    },
    {
      "original": "But you couldn't do the equivalent thing for startups, because by definition if the students did well they would never come back.[7] Charles Darwin was 22 when he received an invitation to travel aboard the HMS Beagle as a naturalist.",
      "translated": "但你不能对初创公司这样做，因为从定义上来说，如果学生表现好，他们就不会再回来了。[7] 查尔斯·达尔文在22岁时收到了邀请，作为博物学家搭乘小猎犬号（HMS Beagle）进行旅行。"
    },
    {
      "original": "It was only because he was otherwise unoccupied, to a degree that alarmed his family, that he could accept it. And yet if he hadn't we probably would not know his name.[8] Parents can sometimes be especially conservative in this department.",
      "translated": "正因为他闲得让家人感到担忧，他才能接受这份工作。然而，如果他没有接受，我们可能就无从得知他的名字了。[8] 在这种情况下，父母有时会显得尤为保守。"
    },
    {
      "original": "There are some whose definition of important problems includes only those on the critical path to med school.[9] I did manage to think of a heuristic for detecting whether you have a taste for interesting ideas: whether you find known boring ideas intolerable.",
      "translated": "有些人对重要问题的定义仅限于通往医学院的关键路径上的问题。我确实想出了一个判断你是否对有趣的想法有品味的启发式方法：那就是你是否无法忍受已知的无聊想法。"
    },
    {
      "original": "Could you endure studying literary theory, or working in middle management at a large company?[10] In fact, if your goal is to start a startup, you can stick even more closely to the ideal of a liberal education than past generations have.",
      "translated": "你能忍受学习文学理论，或者在大公司的中层管理职位上工作吗？实际上，如果你的目标是创办一家初创公司，你可以比前几代人更严格地遵循通识教育的理想。"
    },
    {
      "original": "Back when students focused mainly on getting a job after college, they thought at least a little about how the courses they took might look to an employer. And perhaps even worse, they might shy away from taking a difficult class lest they get a low grade, which would harm their all-important GPA.",
      "translated": "在过去，当学生们主要关注大学毕业后找工作时，他们至少会稍微考虑一下所修课程在雇主眼中的印象。更糟糕的是，他们可能会因为担心成绩低而影响他们至关重要的平均绩点，从而避免选修难度较大的课程。"
    },
    {
      "original": "Good news: users don't care what your GPA was. And I've never heard of investors caring either. Y Combinator certainly never asks what classes you took in college or what grades you got in them. Thanks to Sam Altman, Paul Buchheit, John Collison, Patrick Collison, Jessica Livingston, Robert Morris, Geoff Ralston, and Fred Wilson for reading drafts of this.Arabic Translation",
      "translated": "好消息：用户并不关心你的成绩点数是多少。我从未听说过投资者会在意这一点。Y Combinator 绝不会问你在大学里修了哪些课程或得了什么成绩。感谢 Sam Altman、Paul Buchheit、John Collison、Patrick Collison、Jessica Livingston、Robert Morris、Geoff Ralston 和 Fred Wilson 阅读本文的草稿。"
    }
  ],
  "translation_completed": "2025-07-27T23:35:45.606471",
  "translation_stats": {
    "total_paragraphs": 85,
    "success_count": 85,
    "success_rate": "100.0%"
  }
}