{
  "title": "You Weren't Meant to Have a Boss",
  "title_zh": "[待翻译] You Weren't Meant to Have a Boss",
  "url": "https://www.paulgraham.com/boss.html",
  "filename": "boss.html",
  "date": "2021-02-21",
  "id": 44,
  "content": {
    "success": true,
    "paragraphs": [
      "Want to start a startup? Get funded by Y Combinator. March 2008, rev. June 2008Technology tends to separate normal from natural. Our bodies weren't designed to eat the foods that people in rich countries eat, or to get so little exercise.",
      "There may be a similar problem with the way we work: a normal job may be as bad for us intellectually as white flour or sugar is for us physically.I began to suspect this after spending several years working with startup founders.",
      "I've now worked with over 200 of them, and I've noticed a definite difference between programmers working on their own startups and those working for large organizations. I wouldn't say founders seem happier, necessarily; starting a startup can be very stressful.",
      "Maybe the best way to put it is to say that they're happier in the sense that your body is happier during a long run than sitting on a sofa eating doughnuts.Though they're statistically abnormal, startup founders seem to be working in a way that's more natural for humans.I was in Africa last year and saw a lot of animals in the wild that I'd only seen in zoos before.",
      "It was remarkable how different they seemed. Particularly lions. Lions in the wild seem about ten times more alive. They're like different animals. I suspect that working for oneself feels better to humans in much the same way that living in the wild must feel better to a wide-ranging predator like a lion.",
      "Life in a zoo is easier, but it isn't the life they were designed for. TreesWhat's so unnatural about working for a big company? The root of the problem is that humans weren't meant to work in such large groups.Another thing you notice when you see animals in the wild is that each species thrives in groups of a certain size.",
      "A herd of impalas might have 100 adults; baboons maybe 20; lions rarely 10. Humans also seem designed to work in groups, and what I've read about hunter-gatherers accords with research on organizations and my own experience to suggest roughly what the ideal size is: groups of 8 work well; by 20 they're getting hard to manage; and a group of 50 is really unwieldy.",
      "[1] Whatever the upper limit is, we are clearly not meant to work in groups of several hundred. And yet—for reasons having more to do with technology than human nature—a great many people work for companies with hundreds or thousands of employees.Companies know groups that large wouldn't work, so they divide themselves into units small enough to work together.",
      "But to coordinate these they have to introduce something new: bosses.These smaller groups are always arranged in a tree structure. Your boss is the point where your group attaches to the tree. But when you use this trick for dividing a large group into smaller ones, something strange happens that I've never heard anyone mention explicitly.",
      "In the group one level up from yours, your boss represents your entire group. A group of 10 managers is not merely a group of 10 people working together in the usual way. It's really a group of groups.",
      "Which means for a group of 10 managers to work together as if they were simply a group of 10 individuals, the group working for each manager would have to work as if they were a single person—the workers and manager would each share only one person's worth of freedom between them.In practice a group of people are never able to act as if they were one person.",
      "But in a large organization divided into groups in this way, the pressure is always in that direction. Each group tries its best to work as if it were the small group of individuals that humans were designed to work in.",
      "That was the point of creating it. And when you propagate that constraint, the result is that each person gets freedom of action in inverse proportion to the size of the entire tree. [2]Anyone who's worked for a large organization has felt this.",
      "You can feel the difference between working for a company with 100 employees and one with 10,000, even if your group has only 10 people. Corn SyrupA group of 10 people within a large organization is a kind of fake tribe.",
      "The number of people you interact with is about right. But something is missing: individual initiative. Tribes of hunter-gatherers have much more freedom. The leaders have a little more power than other members of the tribe, but they don't generally tell them what to do and when the way a boss can.It's not your boss's fault.",
      "The real problem is that in the group above you in the hierarchy, your entire group is one virtual person. Your boss is just the way that constraint is imparted to you.So working in a group of 10 people within a large organization feels both right and wrong at the same time.",
      "On the surface it feels like the kind of group you're meant to work in, but something major is missing. A job at a big company is like high fructose corn syrup: it has some of the qualities of things you're meant to like, but is disastrously lacking in others.Indeed, food is an excellent metaphor to explain what's wrong with the usual sort of job.For example, working for a big company is the default thing to do, at least for programmers.",
      "How bad could it be? Well, food shows that pretty clearly. If you were dropped at a random point in America today, nearly all the food around you would be bad for you. Humans were not designed to eat white flour, refined sugar, high fructose corn syrup, and hydrogenated vegetable oil.",
      "And yet if you analyzed the contents of the average grocery store you'd probably find these four ingredients accounted for most of the calories. \"Normal\" food is terribly bad for you. The only people who eat what humans were actually designed to eat are a few Birkenstock-wearing weirdos in Berkeley.If \"normal\" food is so bad for us, why is it so common?",
      "There are two main reasons. One is that it has more immediate appeal. You may feel lousy an hour after eating that pizza, but eating the first couple bites feels great. The other is economies of scale.",
      "Producing junk food scales; producing fresh vegetables doesn't. Which means (a) junk food can be very cheap, and (b) it's worth spending a lot to market it.If people have to choose between something that's cheap, heavily marketed, and appealing in the short term, and something that's expensive, obscure, and appealing in the long term, which do you think most will choose?It's the same with work.",
      "The average MIT graduate wants to work at Google or Microsoft, because it's a recognized brand, it's safe, and they'll get paid a good salary right away. It's the job equivalent of the pizza they had for lunch.",
      "The drawbacks will only become apparent later, and then only in a vague sense of malaise.And founders and early employees of startups, meanwhile, are like the Birkenstock-wearing weirdos of Berkeley: though a tiny minority of the population, they're the ones living as humans are meant to.",
      "In an artificial world, only extremists live naturally. ProgrammersThe restrictiveness of big company jobs is particularly hard on programmers, because the essence of programming is to build new things.",
      "Sales people make much the same pitches every day; support people answer much the same questions; but once you've written a piece of code you don't need to write it again. So a programmer working as programmers are meant to is always making new things.",
      "And when you're part of an organization whose structure gives each person freedom in inverse proportion to the size of the tree, you're going to face resistance when you do something new.This seems an inevitable consequence of bigness.",
      "It's true even in the smartest companies. I was talking recently to a founder who considered starting a startup right out of college, but went to work for Google instead because he thought he'd learn more there.",
      "He didn't learn as much as he expected. Programmers learn by doing, and most of the things he wanted to do, he couldn't—sometimes because the company wouldn't let him, but often because the company's code wouldn't let him.",
      "Between the drag of legacy code, the overhead of doing development in such a large organization, and the restrictions imposed by interfaces owned by other groups, he could only try a fraction of the things he would have liked to.",
      "He said he has learned much more in his own startup, despite the fact that he has to do all the company's errands as well as programming, because at least when he's programming he can do whatever he wants.An obstacle downstream propagates upstream.",
      "If you're not allowed to implement new ideas, you stop having them. And vice versa: when you can do whatever you want, you have more ideas about what to do. So working for yourself makes your brain more powerful in the same way a low-restriction exhaust system makes an engine more powerful.Working for yourself doesn't have to mean starting a startup, of course.",
      "But a programmer deciding between a regular job at a big company and their own startup is probably going to learn more doing the startup.You can adjust the amount of freedom you get by scaling the size of company you work for.",
      "If you start the company, you'll have the most freedom. If you become one of the first 10 employees you'll have almost as much freedom as the founders. Even a company with 100 people will feel different from one with 1000.Working for a small company doesn't ensure freedom.",
      "The tree structure of large organizations sets an upper bound on freedom, not a lower bound. The head of a small company may still choose to be a tyrant. The point is that a large organization is compelled by its structure to be one.",
      "ConsequencesThat has real consequences for both organizations and individuals. One is that companies will inevitably slow down as they grow larger, no matter how hard they try to keep their startup mojo.",
      "It's a consequence of the tree structure that every large organization is forced to adopt.Or rather, a large organization could only avoid slowing down if they avoided tree structure. And since human nature limits the size of group that can work together, the only way I can imagine for larger groups to avoid tree structure would be to have no structure: to have each group actually be independent, and to work together the way components of a market economy do.That might be worth exploring.",
      "I suspect there are already some highly partitionable businesses that lean this way. But I don't know any technology companies that have done it.There is one thing companies can do short of structuring themselves as sponges: they can stay small.",
      "If I'm right, then it really pays to keep a company as small as it can be at every stage. Particularly a technology company. Which means it's doubly important to hire the best people. Mediocre hires hurt you twice: they get less done, but they also make you big, because you need more of them to solve a given problem.For individuals the upshot is the same: aim small.",
      "It will always suck to work for large organizations, and the larger the organization, the more it will suck.In an essay I wrote a couple years ago I advised graduating seniors to work for a couple years for another company before starting their own.",
      "I'd modify that now. Work for another company if you want to, but only for a small one, and if you want to start your own startup, go ahead.The reason I suggested college graduates not start startups immediately was that I felt most would fail.",
      "And they will. But ambitious programmers are better off doing their own thing and failing than going to work at a big company. Certainly they'll learn more. They might even be better off financially.",
      "A lot of people in their early twenties get into debt, because their expenses grow even faster than the salary that seemed so high when they left school. At least if you start a startup and fail your net worth will be zero rather than negative.",
      "[3]We've now funded so many different types of founders that we have enough data to see patterns, and there seems to be no benefit from working for a big company. The people who've worked for a few years do seem better than the ones straight out of college, but only because they're that much older.The people who come to us from big companies often seem kind of conservative.",
      "It's hard to say how much is because big companies made them that way, and how much is the natural conservatism that made them work for the big companies in the first place. But certainly a large part of it is learned.",
      "I know because I've seen it burn off.Having seen that happen so many times is one of the things that convinces me that working for oneself, or at least for a small group, is the natural way for programmers to live.",
      "Founders arriving at Y Combinator often have the downtrodden air of refugees. Three months later they're transformed: they have so much more confidence that they seem as if they've grown several inches taller.",
      "[4] Strange as this sounds, they seem both more worried and happier at the same time. Which is exactly how I'd describe the way lions seem in the wild.Watching employees get transformed into founders makes it clear that the difference between the two is due mostly to environment—and in particular that the environment in big companies is toxic to programmers.",
      "In the first couple weeks of working on their own startup they seem to come to life, because finally they're working the way people are meant to.Notes[1] When I talk about humans being meant or designed to live a certain way, I mean by evolution.[2] It's not only the leaves who suffer.",
      "The constraint propagates up as well as down. So managers are constrained too; instead of just doing things, they have to act through subordinates.[3] Do not finance your startup with credit cards. Financing a startup with debt is usually a stupid move, and credit card debt stupidest of all.",
      "Credit card debt is a bad idea, period. It is a trap set by evil companies for the desperate and the foolish.[4] The founders we fund used to be younger (initially we encouraged undergrads to apply), and the first couple times I saw this I used to wonder if they were actually getting physically taller.Thanks to Trevor Blackwell, Ross Boucher, Aaron Iba, Abby Kirigin, Ivan Kirigin, Jessica Livingston, and Robert Morris for reading drafts of this.French TranslationRussian Translation"
    ],
    "word_count": 2491,
    "paragraph_count": 50
  },
  "processed_at": "2025-07-26T19:02:50.243943",
  "paragraphs": [
    {
      "original": "Want to start a startup? Get funded by Y Combinator. March 2008, rev. June 2008Technology tends to separate normal from natural. Our bodies weren't designed to eat the foods that people in rich countries eat, or to get so little exercise.",
      "translated": "想创业吗？争取得到 Y Combinator 的投资。2008年3月，2008年6月修订。技术往往将正常与自然区分开来。我们的身体并不是为了吃发达国家人们所吃的食物，或者进行如此少的运动而设计的。"
    },
    {
      "original": "There may be a similar problem with the way we work: a normal job may be as bad for us intellectually as white flour or sugar is for us physically.I began to suspect this after spending several years working with startup founders.",
      "translated": "我们工作的方式可能存在类似的问题：一份普通的工作可能对我们的智力有害，就像白面粉或糖对我们的身体有害一样。在与初创公司创始人共事几年后，我开始怀疑这一点。"
    },
    {
      "original": "I've now worked with over 200 of them, and I've noticed a definite difference between programmers working on their own startups and those working for large organizations. I wouldn't say founders seem happier, necessarily; starting a startup can be very stressful.",
      "translated": "我现在已经与超过200位他们合作过，我注意到独立创业的程序员与在大公司工作的程序员之间有着明显的差异。我不会说创业者一定更快乐；创立一家初创公司可能会非常有压力。"
    },
    {
      "original": "Maybe the best way to put it is to say that they're happier in the sense that your body is happier during a long run than sitting on a sofa eating doughnuts.Though they're statistically abnormal, startup founders seem to be working in a way that's more natural for humans.I was in Africa last year and saw a lot of animals in the wild that I'd only seen in zoos before.",
      "translated": "也许最好的表达方式是说，他们更快乐，就像你的身体在长时间跑步时比坐在沙发上吃甜甜圈时更快乐。尽管从统计学上来看，创业公司创始人是异常的，但他们似乎是以一种更符合人类天性的方\">×</方式工作的。去年我在非洲，看到了许多以前只在动物园里见过的野生动物。"
    },
    {
      "original": "It was remarkable how different they seemed. Particularly lions. Lions in the wild seem about ten times more alive. They're like different animals. I suspect that working for oneself feels better to humans in much the same way that living in the wild must feel better to a wide-ranging predator like a lion.",
      "translated": "他们看起来有多么不同，真是令人印象深刻。尤其是狮子。野生的狮子似乎活力十足，是圈养狮子的十倍。它们就像是不同的动物。我怀疑，对于像狮子这样的大型捕食者来说，生活在野外的感觉，可能就像人类为自己工作时的感觉一样好。"
    },
    {
      "original": "Life in a zoo is easier, but it isn't the life they were designed for. TreesWhat's so unnatural about working for a big company? The root of the problem is that humans weren't meant to work in such large groups.Another thing you notice when you see animals in the wild is that each species thrives in groups of a certain size.",
      "translated": "动物园里的生活更轻松，但这并不是它们本应过的生活。树木那么为大公司工作有什么不自然的呢？问题的根源在于人类本不应该在如此庞大的群体中工作。另外，当你在野外看到动物时，你会发现每个物种都在特定规模的群体中繁盛。"
    },
    {
      "original": "A herd of impalas might have 100 adults; baboons maybe 20; lions rarely 10. Humans also seem designed to work in groups, and what I've read about hunter-gatherers accords with research on organizations and my own experience to suggest roughly what the ideal size is: groups of 8 work well; by 20 they're getting hard to manage; and a group of 50 is really unwieldy.",
      "translated": "一群羚羊可能有100只成年个体；狒狒群体可能有20只；狮子的群体很少超过10只。人类似乎也适合以群体形式工作，关于狩猎采集者的记载与对组织的研究以及我自己的经验表明，理想的人群规模大致是：8人的小组工作得很好；20人时管理起来就开始变得困难；而50人的群体则非常难以管理。"
    },
    {
      "original": "[1] Whatever the upper limit is, we are clearly not meant to work in groups of several hundred. And yet—for reasons having more to do with technology than human nature—a great many people work for companies with hundreds or thousands of employees.Companies know groups that large wouldn't work, so they divide themselves into units small enough to work together.",
      "translated": "无论这个上限是多少，很明显我们并不适合几百人一起工作。然而——出于更多与技术而非人性相关的原因——许多人供职于拥有成百上千员工的公司。公司知道这么大的团队无法有效运作，因此他们会将自己划分成足够小的单元以便协同工作。"
    },
    {
      "original": "But to coordinate these they have to introduce something new: bosses.These smaller groups are always arranged in a tree structure. Your boss is the point where your group attaches to the tree. But when you use this trick for dividing a large group into smaller ones, something strange happens that I've never heard anyone mention explicitly.",
      "translated": "但为了协调这些小组，他们必须引入新的东西：老板。这些较小的小组总是以树形结构排列。你的老板就是你的小组与树相连的节点。但当你使用这种方法将大组分成小组时，会发生一些奇怪的现象，我从未听任何人明确提到过。"
    },
    {
      "original": "In the group one level up from yours, your boss represents your entire group. A group of 10 managers is not merely a group of 10 people working together in the usual way. It's really a group of groups.",
      "translated": "在你所在层级之上的那个层级中，你的上司代表了你们整个团队。10位经理组成的团队并不仅仅是10个人以常规方式一起工作。实际上，它是一个团队的集合。"
    },
    {
      "original": "Which means for a group of 10 managers to work together as if they were simply a group of 10 individuals, the group working for each manager would have to work as if they were a single person—the workers and manager would each share only one person's worth of freedom between them.In practice a group of people are never able to act as if they were one person.",
      "translated": "这意味着，如果10位经理作为一个简单的10人小组一起工作，那么每位经理所领导的团队必须像一个人一样工作——管理者和员工之间只能共享一个人的自由度。实际上，一群人永远无法像一个人那样行动。"
    },
    {
      "original": "But in a large organization divided into groups in this way, the pressure is always in that direction. Each group tries its best to work as if it were the small group of individuals that humans were designed to work in.",
      "translated": "但在这种分组方式的大型组织中，这种压力始终存在。每个小组都努力像人类最初设计的工作方式那样，即像一个小团体的个体那样工作。"
    },
    {
      "original": "That was the point of creating it. And when you propagate that constraint, the result is that each person gets freedom of action in inverse proportion to the size of the entire tree. [2]Anyone who's worked for a large organization has felt this.",
      "translated": "这就是创建它的目的。当你将这一限制传播开来时，结果就是每个人获得的行动自由度与整个组织的规模成反比。[2]任何在大型组织工作过的人对此都有所体会。"
    },
    {
      "original": "You can feel the difference between working for a company with 100 employees and one with 10,000, even if your group has only 10 people. Corn SyrupA group of 10 people within a large organization is a kind of fake tribe.",
      "translated": "你可以感受到为一家有100名员工的公司工作和为一家有10,000名员工的公司工作的区别，即使你的团队只有10个人。在一个大型组织中的10人团队，其实是一种伪部落。"
    },
    {
      "original": "The number of people you interact with is about right. But something is missing: individual initiative. Tribes of hunter-gatherers have much more freedom. The leaders have a little more power than other members of the tribe, but they don't generally tell them what to do and when the way a boss can.It's not your boss's fault.",
      "translated": "你交往的人数大致合适。但缺少了一些东西：个人主动性。狩猎采集部落拥有更多的自由。部落的领导者比其他成员拥有稍多的权力，但他们通常不会像老板那样告诉成员们该做什么、什么时候做。这不是你老板的错。"
    },
    {
      "original": "The real problem is that in the group above you in the hierarchy, your entire group is one virtual person. Your boss is just the way that constraint is imparted to you.So working in a group of 10 people within a large organization feels both right and wrong at the same time.",
      "translated": "真正的问题在于，在你上级的层级中，你的整个团队被视为一个虚拟的个体。你的老板就是这种约束传递给你的途径。因此，在一个大型组织中，作为一个10人团队的一员工作时，这种感觉既对又不对。"
    },
    {
      "original": "On the surface it feels like the kind of group you're meant to work in, but something major is missing. A job at a big company is like high fructose corn syrup: it has some of the qualities of things you're meant to like, but is disastrously lacking in others.Indeed, food is an excellent metaphor to explain what's wrong with the usual sort of job.For example, working for a big company is the default thing to do, at least for programmers.",
      "translated": "表面上看，这似乎是你应该在的那种团队，但缺少了一些重要的东西。在大公司工作就像高果糖玉米糖浆：它具有一些你本应喜欢的事物的特性，但在其他方面却严重不足。事实上，食物是一个很好的比喻，用来解释通常的工作有什么问题。例如，对程序员来说，在大公司工作是默认的选择。"
    },
    {
      "original": "How bad could it be? Well, food shows that pretty clearly. If you were dropped at a random point in America today, nearly all the food around you would be bad for you. Humans were not designed to eat white flour, refined sugar, high fructose corn syrup, and hydrogenated vegetable oil.",
      "translated": "情况能有多糟？食物就清楚地说明了这一点。如果你被随机丢到当今美国的任何一个地方，你会发现周围几乎所有的食物都是对你有害的。人类并不是为了吃精制面粉、精炼糖、高果糖玉米糖浆和氢化植物油而设计的。"
    },
    {
      "original": "And yet if you analyzed the contents of the average grocery store you'd probably find these four ingredients accounted for most of the calories. \"Normal\" food is terribly bad for you. The only people who eat what humans were actually designed to eat are a few Birkenstock-wearing weirdos in Berkeley.If \"normal\" food is so bad for us, why is it so common?",
      "translated": "然而，如果你分析一下普通杂货店里的商品成分，你可能会发现这四种成分占据了大多数的热量。“正常”食物对你非常不好。唯一吃人类真正应该吃的东西的人，只是一些穿着勃肯鞋的怪人在伯克利。如果“正常”食物对我们这么不好，为什么它如此普遍？"
    },
    {
      "original": "There are two main reasons. One is that it has more immediate appeal. You may feel lousy an hour after eating that pizza, but eating the first couple bites feels great. The other is economies of scale.",
      "translated": "有两个主要理由。一是它具有更直接的吸引力。你可能在吃了比萨一小时后感觉糟糕，但前几口吃起来确实很美妙。另一个原因是规模经济。"
    },
    {
      "original": "Producing junk food scales; producing fresh vegetables doesn't. Which means (a) junk food can be very cheap, and (b) it's worth spending a lot to market it.If people have to choose between something that's cheap, heavily marketed, and appealing in the short term, and something that's expensive, obscure, and appealing in the long term, which do you think most will choose?It's the same with work.",
      "translated": "生产垃圾食品可以规模化；生产新鲜蔬菜则不行。这意味着（a）垃圾食品可以非常便宜，（b）值得花大价钱来营销它。如果人们不得不在一种既便宜、宣传广泛且短期内有吸引力的东西和一种既昂贵、鲜为人知且长期有益的东西之间做出选择，你认为大多数人会选择哪一个？工作也是如此。"
    },
    {
      "original": "The average MIT graduate wants to work at Google or Microsoft, because it's a recognized brand, it's safe, and they'll get paid a good salary right away. It's the job equivalent of the pizza they had for lunch.",
      "translated": "平均而言，麻省理工学院的毕业生希望在谷歌或微软工作，因为这些公司是知名品牌，工作稳定，而且他们可以立即获得丰厚的薪水。这相当于他们午餐吃比萨的工作选择。"
    },
    {
      "original": "The drawbacks will only become apparent later, and then only in a vague sense of malaise.And founders and early employees of startups, meanwhile, are like the Birkenstock-wearing weirdos of Berkeley: though a tiny minority of the population, they're the ones living as humans are meant to.",
      "translated": "缺点只有在后来才会显现出来，而且那时也只是表现为一种模糊的不适感。而初创企业的创始人和早期员工，就好比是伯克利穿凉鞋的怪人：虽然只是人口中的极小一部分，但他们过着人类应有的生活。"
    },
    {
      "original": "In an artificial world, only extremists live naturally. ProgrammersThe restrictiveness of big company jobs is particularly hard on programmers, because the essence of programming is to build new things.",
      "translated": "在一个虚拟的世界里，只有极端分子能够自然地生活。大公司的职位对程序员的限制尤其严重，因为编程的本质是创造新事物。"
    },
    {
      "original": "Sales people make much the same pitches every day; support people answer much the same questions; but once you've written a piece of code you don't need to write it again. So a programmer working as programmers are meant to is always making new things.",
      "translated": "销售人员每天都在做类似的推销；支持人员回答着相同的问题；但一旦你写了一段代码，就不需要再写一次。因此，程序员按照应有的方式工作时，总是在创造新的东西。"
    },
    {
      "original": "And when you're part of an organization whose structure gives each person freedom in inverse proportion to the size of the tree, you're going to face resistance when you do something new.This seems an inevitable consequence of bigness.",
      "translated": "当你身处一个组织结构中，每个人拥有的自由度与组织规模成反比时，你在尝试新事物时必然会遇到阻力。这似乎是大组织不可避免的后果。"
    },
    {
      "original": "It's true even in the smartest companies. I was talking recently to a founder who considered starting a startup right out of college, but went to work for Google instead because he thought he'd learn more there.",
      "translated": "即使在最聪明的公司也是如此。我最近与一位创始人交谈，他本打算一毕业就创业，但最终选择去谷歌工作，因为他认为在那里能学到更多。"
    },
    {
      "original": "He didn't learn as much as he expected. Programmers learn by doing, and most of the things he wanted to do, he couldn't—sometimes because the company wouldn't let him, but often because the company's code wouldn't let him.",
      "translated": "他并没有学到他预期那么多。程序员通过实践来学习，而他想要做的大部分事情都做不到——有时是因为公司不允许，但很多时候是因为公司的代码不允许。"
    },
    {
      "original": "Between the drag of legacy code, the overhead of doing development in such a large organization, and the restrictions imposed by interfaces owned by other groups, he could only try a fraction of the things he would have liked to.",
      "translated": "由于遗留代码的拖累、在如此大型组织中进行开发的额外开销，以及受其他团队所拥有的接口的限制，他只能尝试他想要做的事情中的一小部分。"
    },
    {
      "original": "He said he has learned much more in his own startup, despite the fact that he has to do all the company's errands as well as programming, because at least when he's programming he can do whatever he wants.An obstacle downstream propagates upstream.",
      "translated": "他说，尽管他必须处理公司的所有杂务以及编程工作，但他从自己的创业经历中学到了更多，因为至少在编程时，他可以随心所欲地做任何事情。下游的障碍会向上游传播。"
    },
    {
      "original": "If you're not allowed to implement new ideas, you stop having them. And vice versa: when you can do whatever you want, you have more ideas about what to do. So working for yourself makes your brain more powerful in the same way a low-restriction exhaust system makes an engine more powerful.Working for yourself doesn't have to mean starting a startup, of course.",
      "translated": "如果你不被允许实施新的想法，你就不再会有新的想法。反之亦然：当你能够随心所欲时，你会有更多的想法。因此，为自己工作会让你的大脑更强大，就像低限制的排气系统能让发动机更强大一样。当然，为自己工作并不一定意味着要创办一家初创公司。"
    },
    {
      "original": "But a programmer deciding between a regular job at a big company and their own startup is probably going to learn more doing the startup.You can adjust the amount of freedom you get by scaling the size of company you work for.",
      "translated": "但是，一个程序员在大型公司的普通职位和自己的创业项目之间做选择时，很可能在创业项目中学到更多。你可以通过调整所服务公司的规模来调节自己获得的自由度。"
    },
    {
      "original": "If you start the company, you'll have the most freedom. If you become one of the first 10 employees you'll have almost as much freedom as the founders. Even a company with 100 people will feel different from one with 1000.Working for a small company doesn't ensure freedom.",
      "translated": "如果你创办公司，你会拥有最大的自由。如果你成为前10名员工之一，你将几乎拥有与创始人同等的自由。即使是一家有100人的公司，也会与有1000人的公司感觉不同。在小公司工作并不保证自由。"
    },
    {
      "original": "The tree structure of large organizations sets an upper bound on freedom, not a lower bound. The head of a small company may still choose to be a tyrant. The point is that a large organization is compelled by its structure to be one.",
      "translated": "大型组织的树状结构设定了自由的上限，而不是下限。小公司的老板仍然可以选择成为一个暴君。关键在于，大型组织由于其结构的限制，不得不成为这样的组织。"
    },
    {
      "original": "ConsequencesThat has real consequences for both organizations and individuals. One is that companies will inevitably slow down as they grow larger, no matter how hard they try to keep their startup mojo.",
      "translated": "这对公司和个人都有实际的影响。其中一个影响是，无论企业如何努力保持初创时的活力，随着规模的扩大，它们不可避免地会放缓。"
    },
    {
      "original": "It's a consequence of the tree structure that every large organization is forced to adopt.Or rather, a large organization could only avoid slowing down if they avoided tree structure. And since human nature limits the size of group that can work together, the only way I can imagine for larger groups to avoid tree structure would be to have no structure: to have each group actually be independent, and to work together the way components of a market economy do.That might be worth exploring.",
      "translated": "这是每个大型组织被迫采用的树状结构的结果。或者更准确地说，大型组织只有避免树状结构才能避免效率下降。由于人性限制了可以有效合作的群体规模，我所能想象的大型群体避免树状结构的唯一方法就是没有结构：让每个群体真正独立，并像市场经济中的各个组成部分那样协作。这或许值得探索。"
    },
    {
      "original": "I suspect there are already some highly partitionable businesses that lean this way. But I don't know any technology companies that have done it.There is one thing companies can do short of structuring themselves as sponges: they can stay small.",
      "translated": "我怀疑已经有一些高度可分割的企业倾向于这种方式。但我并不知道有任何科技公司这样做过。企业在不把自己构建成海绵结构的情况下可以做一件事：保持小型化。"
    },
    {
      "original": "If I'm right, then it really pays to keep a company as small as it can be at every stage. Particularly a technology company. Which means it's doubly important to hire the best people. Mediocre hires hurt you twice: they get less done, but they also make you big, because you need more of them to solve a given problem.For individuals the upshot is the same: aim small.",
      "translated": "如果我是对的，那么在每个阶段都尽可能保持公司的小规模是非常值得的。尤其是对于科技公司而言。这意味着雇佣最优秀的人才尤为重要。平庸的员工会让你受到双重打击：他们完成的工作较少，但你也需要更多的人来解决同一个问题。对于个人而言，结果也是一样的：目标要小。"
    },
    {
      "original": "It will always suck to work for large organizations, and the larger the organization, the more it will suck.In an essay I wrote a couple years ago I advised graduating seniors to work for a couple years for another company before starting their own.",
      "translated": "为大型组织工作总是不愉快的，而且组织越大，这种不愉快感就越强。几年前我在一篇文章中建议即将毕业的大学生，先为其他公司工作几年再开始自己的事业。"
    },
    {
      "original": "I'd modify that now. Work for another company if you want to, but only for a small one, and if you want to start your own startup, go ahead.The reason I suggested college graduates not start startups immediately was that I felt most would fail.",
      "translated": "我现在会修改这个建议。如果你想为另一家公司工作，那就去吧，但只选择小公司；如果你想自己创业，那就去做吧。我之前建议大学毕业生不要立即创业，是因为我认为大多数人会失败。"
    },
    {
      "original": "And they will. But ambitious programmers are better off doing their own thing and failing than going to work at a big company. Certainly they'll learn more. They might even be better off financially.",
      "translated": "他们确实会这样。但是，有抱负的程序员自己做项目并失败，比去大公司工作要好。他们肯定会学到更多。甚至在经济上可能会更好。"
    },
    {
      "original": "A lot of people in their early twenties get into debt, because their expenses grow even faster than the salary that seemed so high when they left school. At least if you start a startup and fail your net worth will be zero rather than negative.",
      "translated": "许多年轻人在二十出头时就会负债，因为他们的开销增长速度超过了刚毕业时觉得很高的薪水。至少，如果你开始创业失败了，你的净资产会是零，而不是负数。"
    },
    {
      "original": "[3]We've now funded so many different types of founders that we have enough data to see patterns, and there seems to be no benefit from working for a big company. The people who've worked for a few years do seem better than the ones straight out of college, but only because they're that much older.The people who come to us from big companies often seem kind of conservative.",
      "translated": "我们现在资助了如此多不同类型的创业者，积累了足够的数据来发现一些规律，似乎在大公司工作并没有什么特别的好处。工作了几年的人似乎比刚出校门的人要好一些，但这仅仅是因为他们年龄更大一些。从大公司来的人往往显得有些保守。"
    },
    {
      "original": "It's hard to say how much is because big companies made them that way, and how much is the natural conservatism that made them work for the big companies in the first place. But certainly a large part of it is learned.",
      "translated": "很难说清这其中有多少是因为大公司把他们塑造成这样，又有多少是因为他们天生的保守让他们最初选择为大公司工作。但可以肯定的是，其中很大一部分是后天习得的。"
    },
    {
      "original": "I know because I've seen it burn off.Having seen that happen so many times is one of the things that convinces me that working for oneself, or at least for a small group, is the natural way for programmers to live.",
      "translated": "我知道，因为我亲眼见过这种情况发生。多次目睹这种现象是我相信程序员应该为自己或至少为一个小团队工作是自然生活方式的原因之一。"
    },
    {
      "original": "Founders arriving at Y Combinator often have the downtrodden air of refugees. Three months later they're transformed: they have so much more confidence that they seem as if they've grown several inches taller.",
      "translated": "来到 Y Combinator 的创始人们往往带着难民般的落魄气息。三个月后，他们发生了蜕变：他们的自信心大幅提升，仿佛长高了几英寸。"
    },
    {
      "original": "[4] Strange as this sounds, they seem both more worried and happier at the same time. Which is exactly how I'd describe the way lions seem in the wild.Watching employees get transformed into founders makes it clear that the difference between the two is due mostly to environment—and in particular that the environment in big companies is toxic to programmers.",
      "translated": "这听起来可能很奇怪，但他们似乎同时更加担忧和更加快乐。这正是我用来描述野生狮子的样子。观察员工转变为创始人，可以清楚地看出两者之间的差异主要归因于环境——特别是大公司对程序员的环境是有毒的。"
    },
    {
      "original": "In the first couple weeks of working on their own startup they seem to come to life, because finally they're working the way people are meant to.Notes[1] When I talk about humans being meant or designed to live a certain way, I mean by evolution.[2] It's not only the leaves who suffer.",
      "translated": "在他们自己创业的头几周，他们似乎变得充满活力，因为终于可以按照人类本应工作的方式进行工作。注[1] 当我谈到人类本应或被设计成某种生活方式时，我是指通过进化。[2] 不仅仅是那些处于底层的人在受苦。"
    },
    {
      "original": "The constraint propagates up as well as down. So managers are constrained too; instead of just doing things, they have to act through subordinates.[3] Do not finance your startup with credit cards. Financing a startup with debt is usually a stupid move, and credit card debt stupidest of all.",
      "translated": "这种约束不仅向下传递，也向上蔓延。因此，管理者也受到限制；他们不能直接做事，而必须通过下属来行动。[3] 不要用信用卡为你的初创公司融资。用债务为初创公司融资通常是一个愚蠢的举动，而信用卡债务则是最愚蠢的。"
    },
    {
      "original": "Credit card debt is a bad idea, period. It is a trap set by evil companies for the desperate and the foolish.[4] The founders we fund used to be younger (initially we encouraged undergrads to apply), and the first couple times I saw this I used to wonder if they were actually getting physically taller.Thanks to Trevor Blackwell, Ross Boucher, Aaron Iba, Abby Kirigin, Ivan Kirigin, Jessica Livingston, and Robert Morris for reading drafts of this.French TranslationRussian Translation",
      "translated": "信用卡债务绝对是一个坏主意。它是那些邪恶的公司为绝望和愚蠢的人设下的陷阱。[4] 我们资助的创始人曾经更年轻（最初我们鼓励大学生申请），前几次看到这种情况时，我甚至怀疑他们是否真的长高了。感谢 Trevor Blackwell、Ross Boucher、Aaron Iba、Abby Kirigin、Ivan Kirigin、Jessica Livingston 和 Robert Morris 阅读本文的草稿。法文翻译俄文翻译"
    }
  ],
  "translation_completed": "2025-07-28T11:21:22.756319",
  "translation_stats": {
    "total_paragraphs": 50,
    "success_count": 50,
    "success_rate": "100.0%"
  }
}