{
  "title": "It's Charisma, Stupid",
  "title_zh": "[待翻译] It's Charisma, Stupid",
  "url": "https://www.paulgraham.com/charisma.html",
  "filename": "charisma.html",
  "date": "2004-11-01",
  "id": 209,
  "content": {
    "success": true,
    "paragraphs": [
      "November 2004, corrected June 2006Occam's razor says we should prefer the simpler of two explanations. I begin by reminding readers of this principle because I'm about to propose a theory that will offend both liberals and conservatives.",
      "But Occam's razor means, in effect, that if you want to disagree with it, you have a hell of a coincidence to explain.Theory: In US presidential elections, the more charismatic candidate wins.People who write about politics, whether on the left or the right, have a consistent bias: they take politics seriously.",
      "When one candidate beats another they look for political explanations. The country is shifting to the left, or the right. And that sort of shift can certainly be the result of a presidential election, which makes it easy to believe it was the cause.But when I think about why I voted for Clinton over the first George Bush, it wasn't because I was shifting to the left.",
      "Clinton just seemed more dynamic. He seemed to want the job more. Bush seemed old and tired. I suspect it was the same for a lot of voters.Clinton didn't represent any national shift leftward. [1] He was just more charismatic than George Bush or (God help us) Bob Dole.",
      "In 2000 we practically got a controlled experiment to prove it: Gore had Clinton's policies, but not his charisma, and he suffered proportionally. [2] Same story in 2004. Kerry was smarter and more articulate than Bush, but rather a stiff.",
      "And Kerry lost.As I looked further back, I kept finding the same pattern. Pundits said Carter beat Ford because the country distrusted the Republicans after Watergate. And yet it also happened that Carter was famous for his big grin and folksy ways, and Ford for being a boring klutz.",
      "Four years later, pundits said the country had lurched to the right. But Reagan, a former actor, also happened to be even more charismatic than Carter (whose grin was somewhat less cheery after four stressful years in office).",
      "In 1984 the charisma gap between Reagan and Mondale was like that between Clinton and Dole, with similar results. The first George Bush managed to win in 1988, though he would later be vanquished by one of the most charismatic presidents ever, because in 1988 he was up against the notoriously uncharismatic Michael Dukakis.These are the elections I remember personally, but apparently the same pattern played out in 1964 and 1972.",
      "The most recent counterexample appears to be 1968, when Nixon beat the more charismatic Hubert Humphrey. But when you examine that election, it tends to support the charisma theory more than contradict it.",
      "As Joe McGinnis recounts in his famous book The Selling of the President 1968, Nixon knew he had less charisma than Humphrey, and thus simply refused to debate him on TV. He knew he couldn't afford to let the two of them be seen side by side.Now a candidate probably couldn't get away with refusing to debate.",
      "But in 1968 the custom of televised debates was still evolving. In effect, Nixon won in 1968 because voters were never allowed to see the real Nixon. All they saw were carefully scripted campaign spots.Oddly enough, the most recent true counterexample is probably 1960.",
      "Though this election is usually given as an example of the power of TV, Kennedy apparently would not have won without fraud by party machines in Illinois and Texas. But TV was still young in 1960; only 87% of households had it.",
      "[3] Undoubtedly TV helped Kennedy, so historians are correct in regarding this election as a watershed. TV required a new kind of candidate. There would be no more Calvin Coolidges.The charisma theory may also explain why Democrats tend to lose presidential elections.",
      "The core of the Democrats' ideology seems to be a belief in government. Perhaps this tends to attract people who are earnest, but dull. Dukakis, Gore, and Kerry were so similar in that respect that they might have been brothers.",
      "Good thing for the Democrats that their screen lets through an occasional Clinton, even if some scandal results. [4]One would like to believe elections are won and lost on issues, if only fake ones like Willie Horton.",
      "And yet, if they are, we have a remarkable coincidence to explain. In every presidential election since TV became widespread, the apparently more charismatic candidate has won. Surprising, isn't it, that voters' opinions on the issues have lined up with charisma for 11 elections in a row?The political commentators who come up with shifts to the left or right in their morning-after analyses are like the financial reporters stuck writing stories day after day about the random fluctuations of the stock market.",
      "Day ends, market closes up or down, reporter looks for good or bad news respectively, and writes that the market was up on news of Intel's earnings, or down on fears of instability in the Middle East.",
      "Suppose we could somehow feed these reporters false information about market closes, but give them all the other news intact. Does anyone believe they would notice the anomaly, and not simply write that stocks were up (or down) on whatever good (or bad) news there was that day?",
      "That they would say, hey, wait a minute, how can stocks be up with all this unrest in the Middle East?I'm not saying that issues don't matter to voters. Of course they do. But the major parties know so well which issues matter how much to how many voters, and adjust their message so precisely in response, that they tend to split the difference on the issues, leaving the election to be decided by the one factor they can't control: charisma.If the Democrats had been running a candidate as charismatic as Clinton in the 2004 election, he'd have won.",
      "And we'd be reading that the election was a referendum on the war in Iraq, instead of that the Democrats are out of touch with evangelical Christians in middle America.During the 1992 election, the Clinton campaign staff had a big sign in their office saying \"It's the economy, stupid.\" Perhaps it was even simpler than they thought.PostscriptOpinions seem to be divided about the charisma theory.",
      "Some say it's impossible, others say it's obvious. This seems a good sign. Perhaps it's in the sweet spot midway between.As for it being impossible, I reply: here's the data; here's the theory; theory explains data 100%.",
      "To a scientist, at least, that means it deserves attention, however implausible it seems.You can't believe voters are so superficial that they just choose the most charismatic guy? My theory doesn't require that.",
      "I'm not proposing that charisma is the only factor, just that it's the only one left after the efforts of the two parties cancel one another out.As for the theory being obvious, as far as I know, no one has proposed it before.",
      "Election forecasters are proud when they can achieve the same results with much more complicated models.Finally, to the people who say that the theory is probably true, but rather depressing: it's not so bad as it seems.",
      "The phenomenon is like a pricing anomaly; once people realize it's there, it will disappear. Once both parties realize it's a waste of time to nominate uncharismatic candidates, they'll tend to nominate only the most charismatic ones.",
      "And if the candidates are equally charismatic, charisma will cancel out, and elections will be decided on issues, as political commentators like to think they are now.Notes[1] As Clinton himself discovered to his surprise when, in one of his first acts as president, he tried to shift the military leftward.",
      "After a bruising fight he escaped with a face-saving compromise.[2] True, Gore won the popular vote. But politicians know the electoral vote decides the election, so that's what they campaign for. If Bush had been campaigning for the popular vote he would presumably have got more of it.",
      "(Thanks to judgmentalist for this point.)[3] Source: Nielsen Media Research. Of the remaining 13%, 11 didn't have TV because they couldn't afford it. I'd argue that the missing 11% were probably also the 11% most susceptible to charisma.[4] One implication of this theory is that parties shouldn't be too quick to reject candidates with skeletons in their closets.",
      "Charismatic candidates will tend to have more skeletons than squeaky clean dullards, but in practice that doesn't seem to lose elections. The current Bush, for example, probably did more drugs in his twenties than any preceding president, and yet managed to get elected with a base of evangelical Christians.",
      "All you have to do is say you've reformed, and stonewall about the details.Thanks to Trevor Blackwell, Maria Daniels, Jessica Livingston, Jackie McDonough, and Robert Morris for reading drafts of this, and to Eric Raymond for pointing out that I was wrong about 1968.",
      "Comment on this essay.What Charisma IsPolitics and the Art of ActingJapanese Translation"
    ],
    "word_count": 1476,
    "paragraph_count": 31
  },
  "processed_at": "2025-07-26T19:08:14.764970",
  "paragraphs": [
    {
      "original": "November 2004, corrected June 2006Occam's razor says we should prefer the simpler of two explanations. I begin by reminding readers of this principle because I'm about to propose a theory that will offend both liberals and conservatives.",
      "translated": "2004年11月，2006年6月修正。奥卡姆剃刀原则告诉我们，在两个解释中，我们应该倾向于更简单的那个。我在此提醒读者这一原则，因为我即将提出一个理论，这个理论将会同时触怒自由派和保守派。"
    },
    {
      "original": "But Occam's razor means, in effect, that if you want to disagree with it, you have a hell of a coincidence to explain.Theory: In US presidential elections, the more charismatic candidate wins.People who write about politics, whether on the left or the right, have a consistent bias: they take politics seriously.",
      "translated": "但奥卡姆剃刀原理实际上意味着，如果你想反对它，你将不得不解释一个非常难以解释的巧合。理论：在美国总统选举中，更有魅力的候选人会获胜。无论是左派还是右派，撰写政治文章的人有一个一贯的偏见：他们认真对待政治。"
    },
    {
      "original": "When one candidate beats another they look for political explanations. The country is shifting to the left, or the right. And that sort of shift can certainly be the result of a presidential election, which makes it easy to believe it was the cause.But when I think about why I voted for Clinton over the first George Bush, it wasn't because I was shifting to the left.",
      "translated": "当一个候选人击败另一个候选人时，人们会寻找政治上的解释。国家正在向左转，或向右转。这种转变确实可能是总统选举的结果，这使得人们很容易相信它是原因。但当我回想为什么我选择支持克林顿而不是老布什时，那并不是因为我正在向左转。"
    },
    {
      "original": "Clinton just seemed more dynamic. He seemed to want the job more. Bush seemed old and tired. I suspect it was the same for a lot of voters.Clinton didn't represent any national shift leftward. [1] He was just more charismatic than George Bush or (God help us) Bob Dole.",
      "translated": "克林顿看起来更有活力。他似乎更渴望得到这份工作。而布什则显得老态龙钟。我想这对很多选民来说也是如此。克林顿并不代表国家向左转的倾向。[1] 他只是比乔治·布什或（天佑美国）鲍勃·多尔更有魅力。"
    },
    {
      "original": "In 2000 we practically got a controlled experiment to prove it: Gore had Clinton's policies, but not his charisma, and he suffered proportionally. [2] Same story in 2004. Kerry was smarter and more articulate than Bush, but rather a stiff.",
      "translated": "2000年，我们几乎得到了一个受控实验来证明这一点：戈尔继承了克林顿的政策，却没有他的个人魅力，因此受到了相应的影响。2004年的情况也是如此。克里比布什更聪明、口才更好，但显得有些僵硬。"
    },
    {
      "original": "And Kerry lost.As I looked further back, I kept finding the same pattern. Pundits said Carter beat Ford because the country distrusted the Republicans after Watergate. And yet it also happened that Carter was famous for his big grin and folksy ways, and Ford for being a boring klutz.",
      "translated": "而克里输了。当我回溯更早的历史时，我发现同样的模式。评论家说卡特战胜福特是因为水门事件后国家对共和党的不信任。然而，卡特也以其大大的笑容和朴实的作风闻名，而福特则被认为是一个乏味的笨拙之人。"
    },
    {
      "original": "Four years later, pundits said the country had lurched to the right. But Reagan, a former actor, also happened to be even more charismatic than Carter (whose grin was somewhat less cheery after four stressful years in office).",
      "translated": "四年后，评论家说这个国家已经右倾。但里根，这位前演员，也比卡特更具魅力（卡特在四年的紧张任期后，笑容显得不那么灿烂了）。"
    },
    {
      "original": "In 1984 the charisma gap between Reagan and Mondale was like that between Clinton and Dole, with similar results. The first George Bush managed to win in 1988, though he would later be vanquished by one of the most charismatic presidents ever, because in 1988 he was up against the notoriously uncharismatic Michael Dukakis.These are the elections I remember personally, but apparently the same pattern played out in 1964 and 1972.",
      "translated": "1984年，里根和蒙代尔之间的个人魅力差距，类似于克林顿和多尔之间的差距，结果也相似。老布什在1988年成功当选，尽管后来被可能是最有魅力的总统之一击败，但在1988年，他的对手是出了名的缺乏魅力的迈克尔·杜卡基斯。这些都是我亲身经历的选举，但显然同样的模式也出现在1964年和1972年。"
    },
    {
      "original": "The most recent counterexample appears to be 1968, when Nixon beat the more charismatic Hubert Humphrey. But when you examine that election, it tends to support the charisma theory more than contradict it.",
      "translated": "最近的一个反例似乎是1968年，当时尼克松击败了更具魅力的汉弗莱。但当你仔细研究那次选举时，它似乎更多地支持了魅力理论，而不是反驳它。"
    },
    {
      "original": "As Joe McGinnis recounts in his famous book The Selling of the President 1968, Nixon knew he had less charisma than Humphrey, and thus simply refused to debate him on TV. He knew he couldn't afford to let the two of them be seen side by side.Now a candidate probably couldn't get away with refusing to debate.",
      "translated": "正如乔·麦金尼斯在他著名的《1968年总统的推销》一书中所述，尼克松知道自己在魅力上不如汉弗莱，因此干脆拒绝与他在电视上进行辩论。他知道不能让两人并肩出现在公众面前。如今，候选人恐怕无法拒绝参加辩论了。"
    },
    {
      "original": "But in 1968 the custom of televised debates was still evolving. In effect, Nixon won in 1968 because voters were never allowed to see the real Nixon. All they saw were carefully scripted campaign spots.Oddly enough, the most recent true counterexample is probably 1960.",
      "translated": "但1968年时，电视辩论的惯例仍在发展中。实际上，尼克松在1968年获胜是因为选民从未有机会看到真正的尼克松。他们所看到的只是精心编排的竞选广告。有趣的是，最近真正相反的例子可能是1960年。"
    },
    {
      "original": "Though this election is usually given as an example of the power of TV, Kennedy apparently would not have won without fraud by party machines in Illinois and Texas. But TV was still young in 1960; only 87% of households had it.",
      "translated": "尽管这次选举常被用作电视力量的例证，但肯尼迪显然若非伊利诺伊州和德克萨斯州的政党机器舞弊，他是不会获胜的。不过，1960年电视还处于起步阶段；只有87%的家庭拥有电视。"
    },
    {
      "original": "[3] Undoubtedly TV helped Kennedy, so historians are correct in regarding this election as a watershed. TV required a new kind of candidate. There would be no more Calvin Coolidges.The charisma theory may also explain why Democrats tend to lose presidential elections.",
      "translated": "无疑，电视帮助了肯尼迪，因此历史学家将这次选举视为一个分水岭是正确的。电视需要一种新型的候选人。不会再有像卡尔文·柯立芝那样的候选人了。魅力理论也可能解释了为什么民主党往往会在总统选举中失利。"
    },
    {
      "original": "The core of the Democrats' ideology seems to be a belief in government. Perhaps this tends to attract people who are earnest, but dull. Dukakis, Gore, and Kerry were so similar in that respect that they might have been brothers.",
      "translated": "民主党的核心意识形态似乎是相信政府。这可能倾向于吸引那些认真但乏味的人。杜卡基斯、戈尔和克里在这方面如此相似，以至于他们可能像是兄弟。"
    },
    {
      "original": "Good thing for the Democrats that their screen lets through an occasional Clinton, even if some scandal results. [4]One would like to believe elections are won and lost on issues, if only fake ones like Willie Horton.",
      "translated": "还好民主党能够偶尔让像克林顿这样的人物通过他们的筛选，即使有时会引发一些丑闻。人们希望选举的胜负能够基于议题，哪怕只是像威利·霍顿这样的虚假议题。"
    },
    {
      "original": "And yet, if they are, we have a remarkable coincidence to explain. In every presidential election since TV became widespread, the apparently more charismatic candidate has won. Surprising, isn't it, that voters' opinions on the issues have lined up with charisma for 11 elections in a row?The political commentators who come up with shifts to the left or right in their morning-after analyses are like the financial reporters stuck writing stories day after day about the random fluctuations of the stock market.",
      "translated": "然而，如果真是这样，我们就需要解释一个惊人的巧合。自电视普及以来的每一次总统选举中，表面上更具魅力的候选人总是获胜。真是令人惊讶，选民对议题的看法竟然连续11次与魅力相符。那些在选举后的早晨分析中提出左转或右转的政治评论员，就像是那些每天不得不撰写股市随机波动报道的财经记者。"
    },
    {
      "original": "Day ends, market closes up or down, reporter looks for good or bad news respectively, and writes that the market was up on news of Intel's earnings, or down on fears of instability in the Middle East.",
      "translated": "一天结束，市场或涨或跌，记者分别寻找利好或利空消息，然后写下市场因英特尔的盈利消息而上涨，或是因中东不稳定局势的担忧而下跌。"
    },
    {
      "original": "Suppose we could somehow feed these reporters false information about market closes, but give them all the other news intact. Does anyone believe they would notice the anomaly, and not simply write that stocks were up (or down) on whatever good (or bad) news there was that day?",
      "translated": "假设我们 somehow 向这些记者提供关于市场收盘的虚假信息，但其他所有新闻都是真实的。有人相信他们会注意到这一异常，而不是简单地根据当天的利好（或利空）消息报道股市上涨（或下跌）吗？"
    },
    {
      "original": "That they would say, hey, wait a minute, how can stocks be up with all this unrest in the Middle East?I'm not saying that issues don't matter to voters. Of course they do. But the major parties know so well which issues matter how much to how many voters, and adjust their message so precisely in response, that they tend to split the difference on the issues, leaving the election to be decided by the one factor they can't control: charisma.If the Democrats had been running a candidate as charismatic as Clinton in the 2004 election, he'd have won.",
      "translated": "他们会说，嘿，等一下，中东这么动荡，股市怎么还能上涨？我不是说这些问题对选民不重要。当然重要。但主要政党非常清楚哪些问题对多少选民有多重要，并且会非常精确地调整他们的信息以应对，结果在这些问题上都趋于折中，使选举最终由一个他们无法控制的因素决定：魅力。如果民主党在2004年的选举中推出了一位像克林顿一样有魅力的候选人，他就会赢得选举。"
    },
    {
      "original": "And we'd be reading that the election was a referendum on the war in Iraq, instead of that the Democrats are out of touch with evangelical Christians in middle America.During the 1992 election, the Clinton campaign staff had a big sign in their office saying \"It's the economy, stupid.\" Perhaps it was even simpler than they thought.PostscriptOpinions seem to be divided about the charisma theory.",
      "translated": "我们会认为这次选举是对伊拉克战争的一次公投，而不是民主党与中西部的福音派基督徒脱节。在1992年的选举中，克林顿竞选团队的办公室里挂着一个大牌子，上面写着“这是经济问题，蠢货。”也许事情比他们想象的还要简单。附注：关于魅力理论，人们的意见似乎存在分歧。"
    },
    {
      "original": "Some say it's impossible, others say it's obvious. This seems a good sign. Perhaps it's in the sweet spot midway between.As for it being impossible, I reply: here's the data; here's the theory; theory explains data 100%.",
      "translated": "有人说这是不可能的，另一些人则认为这是显而易见的。这似乎是个好兆头。也许正处于这两者之间的最佳位置。对于认为这是不可能的观点，我的回答是：这里有数据；这里有理论；理论100%解释了数据。"
    },
    {
      "original": "To a scientist, at least, that means it deserves attention, however implausible it seems.You can't believe voters are so superficial that they just choose the most charismatic guy? My theory doesn't require that.",
      "translated": "对科学家来说，至少这意味着它值得关注，无论看起来多么不可信。你不能认为选民如此肤浅，只会选择最有魅力的人？我的理论并不需要这样的假设。"
    },
    {
      "original": "I'm not proposing that charisma is the only factor, just that it's the only one left after the efforts of the two parties cancel one another out.As for the theory being obvious, as far as I know, no one has proposed it before.",
      "translated": "我并不是说魅力是唯一的因素，只是说在两党努力相互抵消之后，它成了唯一的因素。至于这个理论显而易见，据我所知，之前还没有人提出过。"
    },
    {
      "original": "Election forecasters are proud when they can achieve the same results with much more complicated models.Finally, to the people who say that the theory is probably true, but rather depressing: it's not so bad as it seems.",
      "translated": "选举预测者为能够用更复杂的模型取得相同的结果而感到自豪。最后，对于那些认为这一理论可能是正确的，但相当令人沮丧的人：实际情况并没有看起来那么糟糕。"
    },
    {
      "original": "The phenomenon is like a pricing anomaly; once people realize it's there, it will disappear. Once both parties realize it's a waste of time to nominate uncharismatic candidates, they'll tend to nominate only the most charismatic ones.",
      "translated": "这一现象就像定价异常；一旦人们意识到它的存在，它就会消失。一旦双方意识到提名缺乏魅力的候选人是浪费时间，他们就会倾向于只提名最具魅力的候选人。"
    },
    {
      "original": "And if the candidates are equally charismatic, charisma will cancel out, and elections will be decided on issues, as political commentators like to think they are now.Notes[1] As Clinton himself discovered to his surprise when, in one of his first acts as president, he tried to shift the military leftward.",
      "translated": "如果候选人的魅力相当，那么魅力就会相互抵消，选举将根据问题来决定，正如政治评论员喜欢认为的那样。注[1] 克林顿本人在担任总统后的一次早期行动中试图将军事政策左倾化时，出乎意料地发现了这一点。"
    },
    {
      "original": "After a bruising fight he escaped with a face-saving compromise.[2] True, Gore won the popular vote. But politicians know the electoral vote decides the election, so that's what they campaign for. If Bush had been campaigning for the popular vote he would presumably have got more of it.",
      "translated": "经过一番激烈的争斗，他以一个保全面子的妥协方案脱身。[2] 确实，戈尔赢得了普选票。但是，政治家们都知道选举人票才是决定选举结果的关键，因此他们都是为此而竞选的。如果布什是为了赢得普选票而竞选，他可能会得到更多的票数。"
    },
    {
      "original": "(Thanks to judgmentalist for this point.)[3] Source: Nielsen Media Research. Of the remaining 13%, 11 didn't have TV because they couldn't afford it. I'd argue that the missing 11% were probably also the 11% most susceptible to charisma.[4] One implication of this theory is that parties shouldn't be too quick to reject candidates with skeletons in their closets.",
      "translated": "（感谢judgmentalist提出的这一点。）[3] 资料来源：尼尔森媒体研究。在剩下的13%中，有11%的人因为负担不起而没有电视。我认为，这缺失的11%很可能也是最容易受到魅力影响的11%。[4] 这一理论的一个含义是，政党不应过快地拒绝那些有“污点”的候选人。"
    },
    {
      "original": "Charismatic candidates will tend to have more skeletons than squeaky clean dullards, but in practice that doesn't seem to lose elections. The current Bush, for example, probably did more drugs in his twenties than any preceding president, and yet managed to get elected with a base of evangelical Christians.",
      "translated": "有魅力的候选人往往会比那些毫无瑕疵的乏味之人有更多的丑闻，但在实际中这似乎并不会输掉选举。例如，现任的布什在二十多岁时可能比任何前任总统都吸食了更多的毒品，但最终还是在福音派基督徒的支持下当选。"
    },
    {
      "original": "All you have to do is say you've reformed, and stonewall about the details.Thanks to Trevor Blackwell, Maria Daniels, Jessica Livingston, Jackie McDonough, and Robert Morris for reading drafts of this, and to Eric Raymond for pointing out that I was wrong about 1968.",
      "translated": "你只需要说自己已经改过自新，而对于细节则闭口不谈。感谢特雷弗·布莱克威尔、玛丽亚·丹尼尔斯、杰西卡·利文斯顿、杰基·麦当劳和罗伯特·莫里斯审阅本文草稿，同时也感谢埃里克·雷蒙德指出我对1968年的看法是错误的。"
    },
    {
      "original": "Comment on this essay.What Charisma IsPolitics and the Art of ActingJapanese Translation",
      "translated": "评论这篇文章。魅力是什么？政治与表演艺术日本译文"
    }
  ],
  "translation_completed": "2025-07-28T11:29:50.093278",
  "translation_stats": {
    "total_paragraphs": 31,
    "success_count": 31,
    "success_rate": "100.0%"
  }
}