{
  "title": "Cities and Ambition",
  "title_zh": "[待翻译] Cities and Ambition",
  "url": "https://www.paulgraham.com/cities.html",
  "filename": "cities.html",
  "date": "2008-05-01",
  "id": 167,
  "content": {
    "success": true,
    "paragraphs": [
      "May 2008 Great cities attract ambitious people. You can sense it when you walk around one. In a hundred subtle ways, the city sends you a message: you could do more; you should try harder.The surprising thing is how different these messages can be.",
      "New York tells you, above all: you should make more money. There are other messages too, of course. You should be hipper. You should be better looking. But the clearest message is that you should be richer.What I like about Boston (or rather Cambridge) is that the message there is: you should be smarter.",
      "You really should get around to reading all those books you've been meaning to.When you ask what message a city sends, you sometimes get surprising answers. As much as they respect brains in Silicon Valley, the message the Valley sends is: you should be more powerful.That's not quite the same message New York sends.",
      "Power matters in New York too of course, but New York is pretty impressed by a billion dollars even if you merely inherited it. In Silicon Valley no one would care except a few real estate agents. What matters in Silicon Valley is how much effect you have on the world.",
      "The reason people there care about Larry and Sergey is not their wealth but the fact that they control Google, which affects practically everyone._____How much does it matter what message a city sends?",
      "Empirically, the answer seems to be: a lot. You might think that if you had enough strength of mind to do great things, you'd be able to transcend your environment. Where you live should make at most a couple percent difference.",
      "But if you look at the historical evidence, it seems to matter more than that. Most people who did great things were clumped together in a few places where that sort of thing was done at the time.You can see how powerful cities are from something I wrote about earlier: the case of the Milanese Leonardo.",
      "Practically every fifteenth century Italian painter you've heard of was from Florence, even though Milan was just as big. People in Florence weren't genetically different, so you have to assume there was someone born in Milan with as much natural ability as Leonardo.",
      "What happened to him?If even someone with the same natural ability as Leonardo couldn't beat the force of environment, do you suppose you can?I don't. I'm fairly stubborn, but I wouldn't try to fight this force.",
      "I'd rather use it. So I've thought a lot about where to live.I'd always imagined Berkeley would be the ideal place — that it would basically be Cambridge with good weather. But when I finally tried living there a couple years ago, it turned out not to be.",
      "The message Berkeley sends is: you should live better. Life in Berkeley is very civilized. It's probably the place in America where someone from Northern Europe would feel most at home. But it's not humming with ambition.In retrospect it shouldn't have been surprising that a place so pleasant would attract people interested above all in quality of life.",
      "Cambridge with good weather, it turns out, is not Cambridge. The people you find in Cambridge are not there by accident. You have to make sacrifices to live there. It's expensive and somewhat grubby, and the weather's often bad.",
      "So the kind of people you find in Cambridge are the kind of people who want to live where the smartest people are, even if that means living in an expensive, grubby place with bad weather.As of this writing, Cambridge seems to be the intellectual capital of the world.",
      "I realize that seems a preposterous claim. What makes it true is that it's more preposterous to claim about anywhere else. American universities currently seem to be the best, judging from the flow of ambitious students.",
      "And what US city has a stronger claim? New York? A fair number of smart people, but diluted by a much larger number of neanderthals in suits. The Bay Area has a lot of smart people too, but again, diluted; there are two great universities, but they're far apart.",
      "Harvard and MIT are practically adjacent by West Coast standards, and they're surrounded by about 20 other colleges and universities. [1]Cambridge as a result feels like a town whose main industry is ideas, while New York's is finance and Silicon Valley's is startups._____When you talk about cities in the sense we are, what you're really talking about is collections of people.",
      "For a long time cities were the only large collections of people, so you could use the two ideas interchangeably. But we can see how much things are changing from the examples I've mentioned. New York is a classic great city.",
      "But Cambridge is just part of a city, and Silicon Valley is not even that. (San Jose is not, as it sometimes claims, the capital of Silicon Valley. It's just 178 square miles at one end of it.)Maybe the Internet will change things further.",
      "Maybe one day the most important community you belong to will be a virtual one, and it won't matter where you live physically. But I wouldn't bet on it. The physical world is very high bandwidth, and some of the ways cities send you messages are quite subtle.One of the exhilarating things about coming back to Cambridge every spring is walking through the streets at dusk, when you can see into the houses.",
      "When you walk through Palo Alto in the evening, you see nothing but the blue glow of TVs. In Cambridge you see shelves full of promising-looking books. Palo Alto was probably much like Cambridge in 1960, but you'd never guess now that there was a university nearby.",
      "Now it's just one of the richer neighborhoods in Silicon Valley. [2]A city speaks to you mostly by accident — in things you see through windows, in conversations you overhear. It's not something you have to seek out, but something you can't turn off.",
      "One of the occupational hazards of living in Cambridge is overhearing the conversations of people who use interrogative intonation in declarative sentences. But on average I'll take Cambridge conversations over New York or Silicon Valley ones.A friend who moved to Silicon Valley in the late 90s said the worst thing about living there was the low quality of the eavesdropping.",
      "At the time I thought she was being deliberately eccentric. Sure, it can be interesting to eavesdrop on people, but is good quality eavesdropping so important that it would affect where you chose to live?",
      "Now I understand what she meant. The conversations you overhear tell you what sort of people you're among._____No matter how determined you are, it's hard not to be influenced by the people around you.",
      "It's not so much that you do whatever a city expects of you, but that you get discouraged when no one around you cares about the same things you do.There's an imbalance between encouragement and discouragement like that between gaining and losing money.",
      "Most people overvalue negative amounts of money: they'll work much harder to avoid losing a dollar than to gain one. Similarly, although there are plenty of people strong enough to resist doing something just because that's what one is supposed to do where they happen to be, there are few strong enough to keep working on something no one around them cares about.Because ambitions are to some extent incompatible and admiration is a zero-sum game, each city tends to focus on one type of ambition.",
      "The reason Cambridge is the intellectual capital is not just that there's a concentration of smart people there, but that there's nothing else people there care about more. Professors in New York and the Bay area are second class citizens — till they start hedge funds or startups respectively.This suggests an answer to a question people in New York have wondered about since the Bubble: whether New York could grow into a startup hub to rival Silicon Valley.",
      "One reason that's unlikely is that someone starting a startup in New York would feel like a second class citizen. [3] There's already something else people in New York admire more.In the long term, that could be a bad thing for New York.",
      "The power of an important new technology does eventually convert to money. So by caring more about money and less about power than Silicon Valley, New York is recognizing the same thing, but slower. [4] And in fact it has been losing to Silicon Valley at its own game: the ratio of New York to California residents in the Forbes 400 has decreased from 1.45 (81:56) when the list was first published in 1982 to .83 (73:88) in 2007._____Not all cities send a message.",
      "Only those that are centers for some type of ambition do. And it can be hard to tell exactly what message a city sends without living there. I understand the messages of New York, Cambridge, and Silicon Valley because I've lived for several years in each of them.",
      "DC and LA seem to send messages too, but I haven't spent long enough in either to say for sure what they are.The big thing in LA seems to be fame. There's an A List of people who are most in demand right now, and what's most admired is to be on it, or friends with those who are.",
      "Beneath that, the message is much like New York's, though perhaps with more emphasis on physical attractiveness.In DC the message seems to be that the most important thing is who you know. You want to be an insider.",
      "In practice this seems to work much as in LA. There's an A List and you want to be on it or close to those who are. The only difference is how the A List is selected. And even that is not that different.At the moment, San Francisco's message seems to be the same as Berkeley's: you should live better.",
      "But this will change if enough startups choose SF over the Valley. During the Bubble that was a predictor of failure — a self-indulgent choice, like buying expensive office furniture. Even now I'm suspicious when startups choose SF.",
      "But if enough good ones do, it stops being a self-indulgent choice, because the center of gravity of Silicon Valley will shift there.I haven't found anything like Cambridge for intellectual ambition.",
      "Oxford and Cambridge (England) feel like Ithaca or Hanover: the message is there, but not as strong.Paris was once a great intellectual center. If you went there in 1300, it might have sent the message Cambridge does now.",
      "But I tried living there for a bit last year, and the ambitions of the inhabitants are not intellectual ones. The message Paris sends now is: do things with style. I liked that, actually. Paris is the only city I've lived in where people genuinely cared about art.",
      "In America only a few rich people buy original art, and even the more sophisticated ones rarely get past judging it by the brand name of the artist. But looking through windows at dusk in Paris you can see that people there actually care what paintings look like.",
      "Visually, Paris has the best eavesdropping I know. [5]There's one more message I've heard from cities: in London you can still (barely) hear the message that one should be more aristocratic. If you listen for it you can also hear it in Paris, New York, and Boston.",
      "But this message is everywhere very faint. It would have been strong 100 years ago, but now I probably wouldn't have picked it up at all if I hadn't deliberately tuned in to that wavelength to see if there was any signal left._____So far the complete list of messages I've picked up from cities is: wealth, style, hipness, physical attractiveness, fame, political power, economic power, intelligence, social class, and quality of life.My immediate reaction to this list is that it makes me slightly queasy.",
      "I'd always considered ambition a good thing, but I realize now that was because I'd always implicitly understood it to mean ambition in the areas I cared about. When you list everything ambitious people are ambitious about, it's not so pretty.On closer examination I see a couple things on the list that are surprising in the light of history.",
      "For example, physical attractiveness wouldn't have been there 100 years ago (though it might have been 2400 years ago). It has always mattered for women, but in the late twentieth century it seems to have started to matter for men as well.",
      "I'm not sure why — probably some combination of the increasing power of women, the increasing influence of actors as models, and the fact that so many people work in offices now: you can't show off by wearing clothes too fancy to wear in a factory, so you have to show off with your body instead.Hipness is another thing you wouldn't have seen on the list 100 years ago.",
      "Or wouldn't you? What it means is to know what's what. So maybe it has simply replaced the component of social class that consisted of being \"au fait.\" That could explain why hipness seems particularly admired in London: it's version 2 of the traditional English delight in obscure codes that only insiders understand.Economic power would have been on the list 100 years ago, but what we mean by it is changing.",
      "It used to mean the control of vast human and material resources. But increasingly it means the ability to direct the course of technology, and some of the people in a position to do that are not even rich — leaders of important open source projects, for example.",
      "The Captains of Industry of times past had laboratories full of clever people cooking up new technologies for them. The new breed are themselves those people.As this force gets more attention, another is dropping off the list: social class.",
      "I think the two changes are related. Economic power, wealth, and social class are just names for the same thing at different stages in its life: economic power converts to wealth, and wealth to social class.",
      "So the focus of admiration is simply shifting upstream._____Does anyone who wants to do great work have to live in a great city? No; all great cities inspire some sort of ambition, but they aren't the only places that do.",
      "For some kinds of work, all you need is a handful of talented colleagues.What cities provide is an audience, and a funnel for peers. These aren't so critical in something like math or physics, where no audience matters except your peers, and judging ability is sufficiently straightforward that hiring and admissions committees can do it reliably.",
      "In a field like math or physics all you need is a department with the right colleagues in it. It could be anywhere — in Los Alamos, New Mexico, for example.It's in fields like the arts or writing or technology that the larger environment matters.",
      "In these the best practitioners aren't conveniently collected in a few top university departments and research labs — partly because talent is harder to judge, and partly because people pay for these things, so one doesn't need to rely on teaching or research funding to support oneself.",
      "It's in these more chaotic fields that it helps most to be in a great city: you need the encouragement of feeling that people around you care about the kind of work you do, and since you have to find peers for yourself, you need the much larger intake mechanism of a great city.You don't have to live in a great city your whole life to benefit from it.",
      "The critical years seem to be the early and middle ones of your career. Clearly you don't have to grow up in a great city. Nor does it seem to matter if you go to college in one. To most college students a world of a few thousand people seems big enough.",
      "Plus in college you don't yet have to face the hardest kind of work — discovering new problems to solve.It's when you move on to the next and much harder step that it helps most to be in a place where you can find peers and encouragement.",
      "You seem to be able to leave, if you want, once you've found both. The Impressionists show the typical pattern: they were born all over France (Pissarro was born in the Carribbean) and died all over France, but what defined them were the years they spent together in Paris._____Unless you're sure what you want to do and where the leading center for it is, your best bet is probably to try living in several places when you're young.",
      "You can never tell what message a city sends till you live there, or even whether it still sends one. Often your information will be wrong: I tried living in Florence when I was 25, thinking it would be an art center, but it turned out I was 450 years too late.Even when a city is still a live center of ambition, you won't know for sure whether its message will resonate with you till you hear it.",
      "When I moved to New York, I was very excited at first. It's an exciting place. So it took me quite a while to realize I just wasn't like the people there. I kept searching for the Cambridge of New York.",
      "It turned out it was way, way uptown: an hour uptown by air.Some people know at 16 what sort of work they're going to do, but in most ambitious kids, ambition seems to precede anything specific to be ambitious about.",
      "They know they want to do something great. They just haven't decided yet whether they're going to be a rock star or a brain surgeon. There's nothing wrong with that. But it means if you have this most common type of ambition, you'll probably have to figure out where to live by trial and error.",
      "You'll probably have to find the city where you feel at home to know what sort of ambition you have.Notes[1] This is one of the advantages of not having the universities in your country controlled by the government.",
      "When governments decide how to allocate resources, political deal-making causes things to be spread out geographically. No central goverment would put its two best universities in the same town, unless it was the capital (which would cause other problems).",
      "But scholars seem to like to cluster together as much as people in any other field, and when given the freedom to they derive the same advantages from it.[2] There are still a few old professors in Palo Alto, but one by one they die and their houses are transformed by developers into McMansions and sold to VPs of Bus Dev.[3] How many times have you read about startup founders who continued to live inexpensively as their companies took off?",
      "Who continued to dress in jeans and t-shirts, to drive the old car they had in grad school, and so on? If you did that in New York, people would treat you like shit. If you walk into a fancy restaurant in San Francisco wearing a jeans and a t-shirt, they're nice to you; who knows who you might be?",
      "Not in New York.One sign of a city's potential as a technology center is the number of restaurants that still require jackets for men. According to Zagat's there are none in San Francisco, LA, Boston, or Seattle, 4 in DC, 6 in Chicago, 8 in London, 13 in New York, and 20 in Paris.(Zagat's lists the Ritz Carlton Dining Room in SF as requiring jackets but I couldn't believe it, so I called to check and in fact they don't.",
      "Apparently there's only one restaurant left on the entire West Coast that still requires jackets: The French Laundry in Napa Valley.)[4] Ideas are one step upstream from economic power, so it's conceivable that intellectual centers like Cambridge will one day have an edge over Silicon Valley like the one the Valley has over New York.This seems unlikely at the moment; if anything Boston is falling further and further behind.",
      "The only reason I even mention the possibility is that the path from ideas to startups has recently been getting smoother. It's a lot easier now for a couple of hackers with no business experience to start a startup than it was 10 years ago.",
      "If you extrapolate another 20 years, maybe the balance of power will start to shift back. I wouldn't bet on it, but I wouldn't bet against it either.[5] If Paris is where people care most about art, why is New York the center of gravity of the art business?",
      "Because in the twentieth century, art as brand split apart from art as stuff. New York is where the richest buyers are, but all they demand from art is brand, and since you can base brand on anything with a sufficiently identifiable style, you may as well use the local stuff.Thanks to Trevor Blackwell, Sarah Harlin, Jessica Livingston, Jackie McDonough, Robert Morris, and David Sloo for reading drafts of this.Italian TranslationPortuguese TranslationChinese TranslationKorean Translation"
    ],
    "word_count": 3548,
    "paragraph_count": 68
  },
  "processed_at": "2025-07-26T19:06:48.523230",
  "paragraphs": [
    {
      "original": "May 2008 Great cities attract ambitious people. You can sense it when you walk around one. In a hundred subtle ways, the city sends you a message: you could do more; you should try harder.The surprising thing is how different these messages can be.",
      "translated": "2008年5月，伟大的城市吸引着有抱负的人。当你在这样的城市中漫步时，可以感受到这一点。以一百种微妙的方式，城市向你传递着一个信息：你可以做得更多；你应该更加努力。令人惊讶的是，这些信息之间的差异竟然如此之大。"
    },
    {
      "original": "New York tells you, above all: you should make more money. There are other messages too, of course. You should be hipper. You should be better looking. But the clearest message is that you should be richer.What I like about Boston (or rather Cambridge) is that the message there is: you should be smarter.",
      "translated": "纽约最想告诉你的是：你应该赚更多的钱。当然，还有其他的信息。你应该更酷。你应该更好看。但最明确的信息是：你应该更富有。我喜欢波士顿（或者说剑桥）的地方在于，那里的信息是：你应该更聪明。"
    },
    {
      "original": "You really should get around to reading all those books you've been meaning to.When you ask what message a city sends, you sometimes get surprising answers. As much as they respect brains in Silicon Valley, the message the Valley sends is: you should be more powerful.That's not quite the same message New York sends.",
      "translated": "你真的应该抽时间读读那些你一直打算读的书。当你问一个城市传达了什么信息时，有时会得到令人意外的答案。尽管硅谷非常尊重智力，但硅谷传达的信息是：你应该更有权力。这与纽约传达的信息并不完全相同。"
    },
    {
      "original": "Power matters in New York too of course, but New York is pretty impressed by a billion dollars even if you merely inherited it. In Silicon Valley no one would care except a few real estate agents. What matters in Silicon Valley is how much effect you have on the world.",
      "translated": "当然，权力在纽约也很重要，但纽约对于十亿美元的财富印象非常深刻，即使这笔财富只是继承来的。在硅谷，除了少数房地产经纪人之外，没有人会在意。在硅谷，真正重要的是你对世界产生了多大的影响。"
    },
    {
      "original": "The reason people there care about Larry and Sergey is not their wealth but the fact that they control Google, which affects practically everyone._____How much does it matter what message a city sends?",
      "translated": "人们之所以关心拉里和谢尔盖，并不是因为他们的财富，而是因为他们掌控着谷歌，而谷歌几乎影响到每一个人。_____一个城市传递的信息有多重要？"
    },
    {
      "original": "Empirically, the answer seems to be: a lot. You might think that if you had enough strength of mind to do great things, you'd be able to transcend your environment. Where you live should make at most a couple percent difference.",
      "translated": "实际上，答案似乎是：影响很大。你可能会认为，如果你有足够的意志力去做伟大的事情，就能够超越你的环境。你住在哪儿最多也只能产生百分之几的影响。"
    },
    {
      "original": "But if you look at the historical evidence, it seems to matter more than that. Most people who did great things were clumped together in a few places where that sort of thing was done at the time.You can see how powerful cities are from something I wrote about earlier: the case of the Milanese Leonardo.",
      "translated": "但如果你查阅历史证据，你会发现这比想象中更为重要。大多数成就伟业的人都是集中在当时进行这类活动的几个地方。从我之前写过的米兰的莱昂纳多的例子中，你可以看出城市的力量。"
    },
    {
      "original": "Practically every fifteenth century Italian painter you've heard of was from Florence, even though Milan was just as big. People in Florence weren't genetically different, so you have to assume there was someone born in Milan with as much natural ability as Leonardo.",
      "translated": "实际上，你听说过的几乎每个15世纪的意大利画家都来自佛罗伦萨，尽管米兰的规模也相当。佛罗伦萨的人在基因上并没有什么不同，因此可以假设米兰也诞生了像达·芬奇一样天赋异禀的人。"
    },
    {
      "original": "What happened to him?If even someone with the same natural ability as Leonardo couldn't beat the force of environment, do you suppose you can?I don't. I'm fairly stubborn, but I wouldn't try to fight this force.",
      "translated": "他怎么了？如果像达芬奇这样天赋异禀的人都无法战胜环境的力量，你觉得你能行吗？我不这么认为。我相当固执，但我也不会去对抗这种力量。"
    },
    {
      "original": "I'd rather use it. So I've thought a lot about where to live.I'd always imagined Berkeley would be the ideal place — that it would basically be Cambridge with good weather. But when I finally tried living there a couple years ago, it turned out not to be.",
      "translated": "我更愿意使用它。所以我花了很多时间思考住在哪里。我一直想象伯克利会是理想之地——基本上就是天气好的剑桥。但几年前当我真正尝试在那里生活时，却发现并非如此。"
    },
    {
      "original": "The message Berkeley sends is: you should live better. Life in Berkeley is very civilized. It's probably the place in America where someone from Northern Europe would feel most at home. But it's not humming with ambition.In retrospect it shouldn't have been surprising that a place so pleasant would attract people interested above all in quality of life.",
      "translated": "伯克利传达的信息是：你应该生活得更好。伯克利的生活非常文明。这可能是美国最能让北欧人感到宾至如归的地方。但这里并不充满雄心壮志。回过头来看，一个如此宜人的地方会吸引那些最关注生活质量的人，这本不应令人感到意外。"
    },
    {
      "original": "Cambridge with good weather, it turns out, is not Cambridge. The people you find in Cambridge are not there by accident. You have to make sacrifices to live there. It's expensive and somewhat grubby, and the weather's often bad.",
      "translated": "剑桥在天气好的时候，其实就不再是那个剑桥了。在剑桥遇到的人并不是偶然出现在那里的。你必须做出牺牲才能住在那儿。那里物价昂贵，环境也有些脏乱，而且天气常常不好。"
    },
    {
      "original": "So the kind of people you find in Cambridge are the kind of people who want to live where the smartest people are, even if that means living in an expensive, grubby place with bad weather.As of this writing, Cambridge seems to be the intellectual capital of the world.",
      "translated": "所以，你在剑桥遇到的人都是那些希望生活在最聪明的人身边的人，即使这意味着要住在昂贵、脏乱且天气恶劣的地方。截至本文撰写时，剑桥似乎已成为世界的知识之都。"
    },
    {
      "original": "I realize that seems a preposterous claim. What makes it true is that it's more preposterous to claim about anywhere else. American universities currently seem to be the best, judging from the flow of ambitious students.",
      "translated": "我意识到这听起来像是一个荒谬的断言。但事实是，对于其他任何地方来说，这种断言更加荒谬。根据雄心勃勃的学生们的流向判断，目前美国的大学似乎是最好的。"
    },
    {
      "original": "And what US city has a stronger claim? New York? A fair number of smart people, but diluted by a much larger number of neanderthals in suits. The Bay Area has a lot of smart people too, but again, diluted; there are two great universities, but they're far apart.",
      "translated": "哪个美国城市有更强的理由？纽约？确实有不少聪明人，但被大量穿着西装的“原始人”稀释了。旧金山湾区也有很多聪明人，但同样被稀释了；有两所顶尖大学，但它们相距甚远。"
    },
    {
      "original": "Harvard and MIT are practically adjacent by West Coast standards, and they're surrounded by about 20 other colleges and universities. [1]Cambridge as a result feels like a town whose main industry is ideas, while New York's is finance and Silicon Valley's is startups._____When you talk about cities in the sense we are, what you're really talking about is collections of people.",
      "translated": "按照西海岸的标准，哈佛和麻省理工几乎是毗邻而居，周围还有大约20所其他学院和大学。[1]因此，剑桥感觉像一个以思想为主导产业的城镇，而纽约的主导产业是金融，硅谷的则是创业公司。_____当我们从这个意义上谈论城市时，实际上是在谈论人群的集合。"
    },
    {
      "original": "For a long time cities were the only large collections of people, so you could use the two ideas interchangeably. But we can see how much things are changing from the examples I've mentioned. New York is a classic great city.",
      "translated": "长期以来，城市是唯一的大规模人口聚集地，因此这两个概念可以互换使用。但从我提到的例子中，我们可以看到事情正在发生多大的变化。纽约是一个典型的大城市。"
    },
    {
      "original": "But Cambridge is just part of a city, and Silicon Valley is not even that. (San Jose is not, as it sometimes claims, the capital of Silicon Valley. It's just 178 square miles at one end of it.)Maybe the Internet will change things further.",
      "translated": "但剑桥只是城市的一部分，而硅谷甚至都不是。圣何塞并非如它有时所声称的那样是硅谷的首都。它只是硅谷一端的178平方英里。也许互联网将进一步改变这一切。"
    },
    {
      "original": "Maybe one day the most important community you belong to will be a virtual one, and it won't matter where you live physically. But I wouldn't bet on it. The physical world is very high bandwidth, and some of the ways cities send you messages are quite subtle.One of the exhilarating things about coming back to Cambridge every spring is walking through the streets at dusk, when you can see into the houses.",
      "translated": "也许有一天，你最重要的社群将会是一个虚拟的社群，而你物理上居住在哪里将不再重要。但我不会打这个赌。现实世界的信息传递是非常高效的，而城市向你传递信息的方式中有些是非常微妙的。每年春天回到剑桥时最令人兴奋的事情之一，就是在黄昏时分漫步街头，那时你可以看到屋子里的景象。"
    },
    {
      "original": "When you walk through Palo Alto in the evening, you see nothing but the blue glow of TVs. In Cambridge you see shelves full of promising-looking books. Palo Alto was probably much like Cambridge in 1960, but you'd never guess now that there was a university nearby.",
      "translated": "当你晚上漫步在帕洛阿尔托时，只能看到电视发出的蓝光。而在剑桥，你看到的是摆满诱人书籍的书架。帕洛阿尔托在1960年可能和现在的剑桥很相似，但现在你绝不会想到附近有一所大学。"
    },
    {
      "original": "Now it's just one of the richer neighborhoods in Silicon Valley. [2]A city speaks to you mostly by accident — in things you see through windows, in conversations you overhear. It's not something you have to seek out, but something you can't turn off.",
      "translated": "现在它只是硅谷一个较为富裕的社区。[2]城市大多是以偶然的方式与你交谈——透过窗户看到的景象，无意中听到的对话。这不是你需要刻意寻找的东西，但却是你无法关闭的。"
    },
    {
      "original": "One of the occupational hazards of living in Cambridge is overhearing the conversations of people who use interrogative intonation in declarative sentences. But on average I'll take Cambridge conversations over New York or Silicon Valley ones.A friend who moved to Silicon Valley in the late 90s said the worst thing about living there was the low quality of the eavesdropping.",
      "translated": "生活在剑桥的一个职业风险就是会无意中听到那些在陈述句中使用疑问语调的人的对话。但总的来说，我还是宁愿听剑桥的对话，而不是纽约或硅谷的。一位在90年代末搬到硅谷的朋友说，生活在那里的最糟糕的事情之一就是偷听到的对话质量很低。"
    },
    {
      "original": "At the time I thought she was being deliberately eccentric. Sure, it can be interesting to eavesdrop on people, but is good quality eavesdropping so important that it would affect where you chose to live?",
      "translated": "当时我认为她是在故意标新立异。当然，偷听别人说话可能会很有趣，但高质量的偷听真的那么重要，以至于会影响你选择住在哪里吗？"
    },
    {
      "original": "Now I understand what she meant. The conversations you overhear tell you what sort of people you're among._____No matter how determined you are, it's hard not to be influenced by the people around you.",
      "translated": "现在我明白她的意思了。你所听到的谈话能告诉你周围的人是怎样的人。_____无论你多么有决心，都很难不受周围人的影响。"
    },
    {
      "original": "It's not so much that you do whatever a city expects of you, but that you get discouraged when no one around you cares about the same things you do.There's an imbalance between encouragement and discouragement like that between gaining and losing money.",
      "translated": "问题不在于你是否做了城市对你的期待，而在于当你周围的人对你的兴趣漠不关心时，你会感到沮丧。这种鼓励与沮丧之间的不平衡，就像赚钱与亏钱之间的不平衡一样。"
    },
    {
      "original": "Most people overvalue negative amounts of money: they'll work much harder to avoid losing a dollar than to gain one. Similarly, although there are plenty of people strong enough to resist doing something just because that's what one is supposed to do where they happen to be, there are few strong enough to keep working on something no one around them cares about.Because ambitions are to some extent incompatible and admiration is a zero-sum game, each city tends to focus on one type of ambition.",
      "translated": "大多数人对负数金额的估值过高：他们为了防止损失一美元会比为了获得一美元更努力工作。同样地，虽然有很多人足够坚强，不会因为自己所处的地方应该做某事就去做，但很少有人坚强到能在周围人都不关心的事情上持续努力。因为野心在某种程度上是不相容的，而崇拜又是一场零和游戏，所以每个城市往往专注于一种类型的野心。"
    },
    {
      "original": "The reason Cambridge is the intellectual capital is not just that there's a concentration of smart people there, but that there's nothing else people there care about more. Professors in New York and the Bay area are second class citizens — till they start hedge funds or startups respectively.This suggests an answer to a question people in New York have wondered about since the Bubble: whether New York could grow into a startup hub to rival Silicon Valley.",
      "translated": "剑桥之所以成为知识之都，不仅仅是因为那里聚集了许多聪明的人，还因为那里的人们没有比这更关心的事情了。在纽约和旧金山湾区，教授们是二等公民——直到他们分别开始创办对冲基金或创业公司。这为一个自互联网泡沫以来就困扰纽约人的问题提供了一个答案：纽约是否能够成长为一个可以与硅谷匹敌的创业中心。"
    },
    {
      "original": "One reason that's unlikely is that someone starting a startup in New York would feel like a second class citizen. [3] There's already something else people in New York admire more.In the long term, that could be a bad thing for New York.",
      "translated": "一个原因是，在纽约创业的人会觉得自己像是二等公民。[3] 纽约人已经对其他事情更加钦佩。从长远来看，这对纽约可能是不利的。"
    },
    {
      "original": "The power of an important new technology does eventually convert to money. So by caring more about money and less about power than Silicon Valley, New York is recognizing the same thing, but slower. [4] And in fact it has been losing to Silicon Valley at its own game: the ratio of New York to California residents in the Forbes 400 has decreased from 1.45 (81:56) when the list was first published in 1982 to .83 (73:88) in 2007._____Not all cities send a message.",
      "translated": "重要新技术的力量最终会转化为金钱。因此，纽约比硅谷更看重金钱而不太重视权力，这其实是在以更慢的速度认识到同样的事情。[4] 事实上，纽约在自己擅长的领域也输给了硅谷：《福布斯》400富豪榜中纽约与加利福尼亚居民的比例，从1982年首次发布时的1.45（81:56）下降到了2007年的0.83（73:88）。_____并非所有城市都会传递某种信息。"
    },
    {
      "original": "Only those that are centers for some type of ambition do. And it can be hard to tell exactly what message a city sends without living there. I understand the messages of New York, Cambridge, and Silicon Valley because I've lived for several years in each of them.",
      "translated": "只有那些怀有某种雄心的地方才会如此。而如果不生活在那里，很难确切地理解一个城市传递的信息。因为我曾在纽约、剑桥和硅谷各自生活了数年，所以我理解这些地方传递的信息。"
    },
    {
      "original": "DC and LA seem to send messages too, but I haven't spent long enough in either to say for sure what they are.The big thing in LA seems to be fame. There's an A List of people who are most in demand right now, and what's most admired is to be on it, or friends with those who are.",
      "translated": "华盛顿和洛杉矶似乎也在传递信息，但我在这两个地方待的时间不够长，无法确定它们具体是什么。在洛杉矶，最看重的似乎是名气。有一份A级名单，列出了眼下最受欢迎的人物，而最令人羡慕的是能够上榜，或是与这些上榜者为友。"
    },
    {
      "original": "Beneath that, the message is much like New York's, though perhaps with more emphasis on physical attractiveness.In DC the message seems to be that the most important thing is who you know. You want to be an insider.",
      "translated": "下面的信息与纽约的相似，不过可能更加注重外在形象。在华盛顿特区，信息似乎是在强调最重要的是你认识谁。你希望成为一个圈内人。"
    },
    {
      "original": "In practice this seems to work much as in LA. There's an A List and you want to be on it or close to those who are. The only difference is how the A List is selected. And even that is not that different.At the moment, San Francisco's message seems to be the same as Berkeley's: you should live better.",
      "translated": "实际上，这似乎和在洛杉矶一样运作。有一个“A级名单”，你希望自己在名单上，或者靠近那些在名单上的人。唯一的不同在于“A级名单”是如何选定的。但即使这一点也没有太大的区别。目前，旧金山的信息似乎和伯克利的一样：你应该生活得更好。"
    },
    {
      "original": "But this will change if enough startups choose SF over the Valley. During the Bubble that was a predictor of failure — a self-indulgent choice, like buying expensive office furniture. Even now I'm suspicious when startups choose SF.",
      "translated": "但如果足够多的初创公司选择旧金山而非硅谷，这种情况就会改变。在泡沫时期，这是一个失败的预兆——一种自我放纵的选择，就像购买昂贵的办公家具一样。即使现在，当初创公司选择旧金山时，我仍然持怀疑态度。"
    },
    {
      "original": "But if enough good ones do, it stops being a self-indulgent choice, because the center of gravity of Silicon Valley will shift there.I haven't found anything like Cambridge for intellectual ambition.",
      "translated": "但如果足够多的优秀人才这样做，这将不再是一种自我放纵的选择，因为硅谷的重心将会转移到那里。我还没有找到像剑桥这样充满智力追求的地方。"
    },
    {
      "original": "Oxford and Cambridge (England) feel like Ithaca or Hanover: the message is there, but not as strong.Paris was once a great intellectual center. If you went there in 1300, it might have sent the message Cambridge does now.",
      "translated": "牛津和剑桥（英格兰）感觉像伊萨卡或汉诺威：信息在那里，但没有那么强烈。巴黎曾经是一个伟大的知识中心。如果你在1300年去那里，它可能像现在的剑桥一样传递信息。"
    },
    {
      "original": "But I tried living there for a bit last year, and the ambitions of the inhabitants are not intellectual ones. The message Paris sends now is: do things with style. I liked that, actually. Paris is the only city I've lived in where people genuinely cared about art.",
      "translated": "但我去年在那里住了一段时间，居民们的追求并不是知识分子式的。巴黎现在传递的信息是：做事要有风格。我其实挺喜欢这一点。巴黎是我住过的唯一一个真正关心艺术的城市。"
    },
    {
      "original": "In America only a few rich people buy original art, and even the more sophisticated ones rarely get past judging it by the brand name of the artist. But looking through windows at dusk in Paris you can see that people there actually care what paintings look like.",
      "translated": "在美国，只有少数富人购买原创艺术品，即使是最有鉴赏力的人也往往只根据艺术家的名气来评判作品。但如果你在巴黎黄昏时分透过窗户望去，就会发现那里的人们确实关心画作的本身模样。"
    },
    {
      "original": "Visually, Paris has the best eavesdropping I know. [5]There's one more message I've heard from cities: in London you can still (barely) hear the message that one should be more aristocratic. If you listen for it you can also hear it in Paris, New York, and Boston.",
      "translated": "视觉上，巴黎有着我所知道的最好的窃听效果。[5]从城市中我还听到了另一条信息：在伦敦，你仍然可以（勉强）听到那种要求人们更加贵族化的信息。如果你仔细聆听，你也可以在巴黎、纽约和波士顿听到这种声音。"
    },
    {
      "original": "But this message is everywhere very faint. It would have been strong 100 years ago, but now I probably wouldn't have picked it up at all if I hadn't deliberately tuned in to that wavelength to see if there was any signal left._____So far the complete list of messages I've picked up from cities is: wealth, style, hipness, physical attractiveness, fame, political power, economic power, intelligence, social class, and quality of life.My immediate reaction to this list is that it makes me slightly queasy.",
      "translated": "但这条信息在每一个地方都十分微弱。100年前它会很强，但现在如果我不是有意调到那个频率去查看是否还有任何信号的话，我可能根本不会注意到它。到目前为止，我从城市接收到的完整信息列表包括：财富、时尚、酷炫、外貌吸引力、名声、政治权力、经济实力、智力、社会阶层和生活质量。我对此列表的第一反应是它让我略感不适。"
    },
    {
      "original": "I'd always considered ambition a good thing, but I realize now that was because I'd always implicitly understood it to mean ambition in the areas I cared about. When you list everything ambitious people are ambitious about, it's not so pretty.On closer examination I see a couple things on the list that are surprising in the light of history.",
      "translated": "我一直认为雄心是一件好事，但现在我意识到那是因为我一直隐含地将其理解为在我关心的领域中的雄心。当你列出所有有雄心的人所追求的目标时，情况就不那么美好了。仔细审视后，我发现有几个目标在历史的光芒下显得令人惊讶。"
    },
    {
      "original": "For example, physical attractiveness wouldn't have been there 100 years ago (though it might have been 2400 years ago). It has always mattered for women, but in the late twentieth century it seems to have started to matter for men as well.",
      "translated": "例如，外貌吸引力在100年前可能并不存在（尽管2400年前可能存在）。它对女性始终很重要，但在20世纪后期，似乎也开始对男性变得重要起来。"
    },
    {
      "original": "I'm not sure why — probably some combination of the increasing power of women, the increasing influence of actors as models, and the fact that so many people work in offices now: you can't show off by wearing clothes too fancy to wear in a factory, so you have to show off with your body instead.Hipness is another thing you wouldn't have seen on the list 100 years ago.",
      "translated": "我不确定原因何在——可能是女性地位的提升、演员作为模特的影响力增强，以及现在有这么多人都在办公室工作：你无法通过穿着过于华丽的衣服来展示自己，因为这些衣服在工厂里穿不上，所以你只能通过自己的身体来展示。100年前，你肯定不会在这样的清单上看到“性感”这个词。"
    },
    {
      "original": "Or wouldn't you? What it means is to know what's what. So maybe it has simply replaced the component of social class that consisted of being \"au fait.\" That could explain why hipness seems particularly admired in London: it's version 2 of the traditional English delight in obscure codes that only insiders understand.Economic power would have been on the list 100 years ago, but what we mean by it is changing.",
      "translated": "或者不是吗？这意在表明了解事情的真相。因此，或许它只是取代了社会阶层中原本“熟悉内情”的那一部分。这或许能解释为什么在伦敦，酷炫似乎特别受到赞赏：这是传统英式欣赏那些只有内部人士才能理解的隐秘代码的2.0版本。100年前，经济实力还会列在其中，但我们现在所说的经济实力的含义正在发生变化。"
    },
    {
      "original": "It used to mean the control of vast human and material resources. But increasingly it means the ability to direct the course of technology, and some of the people in a position to do that are not even rich — leaders of important open source projects, for example.",
      "translated": "过去，它意味着对大量人力和物力资源的控制。但如今，它越来越多地意味着能够引导技术的发展方向，而一些能够做到这一点的人甚至并不富有——例如，重要开源项目的领导者。"
    },
    {
      "original": "The Captains of Industry of times past had laboratories full of clever people cooking up new technologies for them. The new breed are themselves those people.As this force gets more attention, another is dropping off the list: social class.",
      "translated": "过去时代的工业巨子们拥有充满聪明才智人士的实验室，为他们研发新技术。而新一代的工业领袖本身就是这些聪明才智的人。随着这股力量受到更多关注，另一个因素则在逐渐淡出清单：社会阶层。"
    },
    {
      "original": "I think the two changes are related. Economic power, wealth, and social class are just names for the same thing at different stages in its life: economic power converts to wealth, and wealth to social class.",
      "translated": "我认为这两个变化是相关的。经济实力、财富和社会阶层只不过是同一个事物在不同生命阶段的不同名称：经济实力转化为财富，而财富又转化为社会阶层。"
    },
    {
      "original": "So the focus of admiration is simply shifting upstream._____Does anyone who wants to do great work have to live in a great city? No; all great cities inspire some sort of ambition, but they aren't the only places that do.",
      "translated": "所以，赞赏的焦点只是向上游转移了。_____想要做出伟大工作的人必须生活在大城市吗？不；所有的大城市都会激发某种雄心，但它们并不是唯一能激发雄心的地方。"
    },
    {
      "original": "For some kinds of work, all you need is a handful of talented colleagues.What cities provide is an audience, and a funnel for peers. These aren't so critical in something like math or physics, where no audience matters except your peers, and judging ability is sufficiently straightforward that hiring and admissions committees can do it reliably.",
      "translated": "对于某些类型的工作，你只需要少数几位有才能的同事。城市提供的是一种观众，以及同侪的聚集地。在数学或物理学这样的领域，这些并不那么重要，因为除了同行之外，其他观众并不重要，而且评估能力足够直接，以至于招聘和录取委员会可以可靠地完成这项工作。"
    },
    {
      "original": "In a field like math or physics all you need is a department with the right colleagues in it. It could be anywhere — in Los Alamos, New Mexico, for example.It's in fields like the arts or writing or technology that the larger environment matters.",
      "translated": "在数学或物理学这样的领域，你只需要有一个拥有合适同事的部门。它可以在任何地方——比如新墨西哥州的洛斯阿拉莫斯。而对于艺术、写作或技术等领域，更大的环境则显得尤为重要。"
    },
    {
      "original": "In these the best practitioners aren't conveniently collected in a few top university departments and research labs — partly because talent is harder to judge, and partly because people pay for these things, so one doesn't need to rely on teaching or research funding to support oneself.",
      "translated": "在这些领域，最优秀的从业者并不方便地集中在少数几所顶尖大学的系里和研究实验室中——部分原因是人才更难以评判，部分原因是人们会为这些服务付费，因此不需要依赖教学或研究资金来维持生计。"
    },
    {
      "original": "It's in these more chaotic fields that it helps most to be in a great city: you need the encouragement of feeling that people around you care about the kind of work you do, and since you have to find peers for yourself, you need the much larger intake mechanism of a great city.You don't have to live in a great city your whole life to benefit from it.",
      "translated": "在这些更为混乱的领域，身处一个伟大的城市最为有益：你需要周围人的鼓励，让他们关心你所从事的工作，而由于你必须为自己找到同行，因此需要一个伟大城市所提供的更为庞大的吸纳机制。你不必一生都居住在伟大的城市中，也能从中受益。"
    },
    {
      "original": "The critical years seem to be the early and middle ones of your career. Clearly you don't have to grow up in a great city. Nor does it seem to matter if you go to college in one. To most college students a world of a few thousand people seems big enough.",
      "translated": "关键的年份似乎是职业生涯的早期和中期。显然，你不必在大城市长大。似乎也不在乎你是否在大城市上大学。对于大多数大学生来说，几千人的世界似乎已经足够大了。"
    },
    {
      "original": "Plus in college you don't yet have to face the hardest kind of work — discovering new problems to solve.It's when you move on to the next and much harder step that it helps most to be in a place where you can find peers and encouragement.",
      "translated": "另外，在大学里你还不必面对最艰难的工作——发现需要解决的新问题。当你进入下一个更艰难的阶段时，在一个能够找到同伴和鼓励的地方会最有帮助。"
    },
    {
      "original": "You seem to be able to leave, if you want, once you've found both. The Impressionists show the typical pattern: they were born all over France (Pissarro was born in the Carribbean) and died all over France, but what defined them were the years they spent together in Paris._____Unless you're sure what you want to do and where the leading center for it is, your best bet is probably to try living in several places when you're young.",
      "translated": "你似乎可以在找到两者之后，如果你想离开的话，随时都可以离开。印象派画家展现了一种典型的模式：他们出生在法国各地（皮萨罗出生在加勒比地区），也去世在法国各地，但定义他们的是在巴黎共同度过的那些年。_____除非你对自己想要做什么以及该领域的中心在哪里非常确定，否则你最好的选择可能是年轻时尝试在几个不同的地方生活。"
    },
    {
      "original": "You can never tell what message a city sends till you live there, or even whether it still sends one. Often your information will be wrong: I tried living in Florence when I was 25, thinking it would be an art center, but it turned out I was 450 years too late.Even when a city is still a live center of ambition, you won't know for sure whether its message will resonate with you till you hear it.",
      "translated": "你永远无法预知一座城市会给你传递什么样的信息，甚至无法确定它是否还在传递信息。通常你的信息会是错误的：我25岁时曾尝试在佛罗伦萨生活，以为那里会是一个艺术中心，结果却发现我晚了450年。即使一座城市仍然是充满雄心的中心，你也不能确定它的信息是否能与你产生共鸣，直到你真正听到它。"
    },
    {
      "original": "When I moved to New York, I was very excited at first. It's an exciting place. So it took me quite a while to realize I just wasn't like the people there. I kept searching for the Cambridge of New York.",
      "translated": "当我搬到纽约时，起初我非常兴奋。那是一个令人激动的地方。所以，我花了好一段时间才意识到，我并不像那里的人。我一直试图寻找纽约的剑桥。"
    },
    {
      "original": "It turned out it was way, way uptown: an hour uptown by air.Some people know at 16 what sort of work they're going to do, but in most ambitious kids, ambition seems to precede anything specific to be ambitious about.",
      "translated": "结果证明，那里远得多了：乘飞机都要一个小时。有些人16岁时就知道自己将来要做什么工作，但在大多数有雄心壮志的孩子身上，这种雄心似乎先于任何具体的目标。"
    },
    {
      "original": "They know they want to do something great. They just haven't decided yet whether they're going to be a rock star or a brain surgeon. There's nothing wrong with that. But it means if you have this most common type of ambition, you'll probably have to figure out where to live by trial and error.",
      "translated": "他们知道自己想要成就一番伟业。只是还没有决定是要成为摇滚明星还是脑外科医生。这没什么不对。但这也意味着，如果你有这种最常见的雄心壮志，你可能需要通过尝试和错误来确定自己该住在哪里。"
    },
    {
      "original": "You'll probably have to find the city where you feel at home to know what sort of ambition you have.Notes[1] This is one of the advantages of not having the universities in your country controlled by the government.",
      "translated": "你可能需要找到一个让你感觉宾至如归的城市，才能明白自己有着怎样的雄心。注[1] 这是你所在国家的大学不受政府控制的一个优势。"
    },
    {
      "original": "When governments decide how to allocate resources, political deal-making causes things to be spread out geographically. No central goverment would put its two best universities in the same town, unless it was the capital (which would cause other problems).",
      "translated": "当政府决定如何分配资源时，政治上的讨价还价会导致资源在地理上的分散。没有中央政府会将两所最好的大学都设在同一座城市，除非这座城市是首都（但这又会引发其他问题）。"
    },
    {
      "original": "But scholars seem to like to cluster together as much as people in any other field, and when given the freedom to they derive the same advantages from it.[2] There are still a few old professors in Palo Alto, but one by one they die and their houses are transformed by developers into McMansions and sold to VPs of Bus Dev.[3] How many times have you read about startup founders who continued to live inexpensively as their companies took off?",
      "translated": "但是学者们似乎和任何其他领域的人一样喜欢聚集在一起，当他们有这种自由时，也能从中获得同样的好处。帕洛阿尔托还有一些老教授，但一个接一个地去世了，他们的房子被开发商改造成大宅，卖给业务发展副总裁。你读过多少次关于初创公司创始人在公司起飞后仍然过着简朴生活的故事？"
    },
    {
      "original": "Who continued to dress in jeans and t-shirts, to drive the old car they had in grad school, and so on? If you did that in New York, people would treat you like shit. If you walk into a fancy restaurant in San Francisco wearing a jeans and a t-shirt, they're nice to you; who knows who you might be?",
      "translated": "谁继续穿着牛仔裤和T恤，开着研究生时期的老车，等等？如果你在纽约这么做，人们会对你很不友好。如果你穿着牛仔裤和T恤走进旧金山的一家高档餐厅，他们会对你很友好；谁知道你可能是谁呢？"
    },
    {
      "original": "Not in New York.One sign of a city's potential as a technology center is the number of restaurants that still require jackets for men. According to Zagat's there are none in San Francisco, LA, Boston, or Seattle, 4 in DC, 6 in Chicago, 8 in London, 13 in New York, and 20 in Paris.(Zagat's lists the Ritz Carlton Dining Room in SF as requiring jackets but I couldn't believe it, so I called to check and in fact they don't.",
      "translated": "不在纽约。一个城市作为技术中心的潜力的标志之一是仍然要求男性顾客穿夹克的餐厅数量。根据《扎加特调查》，旧金山、洛杉矶、波士顿或西雅图没有这样的餐厅，华盛顿特区有4家，芝加哥有6家，伦敦有8家，纽约有13家，巴黎有20家。（《扎加特调查》列出了旧金山的丽思卡尔顿餐厅需要穿夹克，但我无法相信，所以打电话确认，实际上他们没有这个要求。）"
    },
    {
      "original": "Apparently there's only one restaurant left on the entire West Coast that still requires jackets: The French Laundry in Napa Valley.)[4] Ideas are one step upstream from economic power, so it's conceivable that intellectual centers like Cambridge will one day have an edge over Silicon Valley like the one the Valley has over New York.This seems unlikely at the moment; if anything Boston is falling further and further behind.",
      "translated": "显然，整个西海岸现在只有一家餐厅仍然要求穿夹克：那便是纳帕谷的法国洗衣店。)[4] 想法比经济实力更上游一步，因此可以想象，像剑桥这样的知识中心有一天可能会像硅谷领先纽约那样领先于硅谷。这在目前看来似乎不太可能；事实上，波士顿似乎正越来越落后。"
    },
    {
      "original": "The only reason I even mention the possibility is that the path from ideas to startups has recently been getting smoother. It's a lot easier now for a couple of hackers with no business experience to start a startup than it was 10 years ago.",
      "translated": "我之所以提到这种可能性，仅仅是因为从想法到创业的路径最近变得越来越顺畅。现在，对于没有任何商业经验的两三个程序员来说，创业比10年前容易得多。"
    },
    {
      "original": "If you extrapolate another 20 years, maybe the balance of power will start to shift back. I wouldn't bet on it, but I wouldn't bet against it either.[5] If Paris is where people care most about art, why is New York the center of gravity of the art business?",
      "translated": "如果你再推算20年，也许权力的平衡会开始回转。我不会打赌这种情况会发生，但我也不会打赌它不会发生。[5] 如果巴黎是人们最关心艺术的地方，为什么纽约会成为艺术商业的重心？"
    },
    {
      "original": "Because in the twentieth century, art as brand split apart from art as stuff. New York is where the richest buyers are, but all they demand from art is brand, and since you can base brand on anything with a sufficiently identifiable style, you may as well use the local stuff.Thanks to Trevor Blackwell, Sarah Harlin, Jessica Livingston, Jackie McDonough, Robert Morris, and David Sloo for reading drafts of this.Italian TranslationPortuguese TranslationChinese TranslationKorean Translation",
      "translated": "因为在二十世纪，作为品牌的艺术与作为物品的艺术分道扬镳了。纽约是富豪买家聚集的地方，但他们对艺术的要求只是品牌，而你可以基于任何具有足够可识别风格的事物来建立品牌，因此不妨使用当地的东西。感谢 Trevor Blackwell、Sarah Harlin、Jessica Livingston、Jackie McDonough、Robert Morris 和 David Sloo 阅读本文的草稿。意大利语翻译葡萄牙语翻译中文翻译韩语翻译"
    }
  ],
  "translation_completed": "2025-07-28T11:32:24.801104",
  "translation_stats": {
    "total_paragraphs": 68,
    "success_count": 68,
    "success_rate": "100.0%"
  }
}