{
  "title": "News from the Front",
  "title_zh": "[待翻译] News from the Front",
  "url": "https://www.paulgraham.com/colleges.html",
  "filename": "colleges.html",
  "date": "2007-09-01",
  "id": 176,
  "content": {
    "success": true,
    "paragraphs": [
      "September 2007A few weeks ago I had a thought so heretical that it really surprised me. It may not matter all that much where you go to college.For me, as for a lot of middle class kids, getting into a good college was more or less the meaning of life when I was growing up.",
      "What was I? A student. To do that well meant to get good grades. Why did one have to get good grades? To get into a good college. And why did one want to do that? There seemed to be several reasons: you'd learn more, get better jobs, make more money.",
      "But it didn't matter exactly what the benefits would be. College was a bottleneck through which all your future prospects passed; everything would be better if you went to a better college.A few weeks ago I realized that somewhere along the line I had stopped believing that.What first set me thinking about this was the new trend of worrying obsessively about what kindergarten your kids go to.",
      "It seemed to me this couldn't possibly matter. Either it won't help your kid get into Harvard, or if it does, getting into Harvard won't mean much anymore. And then I thought: how much does it mean even now?It turns out I have a lot of data about that.",
      "My three partners and I run a seed stage investment firm called Y Combinator. We invest when the company is just a couple guys and an idea. The idea doesn't matter much; it will change anyway. Most of our decision is based on the founders.",
      "The average founder is three years out of college. Many have just graduated; a few are still in school. So we're in much the same position as a graduate program, or a company hiring people right out of college.",
      "Except our choices are immediately and visibly tested. There are two possible outcomes for a startup: success or failure—and usually you know within a year which it will be.The test applied to a startup is among the purest of real world tests.",
      "A startup succeeds or fails depending almost entirely on the efforts of the founders. Success is decided by the market: you only succeed if users like what you've built. And users don't care where you went to college.As well as having precisely measurable results, we have a lot of them.",
      "Instead of doing a small number of large deals like a traditional venture capital fund, we do a large number of small ones. We currently fund about 40 companies a year, selected from about 900 applications representing a total of about 2000 people.",
      "[1]Between the volume of people we judge and the rapid, unequivocal test that's applied to our choices, Y Combinator has been an unprecedented opportunity for learning how to pick winners. One of the most surprising things we've learned is how little it matters where people went to college.I thought I'd already been cured of caring about that.",
      "There's nothing like going to grad school at Harvard to cure you of any illusions you might have about the average Harvard undergrad. And yet Y Combinator showed us we were still overestimating people who'd been to elite colleges.",
      "We'd interview people from MIT or Harvard or Stanford and sometimes find ourselves thinking: they must be smarter than they seem. It took us a few iterations to learn to trust our senses.Practically everyone thinks that someone who went to MIT or Harvard or Stanford must be smart.",
      "Even people who hate you for it believe it.But when you think about what it means to have gone to an elite college, how could this be true? We're talking about a decision made by admissions officers—basically, HR people—based on a cursory examination of a huge pile of depressingly similar applications submitted by seventeen year olds.",
      "And what do they have to go on? An easily gamed standardized test; a short essay telling you what the kid thinks you want to hear; an interview with a random alum; a high school record that's largely an index of obedience.",
      "Who would rely on such a test?And yet a lot of companies do. A lot of companies are very much influenced by where applicants went to college. How could they be? I think I know the answer to that.There used to be a saying in the corporate world: \"No one ever got fired for buying IBM.\" You no longer hear this about IBM specifically, but the idea is very much alive; there is a whole category of \"enterprise\" software companies that exist to take advantage of it.",
      "People buying technology for large organizations don't care if they pay a fortune for mediocre software. It's not their money. They just want to buy from a supplier who seems safe—a company with an established name, confident salesmen, impressive offices, and software that conforms to all the current fashions.",
      "Not necessarily a company that will deliver so much as one that, if they do let you down, will still seem to have been a prudent choice. So companies have evolved to fill that niche.A recruiter at a big company is in much the same position as someone buying technology for one.",
      "If someone went to Stanford and is not obviously insane, they're probably a safe bet. And a safe bet is enough. No one ever measures recruiters by the later performance of people they turn down. [2]I'm not saying, of course, that elite colleges have evolved to prey upon the weaknesses of large organizations the way enterprise software companies have.",
      "But they work as if they had. In addition to the power of the brand name, graduates of elite colleges have two critical qualities that plug right into the way large organizations work. They're good at doing what they're asked, since that's what it takes to please the adults who judge you at seventeen.",
      "And having been to an elite college makes them more confident.Back in the days when people might spend their whole career at one big company, these qualities must have been very valuable. Graduates of elite colleges would have been capable, yet amenable to authority.",
      "And since individual performance is so hard to measure in large organizations, their own confidence would have been the starting point for their reputation.Things are very different in the new world of startups.",
      "We couldn't save someone from the market's judgement even if we wanted to. And being charming and confident counts for nothing with users. All users care about is whether you make something they like.",
      "If you don't, you're dead.Knowing that test is coming makes us work a lot harder to get the right answers than anyone would if they were merely hiring people. We can't afford to have any illusions about the predictors of success.",
      "And what we've found is that the variation between schools is so much smaller than the variation between individuals that it's negligible by comparison. We can learn more about someone in the first minute of talking to them than by knowing where they went to school.It seems obvious when you put it that way.",
      "Look at the individual, not where they went to college. But that's a weaker statement than the idea I began with, that it doesn't matter much where a given individual goes to college. Don't you learn things at the best schools that you wouldn't learn at lesser places?Apparently not.",
      "Obviously you can't prove this in the case of a single individual, but you can tell from aggregate evidence: you can't, without asking them, distinguish people who went to one school from those who went to another three times as far down the US News list.",
      "[3] Try it and see.How can this be? Because how much you learn in college depends a lot more on you than the college. A determined party animal can get through the best school without learning anything.",
      "And someone with a real thirst for knowledge will be able to find a few smart people to learn from at a school that isn't prestigious at all. The other students are the biggest advantage of going to an elite college; you learn more from them than the professors.",
      "But you should be able to reproduce this at most colleges if you make a conscious effort to find smart friends. At most colleges you can find at least a handful of other smart students, and most people have only a handful of close friends in college anyway.",
      "[4] The odds of finding smart professors are even better. The curve for faculty is a lot flatter than for students, especially in math and the hard sciences; you have to go pretty far down the list of colleges before you stop finding smart professors in the math department.So it's not surprising that we've found the relative prestige of different colleges useless in judging individuals.",
      "There's a lot of randomness in how colleges select people, and what they learn there depends much more on them than the college. Between these two sources of variation, the college someone went to doesn't mean a lot.",
      "It is to some degree a predictor of ability, but so weak that we regard it mainly as a source of error and try consciously to ignore it.I doubt what we've discovered is an anomaly specific to startups.",
      "Probably people have always overestimated the importance of where one goes to college. We're just finally able to measure it.The unfortunate thing is not just that people are judged by such a superficial test, but that so many judge themselves by it.",
      "A lot of people, probably the majority of people in America, have some amount of insecurity about where, or whether, they went to college. The tragedy of the situation is that by far the greatest liability of not having gone to the college you'd have liked is your own feeling that you're thereby lacking something.",
      "Colleges are a bit like exclusive clubs in this respect. There is only one real advantage to being a member of most exclusive clubs: you know you wouldn't be missing much if you weren't. When you're excluded, you can only imagine the advantages of being an insider.",
      "But invariably they're larger in your imagination than in real life.So it is with colleges. Colleges differ, but they're nothing like the stamp of destiny so many imagine them to be. People aren't what some admissions officer decides about them at seventeen.",
      "They're what they make themselves.Indeed, the great advantage of not caring where people went to college is not just that you can stop judging them (and yourself) by superficial measures, but that you can focus instead on what really matters.",
      "What matters is what you make of yourself. I think that's what we should tell kids. Their job isn't to get good grades so they can get into a good college, but to learn and do. And not just because that's more rewarding than worldly success.",
      "That will increasingly be the route to worldly success. Notes[1] Is what we measure worth measuring? I think so. You can get rich simply by being energetic and unscrupulous, but getting rich from a technology startup takes some amount of brains.",
      "It is just the kind of work the upper middle class values; it has about the same intellectual component as being a doctor.[2] Actually, someone did, once. Mitch Kapor's wife Freada was in charge of HR at Lotus in the early years.",
      "(As he is at pains to point out, they did not become romantically involved till afterward.) At one point they worried Lotus was losing its startup edge and turning into a big company. So as an experiment she sent their recruiters the resumes of the first 40 employees, with identifying details changed.",
      "These were the people who had made Lotus into the star it was. Not one got an interview.[3] The US News list? Surely no one trusts that. Even if the statistics they consider are useful, how do they decide on the relative weights?",
      "The reason the US News list is meaningful is precisely because they are so intellectually dishonest in that respect. There is no external source they can use to calibrate the weighting of the statistics they use; if there were, we could just use that instead.",
      "What they must do is adjust the weights till the top schools are the usual suspects in about the right order. So in effect what the US News list tells us is what the editors think the top schools are, which is probably not far from the conventional wisdom on the matter.",
      "The amusing thing is, because some schools work hard to game the system, the editors will have to keep tweaking their algorithm to get the rankings they want.[4] Possible doesn't mean easy, of course.",
      "A smart student at a party school will inevitably be something of an outcast, just as he or she would be in most high schools. Thanks to Trevor Blackwell, Sarah Harlin, Jessica Livingston, Jackie McDonough, Peter Norvig, and Robert Morris for reading drafts of this.French Translation"
    ],
    "word_count": 2187,
    "paragraph_count": 46
  },
  "processed_at": "2025-07-26T19:07:06.918269",
  "paragraphs": [
    {
      "original": "September 2007A few weeks ago I had a thought so heretical that it really surprised me. It may not matter all that much where you go to college.For me, as for a lot of middle class kids, getting into a good college was more or less the meaning of life when I was growing up.",
      "translated": "2007年9月，几周前我有一个非常异端的想法，这让我自己都感到惊讶。你上哪所大学可能并没有那么重要。对我来说，和许多中产阶级孩子一样，上大学时能进入一所好大学几乎是生活的全部意义。"
    },
    {
      "original": "What was I? A student. To do that well meant to get good grades. Why did one have to get good grades? To get into a good college. And why did one want to do that? There seemed to be several reasons: you'd learn more, get better jobs, make more money.",
      "translated": "我是什么？一个学生。要做好这一点就意味着要取得好成绩。为什么要取得好成绩？为了进入一所好大学。而为什么要这样做？似乎有几个原因：你会学到更多，找到更好的工作，赚更多的钱。"
    },
    {
      "original": "But it didn't matter exactly what the benefits would be. College was a bottleneck through which all your future prospects passed; everything would be better if you went to a better college.A few weeks ago I realized that somewhere along the line I had stopped believing that.What first set me thinking about this was the new trend of worrying obsessively about what kindergarten your kids go to.",
      "translated": "但具体有什么好处并不重要。大学是一个瓶颈，你未来的所有前景都要从中通过；如果你上了一所更好的大学，一切都会更好。几周前，我意识到不知从什么时候起，我不再相信这一点了。首先让我思考这个问题的是，现在有一种新趋势，就是对孩子们上哪所幼儿园过分担忧。"
    },
    {
      "original": "It seemed to me this couldn't possibly matter. Either it won't help your kid get into Harvard, or if it does, getting into Harvard won't mean much anymore. And then I thought: how much does it mean even now?It turns out I have a lot of data about that.",
      "translated": "这在我看来根本无关紧要。要么它帮不了你的孩子进入哈佛，要么即使能帮上忙，进入哈佛也不再意味着什么了。然后我想到：即使现在，这到底意味着什么呢？事实证明，我有很多这方面的数据。"
    },
    {
      "original": "My three partners and I run a seed stage investment firm called Y Combinator. We invest when the company is just a couple guys and an idea. The idea doesn't matter much; it will change anyway. Most of our decision is based on the founders.",
      "translated": "我的三位合伙人和我共同经营一家种子阶段的投资公司，名叫Y Combinator。我们在公司只有几位创始人和一个想法时进行投资。想法本身并不那么重要，它迟早会改变。我们决策的主要依据是创始人。"
    },
    {
      "original": "The average founder is three years out of college. Many have just graduated; a few are still in school. So we're in much the same position as a graduate program, or a company hiring people right out of college.",
      "translated": "平均来说，创始人大学毕业已有三年。许多人刚毕业，还有一些人仍在上学。因此，我们的处境与研究生项目或直接从大学毕业招聘人员的公司相似。"
    },
    {
      "original": "Except our choices are immediately and visibly tested. There are two possible outcomes for a startup: success or failure—and usually you know within a year which it will be.The test applied to a startup is among the purest of real world tests.",
      "translated": "除了我们的选择会立即且明显地接受考验。对于一家创业公司来说，只有两种可能的结果：成功或失败——而通常在一年内就能知道结果。创业公司所接受的测试是现实世界中最纯粹的测试之一。"
    },
    {
      "original": "A startup succeeds or fails depending almost entirely on the efforts of the founders. Success is decided by the market: you only succeed if users like what you've built. And users don't care where you went to college.As well as having precisely measurable results, we have a lot of them.",
      "translated": "一家初创公司的成败几乎完全取决于创始人的努力。成功是由市场决定的：只有当用户喜欢你所构建的产品时，你才能成功。用户并不在乎你上的是哪所大学。除了有可以精确衡量的结果外，我们还有很多这样的结果。"
    },
    {
      "original": "Instead of doing a small number of large deals like a traditional venture capital fund, we do a large number of small ones. We currently fund about 40 companies a year, selected from about 900 applications representing a total of about 2000 people.",
      "translated": "我们不像传统的风险投资基金那样做少量的大额投资，而是做大量的小额投资。目前，我们每年资助大约40家公司，这些公司是从大约900份申请中挑选出来的，这些申请代表了总共约2000人。"
    },
    {
      "original": "[1]Between the volume of people we judge and the rapid, unequivocal test that's applied to our choices, Y Combinator has been an unprecedented opportunity for learning how to pick winners. One of the most surprising things we've learned is how little it matters where people went to college.I thought I'd already been cured of caring about that.",
      "translated": "[1]在我们评估的人数和对我们选择进行的快速、明确的测试之间，Y Combinator 为我们提供了一个前所未有的学习如何挑选获胜者的机会。我们学到的最令人惊讶的一件事是，人们上过哪所大学其实并不那么重要。我以为自己已经不再关心这一点了。"
    },
    {
      "original": "There's nothing like going to grad school at Harvard to cure you of any illusions you might have about the average Harvard undergrad. And yet Y Combinator showed us we were still overestimating people who'd been to elite colleges.",
      "translated": "没有什么比在哈佛读研究生更能让你摆脱对哈佛本科生的任何幻想。然而，Y Combinator 仍然让我们意识到，我们对那些毕业于精英大学的人的评价仍然过高。"
    },
    {
      "original": "We'd interview people from MIT or Harvard or Stanford and sometimes find ourselves thinking: they must be smarter than they seem. It took us a few iterations to learn to trust our senses.Practically everyone thinks that someone who went to MIT or Harvard or Stanford must be smart.",
      "translated": "我们会面试来自麻省理工学院、哈佛大学或斯坦福大学的人，有时会发现自己在想：他们肯定比看起来更聪明。经过几次尝试，我们才学会相信自己的直觉。几乎每个人都会认为，毕业于麻省理工学院、哈佛大学或斯坦福大学的人一定很聪明。"
    },
    {
      "original": "Even people who hate you for it believe it.But when you think about what it means to have gone to an elite college, how could this be true? We're talking about a decision made by admissions officers—basically, HR people—based on a cursory examination of a huge pile of depressingly similar applications submitted by seventeen year olds.",
      "translated": "即使讨厌你的人也相信这一点。但当你考虑到上精英大学意味着什么时，这怎么可能是真的呢？我们谈论的是招生官——基本上是人力资源人员——基于对大量令人沮丧的相似的十七岁孩子提交的申请材料的粗略检查所做出的决定。"
    },
    {
      "original": "And what do they have to go on? An easily gamed standardized test; a short essay telling you what the kid thinks you want to hear; an interview with a random alum; a high school record that's largely an index of obedience.",
      "translated": "他们依据什么呢？一个容易被操纵的标准考试；一篇简短的文章告诉你孩子认为你想听到的内容；与一位随机校友的面试；一份高中记录，主要反映的是顺从程度。"
    },
    {
      "original": "Who would rely on such a test?And yet a lot of companies do. A lot of companies are very much influenced by where applicants went to college. How could they be? I think I know the answer to that.There used to be a saying in the corporate world: \"No one ever got fired for buying IBM.\" You no longer hear this about IBM specifically, but the idea is very much alive; there is a whole category of \"enterprise\" software companies that exist to take advantage of it.",
      "translated": "谁会依赖这样的测试？然而很多公司确实如此。很多公司在招聘时非常看重申请人的大学背景。他们怎么会这样？我认为我知道答案。过去商界有一句话：“没有人会因为选择IBM而被解雇。”现在你很少听到关于IBM的这种说法，但这种思想依然活跃；有一类“企业”软件公司就是利用这一点而存在的。"
    },
    {
      "original": "People buying technology for large organizations don't care if they pay a fortune for mediocre software. It's not their money. They just want to buy from a supplier who seems safe—a company with an established name, confident salesmen, impressive offices, and software that conforms to all the current fashions.",
      "translated": "为大型组织购买技术的人并不在乎他们是否为平庸的软件支付了巨额费用。那不是他们的钱。他们只想从一个看起来安全的供应商那里购买——一家有知名度的公司，自信的销售人员，令人印象深刻的办公室，以及符合所有当前潮流的软件。"
    },
    {
      "original": "Not necessarily a company that will deliver so much as one that, if they do let you down, will still seem to have been a prudent choice. So companies have evolved to fill that niche.A recruiter at a big company is in much the same position as someone buying technology for one.",
      "translated": "不一定是一家能够完全满足你需求的公司，而是一家即使让你失望，也会觉得选择它是明智的。因此，公司已经发展来填补这一空白。大公司的招聘人员与为公司购买技术的人处境相似。"
    },
    {
      "original": "If someone went to Stanford and is not obviously insane, they're probably a safe bet. And a safe bet is enough. No one ever measures recruiters by the later performance of people they turn down. [2]I'm not saying, of course, that elite colleges have evolved to prey upon the weaknesses of large organizations the way enterprise software companies have.",
      "translated": "如果某个人毕业于斯坦福大学，并且显然不是疯子，那么他大概率是个稳妥的选择。而一个稳妥的选择就足够了。从来没有人会根据那些被拒绝的候选人后来的表现来评价招聘人员。[2]当然，我不是说精英大学已经进化到像企业软件公司那样，专门利用大型组织的弱点。"
    },
    {
      "original": "But they work as if they had. In addition to the power of the brand name, graduates of elite colleges have two critical qualities that plug right into the way large organizations work. They're good at doing what they're asked, since that's what it takes to please the adults who judge you at seventeen.",
      "translated": "但他们表现得就像能做到一样。除了品牌的威力外，精英大学的毕业生还具备两种关键品质，这使他们能够很好地适应大型组织的运作方式。他们善于按照要求行事，因为这正是在十七岁时取悦那些评判你的人所需要的。"
    },
    {
      "original": "And having been to an elite college makes them more confident.Back in the days when people might spend their whole career at one big company, these qualities must have been very valuable. Graduates of elite colleges would have been capable, yet amenable to authority.",
      "translated": "上过精英大学使他们更加自信。在过去，人们可能会在一家大公司度过整个职业生涯的时候，这些品质必定非常有价值。精英大学的毕业生既有能力，又愿意服从权威。"
    },
    {
      "original": "And since individual performance is so hard to measure in large organizations, their own confidence would have been the starting point for their reputation.Things are very different in the new world of startups.",
      "translated": "而在大型组织中，个人绩效很难衡量，因此他们声誉的起点是他们自身的自信。在初创企业的全新世界里，情况则大不相同。"
    },
    {
      "original": "We couldn't save someone from the market's judgement even if we wanted to. And being charming and confident counts for nothing with users. All users care about is whether you make something they like.",
      "translated": "即使我们想，也无法从市场的评判中拯救某人。而魅力和自信在用户面前毫无意义。用户在乎的只是你是否做出了他们喜欢的东西。"
    },
    {
      "original": "If you don't, you're dead.Knowing that test is coming makes us work a lot harder to get the right answers than anyone would if they were merely hiring people. We can't afford to have any illusions about the predictors of success.",
      "translated": "如果你不这样做，你就完了。知道测试即将到来，这让我们为了找到正确的答案而更加努力地工作，比任何人都要努力，如果他们只是在招聘人员的话。我们不能对成功的预测因素有任何幻想。"
    },
    {
      "original": "And what we've found is that the variation between schools is so much smaller than the variation between individuals that it's negligible by comparison. We can learn more about someone in the first minute of talking to them than by knowing where they went to school.It seems obvious when you put it that way.",
      "translated": "我们发现，学校之间的差异与个人之间的差异相比是如此之小，以至于可以忽略不计。与某人交谈的第一分钟，我们能了解到的比知道他们上过哪所学校要多得多。这样说来，这似乎是很明显的。"
    },
    {
      "original": "Look at the individual, not where they went to college. But that's a weaker statement than the idea I began with, that it doesn't matter much where a given individual goes to college. Don't you learn things at the best schools that you wouldn't learn at lesser places?Apparently not.",
      "translated": "看待个人，而不是他们上的是哪所大学。但这一观点比我的初衷要弱，我的初衷是，一个人上哪所大学其实并不那么重要。难道在最好的学校里学习的东西，在较差的学校里就学不到吗？显然不是。"
    },
    {
      "original": "Obviously you can't prove this in the case of a single individual, but you can tell from aggregate evidence: you can't, without asking them, distinguish people who went to one school from those who went to another three times as far down the US News list.",
      "translated": "显然，你不能对单个个体进行证明，但你可以从总体证据中看出：在不询问他们的情况下，你无法区分那些上了一所大学的人和那些上了美国新闻排名低三倍的另一所大学的人。"
    },
    {
      "original": "[3] Try it and see.How can this be? Because how much you learn in college depends a lot more on you than the college. A determined party animal can get through the best school without learning anything.",
      "translated": "试一试就知道了。这怎么可能呢？因为你在大学里能学到多少，更多地取决于你自己，而不是大学本身。一个决心享受派对生活的人，即使在最好的学校里也能不学无术地混过去。"
    },
    {
      "original": "And someone with a real thirst for knowledge will be able to find a few smart people to learn from at a school that isn't prestigious at all. The other students are the biggest advantage of going to an elite college; you learn more from them than the professors.",
      "translated": "而一个真正渴望知识的人，即使在一所并不出名的学校，也能找到几位智者向他们学习。上精英大学最大的优势是其他学生；你从他们那里学到的东西比从教授那里学到的还要多。"
    },
    {
      "original": "But you should be able to reproduce this at most colleges if you make a conscious effort to find smart friends. At most colleges you can find at least a handful of other smart students, and most people have only a handful of close friends in college anyway.",
      "translated": "但只要你有意识地去结交聪明的朋友，大多数大学里你都能重现这种情况。在大多数大学里，你总能找到几个聪明的同学，而且大多数人上大学时也只有少数几个亲密朋友。"
    },
    {
      "original": "[4] The odds of finding smart professors are even better. The curve for faculty is a lot flatter than for students, especially in math and the hard sciences; you have to go pretty far down the list of colleges before you stop finding smart professors in the math department.So it's not surprising that we've found the relative prestige of different colleges useless in judging individuals.",
      "translated": "找到聪明教授的几率甚至更高。教授的分布曲线比学生平坦得多，尤其是在数学和理科领域；你必须在大学名单上往下排很久，才会找不到数学系的聪明教授。因此，我们发现不同大学的相对声望在评判个人时毫无用处。"
    },
    {
      "original": "There's a lot of randomness in how colleges select people, and what they learn there depends much more on them than the college. Between these two sources of variation, the college someone went to doesn't mean a lot.",
      "translated": "在大学挑选学生的过程中存在很多随机性，而学生们在那里学到的东西更多取决于他们自己，而非大学本身。由于这两种变异来源，一个人上过哪所大学并不意味着太多。"
    },
    {
      "original": "It is to some degree a predictor of ability, but so weak that we regard it mainly as a source of error and try consciously to ignore it.I doubt what we've discovered is an anomaly specific to startups.",
      "translated": "在某种程度上，它是一个能力的预测指标，但这种预测力如此之弱，以至于我们主要将其视为误差的来源，并有意识地试图忽略它。我怀疑我们所发现的并不是初创企业特有的异常现象。"
    },
    {
      "original": "Probably people have always overestimated the importance of where one goes to college. We're just finally able to measure it.The unfortunate thing is not just that people are judged by such a superficial test, but that so many judge themselves by it.",
      "translated": "人们可能一直高估了上哪所大学的重要性。我们现在终于能够衡量这一点。不幸的是，问题不仅在于人们被这样肤浅的标准评判，还在于有那么多人用这一标准来评判自己。"
    },
    {
      "original": "A lot of people, probably the majority of people in America, have some amount of insecurity about where, or whether, they went to college. The tragedy of the situation is that by far the greatest liability of not having gone to the college you'd have liked is your own feeling that you're thereby lacking something.",
      "translated": "很多人，可能在美国的大多数人，对自己是否上过大学或上过哪所大学有些不安全感。这种情况的悲剧在于，最大的遗憾是你觉得自己缺少了什么，而这恰恰是因为你没有上到自己心仪的大学。"
    },
    {
      "original": "Colleges are a bit like exclusive clubs in this respect. There is only one real advantage to being a member of most exclusive clubs: you know you wouldn't be missing much if you weren't. When you're excluded, you can only imagine the advantages of being an insider.",
      "translated": "在这方面，大学有点像专属俱乐部。成为大多数专属俱乐部成员只有一个真正的优势：你知道即使你不属于其中，也不会错过太多。当你被排除在外时，你只能想象成为内部人士的优势。"
    },
    {
      "original": "But invariably they're larger in your imagination than in real life.So it is with colleges. Colleges differ, but they're nothing like the stamp of destiny so many imagine them to be. People aren't what some admissions officer decides about them at seventeen.",
      "translated": "但在你的想象中，它们总是比现实中的要大。同样适用于大学。大学各有不同，但它们绝不像许多人想象的那样是命运的印记。人的价值并不由十七岁时某个招生官的决定来界定。"
    },
    {
      "original": "They're what they make themselves.Indeed, the great advantage of not caring where people went to college is not just that you can stop judging them (and yourself) by superficial measures, but that you can focus instead on what really matters.",
      "translated": "他们就是他们自己的造就。事实上，不在乎人们毕业于哪所大学的最大优点不仅在于你可以停止用表面的标准来评判他们（和你自己），还在于你可以专注于真正重要的事情。"
    },
    {
      "original": "What matters is what you make of yourself. I think that's what we should tell kids. Their job isn't to get good grades so they can get into a good college, but to learn and do. And not just because that's more rewarding than worldly success.",
      "translated": "重要的是你如何塑造自己。我认为这是我们应该告诉孩子们的。他们的任务不是为了进入好大学而取得好成绩，而是要学习和实践。这不仅仅是因为这样比世俗的成功更有意义。"
    },
    {
      "original": "That will increasingly be the route to worldly success. Notes[1] Is what we measure worth measuring? I think so. You can get rich simply by being energetic and unscrupulous, but getting rich from a technology startup takes some amount of brains.",
      "translated": "这将越来越成为通往世俗成功的道路。注[1] 我们所衡量的东西值得衡量吗？我认为值得。你可以通过精力充沛和不择手段而变得富有，但要从一家科技初创公司中致富，则需要一定的智力。"
    },
    {
      "original": "It is just the kind of work the upper middle class values; it has about the same intellectual component as being a doctor.[2] Actually, someone did, once. Mitch Kapor's wife Freada was in charge of HR at Lotus in the early years.",
      "translated": "这正是上中产阶级所看重的工作；它与医生职业有着大致相同的智力成分。[2] 实际上，确实有人这样做过。米奇·卡普尔的妻子弗雷达在莲花软件公司早期负责人力资源。"
    },
    {
      "original": "(As he is at pains to point out, they did not become romantically involved till afterward.) At one point they worried Lotus was losing its startup edge and turning into a big company. So as an experiment she sent their recruiters the resumes of the first 40 employees, with identifying details changed.",
      "translated": "（他特意指出，他们是在那之后才发展成浪漫关系的。）有一次，他们担心Lotus正在失去创业公司的优势，变得像大公司一样。因此，她作为实验，将最初的40名员工的简历发送给了招聘人员，但修改了识别信息。"
    },
    {
      "original": "These were the people who had made Lotus into the star it was. Not one got an interview.[3] The US News list? Surely no one trusts that. Even if the statistics they consider are useful, how do they decide on the relative weights?",
      "translated": "这些人曾把莲花公司打造成了一颗明星。然而，没有一个人得到了面试的机会。《美国新闻》的排名？谁会相信那个。即使他们考虑的统计数据有用，他们又是如何决定各项指标的相对权重的呢？"
    },
    {
      "original": "The reason the US News list is meaningful is precisely because they are so intellectually dishonest in that respect. There is no external source they can use to calibrate the weighting of the statistics they use; if there were, we could just use that instead.",
      "translated": "US News排行榜之所以有意义，恰恰是因为他们在这一点上极其不诚实。他们使用的统计数据的权重没有任何外部来源可以校准；如果有的话，我们就可以直接使用那个来源了。"
    },
    {
      "original": "What they must do is adjust the weights till the top schools are the usual suspects in about the right order. So in effect what the US News list tells us is what the editors think the top schools are, which is probably not far from the conventional wisdom on the matter.",
      "translated": "他们必须调整权重，直到顶尖学校的排名大致符合预期。因此，实际上《美国新闻与世界报道》的排名告诉我们的，是编辑们认为的顶尖学校，这大概与人们对此问题的普遍看法相差不远。"
    },
    {
      "original": "The amusing thing is, because some schools work hard to game the system, the editors will have to keep tweaking their algorithm to get the rankings they want.[4] Possible doesn't mean easy, of course.",
      "translated": "有趣的是，由于一些学校努力钻系统漏洞，编辑们不得不不断调整他们的算法以获得他们想要的排名。[4] 可能并不意味着容易，当然。"
    },
    {
      "original": "A smart student at a party school will inevitably be something of an outcast, just as he or she would be in most high schools. Thanks to Trevor Blackwell, Sarah Harlin, Jessica Livingston, Jackie McDonough, Peter Norvig, and Robert Morris for reading drafts of this.French Translation",
      "translated": "在一所派对学校里，一个聪明的学生不可避免地会显得有些格格不入，就像他在大多数高中一样。感谢特雷弗·布莱克威尔、莎拉·哈林、杰西卡·利文斯顿、杰基·麦克唐纳、彼得·诺维格和罗伯特·莫里斯阅读本文的初稿。"
    }
  ],
  "translation_completed": "2025-07-28T11:38:40.213270",
  "translation_stats": {
    "total_paragraphs": 46,
    "success_count": 46,
    "success_rate": "100.0%"
  }
}