{
  "title": "Copy What You Like",
  "title_zh": "[待翻译] Copy What You Like",
  "url": "https://www.paulgraham.com/copy.html",
  "filename": "copy.html",
  "date": "2006-07-01",
  "id": 189,
  "content": {
    "success": true,
    "paragraphs": [
      "July 2006 When I was in high school I spent a lot of time imitating bad writers. What we studied in English classes was mostly fiction, so I assumed that was the highest form of writing. Mistake number one.",
      "The stories that seemed to be most admired were ones in which people suffered in complicated ways. Anything funny or gripping was ipso facto suspect, unless it was old enough to be hard to understand, like Shakespeare or Chaucer.",
      "Mistake number two. The ideal medium seemed the short story, which I've since learned had quite a brief life, roughly coincident with the peak of magazine publishing. But since their size made them perfect for use in high school classes, we read a lot of them, which gave us the impression the short story was flourishing.",
      "Mistake number three. And because they were so short, nothing really had to happen; you could just show a randomly truncated slice of life, and that was considered advanced. Mistake number four. The result was that I wrote a lot of stories in which nothing happened except that someone was unhappy in a way that seemed deep.For most of college I was a philosophy major.",
      "I was very impressed by the papers published in philosophy journals. They were so beautifully typeset, and their tone was just captivating—alternately casual and buffer-overflowingly technical. A fellow would be walking along a street and suddenly modality qua modality would spring upon him.",
      "I didn't ever quite understand these papers, but I figured I'd get around to that later, when I had time to reread them more closely. In the meantime I tried my best to imitate them. This was, I can now see, a doomed undertaking, because they weren't really saying anything.",
      "No philosopher ever refuted another, for example, because no one said anything definite enough to refute. Needless to say, my imitations didn't say anything either.In grad school I was still wasting time imitating the wrong things.",
      "There was then a fashionable type of program called an expert system, at the core of which was something called an inference engine. I looked at what these things did and thought \"I could write that in a thousand lines of code.\" And yet eminent professors were writing books about them, and startups were selling them for a year's salary a copy.",
      "What an opportunity, I thought; these impressive things seem easy to me; I must be pretty sharp. Wrong. It was simply a fad. The books the professors wrote about expert systems are now ignored. They were not even on a path to anything interesting.",
      "And the customers paying so much for them were largely the same government agencies that paid thousands for screwdrivers and toilet seats.How do you avoid copying the wrong things? Copy only what you genuinely like.",
      "That would have saved me in all three cases. I didn't enjoy the short stories we had to read in English classes; I didn't learn anything from philosophy papers; I didn't use expert systems myself. I believed these things were good because they were admired.It can be hard to separate the things you like from the things you're impressed with.",
      "One trick is to ignore presentation. Whenever I see a painting impressively hung in a museum, I ask myself: how much would I pay for this if I found it at a garage sale, dirty and frameless, and with no idea who painted it?",
      "If you walk around a museum trying this experiment, you'll find you get some truly startling results. Don't ignore this data point just because it's an outlier.Another way to figure out what you like is to look at what you enjoy as guilty pleasures.",
      "Many things people like, especially if they're young and ambitious, they like largely for the feeling of virtue in liking them. 99% of people reading Ulysses are thinking \"I'm reading Ulysses\" as they do it.",
      "A guilty pleasure is at least a pure one. What do you read when you don't feel up to being virtuous? What kind of book do you read and feel sad that there's only half of it left, instead of being impressed that you're half way through?",
      "That's what you really like.Even when you find genuinely good things to copy, there's another pitfall to be avoided. Be careful to copy what makes them good, rather than their flaws. It's easy to be drawn into imitating flaws, because they're easier to see, and of course easier to copy too.",
      "For example, most painters in the eighteenth and nineteenth centuries used brownish colors. They were imitating the great painters of the Renaissance, whose paintings by that time were brown with dirt.",
      "Those paintings have since been cleaned, revealing brilliant colors; their imitators are of course still brown.It was painting, incidentally, that cured me of copying the wrong things. Halfway through grad school I decided I wanted to try being a painter, and the art world was so manifestly corrupt that it snapped the leash of credulity.",
      "These people made philosophy professors seem as scrupulous as mathematicians. It was so clearly a choice of doing good work xor being an insider that I was forced to see the distinction. It's there to some degree in almost every field, but I had till then managed to avoid facing it.That was one of the most valuable things I learned from painting: you have to figure out for yourself what's good.",
      "You can't trust authorities. They'll lie to you on this one. Comment on this essay.Chinese TranslationRomanian TranslationSpanish TranslationRussian Translation"
    ],
    "word_count": 926,
    "paragraph_count": 20
  },
  "processed_at": "2025-07-26T19:07:33.466261",
  "paragraphs": [
    {
      "original": "July 2006 When I was in high school I spent a lot of time imitating bad writers. What we studied in English classes was mostly fiction, so I assumed that was the highest form of writing. Mistake number one.",
      "translated": "2006年7月 当我还是高中生时，我花了很多时间模仿糟糕的作家。我们在英语课上学习的大多是小说，所以我以为那是写作的最高形式。这是我的第一个错误。"
    },
    {
      "original": "The stories that seemed to be most admired were ones in which people suffered in complicated ways. Anything funny or gripping was ipso facto suspect, unless it was old enough to be hard to understand, like Shakespeare or Chaucer.",
      "translated": "最受赞赏的故事似乎是那些描绘人们以复杂方式遭受苦难的。任何有趣或引人入胜的内容从本质上都是可疑的，除非它足够古老，难以理解，比如莎士比亚或乔叟的作品。"
    },
    {
      "original": "Mistake number two. The ideal medium seemed the short story, which I've since learned had quite a brief life, roughly coincident with the peak of magazine publishing. But since their size made them perfect for use in high school classes, we read a lot of them, which gave us the impression the short story was flourishing.",
      "translated": "第二个错误。短篇小说似乎是理想的媒介，后来我了解到，它实际上只有很短的兴盛期，大致与杂志出版的鼎盛时期重合。但由于它们的篇幅适合作为高中课堂的阅读材料，我们读了很多短篇小说，这让我们误以为短篇小说正在蓬勃发展。"
    },
    {
      "original": "Mistake number three. And because they were so short, nothing really had to happen; you could just show a randomly truncated slice of life, and that was considered advanced. Mistake number four. The result was that I wrote a lot of stories in which nothing happened except that someone was unhappy in a way that seemed deep.For most of college I was a philosophy major.",
      "translated": "第三个错误。因为它们很短，所以实际上不需要发生什么；你只需展示一段随意截取的生活片段，这被认为是很前卫的。第四个错误。结果是我写了很多故事，里面除了有人以一种看似深刻的方式感到不快乐之外，什么也没有发生。大学的大部分时间里，我都是哲学专业的。"
    },
    {
      "original": "I was very impressed by the papers published in philosophy journals. They were so beautifully typeset, and their tone was just captivating—alternately casual and buffer-overflowingly technical. A fellow would be walking along a street and suddenly modality qua modality would spring upon him.",
      "translated": "我对发表在哲学期刊上的论文印象深刻。它们排版精美，文风引人入胜——时而随意，时而技术性极强。一个人走在街上，突然间模态作为模态就扑面而来。"
    },
    {
      "original": "I didn't ever quite understand these papers, but I figured I'd get around to that later, when I had time to reread them more closely. In the meantime I tried my best to imitate them. This was, I can now see, a doomed undertaking, because they weren't really saying anything.",
      "translated": "我从未完全理解这些论文，但我打算等有时间时再仔细重读。在此期间，我尽力模仿它们。现在我意识到，这是一场注定失败的尝试，因为它们实际上并没有说什么。"
    },
    {
      "original": "No philosopher ever refuted another, for example, because no one said anything definite enough to refute. Needless to say, my imitations didn't say anything either.In grad school I was still wasting time imitating the wrong things.",
      "translated": "没有哲学家曾经驳倒过另一位，因为没有人说出过足够明确的观点来被驳倒。不用说，我的模仿也没有说出任何东西。在研究生院时，我仍在浪费时间模仿错误的东西。"
    },
    {
      "original": "There was then a fashionable type of program called an expert system, at the core of which was something called an inference engine. I looked at what these things did and thought \"I could write that in a thousand lines of code.\" And yet eminent professors were writing books about them, and startups were selling them for a year's salary a copy.",
      "translated": "当时有一种流行的程序叫做专家系统，其核心是一种称为推理引擎的东西。我看了看这些东西的工作原理，心想“我可以用一千行代码写出来。”然而，著名的教授们却在写关于它们的书，初创公司则以一年的薪水为价出售它们。"
    },
    {
      "original": "What an opportunity, I thought; these impressive things seem easy to me; I must be pretty sharp. Wrong. It was simply a fad. The books the professors wrote about expert systems are now ignored. They were not even on a path to anything interesting.",
      "translated": "多么好的机会，我心想；这些令人印象深刻的东西对我来说似乎很容易；我一定很聪明。错了。那只不过是一种潮流。教授们写的关于专家系统的书现在都被忽略了。它们甚至没有走向任何有趣的方向。"
    },
    {
      "original": "And the customers paying so much for them were largely the same government agencies that paid thousands for screwdrivers and toilet seats.How do you avoid copying the wrong things? Copy only what you genuinely like.",
      "translated": "而支付如此高价的客户主要是那些曾经为螺丝刀和马桶座支付数千美元的政府机构。如何避免模仿错误的东西？只模仿你真正喜欢的东西。"
    },
    {
      "original": "That would have saved me in all three cases. I didn't enjoy the short stories we had to read in English classes; I didn't learn anything from philosophy papers; I didn't use expert systems myself. I believed these things were good because they were admired.It can be hard to separate the things you like from the things you're impressed with.",
      "translated": "这在我遇到的三种情况中都能帮到我。我不喜欢英语课上必须读的短篇小说；从哲学论文中我什么也没学到；我自己也没有使用过专家系统。我一直认为这些东西是好的，因为它们受到了赞赏。很难将你喜欢的东西与你印象深刻的东西区分开来。"
    },
    {
      "original": "One trick is to ignore presentation. Whenever I see a painting impressively hung in a museum, I ask myself: how much would I pay for this if I found it at a garage sale, dirty and frameless, and with no idea who painted it?",
      "translated": "一个技巧是忽略展示。每当我看到一幅画在博物馆里令人印象深刻地悬挂着时，我就会问自己：如果我在车库 sale 上发现这幅画，又脏又没有框，也不知道是谁画的，我会愿意为它付多少钱？"
    },
    {
      "original": "If you walk around a museum trying this experiment, you'll find you get some truly startling results. Don't ignore this data point just because it's an outlier.Another way to figure out what you like is to look at what you enjoy as guilty pleasures.",
      "translated": "如果你在博物馆里四处走动尝试这个实验，你会发现一些真正令人惊讶的结果。不要因为这是一个异常值就忽略这个数据点。另一种找出你喜好的方法是看看你有哪些心照不宣的乐趣。"
    },
    {
      "original": "Many things people like, especially if they're young and ambitious, they like largely for the feeling of virtue in liking them. 99% of people reading Ulysses are thinking \"I'm reading Ulysses\" as they do it.",
      "translated": "人们喜欢很多东西，尤其是年轻人和有抱负的人，他们喜欢这些东西很大程度上是因为喜欢这些能让他们感到自己很有品位。99%的人在读《尤利西斯》时，心里想的都是“我正在读《尤利西斯》”。"
    },
    {
      "original": "A guilty pleasure is at least a pure one. What do you read when you don't feel up to being virtuous? What kind of book do you read and feel sad that there's only half of it left, instead of being impressed that you're half way through?",
      "translated": "有罪的快乐至少是纯粹的。当你不想表现得那么高尚时，你会读些什么？你会读什么样的书，以至于感到难过只剩下一半，而不是为自己已经读了一半而感到自豪？"
    },
    {
      "original": "That's what you really like.Even when you find genuinely good things to copy, there's another pitfall to be avoided. Be careful to copy what makes them good, rather than their flaws. It's easy to be drawn into imitating flaws, because they're easier to see, and of course easier to copy too.",
      "translated": "这就是你真正喜欢的。即使当你找到了真正值得模仿的好东西时，也还有另一个需要避免的陷阱。要小心模仿它们的优点，而不是它们的缺点。因为缺点更容易被看到，当然也更容易模仿，所以很容易被吸引去模仿缺点。"
    },
    {
      "original": "For example, most painters in the eighteenth and nineteenth centuries used brownish colors. They were imitating the great painters of the Renaissance, whose paintings by that time were brown with dirt.",
      "translated": "例如，十八和十九世纪的大多数画家使用棕色调。他们是在模仿文艺复兴时期的大师们，而那时那些大师的作品已经因积满灰尘而变得棕黄。"
    },
    {
      "original": "Those paintings have since been cleaned, revealing brilliant colors; their imitators are of course still brown.It was painting, incidentally, that cured me of copying the wrong things. Halfway through grad school I decided I wanted to try being a painter, and the art world was so manifestly corrupt that it snapped the leash of credulity.",
      "translated": "那些画作后来被清洗过，显露出鲜艳的色彩；而它们的仿制品当然仍然是棕色的。顺便说一句，正是绘画使我摆脱了模仿错误事物的习惯。在研究生院的中途，我决定尝试成为一名画家，而艺术界的腐败显而易见，这让我对它的信任彻底断裂。"
    },
    {
      "original": "These people made philosophy professors seem as scrupulous as mathematicians. It was so clearly a choice of doing good work xor being an insider that I was forced to see the distinction. It's there to some degree in almost every field, but I had till then managed to avoid facing it.That was one of the most valuable things I learned from painting: you have to figure out for yourself what's good.",
      "translated": "这些人使得哲学教授看起来像数学家一样严谨。很明显，这是一个选择，要么做好工作，要么成为内部人士，这使我不得不看到这种区别。几乎每个领域都存在某种程度的这种区别，但直到那时我一直设法避免面对它。这是我从绘画中学到的最有价值的事情之一：你必须自己弄清楚什么是好的。"
    },
    {
      "original": "You can't trust authorities. They'll lie to you on this one. Comment on this essay.Chinese TranslationRomanian TranslationSpanish TranslationRussian Translation",
      "translated": "你不能相信权威。在这个问题上，他们会对你撒谎。请对这篇作文发表评论。"
    }
  ],
  "translation_completed": "2025-07-27T10:06:15.718537",
  "translation_stats": {
    "total_paragraphs": 20,
    "success_count": 20,
    "success_rate": "100.0%"
  }
}