{
  "title": "After Credentials",
  "title_zh": "[待翻译] After Credentials",
  "url": "https://www.paulgraham.com/credentials.html",
  "filename": "credentials.html",
  "date": "2020-10-20",
  "id": 77,
  "content": {
    "success": true,
    "paragraphs": [
      "December 2008A few months ago I read a New York Times article on South Korean cram schools that said Admission to the right university can make or break an ambitious young South Korean. A parent added: \"In our country, college entrance exams determine 70 to 80 percent of a person's future.\" It was striking how old fashioned this sounded.",
      "And yet when I was in high school it wouldn't have seemed too far off as a description of the US. Which means things must have been changing here.The course of people's lives in the US now seems to be determined less by credentials and more by performance than it was 25 years ago.",
      "Where you go to college still matters, but not like it used to.What happened?_____Judging people by their academic credentials was in its time an advance. The practice seems to have begun in China, where starting in 587 candidates for the imperial civil service had to take an exam on classical literature.",
      "[1] It was also a test of wealth, because the knowledge it tested was so specialized that passing required years of expensive training. But though wealth was a necessary condition for passing, it was not a sufficient one.",
      "By the standards of the rest of the world in 587, the Chinese system was very enlightened. Europeans didn't introduce formal civil service exams till the nineteenth century, and even then they seem to have been influenced by the Chinese example.Before credentials, government positions were obtained mainly by family influence, if not outright bribery.",
      "It was a great step forward to judge people by their performance on a test. But by no means a perfect solution. When you judge people that way, you tend to get cram schools—which they did in Ming China and nineteenth century England just as much as in present day South Korea.What cram schools are, in effect, is leaks in a seal.",
      "The use of credentials was an attempt to seal off the direct transmission of power between generations, and cram schools represent that power finding holes in the seal. Cram schools turn wealth in one generation into credentials in the next.It's hard to beat this phenomenon, because the schools adjust to suit whatever the tests measure.",
      "When the tests are narrow and predictable, you get cram schools on the classic model, like those that prepared candidates for Sandhurst (the British West Point) or the classes American students take now to improve their SAT scores.",
      "But as the tests get broader, the schools do too. Preparing a candidate for the Chinese imperial civil service exams took years, as prep school does today. But the raison d'etre of all these institutions has been the same: to beat the system.",
      "[2]_____History suggests that, all other things being equal, a society prospers in proportion to its ability to prevent parents from influencing their children's success directly. It's a fine thing for parents to help their children indirectly—for example, by helping them to become smarter or more disciplined, which then makes them more successful.",
      "The problem comes when parents use direct methods: when they are able to use their own wealth or power as a substitute for their children's qualities.Parents will tend to do this when they can. Parents will die for their kids, so it's not surprising to find they'll also push their scruples to the limits for them.",
      "Especially if other parents are doing it.Sealing off this force has a double advantage. Not only does a society get \"the best man for the job,\" but parents' ambitions are diverted from direct methods to indirect ones—to actually trying to raise their kids well.But we should expect it to be very hard to contain parents' efforts to obtain an unfair advantage for their kids.",
      "We're dealing with one of the most powerful forces in human nature. We shouldn't expect naive solutions to work, any more than we'd expect naive solutions for keeping heroin out of a prison to work._____The obvious way to solve the problem is to make credentials better.",
      "If the tests a society uses are currently hackable, we can study the way people beat them and try to plug the holes. You can use the cram schools to show you where most of the holes are. They also tell you when you're succeeding in fixing them: when cram schools become less popular.A more general solution would be to push for increased transparency, especially at critical social bottlenecks like college admissions.",
      "In the US this process still shows many outward signs of corruption. For example, legacy admissions. The official story is that legacy status doesn't carry much weight, because all it does is break ties: applicants are bucketed by ability, and legacy status is only used to decide between the applicants in the bucket that straddles the cutoff.",
      "But what this means is that a university can make legacy status have as much or as little weight as they want, by adjusting the size of the bucket that straddles the cutoff.By gradually chipping away at the abuse of credentials, you could probably make them more airtight.",
      "But what a long fight it would be. Especially when the institutions administering the tests don't really want them to be airtight._____Fortunately there's a better way to prevent the direct transmission of power between generations.",
      "Instead of trying to make credentials harder to hack, we can also make them matter less.Let's think about what credentials are for. What they are, functionally, is a way of predicting performance. If you could measure actual performance, you wouldn't need them.So why did they even evolve?",
      "Why haven't we just been measuring actual performance? Think about where credentialism first appeared: in selecting candidates for large organizations. Individual performance is hard to measure in large organizations, and the harder performance is to measure, the more important it is to predict it.",
      "If an organization could immediately and cheaply measure the performance of recruits, they wouldn't need to examine their credentials. They could take everyone and keep just the good ones.Large organizations can't do this.",
      "But a bunch of small organizations in a market can come close. A market takes every organization and keeps just the good ones. As organizations get smaller, this approaches taking every person and keeping just the good ones.",
      "So all other things being equal, a society consisting of more, smaller organizations will care less about credentials._____That's what's been happening in the US. That's why those quotes from Korea sound so old fashioned.",
      "They're talking about an economy like America's a few decades ago, dominated by a few big companies. The route for the ambitious in that sort of environment is to join one and climb to the top. Credentials matter a lot then.",
      "In the culture of a large organization, an elite pedigree becomes a self-fulfilling prophecy.This doesn't work in small companies. Even if your colleagues were impressed by your credentials, they'd soon be parted from you if your performance didn't match, because the company would go out of business and the people would be dispersed.In a world of small companies, performance is all anyone cares about.",
      "People hiring for a startup don't care whether you've even graduated from college, let alone which one. All they care about is what you can do. Which is in fact all that should matter, even in a large organization.",
      "The reason credentials have such prestige is that for so long the large organizations in a society tended to be the most powerful. But in the US at least they don't have the monopoly on power they once did, precisely because they can't measure (and thus reward) individual performance.",
      "Why spend twenty years climbing the corporate ladder when you can get rewarded directly by the market?I realize I see a more exaggerated version of the change than most other people. As a partner at an early stage venture funding firm, I'm like a jumpmaster shoving people out of the old world of credentials and into the new one of performance.",
      "I'm an agent of the change I'm seeing. But I don't think I'm imagining it. It was not so easy 25 years ago for an ambitious person to choose to be judged directly by the market. You had to go through bosses, and they were influenced by where you'd been to college._____What made it possible for small organizations to succeed in America?",
      "I'm still not entirely sure. Startups are certainly a large part of it. Small organizations can develop new ideas faster than large ones, and new ideas are increasingly valuable.But I don't think startups account for all the shift from credentials to measurement.",
      "My friend Julian Weber told me that when he went to work for a New York law firm in the 1950s they paid associates far less than firms do today. Law firms then made no pretense of paying people according to the value of the work they'd done.",
      "Pay was based on seniority. The younger employees were paying their dues. They'd be rewarded later.The same principle prevailed at industrial companies. When my father was working at Westinghouse in the 1970s, he had people working for him who made more than he did, because they'd been there longer.Now companies increasingly have to pay employees market price for the work they do.",
      "One reason is that employees no longer trust companies to deliver deferred rewards: why work to accumulate deferred rewards at a company that might go bankrupt, or be taken over and have all its implicit obligations wiped out?",
      "The other is that some companies broke ranks and started to pay young employees large amounts. This was particularly true in consulting, law, and finance, where it led to the phenomenon of yuppies. The word is rarely used today because it's no longer surprising to see a 25 year old with money, but in 1985 the sight of a 25 year old professional able to afford a new BMW was so novel that it called forth a new word.The classic yuppie worked for a small organization.",
      "He didn't work for General Widget, but for the law firm that handled General Widget's acquisitions or the investment bank that floated their bond issues.Startups and yuppies entered the American conceptual vocabulary roughly simultaneously in the late 1970s and early 1980s.",
      "I don't think there was a causal connection. Startups happened because technology started to change so fast that big companies could no longer keep a lid on the smaller ones. I don't think the rise of yuppies was inspired by it; it seems more as if there was a change in the social conventions (and perhaps the laws) governing the way big companies worked.",
      "But the two phenomena rapidly fused to produce a principle that now seems obvious: paying energetic young people market rates, and getting correspondingly high performance from them.At about the same time the US economy rocketed out of the doldrums that had afflicted it for most of the 1970s.",
      "Was there a connection? I don't know enough to say, but it felt like it at the time. There was a lot of energy released._____Countries worried about their competitiveness are right to be concerned about the number of startups started within them.",
      "But they would do even better to examine the underlying principle. Do they let energetic young people get paid market rate for the work they do? The young are the test, because when people aren't rewarded according to performance, they're invariably rewarded according to seniority instead.All it takes is a few beachheads in your economy that pay for performance.",
      "Measurement spreads like heat. If one part of a society is better at measurement than others, it tends to push the others to do better. If people who are young but smart and driven can make more by starting their own companies than by working for existing ones, the existing companies are forced to pay more to keep them.",
      "So market rates gradually permeate every organization, even the government. [3]The measurement of performance will tend to push even the organizations issuing credentials into line. When we were kids I used to annoy my sister by ordering her to do things I knew she was about to do anyway.",
      "As credentials are superseded by performance, a similar role is the best former gatekeepers can hope for. Once credential granting institutions are no longer in the self-fullfilling prophecy business, they'll have to work harder to predict the future._____Credentials are a step beyond bribery and influence.",
      "But they're not the final step. There's an even better way to block the transmission of power between generations: to encourage the trend toward an economy made of more, smaller units. Then you can measure what credentials merely predict.No one likes the transmission of power between generations—not the left or the right.",
      "But the market forces favored by the right turn out to be a better way of preventing it than the credentials the left are forced to fall back on.The era of credentials began to end when the power of large organizations peaked in the late twentieth century.",
      "Now we seem to be entering a new era based on measurement. The reason the new model has advanced so rapidly is that it works so much better. It shows no sign of slowing.Notes[1] Miyazaki, Ichisada (Conrad Schirokauer trans.), China's Examination Hell: The Civil Service Examinations of Imperial China, Yale University Press, 1981.Scribes in ancient Egypt took exams, but they were more the type of proficiency test any apprentice might have to pass.[2] When I say the raison d'etre of prep schools is to get kids into better colleges, I mean this in the narrowest sense.",
      "I'm not saying that's all prep schools do, just that if they had zero effect on college admissions there would be far less demand for them.[3] Progressive tax rates will tend to damp this effect, however, by decreasing the difference between good and bad measurers.Thanks to Trevor Blackwell, Sarah Harlin, Jessica Livingston, and David Sloo for reading drafts of this."
    ],
    "word_count": 2334,
    "paragraph_count": 45
  },
  "processed_at": "2025-07-26T19:03:53.624946",
  "paragraphs": [
    {
      "original": "December 2008A few months ago I read a New York Times article on South Korean cram schools that said Admission to the right university can make or break an ambitious young South Korean. A parent added: \"In our country, college entrance exams determine 70 to 80 percent of a person's future.\" It was striking how old fashioned this sounded.",
      "translated": "2008年12月，几个月前我读了一篇《纽约时报》关于韩国补习班的文章，文中提到：“能否进入理想的大学可以决定一个有抱负的韩国年轻人的成败。”一位家长补充说：“在我们国家，大学入学考试决定了一个人未来70%到80%的走向。”这种说法听起来非常过时。"
    },
    {
      "original": "And yet when I was in high school it wouldn't have seemed too far off as a description of the US. Which means things must have been changing here.The course of people's lives in the US now seems to be determined less by credentials and more by performance than it was 25 years ago.",
      "translated": "然而，当我高中时，用这样的描述来概括美国也并不显得太离谱。这意味着这里的情况一定发生了变化。现在在美国，人们的生活轨迹似乎更多地由表现决定，而不是像25年前那样主要由资历决定。"
    },
    {
      "original": "Where you go to college still matters, but not like it used to.What happened?_____Judging people by their academic credentials was in its time an advance. The practice seems to have begun in China, where starting in 587 candidates for the imperial civil service had to take an exam on classical literature.",
      "translated": "你上哪所大学仍然很重要，但不像过去那样重要了。发生了什么？_____以学术资历来评判人，这在过去曾是一种进步。这种做法似乎起源于中国，早在587年，应试者就必须参加关于古典文学的考试，以求得帝国文官职位。"
    },
    {
      "original": "[1] It was also a test of wealth, because the knowledge it tested was so specialized that passing required years of expensive training. But though wealth was a necessary condition for passing, it was not a sufficient one.",
      "translated": "这也是一种财富的考验，因为所测试的知识如此专门，以至于通过考试需要多年的昂贵培训。但尽管财富是通过考试的必要条件，却不是充分条件。"
    },
    {
      "original": "By the standards of the rest of the world in 587, the Chinese system was very enlightened. Europeans didn't introduce formal civil service exams till the nineteenth century, and even then they seem to have been influenced by the Chinese example.Before credentials, government positions were obtained mainly by family influence, if not outright bribery.",
      "translated": "按照587年世界其他地区的标准，中国的制度是非常开明的。欧洲人直到19世纪才引入正式的文官考试制度，而且即便如此，他们似乎也受到了中国模式的影响。在实行凭资历任职之前，政府职位主要靠家族影响获得，甚至有时是通过赤裸裸的贿赂。"
    },
    {
      "original": "It was a great step forward to judge people by their performance on a test. But by no means a perfect solution. When you judge people that way, you tend to get cram schools—which they did in Ming China and nineteenth century England just as much as in present day South Korea.What cram schools are, in effect, is leaks in a seal.",
      "translated": "通过考试来评判一个人是一个很大的进步。但这绝非完美的解决方案。当你以这种方式评判人时，往往会催生出补习班——这种现象在明朝的中国、19世纪的英国和当今的韩国同样存在。实际上，补习班就像是密封中的漏洞。"
    },
    {
      "original": "The use of credentials was an attempt to seal off the direct transmission of power between generations, and cram schools represent that power finding holes in the seal. Cram schools turn wealth in one generation into credentials in the next.It's hard to beat this phenomenon, because the schools adjust to suit whatever the tests measure.",
      "translated": "使用文凭是为了阻断权力在代际之间的直接传递，而补习班则代表了这种权力找到了封堵中的漏洞。补习班将一代人的财富转化为下一代人的文凭。要战胜这一现象很难，因为这些学校会根据考试所衡量的内容进行调整。"
    },
    {
      "original": "When the tests are narrow and predictable, you get cram schools on the classic model, like those that prepared candidates for Sandhurst (the British West Point) or the classes American students take now to improve their SAT scores.",
      "translated": "当考试范围狭窄且可预测时，就会出现类似传统模式的补习班，比如为准备进入桑德赫斯特（英国西点军校）的考生提供的补习班，或是现在美国学生为了提高SAT成绩而上的课程。"
    },
    {
      "original": "But as the tests get broader, the schools do too. Preparing a candidate for the Chinese imperial civil service exams took years, as prep school does today. But the raison d'etre of all these institutions has been the same: to beat the system.",
      "translated": "但是，随着考试范围的扩大，学校也变得更多样化。为准备参加中国科举考试，候选人需要花费数年时间，就像今天的预备学校一样。但所有这些机构存在的目的始终相同：战胜体制。"
    },
    {
      "original": "[2]_____History suggests that, all other things being equal, a society prospers in proportion to its ability to prevent parents from influencing their children's success directly. It's a fine thing for parents to help their children indirectly—for example, by helping them to become smarter or more disciplined, which then makes them more successful.",
      "translated": "历史表明，在其他条件相同的情况下，一个社会的繁荣程度与其防止父母直接左右子女成功的能力成正比。父母间接帮助子女是件好事，例如，通过帮助他们变得更聪明或更有自律性，从而使他们更加成功。"
    },
    {
      "original": "The problem comes when parents use direct methods: when they are able to use their own wealth or power as a substitute for their children's qualities.Parents will tend to do this when they can. Parents will die for their kids, so it's not surprising to find they'll also push their scruples to the limits for them.",
      "translated": "问题在于当父母使用直接手段时：当他们能够用自己的财富或权力来替代子女的特质。父母在有能力时往往会这样做。父母愿意为孩子牺牲生命，因此他们为了孩子也会将道德底线推至极限，这并不令人意外。"
    },
    {
      "original": "Especially if other parents are doing it.Sealing off this force has a double advantage. Not only does a society get \"the best man for the job,\" but parents' ambitions are diverted from direct methods to indirect ones—to actually trying to raise their kids well.But we should expect it to be very hard to contain parents' efforts to obtain an unfair advantage for their kids.",
      "translated": "尤其是当其他家长也在这么做时。封堵这种力量具有双重优势。社会不仅能获得“最适合担任该职位的人”，而且家长的野心也会从直接手段转向间接手段——真正努力把孩子培养好。但我们应该预料到，要遏制家长为孩子获取不公平优势的努力将会非常困难。"
    },
    {
      "original": "We're dealing with one of the most powerful forces in human nature. We shouldn't expect naive solutions to work, any more than we'd expect naive solutions for keeping heroin out of a prison to work._____The obvious way to solve the problem is to make credentials better.",
      "translated": "我们正在应对人类天性中最强大的力量之一。我们不应该期望天真的解决方案能奏效，就像我们不能期望天真的方法能阻止海洛因进入监狱一样。显而易见的解决办法是改善凭证。"
    },
    {
      "original": "If the tests a society uses are currently hackable, we can study the way people beat them and try to plug the holes. You can use the cram schools to show you where most of the holes are. They also tell you when you're succeeding in fixing them: when cram schools become less popular.A more general solution would be to push for increased transparency, especially at critical social bottlenecks like college admissions.",
      "translated": "如果一个社会使用的测试目前可以被破解，我们可以研究人们是如何破解它们的，并尝试堵住这些漏洞。你可以利用补习班来显示大多数漏洞所在。当补习班变得不那么受欢迎时，它们也会告诉你你正在成功地修复这些漏洞。一个更普遍的解决方案是推动提高透明度，特别是在像大学录取这样的关键社会瓶颈上。"
    },
    {
      "original": "In the US this process still shows many outward signs of corruption. For example, legacy admissions. The official story is that legacy status doesn't carry much weight, because all it does is break ties: applicants are bucketed by ability, and legacy status is only used to decide between the applicants in the bucket that straddles the cutoff.",
      "translated": "在美国，这一过程仍表现出许多腐败的表面迹象。例如，校友子女优先录取。官方的说法是，校友子女身份并没有多大权重，因为它的作用只是在同等条件下作出选择：申请人按能力分组，校友子女身份仅用于决定处于录取分数线边缘的申请者之间的取舍。"
    },
    {
      "original": "But what this means is that a university can make legacy status have as much or as little weight as they want, by adjusting the size of the bucket that straddles the cutoff.By gradually chipping away at the abuse of credentials, you could probably make them more airtight.",
      "translated": "但这意味着，大学可以通过调整跨越分数线的名额数量，来决定校友子女身份的权重大小。通过逐步减少对资历的滥用，可能会使这些制度更加严密。"
    },
    {
      "original": "But what a long fight it would be. Especially when the institutions administering the tests don't really want them to be airtight._____Fortunately there's a better way to prevent the direct transmission of power between generations.",
      "translated": "但这将是一场漫长的斗争。尤其是在管理这些测试的机构并不真正希望它们无懈可击的情况下。_____幸运的是，有一种更好的方法可以防止权力在代际之间直接传递。"
    },
    {
      "original": "Instead of trying to make credentials harder to hack, we can also make them matter less.Let's think about what credentials are for. What they are, functionally, is a way of predicting performance. If you could measure actual performance, you wouldn't need them.So why did they even evolve?",
      "translated": "与其努力使凭证更难被破解，我们也可以让它们的重要性降低。让我们思考一下凭证的作用。从功能上讲，凭证是一种预测表现的方式。如果你能够衡量实际表现，那么就不再需要凭证了。那么，它们为什么会发展出来呢？"
    },
    {
      "original": "Why haven't we just been measuring actual performance? Think about where credentialism first appeared: in selecting candidates for large organizations. Individual performance is hard to measure in large organizations, and the harder performance is to measure, the more important it is to predict it.",
      "translated": "为什么我们不直接测量实际表现呢？想想资格主义最初出现的地方：在选择大型组织的候选人时。在大型组织中，个人表现很难衡量，而表现越难衡量，预测它就越重要。"
    },
    {
      "original": "If an organization could immediately and cheaply measure the performance of recruits, they wouldn't need to examine their credentials. They could take everyone and keep just the good ones.Large organizations can't do this.",
      "translated": "如果一个组织能够立即且低成本地衡量新员工的表现，他们就不需要审核他们的资历。他们可以接受所有人，只留下优秀的人。大型组织无法做到这一点。"
    },
    {
      "original": "But a bunch of small organizations in a market can come close. A market takes every organization and keeps just the good ones. As organizations get smaller, this approaches taking every person and keeping just the good ones.",
      "translated": "但是一群小型组织在市场中可以接近这一点。市场会筛选出每一个组织中的优质部分。随着组织规模的缩小，这一过程逐渐接近于筛选出每一个人中的优秀者。"
    },
    {
      "original": "So all other things being equal, a society consisting of more, smaller organizations will care less about credentials._____That's what's been happening in the US. That's why those quotes from Korea sound so old fashioned.",
      "translated": "因此，在其他条件相同的情况下，由更多、规模较小的组织构成的社会将不太重视资历。____这就是美国正在发生的情况。这也是为什么那些来自韩国的引言听起来如此过时。"
    },
    {
      "original": "They're talking about an economy like America's a few decades ago, dominated by a few big companies. The route for the ambitious in that sort of environment is to join one and climb to the top. Credentials matter a lot then.",
      "translated": "他们谈论的是几十年前像美国那样的经济，由几家大公司主导。在这种环境下，有野心的人的出路是加入其中一家公司，然后爬到顶端。那时，资历非常重要。"
    },
    {
      "original": "In the culture of a large organization, an elite pedigree becomes a self-fulfilling prophecy.This doesn't work in small companies. Even if your colleagues were impressed by your credentials, they'd soon be parted from you if your performance didn't match, because the company would go out of business and the people would be dispersed.In a world of small companies, performance is all anyone cares about.",
      "translated": "在大型组织的文化中，精英背景成为一种自我实现的预言。这在小公司行不通。即使你的同事对你的资历印象深刻，如果你的表现不符合期望，他们很快就会与你分道扬镳，因为公司可能会倒闭，人员也会散去。在小公司的世界里，人们唯一关心的就是表现。"
    },
    {
      "original": "People hiring for a startup don't care whether you've even graduated from college, let alone which one. All they care about is what you can do. Which is in fact all that should matter, even in a large organization.",
      "translated": "招聘初创公司的人才时，他们并不关心你是否从大学毕业，更不用说毕业于哪所大学。他们只在乎你能做什么。事实上，即使在大型组织中，这也应该是唯一重要的事情。"
    },
    {
      "original": "The reason credentials have such prestige is that for so long the large organizations in a society tended to be the most powerful. But in the US at least they don't have the monopoly on power they once did, precisely because they can't measure (and thus reward) individual performance.",
      "translated": "证书之所以有如此高的声望，是因为长期以来，社会中的大型组织往往是权力最大的。但至少在美国，这些组织不再像过去那样垄断权力，恰恰是因为它们无法衡量（因而也无法奖励）个人绩效。"
    },
    {
      "original": "Why spend twenty years climbing the corporate ladder when you can get rewarded directly by the market?I realize I see a more exaggerated version of the change than most other people. As a partner at an early stage venture funding firm, I'm like a jumpmaster shoving people out of the old world of credentials and into the new one of performance.",
      "translated": "为什么要在职场上奋斗二十年，当你可以直接从市场获得回报呢？我意识到我看到的这种变化比大多数人更为夸张。作为一名早期风险投资公司的合伙人，我就像是一名跳伞教练，把人们从旧世界的资历观念中推入新世界的绩效评价体系。"
    },
    {
      "original": "I'm an agent of the change I'm seeing. But I don't think I'm imagining it. It was not so easy 25 years ago for an ambitious person to choose to be judged directly by the market. You had to go through bosses, and they were influenced by where you'd been to college._____What made it possible for small organizations to succeed in America?",
      "translated": "我是我所见证的变革的推动者。但我并不认为这只是我的想象。25年前，一个有抱负的人要想直接由市场来评判自己，这并不是那么容易的。你必须通过老板，而他们又会受到你上过哪所大学的影响。_____是什么使得小型组织在美国能够取得成功？"
    },
    {
      "original": "I'm still not entirely sure. Startups are certainly a large part of it. Small organizations can develop new ideas faster than large ones, and new ideas are increasingly valuable.But I don't think startups account for all the shift from credentials to measurement.",
      "translated": "我仍然不太确定。初创公司当然是其中的一个重要部分。小组织比大组织能更快地开发新想法，而新想法正变得越来越有价值。但我认为，从重视资历到重视绩效的转变，并不能完全归因于初创公司。"
    },
    {
      "original": "My friend Julian Weber told me that when he went to work for a New York law firm in the 1950s they paid associates far less than firms do today. Law firms then made no pretense of paying people according to the value of the work they'd done.",
      "translated": "我的朋友朱利安·韦伯告诉我，20世纪50年代他去纽约的一家律师事务所工作时，那里的律师助理薪酬远低于今天的水平。当时的律师事务所从不假装根据员工工作价值来支付薪酬。"
    },
    {
      "original": "Pay was based on seniority. The younger employees were paying their dues. They'd be rewarded later.The same principle prevailed at industrial companies. When my father was working at Westinghouse in the 1970s, he had people working for him who made more than he did, because they'd been there longer.Now companies increasingly have to pay employees market price for the work they do.",
      "translated": "薪酬是基于资历的。年轻员工正在偿还他们的义务。他们以后会得到回报。同样的原则在工业公司中也占主导地位。上世纪70年代，我父亲在西屋公司工作时，他手下有些人比他挣得多，因为他们在那里的时间更长。现在，公司越来越需要为员工的工作支付市场价格。"
    },
    {
      "original": "One reason is that employees no longer trust companies to deliver deferred rewards: why work to accumulate deferred rewards at a company that might go bankrupt, or be taken over and have all its implicit obligations wiped out?",
      "translated": "一个原因是，员工不再信任公司能够兑现延期奖励：为什么要在一家可能破产，或被收购后所有隐性义务都被取消的公司努力工作以积累延期奖励呢？"
    },
    {
      "original": "The other is that some companies broke ranks and started to pay young employees large amounts. This was particularly true in consulting, law, and finance, where it led to the phenomenon of yuppies. The word is rarely used today because it's no longer surprising to see a 25 year old with money, but in 1985 the sight of a 25 year old professional able to afford a new BMW was so novel that it called forth a new word.The classic yuppie worked for a small organization.",
      "translated": "另一方面，一些公司开始打破常规，向年轻员工支付大笔薪酬。这在咨询、法律和金融行业尤为明显，这些行业因此出现了“雅皮士”现象。如今这个词汇已很少使用，因为25岁的人拥有财富已不再令人惊讶，但在1985年，看到一个25岁的专业人士能够买得起一辆全新的宝马还是非常新奇的，以至于需要创造一个新词来形容。典型的雅皮士受雇于小型组织。"
    },
    {
      "original": "He didn't work for General Widget, but for the law firm that handled General Widget's acquisitions or the investment bank that floated their bond issues.Startups and yuppies entered the American conceptual vocabulary roughly simultaneously in the late 1970s and early 1980s.",
      "translated": "他并不在通用小部件公司工作，而是在处理通用小部件公司收购事宜的律师事务所或发行其债券的投资银行工作。初创企业和雅皮士在20世纪70年代末和80年代初几乎同时进入了美国的概念词汇中。"
    },
    {
      "original": "I don't think there was a causal connection. Startups happened because technology started to change so fast that big companies could no longer keep a lid on the smaller ones. I don't think the rise of yuppies was inspired by it; it seems more as if there was a change in the social conventions (and perhaps the laws) governing the way big companies worked.",
      "translated": "我认为这之间并没有因果关系。创业公司之所以出现，是因为技术变革如此之快，大公司已经无法再压制小公司了。我不认为雅皮士的兴起是受此启发；这似乎更像是社会规范（或许还有法律）在大公司的运作方式上发生了变化。"
    },
    {
      "original": "But the two phenomena rapidly fused to produce a principle that now seems obvious: paying energetic young people market rates, and getting correspondingly high performance from them.At about the same time the US economy rocketed out of the doldrums that had afflicted it for most of the 1970s.",
      "translated": "但这两个现象迅速融合，产生了一个现在看来显而易见的原则：以市场价雇用精力充沛的年轻人，并从他们那里获得相应的高绩效。大约同一时期，美国经济也迅速摆脱了整个20世纪70年代大部分时间里困扰它的低迷状态。"
    },
    {
      "original": "Was there a connection? I don't know enough to say, but it felt like it at the time. There was a lot of energy released._____Countries worried about their competitiveness are right to be concerned about the number of startups started within them.",
      "translated": "有联系吗？我不知道是否有足够的信息来下结论，但在当时确实有这样的感觉。有很多能量被释放。_____担心竞争力的国家有理由关注其国内新兴企业的数量。"
    },
    {
      "original": "But they would do even better to examine the underlying principle. Do they let energetic young people get paid market rate for the work they do? The young are the test, because when people aren't rewarded according to performance, they're invariably rewarded according to seniority instead.All it takes is a few beachheads in your economy that pay for performance.",
      "translated": "但他们更应该审视其背后的原理。他们是否让充满活力的年轻人按照市场价获得报酬？年轻人就是试金石，因为当人们不是根据绩效获得回报时，他们不可避免地会根据资历获得回报。只需要在你的经济中有一些根据绩效支付报酬的据点即可。"
    },
    {
      "original": "Measurement spreads like heat. If one part of a society is better at measurement than others, it tends to push the others to do better. If people who are young but smart and driven can make more by starting their own companies than by working for existing ones, the existing companies are forced to pay more to keep them.",
      "translated": "测量如同热能一般扩散。如果社会的某一部分比其他部分更擅长测量，它往往会推动其他部分做得更好。如果年轻但聪明和有抱负的人通过创办自己的公司能赚得比为现有公司工作更多，那么现有公司就会被迫提高薪酬以留住他们。"
    },
    {
      "original": "So market rates gradually permeate every organization, even the government. [3]The measurement of performance will tend to push even the organizations issuing credentials into line. When we were kids I used to annoy my sister by ordering her to do things I knew she was about to do anyway.",
      "translated": "因此，市场利率逐渐渗透到每一个组织，甚至政府。[3]绩效的衡量将倾向于推动甚至发放证书的组织保持一致。当我们还是孩子时，我常常通过命令我妹妹去做她本来就要做的事情来逗她。"
    },
    {
      "original": "As credentials are superseded by performance, a similar role is the best former gatekeepers can hope for. Once credential granting institutions are no longer in the self-fullfilling prophecy business, they'll have to work harder to predict the future._____Credentials are a step beyond bribery and influence.",
      "translated": "随着资历被绩效所取代，以前的守门人能期望的最佳角色也相似。一旦授予资历的机构不再从事自我实现预言的业务，它们将不得不更加努力地预测未来。_____资历超越了贿赂和影响力。"
    },
    {
      "original": "But they're not the final step. There's an even better way to block the transmission of power between generations: to encourage the trend toward an economy made of more, smaller units. Then you can measure what credentials merely predict.No one likes the transmission of power between generations—not the left or the right.",
      "translated": "但这还不是最后的一步。有一种更好的方法可以阻止权力在代际间的传递：那就是鼓励向更多、更小的经济单位发展的趋势。这样你就能衡量文凭所预测的内容。没有人喜欢权力在代际间的传递——无论是左派还是右派。"
    },
    {
      "original": "But the market forces favored by the right turn out to be a better way of preventing it than the credentials the left are forced to fall back on.The era of credentials began to end when the power of large organizations peaked in the late twentieth century.",
      "translated": "但事实证明，右派所倡导的市场力量在防止这一问题上比左派所依赖的资历更为有效。资历的时代始于20世纪晚期大型组织权力达到顶峰时开始衰落。"
    },
    {
      "original": "Now we seem to be entering a new era based on measurement. The reason the new model has advanced so rapidly is that it works so much better. It shows no sign of slowing.Notes[1] Miyazaki, Ichisada (Conrad Schirokauer trans.), China's Examination Hell: The Civil Service Examinations of Imperial China, Yale University Press, 1981.Scribes in ancient Egypt took exams, but they were more the type of proficiency test any apprentice might have to pass.[2] When I say the raison d'etre of prep schools is to get kids into better colleges, I mean this in the narrowest sense.",
      "translated": "现在我们似乎正在进入一个基于测量的新时代。新的模式之所以能够迅速推进，是因为它效果显著更好。它没有任何放缓的迹象。注[1] 宫崎市定（康拉德·席罗考尔译），《中国的考试地狱：帝国中国的文官考试》，耶鲁大学出版社，1981年。古埃及的文士也需要参加考试，但这些考试更像是任何学徒都可能需要通过的技能测试。[2] 当我说预科学校的存在理由是为了让学生进入更好的大学时，我是指这一点的狭义层面。"
    },
    {
      "original": "I'm not saying that's all prep schools do, just that if they had zero effect on college admissions there would be far less demand for them.[3] Progressive tax rates will tend to damp this effect, however, by decreasing the difference between good and bad measurers.Thanks to Trevor Blackwell, Sarah Harlin, Jessica Livingston, and David Sloo for reading drafts of this.",
      "translated": "我并不是说预科学校就只做这些，只是如果它们对大学录取完全没有影响的话，对它们的需求就会少得多。[3] 然而，累进税率会减弱这种效应，通过减少优秀测量者和糟糕测量者之间的差异。感谢 Trevor Blackwell、Sarah Harlin、Jessica Livingston 和 David Sloo 阅读本文的草稿。"
    }
  ],
  "translation_completed": "2025-07-27T14:11:49.552541",
  "translation_stats": {
    "total_paragraphs": 45,
    "success_count": 45,
    "success_rate": "100.0%"
  }
}