{
  "title": "The Anatomy of Determination",
  "title_zh": "[待翻译] The Anatomy of Determination",
  "url": "https://www.paulgraham.com/determination.html",
  "filename": "determination.html",
  "date": "2021-01-16",
  "id": 50,
  "content": {
    "success": true,
    "paragraphs": [
      "Want to start a startup? Get funded by Y Combinator. September 2009Like all investors, we spend a lot of time trying to learn how to predict which startups will succeed. We probably spend more time thinking about it than most, because we invest the earliest.",
      "Prediction is usually all we have to rely on.We learned quickly that the most important predictor of success is determination. At first we thought it might be intelligence. Everyone likes to believe that's what makes startups succeed.",
      "It makes a better story that a company won because its founders were so smart. The PR people and reporters who spread such stories probably believe them themselves. But while it certainly helps to be smart, it's not the deciding factor.",
      "There are plenty of people as smart as Bill Gates who achieve nothing.In most domains, talent is overrated compared to determination—partly because it makes a better story, partly because it gives onlookers an excuse for being lazy, and partly because after a while determination starts to look like talent.I can't think of any field in which determination is overrated, but the relative importance of determination and talent probably do vary somewhat.",
      "Talent probably matters more in types of work that are purer, in the sense that one is solving mostly a single type of problem instead of many different types. I suspect determination would not take you as far in math as it would in, say, organized crime.I don't mean to suggest by this comparison that types of work that depend more on talent are always more admirable.",
      "Most people would agree it's more admirable to be good at math than memorizing long strings of digits, even though the latter depends more on natural ability.Perhaps one reason people believe startup founders win by being smarter is that intelligence does matter more in technology startups than it used to in earlier types of companies.",
      "You probably do need to be a bit smarter to dominate Internet search than you had to be to dominate railroads or hotels or newspapers. And that's probably an ongoing trend. But even in the highest of high tech industries, success still depends more on determination than brains.If determination is so important, can we isolate its components?",
      "Are some more important than others? Are there some you can cultivate?The simplest form of determination is sheer willfulness. When you want something, you must have it, no matter what.A good deal of willfulness must be inborn, because it's common to see families where one sibling has much more of it than another.",
      "Circumstances can alter it, but at the high end of the scale, nature seems to be more important than nurture. Bad circumstances can break the spirit of a strong-willed person, but I don't think there's much you can do to make a weak-willed person stronger-willed.Being strong-willed is not enough, however.",
      "You also have to be hard on yourself. Someone who was strong-willed but self-indulgent would not be called determined. Determination implies your willfulness is balanced by discipline.That word balance is a significant one.",
      "The more willful you are, the more disciplined you have to be. The stronger your will, the less anyone will be able to argue with you except yourself. And someone has to argue with you, because everyone has base impulses, and if you have more will than discipline you'll just give into them and end up on a local maximum like drug addiction.We can imagine will and discipline as two fingers squeezing a slippery melon seed.",
      "The harder they squeeze, the further the seed flies, but they must both squeeze equally or the seed spins off sideways.If this is true it has interesting implications, because discipline can be cultivated, and in fact does tend to vary quite a lot in the course of an individual's life.",
      "If determination is effectively the product of will and discipline, then you can become more determined by being more disciplined. [1]Another consequence of the melon seed model is that the more willful you are, the more dangerous it is to be undisciplined.",
      "There seem to be plenty of examples to confirm that. In some very energetic people's lives you see something like wing flutter, where they alternate between doing great work and doing absolutely nothing.",
      "Externally this would look a lot like bipolar disorder.The melon seed model is inaccurate in at least one respect, however: it's static. In fact the dangers of indiscipline increase with temptation. Which means, interestingly, that determination tends to erode itself.",
      "If you're sufficiently determined to achieve great things, this will probably increase the number of temptations around you. Unless you become proportionally more disciplined, willfulness will then get the upper hand, and your achievement will revert to the mean.That's why Shakespeare's Caesar thought thin men so dangerous.",
      "They weren't tempted by the minor perquisites of power.The melon seed model implies it's possible to be too disciplined. Is it? I think there probably are people whose willfulness is crushed down by excessive discipline, and who would achieve more if they weren't so hard on themselves.",
      "One reason the young sometimes succeed where the old fail is that they don't realize how incompetent they are. This lets them do a kind of deficit spending. When they first start working on something, they overrate their achievements.",
      "But that gives them confidence to keep working, and their performance improves. Whereas someone clearer-eyed would see their initial incompetence for what it was, and perhaps be discouraged from continuing.There's one other major component of determination: ambition.",
      "If willfulness and discipline are what get you to your destination, ambition is how you choose it.I don't know if it's exactly right to say that ambition is a component of determination, but they're not entirely orthogonal.",
      "It would seem a misnomer if someone said they were very determined to do something trivially easy.And fortunately ambition seems to be quite malleable; there's a lot you can do to increase it. Most people don't know how ambitious to be, especially when they're young.",
      "They don't know what's hard, or what they're capable of. And this problem is exacerbated by having few peers. Ambitious people are rare, so if everyone is mixed together randomly, as they tend to be early in people's lives, then the ambitious ones won't have many ambitious peers.",
      "When you take people like this and put them together with other ambitious people, they bloom like dying plants given water. Probably most ambitious people are starved for the sort of encouragement they'd get from ambitious peers, whatever their age.",
      "[2]Achievements also tend to increase your ambition. With each step you gain confidence to stretch further next time.So here in sum is how determination seems to work: it consists of willfulness balanced with discipline, aimed by ambition.",
      "And fortunately at least two of these three qualities can be cultivated. You may be able to increase your strength of will somewhat; you can definitely learn self-discipline; and almost everyone is practically malnourished when it comes to ambition.I feel like I understand determination a bit better now.",
      "But only a bit: willfulness, discipline, and ambition are all concepts almost as complicated as determination. [3]Note too that determination and talent are not the whole story. There's a third factor in achievement: how much you like the work.",
      "If you really love working on something, you don't need determination to drive you; it's what you'd do anyway. But most types of work have aspects one doesn't like, because most types of work consist of doing things for other people, and it's very unlikely that the tasks imposed by their needs will happen to align exactly with what you want to do.Indeed, if you want to create the most wealth, the way to do it is to focus more on their needs than your interests, and make up the difference with determination.Notes[1] Loosely speaking.",
      "What I'm claiming with the melon seed model is more like determination is proportionate to wd^m - k|w - d|^n, where w is will and d discipline.[2] Which means one of the best ways to help a society generally is to create events and institutions that bring ambitious people together.",
      "It's like pulling the control rods out of a reactor: the energy they emit encourages other ambitious people, instead of being absorbed by the normal people they're usually surrounded with.Conversely, it's probably a mistake to do as some European countries have done and try to ensure none of your universities is significantly better than the others.[3] For example, willfulness clearly has two subcomponents, stubbornness and energy.",
      "The first alone yields someone who's stubbornly inert. The second alone yields someone flighty. As willful people get older or otherwise lose their energy, they tend to become merely stubborn. Thanks to Sam Altman, Jessica Livingston, and Robert Morris for reading drafts of this.Italian TranslationPortuguese TranslationRussian Translation"
    ],
    "word_count": 1472,
    "paragraph_count": 30
  },
  "processed_at": "2025-07-26T19:03:01.239761",
  "paragraphs": [
    {
      "original": "Want to start a startup? Get funded by Y Combinator. September 2009Like all investors, we spend a lot of time trying to learn how to predict which startups will succeed. We probably spend more time thinking about it than most, because we invest the earliest.",
      "translated": "想创办一家初创公司吗？获得Y Combinator的资助。2009年9月\n\n像所有投资者一样，我们花费大量时间试图学习如何预测哪些初创公司会成功。我们可能比大多数投资者花更多的时间思考这个问题，因为我们投资的是最早期的项目。"
    },
    {
      "original": "Prediction is usually all we have to rely on.We learned quickly that the most important predictor of success is determination. At first we thought it might be intelligence. Everyone likes to believe that's what makes startups succeed.",
      "translated": "预测通常是我们的唯一依靠。我们很快意识到，成功最重要的预测因素是决心。起初，我们认为可能是智力。每个人都喜欢相信智力是创业成功的关键。"
    },
    {
      "original": "It makes a better story that a company won because its founders were so smart. The PR people and reporters who spread such stories probably believe them themselves. But while it certainly helps to be smart, it's not the deciding factor.",
      "translated": "一家公司之所以成功，是因为其创始人非常聪明，这确实是一个更好的故事。传播这类故事的公关人员和记者可能自己也相信这些。但尽管聪明肯定有帮助，却不是决定性因素。"
    },
    {
      "original": "There are plenty of people as smart as Bill Gates who achieve nothing.In most domains, talent is overrated compared to determination—partly because it makes a better story, partly because it gives onlookers an excuse for being lazy, and partly because after a while determination starts to look like talent.I can't think of any field in which determination is overrated, but the relative importance of determination and talent probably do vary somewhat.",
      "translated": "有许多人和比尔·盖茨一样聪明，却一事无成。在大多数领域，天赋被高估了，部分原因是它造就了更好的故事，部分原因是它为旁观者的懒惰提供了借口，还有一部分原因是，时间长了，决心也开始看起来像天赋。我想不出有任何领域决心被高估了，但决心和天赋的相对重要性可能确实有些不同。"
    },
    {
      "original": "Talent probably matters more in types of work that are purer, in the sense that one is solving mostly a single type of problem instead of many different types. I suspect determination would not take you as far in math as it would in, say, organized crime.I don't mean to suggest by this comparison that types of work that depend more on talent are always more admirable.",
      "translated": "在那些更为纯粹的工作类型中，才华可能更为重要，这类工作主要解决的是一种类型的问题，而不是多种不同类型的问题。我猜测，在数学领域，仅凭决心所能达到的成就可能不如在有组织犯罪中那么远。我并不想通过这种比较暗示，那些更依赖才华的工作类型总是更值得尊敬。"
    },
    {
      "original": "Most people would agree it's more admirable to be good at math than memorizing long strings of digits, even though the latter depends more on natural ability.Perhaps one reason people believe startup founders win by being smarter is that intelligence does matter more in technology startups than it used to in earlier types of companies.",
      "translated": "大多数人会认为，擅长数学比能记住长串的数字更值得敬佩，即使后者更依赖于天赋。也许人们相信创业公司创始人靠聪明取胜的一个原因是，在科技创业公司中，智力的作用比以前的公司类型更为重要。"
    },
    {
      "original": "You probably do need to be a bit smarter to dominate Internet search than you had to be to dominate railroads or hotels or newspapers. And that's probably an ongoing trend. But even in the highest of high tech industries, success still depends more on determination than brains.If determination is so important, can we isolate its components?",
      "translated": "你可能确实需要更聪明一些才能在互联网搜索领域占据主导地位，而不仅仅是像在铁路、酒店或报纸行业那样。这可能是一个持续的趋势。但即使在最高科技的行业中，成功仍然更多地取决于决心而非智力。如果决心如此重要，我们能否将其组成部分分离出来？"
    },
    {
      "original": "Are some more important than others? Are there some you can cultivate?The simplest form of determination is sheer willfulness. When you want something, you must have it, no matter what.A good deal of willfulness must be inborn, because it's common to see families where one sibling has much more of it than another.",
      "translated": "有些比其他的重要吗？有些是你能够培养的吗？决心的最简单形式就是纯粹的固执。当你想要某样东西时，无论怎样你都必须得到它。很多的固执一定是与生俱来的，因为常见到一个家庭中的一个兄弟姐妹比另一个有更多的固执。"
    },
    {
      "original": "Circumstances can alter it, but at the high end of the scale, nature seems to be more important than nurture. Bad circumstances can break the spirit of a strong-willed person, but I don't think there's much you can do to make a weak-willed person stronger-willed.Being strong-willed is not enough, however.",
      "translated": "环境可以改变它，但在高端的层面上，天性似乎比教养更重要。恶劣的环境可以摧毁一个意志坚强的人的精神，但我认为，对于意志薄弱的人，你很难让他们变得更加坚强。然而，仅仅意志坚强是不够的。"
    },
    {
      "original": "You also have to be hard on yourself. Someone who was strong-willed but self-indulgent would not be called determined. Determination implies your willfulness is balanced by discipline.That word balance is a significant one.",
      "translated": "你也必须对自己严格。一个意志坚强但放纵自我的人不会被称为有决心。决心意味着你的意志力是由自律平衡的。这个词“平衡”是非常重要的。"
    },
    {
      "original": "The more willful you are, the more disciplined you have to be. The stronger your will, the less anyone will be able to argue with you except yourself. And someone has to argue with you, because everyone has base impulses, and if you have more will than discipline you'll just give into them and end up on a local maximum like drug addiction.We can imagine will and discipline as two fingers squeezing a slippery melon seed.",
      "translated": "你越有主见，就必须越自律。你的意志越坚定，除了你自己，就几乎没有人能与你争辩。而必须有人与你争辩，因为每个人都有低级的冲动，如果你的意志超过了自律，你就会屈服于这些冲动，最终陷入像药物成瘾这样的局部最优状态。我们可以将意志和自律想象成两只手指捏着一颗滑溜的瓜子。"
    },
    {
      "original": "The harder they squeeze, the further the seed flies, but they must both squeeze equally or the seed spins off sideways.If this is true it has interesting implications, because discipline can be cultivated, and in fact does tend to vary quite a lot in the course of an individual's life.",
      "translated": "他们挤得越紧，种子飞得越远，但两人必须用相同的力度，否则种子会向侧面旋转飞出。如果这是真的，那么它就有很有趣的含义，因为自律是可以培养的，事实上，在一个人的一生中，自律程度确实会有很大的变化。"
    },
    {
      "original": "If determination is effectively the product of will and discipline, then you can become more determined by being more disciplined. [1]Another consequence of the melon seed model is that the more willful you are, the more dangerous it is to be undisciplined.",
      "translated": "如果决心实际上是意志和纪律的产物，那么你可以通过更加自律来变得更加坚定。[1]根据瓜子模型的另一个推论，意志越强的人，如果缺乏纪律，危险性就越大。"
    },
    {
      "original": "There seem to be plenty of examples to confirm that. In some very energetic people's lives you see something like wing flutter, where they alternate between doing great work and doing absolutely nothing.",
      "translated": "似乎有很多例子可以证实这一点。在一些非常有活力的人的生活中，你可以看到类似翅膀振动的现象，他们在做出出色的工作和完全不做事之间交替。"
    },
    {
      "original": "Externally this would look a lot like bipolar disorder.The melon seed model is inaccurate in at least one respect, however: it's static. In fact the dangers of indiscipline increase with temptation. Which means, interestingly, that determination tends to erode itself.",
      "translated": "从外部看，这很像双相情感障碍。然而，西瓜籽模型至少在一个方面是不准确的：它是静态的。事实上，诱惑越大，不守纪律的危险就越大。这意味着，有趣的是，决心往往会自我侵蚀。"
    },
    {
      "original": "If you're sufficiently determined to achieve great things, this will probably increase the number of temptations around you. Unless you become proportionally more disciplined, willfulness will then get the upper hand, and your achievement will revert to the mean.That's why Shakespeare's Caesar thought thin men so dangerous.",
      "translated": "如果你有足够的决心去成就伟大的事业，这可能会增加你周围的诱惑。除非你变得相应地更加自律，否则任性将会占据上风，你的成就将会回归平庸。这就是为什么莎士比亚笔下的凯撒认为瘦弱的人如此危险。"
    },
    {
      "original": "They weren't tempted by the minor perquisites of power.The melon seed model implies it's possible to be too disciplined. Is it? I think there probably are people whose willfulness is crushed down by excessive discipline, and who would achieve more if they weren't so hard on themselves.",
      "translated": "他们并未被权力的小恩小惠所诱惑。瓜子模型暗示，过度自律可能是存在的。是这样吗？我认为可能确实有些人因为过度的自律而压制了自己的意志，如果他们对自己不那么苛刻，可能会取得更大的成就。"
    },
    {
      "original": "One reason the young sometimes succeed where the old fail is that they don't realize how incompetent they are. This lets them do a kind of deficit spending. When they first start working on something, they overrate their achievements.",
      "translated": "年轻人有时能在老年人失败的地方取得成功，其中一个原因是他们没有意识到自己的无能。这使他们能够进行一种“透支”行为。当他们刚开始做某件事时，会高估自己的成就。"
    },
    {
      "original": "But that gives them confidence to keep working, and their performance improves. Whereas someone clearer-eyed would see their initial incompetence for what it was, and perhaps be discouraged from continuing.There's one other major component of determination: ambition.",
      "translated": "但这让他们有信心继续努力，他们的表现也得到了改善。而一个更加清醒的人则会看到他们最初的无能，或许会因此而灰心丧气，不再继续。还有一个决定性的因素：雄心。"
    },
    {
      "original": "If willfulness and discipline are what get you to your destination, ambition is how you choose it.I don't know if it's exactly right to say that ambition is a component of determination, but they're not entirely orthogonal.",
      "translated": "如果说意志和自律是让你到达目的地的手段，那么雄心就是你选择目的地的方式。我不确定说雄心是决心的一个组成部分是否完全正确，但它们并非完全无关。"
    },
    {
      "original": "It would seem a misnomer if someone said they were very determined to do something trivially easy.And fortunately ambition seems to be quite malleable; there's a lot you can do to increase it. Most people don't know how ambitious to be, especially when they're young.",
      "translated": "如果有人说他们决心要去做一件微不足道的小事，这听起来似乎有些名不副实。幸运的是，雄心似乎相当具有可塑性；有很多方法可以增强它。大多数人，尤其是在年轻时，都不知道该有多大的雄心。"
    },
    {
      "original": "They don't know what's hard, or what they're capable of. And this problem is exacerbated by having few peers. Ambitious people are rare, so if everyone is mixed together randomly, as they tend to be early in people's lives, then the ambitious ones won't have many ambitious peers.",
      "translated": "他们不知道什么才是困难的，也不知道自己能做些什么。而这个问题由于缺少志同道合的人而变得更加严重。有雄心壮志的人很少，所以如果所有人像在人生成长早期那样被随机地混在一起，那么有抱负的人就不会有很多同样有抱负的同伴。"
    },
    {
      "original": "When you take people like this and put them together with other ambitious people, they bloom like dying plants given water. Probably most ambitious people are starved for the sort of encouragement they'd get from ambitious peers, whatever their age.",
      "translated": "当你把这样的人和其它有抱负的人放在一起时，他们就像枯萎的植物得到了水一样绽放。也许大多数有抱负的人都渴望从有志同道合的同伴那里得到鼓励，无论他们的年龄如何。"
    },
    {
      "original": "[2]Achievements also tend to increase your ambition. With each step you gain confidence to stretch further next time.So here in sum is how determination seems to work: it consists of willfulness balanced with discipline, aimed by ambition.",
      "translated": "成就也往往会增加你的雄心。每前进一步，你都会获得更多信心，以便下次能够走得更远。因此，决心似乎就是这样运作的：它由意志力和自律平衡组成，并由雄心指引。"
    },
    {
      "original": "And fortunately at least two of these three qualities can be cultivated. You may be able to increase your strength of will somewhat; you can definitely learn self-discipline; and almost everyone is practically malnourished when it comes to ambition.I feel like I understand determination a bit better now.",
      "translated": "幸运的是，这三种品质中至少有两种是可以培养的。你可能能够在某种程度上增强自己的意志力；你肯定可以学会自律；而几乎每个人在雄心方面都是实际上营养不良的。现在我觉得自己对决心有了更好的理解。"
    },
    {
      "original": "But only a bit: willfulness, discipline, and ambition are all concepts almost as complicated as determination. [3]Note too that determination and talent are not the whole story. There's a third factor in achievement: how much you like the work.",
      "translated": "但只有一点点：任性、自律和雄心都是几乎和决心一样复杂的概念。[3]还要注意，决心和天赋并不是成功的全部。成就的第三个因素是你对工作的喜爱程度。"
    },
    {
      "original": "If you really love working on something, you don't need determination to drive you; it's what you'd do anyway. But most types of work have aspects one doesn't like, because most types of work consist of doing things for other people, and it's very unlikely that the tasks imposed by their needs will happen to align exactly with what you want to do.Indeed, if you want to create the most wealth, the way to do it is to focus more on their needs than your interests, and make up the difference with determination.Notes[1] Loosely speaking.",
      "translated": "如果你真的热爱某项工作，你并不需要决心来驱使你；这本来就是你会去做的事情。但大多数类型的工作都有你不喜欢的方面，因为大多数工作都是为别人做事，而他们的需求所强加的任务恰好与你想要做的事情完全一致的可能性非常小。事实上，如果你想创造最大的财富，方法是更多地关注他们的需求而不是你的兴趣，并用决心来弥补这一差距。注[1] 广义而言。"
    },
    {
      "original": "What I'm claiming with the melon seed model is more like determination is proportionate to wd^m - k|w - d|^n, where w is will and d discipline.[2] Which means one of the best ways to help a society generally is to create events and institutions that bring ambitious people together.",
      "translated": "我用瓜子模型所表达的观点是，决心与wd^m - k|w - d|^n成正比，其中w代表意志，d代表自律。[2] 这意味着帮助社会的一种最佳方式是创建活动和机构，将有抱负的人聚集在一起。"
    },
    {
      "original": "It's like pulling the control rods out of a reactor: the energy they emit encourages other ambitious people, instead of being absorbed by the normal people they're usually surrounded with.Conversely, it's probably a mistake to do as some European countries have done and try to ensure none of your universities is significantly better than the others.[3] For example, willfulness clearly has two subcomponents, stubbornness and energy.",
      "translated": "这就像是从反应堆中抽出控制棒：它们释放的能量激励了其他有雄心的人，而不是被周围普通的人吸收。相反，像一些欧洲国家那样试图确保你的任何一所大学都不比其他大学显著优秀，这可能是一个错误。[3] 例如，意志力显然有两个子成分，固执和精力。"
    },
    {
      "original": "The first alone yields someone who's stubbornly inert. The second alone yields someone flighty. As willful people get older or otherwise lose their energy, they tend to become merely stubborn. Thanks to Sam Altman, Jessica Livingston, and Robert Morris for reading drafts of this.Italian TranslationPortuguese TranslationRussian Translation",
      "translated": "仅第一种情况会导致一个人固执而无为。第二种情况单独存在则会造就一个轻浮的人。随着有主见的人年龄的增长或能量的减少，他们往往会变得只是固执。感谢Sam Altman、Jessica Livingston和Robert Morris阅读本文的草稿。意大利语翻译葡萄牙语翻译俄语翻译"
    }
  ],
  "translation_completed": "2025-07-28T13:12:39.097885",
  "translation_stats": {
    "total_paragraphs": 30,
    "success_count": 30,
    "success_rate": "100.0%"
  }
}