{
  "title": "The Age of the Essay",
  "title_zh": "[待翻译] The Age of the Essay",
  "url": "https://www.paulgraham.com/essay.html",
  "filename": "essay.html",
  "date": "2004-09-01",
  "id": 213,
  "content": {
    "success": true,
    "paragraphs": [
      "September 2004Remember the essays you had to write in high school? Topic sentence, introductory paragraph, supporting paragraphs, conclusion. The conclusion being, say, that Ahab in Moby Dick was a Christ-like figure.Oy.",
      "So I'm going to try to give the other side of the story: what an essay really is, and how you write one. Or at least, how I write one.ModsThe most obvious difference between real essays and the things one has to write in school is that real essays are not exclusively about English literature.",
      "Certainly schools should teach students how to write. But due to a series of historical accidents the teaching of writing has gotten mixed together with the study of literature. And so all over the country students are writing not about how a baseball team with a small budget might compete with the Yankees, or the role of color in fashion, or what constitutes a good dessert, but about symbolism in Dickens.With the result that writing is made to seem boring and pointless.",
      "Who cares about symbolism in Dickens? Dickens himself would be more interested in an essay about color or baseball.How did things get this way? To answer that we have to go back almost a thousand years.",
      "Around 1100, Europe at last began to catch its breath after centuries of chaos, and once they had the luxury of curiosity they rediscovered what we call \"the classics.\" The effect was rather as if we were visited by beings from another solar system.",
      "These earlier civilizations were so much more sophisticated that for the next several centuries the main work of European scholars, in almost every field, was to assimilate what they knew.During this period the study of ancient texts acquired great prestige.",
      "It seemed the essence of what scholars did. As European scholarship gained momentum it became less and less important; by 1350 someone who wanted to learn about science could find better teachers than Aristotle in his own era.",
      "[1] But schools change slower than scholarship. In the 19th century the study of ancient texts was still the backbone of the curriculum.The time was then ripe for the question: if the study of ancient texts is a valid field for scholarship, why not modern texts?",
      "The answer, of course, is that the original raison d'etre of classical scholarship was a kind of intellectual archaeology that does not need to be done in the case of contemporary authors. But for obvious reasons no one wanted to give that answer.",
      "The archaeological work being mostly done, it implied that those studying the classics were, if not wasting their time, at least working on problems of minor importance.And so began the study of modern literature.",
      "There was a good deal of resistance at first. The first courses in English literature seem to have been offered by the newer colleges, particularly American ones. Dartmouth, the University of Vermont, Amherst, and University College, London taught English literature in the 1820s.",
      "But Harvard didn't have a professor of English literature until 1876, and Oxford not till 1885. (Oxford had a chair of Chinese before it had one of English.) [2]What tipped the scales, at least in the US, seems to have been the idea that professors should do research as well as teach.",
      "This idea (along with the PhD, the department, and indeed the whole concept of the modern university) was imported from Germany in the late 19th century. Beginning at Johns Hopkins in 1876, the new model spread rapidly.Writing was one of the casualties.",
      "Colleges had long taught English composition. But how do you do research on composition? The professors who taught math could be required to do original math, the professors who taught history could be required to write scholarly articles about history, but what about the professors who taught rhetoric or composition?",
      "What should they do research on? The closest thing seemed to be English literature. [3]And so in the late 19th century the teaching of writing was inherited by English professors. This had two drawbacks: (a) an expert on literature need not himself be a good writer, any more than an art historian has to be a good painter, and (b) the subject of writing now tends to be literature, since that's what the professor is interested in.High schools imitate universities.",
      "The seeds of our miserable high school experiences were sown in 1892, when the National Education Association \"formally recommended that literature and composition be unified in the high school course.\" [4] The 'riting component of the 3 Rs then morphed into English, with the bizarre consequence that high school students now had to write about English literature-- to write, without even realizing it, imitations of whatever English professors had been publishing in their journals a few decades before.It's no wonder if this seems to the student a pointless exercise, because we're now three steps removed from real work: the students are imitating English professors, who are imitating classical scholars, who are merely the inheritors of a tradition growing out of what was, 700 years ago, fascinating and urgently needed work.No DefenseThe other big difference between a real essay and the things they make you write in school is that a real essay doesn't take a position and then defend it.",
      "That principle, like the idea that we ought to be writing about literature, turns out to be another intellectual hangover of long forgotten origins.It's often mistakenly believed that medieval universities were mostly seminaries.",
      "In fact they were more law schools. And at least in our tradition lawyers are advocates, trained to take either side of an argument and make as good a case for it as they can. Whether cause or effect, this spirit pervaded early universities.",
      "The study of rhetoric, the art of arguing persuasively, was a third of the undergraduate curriculum. [5] And after the lecture the most common form of discussion was the disputation. This is at least nominally preserved in our present-day thesis defense: most people treat the words thesis and dissertation as interchangeable, but originally, at least, a thesis was a position one took and the dissertation was the argument by which one defended it.Defending a position may be a necessary evil in a legal dispute, but it's not the best way to get at the truth, as I think lawyers would be the first to admit.",
      "It's not just that you miss subtleties this way. The real problem is that you can't change the question.And yet this principle is built into the very structure of the things they teach you to write in high school.",
      "The topic sentence is your thesis, chosen in advance, the supporting paragraphs the blows you strike in the conflict, and the conclusion-- uh, what is the conclusion? I was never sure about that in high school.",
      "It seemed as if we were just supposed to restate what we said in the first paragraph, but in different enough words that no one could tell. Why bother? But when you understand the origins of this sort of \"essay,\" you can see where the conclusion comes from.",
      "It's the concluding remarks to the jury.Good writing should be convincing, certainly, but it should be convincing because you got the right answers, not because you did a good job of arguing. When I give a draft of an essay to friends, there are two things I want to know: which parts bore them, and which seem unconvincing.",
      "The boring bits can usually be fixed by cutting. But I don't try to fix the unconvincing bits by arguing more cleverly. I need to talk the matter over.At the very least I must have explained something badly.",
      "In that case, in the course of the conversation I'll be forced to come up a with a clearer explanation, which I can just incorporate in the essay. More often than not I have to change what I was saying as well.",
      "But the aim is never to be convincing per se. As the reader gets smarter, convincing and true become identical, so if I can convince smart readers I must be near the truth.The sort of writing that attempts to persuade may be a valid (or at least inevitable) form, but it's historically inaccurate to call it an essay.",
      "An essay is something else.TryingTo understand what a real essay is, we have to reach back into history again, though this time not so far. To Michel de Montaigne, who in 1580 published a book of what he called \"essais.\" He was doing something quite different from what lawyers do, and the difference is embodied in the name.",
      "Essayer is the French verb meaning \"to try\" and an essai is an attempt. An essay is something you write to try to figure something out.Figure out what? You don't know yet. And so you can't begin with a thesis, because you don't have one, and may never have one.",
      "An essay doesn't begin with a statement, but with a question. In a real essay, you don't take a position and defend it. You notice a door that's ajar, and you open it and walk in to see what's inside.If all you want to do is figure things out, why do you need to write anything, though?",
      "Why not just sit and think? Well, there precisely is Montaigne's great discovery. Expressing ideas helps to form them. Indeed, helps is far too weak a word. Most of what ends up in my essays I only thought of when I sat down to write them.",
      "That's why I write them.In the things you write in school you are, in theory, merely explaining yourself to the reader. In a real essay you're writing for yourself. You're thinking out loud.But not quite.",
      "Just as inviting people over forces you to clean up your apartment, writing something that other people will read forces you to think well. So it does matter to have an audience. The things I've written just for myself are no good.",
      "They tend to peter out. When I run into difficulties, I find I conclude with a few vague questions and then drift off to get a cup of tea.Many published essays peter out in the same way. Particularly the sort written by the staff writers of newsmagazines.",
      "Outside writers tend to supply editorials of the defend-a-position variety, which make a beeline toward a rousing (and foreordained) conclusion. But the staff writers feel obliged to write something \"balanced.\" Since they're writing for a popular magazine, they start with the most radioactively controversial questions, from which-- because they're writing for a popular magazine-- they then proceed to recoil in terror.",
      "Abortion, for or against? This group says one thing. That group says another. One thing is certain: the question is a complex one. (But don't get mad at us. We didn't draw any conclusions.)The RiverQuestions aren't enough.",
      "An essay has to come up with answers. They don't always, of course. Sometimes you start with a promising question and get nowhere. But those you don't publish. Those are like experiments that get inconclusive results.",
      "An essay you publish ought to tell the reader something he didn't already know.But what you tell him doesn't matter, so long as it's interesting. I'm sometimes accused of meandering. In defend-a-position writing that would be a flaw.",
      "There you're not concerned with truth. You already know where you're going, and you want to go straight there, blustering through obstacles, and hand-waving your way across swampy ground. But that's not what you're trying to do in an essay.",
      "An essay is supposed to be a search for truth. It would be suspicious if it didn't meander.The Meander (aka Menderes) is a river in Turkey. As you might expect, it winds all over the place. But it doesn't do this out of frivolity.",
      "The path it has discovered is the most economical route to the sea. [6]The river's algorithm is simple. At each step, flow down. For the essayist this translates to: flow interesting. Of all the places to go next, choose the most interesting.",
      "One can't have quite as little foresight as a river. I always know generally what I want to write about. But not the specific conclusions I want to reach; from paragraph to paragraph I let the ideas take their course.This doesn't always work.",
      "Sometimes, like a river, one runs up against a wall. Then I do the same thing the river does: backtrack. At one point in this essay I found that after following a certain thread I ran out of ideas. I had to go back seven paragraphs and start over in another direction.Fundamentally an essay is a train of thought-- but a cleaned-up train of thought, as dialogue is cleaned-up conversation.",
      "Real thought, like real conversation, is full of false starts. It would be exhausting to read. You need to cut and fill to emphasize the central thread, like an illustrator inking over a pencil drawing.",
      "But don't change so much that you lose the spontaneity of the original.Err on the side of the river. An essay is not a reference work. It's not something you read looking for a specific answer, and feel cheated if you don't find it.",
      "I'd much rather read an essay that went off in an unexpected but interesting direction than one that plodded dutifully along a prescribed course.SurpriseSo what's interesting? For me, interesting means surprise.",
      "Interfaces, as Geoffrey James has said, should follow the principle of least astonishment. A button that looks like it will make a machine stop should make it stop, not speed up. Essays should do the opposite.",
      "Essays should aim for maximum surprise.I was afraid of flying for a long time and could only travel vicariously. When friends came back from faraway places, it wasn't just out of politeness that I asked what they saw.",
      "I really wanted to know. And I found the best way to get information out of them was to ask what surprised them. How was the place different from what they expected? This is an extremely useful question.",
      "You can ask it of the most unobservant people, and it will extract information they didn't even know they were recording.Surprises are things that you not only didn't know, but that contradict things you thought you knew.",
      "And so they're the most valuable sort of fact you can get. They're like a food that's not merely healthy, but counteracts the unhealthy effects of things you've already eaten.How do you find surprises?",
      "Well, therein lies half the work of essay writing. (The other half is expressing yourself well.) The trick is to use yourself as a proxy for the reader. You should only write about things you've thought about a lot.",
      "And anything you come across that surprises you, who've thought about the topic a lot, will probably surprise most readers.For example, in a recent essay I pointed out that because you can only judge computer programmers by working with them, no one knows who the best programmers are overall.",
      "I didn't realize this when I began that essay, and even now I find it kind of weird. That's what you're looking for.So if you want to write essays, you need two ingredients: a few topics you've thought about a lot, and some ability to ferret out the unexpected.What should you think about?",
      "My guess is that it doesn't matter-- that anything can be interesting if you get deeply enough into it. One possible exception might be things that have deliberately had all the variation sucked out of them, like working in fast food.",
      "In retrospect, was there anything interesting about working at Baskin-Robbins? Well, it was interesting how important color was to the customers. Kids a certain age would point into the case and say that they wanted yellow.",
      "Did they want French Vanilla or Lemon? They would just look at you blankly. They wanted yellow. And then there was the mystery of why the perennial favorite Pralines 'n' Cream was so appealing. (I think now it was the salt.) And the difference in the way fathers and mothers bought ice cream for their kids: the fathers like benevolent kings bestowing largesse, the mothers harried, giving in to pressure.",
      "So, yes, there does seem to be some material even in fast food.I didn't notice those things at the time, though. At sixteen I was about as observant as a lump of rock. I can see more now in the fragments of memory I preserve of that age than I could see at the time from having it all happening live, right in front of me.ObservationSo the ability to ferret out the unexpected must not merely be an inborn one.",
      "It must be something you can learn. How do you learn it?To some extent it's like learning history. When you first read history, it's just a whirl of names and dates. Nothing seems to stick. But the more you learn, the more hooks you have for new facts to stick onto-- which means you accumulate knowledge at an exponential rate.",
      "Once you remember that Normans conquered England in 1066, it will catch your attention when you hear that other Normans conquered southern Italy at about the same time. Which will make you wonder about Normandy, and take note when a third book mentions that Normans were not, like most of what is now called France, tribes that flowed in as the Roman empire collapsed, but Vikings (norman = north man) who arrived four centuries later in 911.",
      "Which makes it easier to remember that Dublin was also established by Vikings in the 840s. Etc, etc squared.Collecting surprises is a similar process. The more anomalies you've seen, the more easily you'll notice new ones.",
      "Which means, oddly enough, that as you grow older, life should become more and more surprising. When I was a kid, I used to think adults had it all figured out. I had it backwards. Kids are the ones who have it all figured out.",
      "They're just mistaken.When it comes to surprises, the rich get richer. But (as with wealth) there may be habits of mind that will help the process along. It's good to have a habit of asking questions, especially questions beginning with Why.",
      "But not in the random way that three year olds ask why. There are an infinite number of questions. How do you find the fruitful ones?I find it especially useful to ask why about things that seem wrong.",
      "For example, why should there be a connection between humor and misfortune? Why do we find it funny when a character, even one we like, slips on a banana peel? There's a whole essay's worth of surprises there for sure.If you want to notice things that seem wrong, you'll find a degree of skepticism helpful.",
      "I take it as an axiom that we're only achieving 1% of what we could. This helps counteract the rule that gets beaten into our heads as children: that things are the way they are because that is how things have to be.",
      "For example, everyone I've talked to while writing this essay felt the same about English classes-- that the whole process seemed pointless. But none of us had the balls at the time to hypothesize that it was, in fact, all a mistake.",
      "We all thought there was just something we weren't getting.I have a hunch you want to pay attention not just to things that seem wrong, but things that seem wrong in a humorous way. I'm always pleased when I see someone laugh as they read a draft of an essay.",
      "But why should I be? I'm aiming for good ideas. Why should good ideas be funny? The connection may be surprise. Surprises make us laugh, and surprises are what one wants to deliver.I write down things that surprise me in notebooks.",
      "I never actually get around to reading them and using what I've written, but I do tend to reproduce the same thoughts later. So the main value of notebooks may be what writing things down leaves in your head.People trying to be cool will find themselves at a disadvantage when collecting surprises.",
      "To be surprised is to be mistaken. And the essence of cool, as any fourteen year old could tell you, is nil admirari. When you're mistaken, don't dwell on it; just act like nothing's wrong and maybe no one will notice.One of the keys to coolness is to avoid situations where inexperience may make you look foolish.",
      "If you want to find surprises you should do the opposite. Study lots of different things, because some of the most interesting surprises are unexpected connections between different fields. For example, jam, bacon, pickles, and cheese, which are among the most pleasing of foods, were all originally intended as methods of preservation.",
      "And so were books and paintings.Whatever you study, include history-- but social and economic history, not political history. History seems to me so important that it's misleading to treat it as a mere field of study.",
      "Another way to describe it is all the data we have so far.Among other things, studying history gives one confidence that there are good ideas waiting to be discovered right under our noses. Swords evolved during the Bronze Age out of daggers, which (like their flint predecessors) had a hilt separate from the blade.",
      "Because swords are longer the hilts kept breaking off. But it took five hundred years before someone thought of casting hilt and blade as one piece.DisobedienceAbove all, make a habit of paying attention to things you're not supposed to, either because they're \"inappropriate,\" or not important, or not what you're supposed to be working on.",
      "If you're curious about something, trust your instincts. Follow the threads that attract your attention. If there's something you're really interested in, you'll find they have an uncanny way of leading back to it anyway, just as the conversation of people who are especially proud of something always tends to lead back to it.For example, I've always been fascinated by comb-overs, especially the extreme sort that make a man look as if he's wearing a beret made of his own hair.",
      "Surely this is a lowly sort of thing to be interested in-- the sort of superficial quizzing best left to teenage girls. And yet there is something underneath. The key question, I realized, is how does the comber-over not see how odd he looks?",
      "And the answer is that he got to look that way incrementally. What began as combing his hair a little carefully over a thin patch has gradually, over 20 years, grown into a monstrosity. Gradualness is very powerful.",
      "And that power can be used for constructive purposes too: just as you can trick yourself into looking like a freak, you can trick yourself into creating something so grand that you would never have dared to plan such a thing.",
      "Indeed, this is just how most good software gets created. You start by writing a stripped-down kernel (how hard can it be?) and gradually it grows into a complete operating system. Hence the next leap: could you do the same thing in painting, or in a novel?See what you can extract from a frivolous question?",
      "If there's one piece of advice I would give about writing essays, it would be: don't do as you're told. Don't believe what you're supposed to. Don't write the essay readers expect; one learns nothing from what one expects.",
      "And don't write the way they taught you to in school.The most important sort of disobedience is to write essays at all. Fortunately, this sort of disobedience shows signs of becoming rampant. It used to be that only a tiny number of officially approved writers were allowed to write essays.",
      "Magazines published few of them, and judged them less by what they said than who wrote them; a magazine might publish a story by an unknown writer if it was good enough, but if they published an essay on x it had to be by someone who was at least forty and whose job title had x in it.",
      "Which is a problem, because there are a lot of things insiders can't say precisely because they're insiders.The Internet is changing that. Anyone can publish an essay on the Web, and it gets judged, as any writing should, by what it says, not who wrote it.",
      "Who are you to write about x? You are whatever you wrote.Popular magazines made the period between the spread of literacy and the arrival of TV the golden age of the short story. The Web may well make this the golden age of the essay.",
      "And that's certainly not something I realized when I started writing this.Notes[1] I'm thinking of Oresme (c. 1323-82). But it's hard to pick a date, because there was a sudden drop-off in scholarship just as Europeans finished assimilating classical science.",
      "The cause may have been the plague of 1347; the trend in scientific progress matches the population curve.[2] Parker, William R. \"Where Do College English Departments Come From?\" College English 28 (1966-67), pp.",
      "339-351. Reprinted in Gray, Donald J. (ed). The Department of English at Indiana University Bloomington 1868-1970. Indiana University Publications.Daniels, Robert V. The University of Vermont: The First Two Hundred Years.",
      "University of Vermont, 1991.Mueller, Friedrich M. Letter to the Pall Mall Gazette. 1886/87. Reprinted in Bacon, Alan (ed). The Nineteenth-Century History of English Studies. Ashgate, 1998.[3] I'm compressing the story a bit.",
      "At first literature took a back seat to philology, which (a) seemed more serious and (b) was popular in Germany, where many of the leading scholars of that generation had been trained.In some cases the writing teachers were transformed in situ into English professors.",
      "Francis James Child, who had been Boylston Professor of Rhetoric at Harvard since 1851, became in 1876 the university's first professor of English.[4] Parker, op. cit., p. 25.[5] The undergraduate curriculum or trivium (whence \"trivial\") consisted of Latin grammar, rhetoric, and logic.",
      "Candidates for masters' degrees went on to study the quadrivium of arithmetic, geometry, music, and astronomy. Together these were the seven liberal arts.The study of rhetoric was inherited directly from Rome, where it was considered the most important subject.",
      "It would not be far from the truth to say that education in the classical world meant training landowners' sons to speak well enough to defend their interests in political and legal disputes.[6] Trevor Blackwell points out that this isn't strictly true, because the outside edges of curves erode faster.",
      "Thanks to Ken Anderson, Trevor Blackwell, Sarah Harlin, Jessica Livingston, Jackie McDonough, and Robert Morris for reading drafts of this.Russian TranslationSpanish TranslationJapanese TranslationHungarian TranslationTraditional Chinese Translation If you liked this, you may also like Hackers & Painters."
    ],
    "word_count": 4463,
    "paragraph_count": 93
  },
  "processed_at": "2025-07-26T19:08:26.288445",
  "paragraphs": [
    {
      "original": "September 2004Remember the essays you had to write in high school? Topic sentence, introductory paragraph, supporting paragraphs, conclusion. The conclusion being, say, that Ahab in Moby Dick was a Christ-like figure.Oy.",
      "translated": "2004年9月还记得你在高中时必须写的文章吗？主题句、引言段、支持段、结论。比如，结论可能是《白鲸记》中的亚哈船长是一个类似基督的人物。哎呀。"
    },
    {
      "original": "So I'm going to try to give the other side of the story: what an essay really is, and how you write one. Or at least, how I write one.ModsThe most obvious difference between real essays and the things one has to write in school is that real essays are not exclusively about English literature.",
      "translated": "所以，我要试着讲述事情的另一面：什么是真正的论文，以及如何写作。或者至少，讲述我是如何写作的。真正的论文与学校里必须写的那些东西之间最明显的区别在于，真正的论文并不局限于英语文学。"
    },
    {
      "original": "Certainly schools should teach students how to write. But due to a series of historical accidents the teaching of writing has gotten mixed together with the study of literature. And so all over the country students are writing not about how a baseball team with a small budget might compete with the Yankees, or the role of color in fashion, or what constitutes a good dessert, but about symbolism in Dickens.With the result that writing is made to seem boring and pointless.",
      "translated": "当然，学校应该教学生如何写作。但由于一系列的历史偶然，写作教学与文学研究混为一谈。因此，全国各地的学生写的不是关于一支预算有限的棒球队如何与扬基队竞争，或是色彩在时尚中的作用，或是构成一道好甜点的因素，而是狄更斯作品中的象征主义。结果，写作显得既乏味又毫无意义。"
    },
    {
      "original": "Who cares about symbolism in Dickens? Dickens himself would be more interested in an essay about color or baseball.How did things get this way? To answer that we have to go back almost a thousand years.",
      "translated": "谁在乎狄更斯作品中的象征主义？狄更斯本人可能更感兴趣于一篇关于色彩或棒球的文章。事情怎么会变成这样？要回答这个问题，我们必须回溯到近一千年前。"
    },
    {
      "original": "Around 1100, Europe at last began to catch its breath after centuries of chaos, and once they had the luxury of curiosity they rediscovered what we call \"the classics.\" The effect was rather as if we were visited by beings from another solar system.",
      "translated": "大约在1100年，欧洲终于从数世纪的混乱中喘过气来，一旦有了好奇心的奢侈，他们重新发现了我们称之为“古典”的东西。这种影响就像我们被来自另一个太阳系的生物访问一样。"
    },
    {
      "original": "These earlier civilizations were so much more sophisticated that for the next several centuries the main work of European scholars, in almost every field, was to assimilate what they knew.During this period the study of ancient texts acquired great prestige.",
      "translated": "这些早期文明是如此先进，以至于在接下来的几个世纪里，欧洲学者在几乎每一个领域的主要工作都是吸收他们已知的知识。在这段时间里，对古代文献的研究获得了极高的声望。"
    },
    {
      "original": "It seemed the essence of what scholars did. As European scholarship gained momentum it became less and less important; by 1350 someone who wanted to learn about science could find better teachers than Aristotle in his own era.",
      "translated": "这似乎就是学者们所做的事情的本质。随着欧洲学术的不断发展，这一点变得越来越不重要；到1350年，想要学习科学的人可以在他自己的时代找到比亚里士多德更好的老师。"
    },
    {
      "original": "[1] But schools change slower than scholarship. In the 19th century the study of ancient texts was still the backbone of the curriculum.The time was then ripe for the question: if the study of ancient texts is a valid field for scholarship, why not modern texts?",
      "translated": "但是，学校的变化比学术研究要慢。19世纪，古代文献的研究仍然是课程的核心。当时，提出这样的问题是恰逢其时：如果古代文献的研究是学术研究的一个有效领域，为什么现代文献不可以呢？"
    },
    {
      "original": "The answer, of course, is that the original raison d'etre of classical scholarship was a kind of intellectual archaeology that does not need to be done in the case of contemporary authors. But for obvious reasons no one wanted to give that answer.",
      "translated": "当然，答案是古典学研究最初的 raison d'etre（存在理由）是一种智力考古学，对于当代作者来说，这种研究没有必要进行。但出于显而易见的原因，没有人愿意给出这样的答案。"
    },
    {
      "original": "The archaeological work being mostly done, it implied that those studying the classics were, if not wasting their time, at least working on problems of minor importance.And so began the study of modern literature.",
      "translated": "考古工作大多已完成，这意味着那些研究古典文献的人，如果不是在浪费时间，至少也是在研究次要的问题。于是，现代文学的研究开始了。"
    },
    {
      "original": "There was a good deal of resistance at first. The first courses in English literature seem to have been offered by the newer colleges, particularly American ones. Dartmouth, the University of Vermont, Amherst, and University College, London taught English literature in the 1820s.",
      "translated": "最初遇到了相当大的阻力。第一批英语文学课程似乎是由一些较新的学院，尤其是美国的学院提供的。达特茅斯学院、佛蒙特大学、阿默斯特学院和伦敦大学学院在1820年代教授英语文学。"
    },
    {
      "original": "But Harvard didn't have a professor of English literature until 1876, and Oxford not till 1885. (Oxford had a chair of Chinese before it had one of English.) [2]What tipped the scales, at least in the US, seems to have been the idea that professors should do research as well as teach.",
      "translated": "但哈佛大学直到1876年才有了英语文学教授，牛津大学则迟至1885年才有。（牛津大学在设立英语教席之前就已经有了汉学教席。）至少在美国，促使这一变化的原因似乎是教授除了教学还应该进行研究的想法。"
    },
    {
      "original": "This idea (along with the PhD, the department, and indeed the whole concept of the modern university) was imported from Germany in the late 19th century. Beginning at Johns Hopkins in 1876, the new model spread rapidly.Writing was one of the casualties.",
      "translated": "这一理念（连同博士学位、院系，以及现代大学的整个概念）是在19世纪末从德国引进的。自1876年约翰斯·霍普金斯大学开始，这一新模式迅速传播。写作成为了受害者之一。"
    },
    {
      "original": "Colleges had long taught English composition. But how do you do research on composition? The professors who taught math could be required to do original math, the professors who taught history could be required to write scholarly articles about history, but what about the professors who taught rhetoric or composition?",
      "translated": "大学长期以来一直教授英语写作。但如何对写作进行研究呢？教数学的教授可以被要求进行原创性的数学研究，教历史的教授可以被要求撰写关于历史的学术文章，那么教授修辞学或写作的教授呢？"
    },
    {
      "original": "What should they do research on? The closest thing seemed to be English literature. [3]And so in the late 19th century the teaching of writing was inherited by English professors. This had two drawbacks: (a) an expert on literature need not himself be a good writer, any more than an art historian has to be a good painter, and (b) the subject of writing now tends to be literature, since that's what the professor is interested in.High schools imitate universities.",
      "translated": "他们应该研究什么？最接近的似乎是英国文学。因此，在19世纪末，写作教学由英语教授继承。这有两个缺点：(a) 文学专家自己不一定是一个好作家，就像艺术史家不必是一个好画家一样；(b) 写作的主题现在倾向于文学，因为这是教授感兴趣的。高中模仿大学。"
    },
    {
      "original": "The seeds of our miserable high school experiences were sown in 1892, when the National Education Association \"formally recommended that literature and composition be unified in the high school course.\" [4] The 'riting component of the 3 Rs then morphed into English, with the bizarre consequence that high school students now had to write about English literature-- to write, without even realizing it, imitations of whatever English professors had been publishing in their journals a few decades before.It's no wonder if this seems to the student a pointless exercise, because we're now three steps removed from real work: the students are imitating English professors, who are imitating classical scholars, who are merely the inheritors of a tradition growing out of what was, 700 years ago, fascinating and urgently needed work.No DefenseThe other big difference between a real essay and the things they make you write in school is that a real essay doesn't take a position and then defend it.",
      "translated": "我们痛苦的高中经历的种子在1892年就被埋下了，当时国家教育协会“正式建议在高中课程中将文学和写作统一。”[4] 3R中的“写作”部分随后演变成了英语，产生了奇怪的结果，即高中生现在必须写关于英国文学的文章——在他们甚至没有意识到的情况下，模仿了几十年前英语教授在期刊上发表的内容。难怪学生们会觉得这是一项毫无意义的练习，因为我们现在距离实际工作已有三步之遥：学生们在模仿英语教授，而英语教授又在模仿古典学者，而古典学者只不过是700年前那些既迷人又迫切需要的工作的继承者。没有辩护在真正的论文和学校里让你写的那些东西之间还有一个重要的区别，那就是真正的论文不会先采取一个立场然后去辩护它。"
    },
    {
      "original": "That principle, like the idea that we ought to be writing about literature, turns out to be another intellectual hangover of long forgotten origins.It's often mistakenly believed that medieval universities were mostly seminaries.",
      "translated": "那个原则，就像我们应该写作关于文学的观点一样，结果证明是另一种源自早已遗忘的过去的智识残留。人们常常错误地认为中世纪的大学主要是神学院。"
    },
    {
      "original": "In fact they were more law schools. And at least in our tradition lawyers are advocates, trained to take either side of an argument and make as good a case for it as they can. Whether cause or effect, this spirit pervaded early universities.",
      "translated": "事实上，它们更多的是法学院。至少按照我们的传统，律师是辩护人，受过训练可以站在辩论的任一方，并尽可能为该方提出有力的论据。无论这是原因还是结果，这种精神弥漫了早期的大学。"
    },
    {
      "original": "The study of rhetoric, the art of arguing persuasively, was a third of the undergraduate curriculum. [5] And after the lecture the most common form of discussion was the disputation. This is at least nominally preserved in our present-day thesis defense: most people treat the words thesis and dissertation as interchangeable, but originally, at least, a thesis was a position one took and the dissertation was the argument by which one defended it.Defending a position may be a necessary evil in a legal dispute, but it's not the best way to get at the truth, as I think lawyers would be the first to admit.",
      "translated": "修辞学，即说服性辩论的艺术，占本科课程的三分之一。[5] 而讲座之后最常见的讨论形式是辩论。这种形式在我们今天的论文答辩中至少名义上得以保留：大多数人将“论文”和“毕业论文”视为可互换的词汇，但最初，“论文”是指一个立场，而“毕业论文”则是用来捍卫这一立场的论据。在法律纠纷中捍卫一个立场可能是必要的恶，但就我所知，律师们或许会首先承认，这并不是寻求真相的最佳方式。"
    },
    {
      "original": "It's not just that you miss subtleties this way. The real problem is that you can't change the question.And yet this principle is built into the very structure of the things they teach you to write in high school.",
      "translated": "不仅仅是你会这样错过细节。真正的问题在于你无法改变问题。然而，这一原则却融入了高中教你写作的结构之中。"
    },
    {
      "original": "The topic sentence is your thesis, chosen in advance, the supporting paragraphs the blows you strike in the conflict, and the conclusion-- uh, what is the conclusion? I was never sure about that in high school.",
      "translated": "主题句就是你事先选定的论点，支持段落是你在论战中所出的招数，而结论——呃，结论是什么呢？我在高中的时候对此一直不太确定。"
    },
    {
      "original": "It seemed as if we were just supposed to restate what we said in the first paragraph, but in different enough words that no one could tell. Why bother? But when you understand the origins of this sort of \"essay,\" you can see where the conclusion comes from.",
      "translated": "似乎我们只是应该用不同到足以让人无法察觉的词语重述第一段的内容。何必呢？但当你理解了这种“论文”的由来时，就能明白结论是如何得出来的。"
    },
    {
      "original": "It's the concluding remarks to the jury.Good writing should be convincing, certainly, but it should be convincing because you got the right answers, not because you did a good job of arguing. When I give a draft of an essay to friends, there are two things I want to know: which parts bore them, and which seem unconvincing.",
      "translated": "这是对陪审团的总结陈词。好的写作当然应该是有说服力的，但应该是因为你得出了正确的答案，而不是因为你辩论得很好。当我把一篇论文的草稿给朋友们看时，我想要知道两件事：哪些部分让他们感到枯燥，哪些部分看起来不够有说服力。"
    },
    {
      "original": "The boring bits can usually be fixed by cutting. But I don't try to fix the unconvincing bits by arguing more cleverly. I need to talk the matter over.At the very least I must have explained something badly.",
      "translated": "枯燥的部分通常可以通过删减来解决。但我不会试图通过更巧妙的争论来修补那些令人不信服的部分。我需要把事情说清楚。至少，我一定是某些地方解释得不好。"
    },
    {
      "original": "In that case, in the course of the conversation I'll be forced to come up a with a clearer explanation, which I can just incorporate in the essay. More often than not I have to change what I was saying as well.",
      "translated": "在这种情况下，在对话过程中我将不得不提出一个更清晰的解释，我可以直接将其纳入文章中。更多时候，我还不得不改变我原本的说法。"
    },
    {
      "original": "But the aim is never to be convincing per se. As the reader gets smarter, convincing and true become identical, so if I can convince smart readers I must be near the truth.The sort of writing that attempts to persuade may be a valid (or at least inevitable) form, but it's historically inaccurate to call it an essay.",
      "translated": "但目的从来不是为了单纯地说服。随着读者变得越来越聪明，说服和真实变得越来越一致，因此如果我能说服聪明的读者，那我一定离真理不远了。试图说服人的写作或许是一种有效（或至少是不可避免的）形式，但称之为散文在历史上是不准确的。"
    },
    {
      "original": "An essay is something else.TryingTo understand what a real essay is, we have to reach back into history again, though this time not so far. To Michel de Montaigne, who in 1580 published a book of what he called \"essais.\" He was doing something quite different from what lawyers do, and the difference is embodied in the name.",
      "translated": "一篇文章是另一种东西。为了理解什么是真正的文章，我们再次需要追溯历史，不过这次不必追溯得太远。米歇尔·德·蒙田在1580年出版了一本书，书中的作品他称之为“随笔”。他所做的与律师截然不同，这种差异也体现在名称上。"
    },
    {
      "original": "Essayer is the French verb meaning \"to try\" and an essai is an attempt. An essay is something you write to try to figure something out.Figure out what? You don't know yet. And so you can't begin with a thesis, because you don't have one, and may never have one.",
      "translated": "Essayer 是法语动词，意思是“尝试”，而 essai 则是指一次尝试。一篇文章是你写下来试图弄清楚某些事情的东西。弄清楚什么？你还不知道。因此你不能从一个论点开始，因为你还没有，也许永远都不会有。"
    },
    {
      "original": "An essay doesn't begin with a statement, but with a question. In a real essay, you don't take a position and defend it. You notice a door that's ajar, and you open it and walk in to see what's inside.If all you want to do is figure things out, why do you need to write anything, though?",
      "translated": "一篇论文不是从陈述开始，而是从一个问题开始。在真正的论文中，你不是先确定一个立场然后去捍卫它。你会注意到一扇半开的门，然后打开它，走进去看看里面有什么。如果你只是想弄清楚事情，为什么还需要写下来呢？"
    },
    {
      "original": "Why not just sit and think? Well, there precisely is Montaigne's great discovery. Expressing ideas helps to form them. Indeed, helps is far too weak a word. Most of what ends up in my essays I only thought of when I sat down to write them.",
      "translated": "为什么不能\"Just sit and think\"呢？这正是蒙田的伟大发现所在。表达思想有助于形成思想。事实上，说有助于都太轻了。我文章中的大部分内容都是在我坐下来写作时才想到的。"
    },
    {
      "original": "That's why I write them.In the things you write in school you are, in theory, merely explaining yourself to the reader. In a real essay you're writing for yourself. You're thinking out loud.But not quite.",
      "translated": "这就是我写作的原因。在学校里写的作业，理论上你只是向读者解释自己。而在真正的散文中，你是为自己而写。你在自言自语。但又不尽然。"
    },
    {
      "original": "Just as inviting people over forces you to clean up your apartment, writing something that other people will read forces you to think well. So it does matter to have an audience. The things I've written just for myself are no good.",
      "translated": "就像邀请别人来家里做客会让你打扫房间一样，写给别人看的东西也会迫使你好好思考。因此，有读者确实很重要。我只为自己的写作都不怎么样。"
    },
    {
      "original": "They tend to peter out. When I run into difficulties, I find I conclude with a few vague questions and then drift off to get a cup of tea.Many published essays peter out in the same way. Particularly the sort written by the staff writers of newsmagazines.",
      "translated": "它们往往会逐渐减弱。当我遇到困难时，我发现我会以几个模糊的问题结束，然后去泡一杯茶。许多已发表的散文也是以同样的方式逐渐减弱，尤其是新闻杂志的编辑们所写的文章。"
    },
    {
      "original": "Outside writers tend to supply editorials of the defend-a-position variety, which make a beeline toward a rousing (and foreordained) conclusion. But the staff writers feel obliged to write something \"balanced.\" Since they're writing for a popular magazine, they start with the most radioactively controversial questions, from which-- because they're writing for a popular magazine-- they then proceed to recoil in terror.",
      "translated": "外部撰稿人往往提供的是立场辩护类的社论，这类文章直奔一个激昂（且预设的）结论。但内部撰稿人觉得有义务写出“平衡”的内容。由于他们是在为一本大众杂志写作，他们通常从最具争议的问题入手，但随即——因为他们是在为一本大众杂志写作——又因恐惧而退缩。"
    },
    {
      "original": "Abortion, for or against? This group says one thing. That group says another. One thing is certain: the question is a complex one. (But don't get mad at us. We didn't draw any conclusions.)The RiverQuestions aren't enough.",
      "translated": "堕胎，支持还是反对？这个群体说一种观点，那个群体说另一种。有一件事是确定的：这个问题很复杂。（但别对我们生气。我们没有下任何结论。）《河流》问题不止于此。"
    },
    {
      "original": "An essay has to come up with answers. They don't always, of course. Sometimes you start with a promising question and get nowhere. But those you don't publish. Those are like experiments that get inconclusive results.",
      "translated": "一篇论文必须得出结论。当然，并非总是如此。有时你从一个有前景的问题开始，却一无所获。但这些你不会发表。这些就像实验得出了不确定的结果。"
    },
    {
      "original": "An essay you publish ought to tell the reader something he didn't already know.But what you tell him doesn't matter, so long as it's interesting. I'm sometimes accused of meandering. In defend-a-position writing that would be a flaw.",
      "translated": "你发表的文章应该告诉读者一些他原本不知道的事情。但你告诉他什么并不重要，只要有趣就行。我有时会被指责为离题太远。在立场辩护的写作中，这确实是一个缺点。"
    },
    {
      "original": "There you're not concerned with truth. You already know where you're going, and you want to go straight there, blustering through obstacles, and hand-waving your way across swampy ground. But that's not what you're trying to do in an essay.",
      "translated": "在那里，你并不关心真相。你已经知道你要去的地方，只想径直前往，冲破障碍，挥挥手就跨过泥泞之地。但这并不是你在写文章时所要做的事情。"
    },
    {
      "original": "An essay is supposed to be a search for truth. It would be suspicious if it didn't meander.The Meander (aka Menderes) is a river in Turkey. As you might expect, it winds all over the place. But it doesn't do this out of frivolity.",
      "translated": "一篇论文应当是对真理的探索。如果它没有曲折蜿蜒，反而会显得可疑。梅安德河（又称门德雷斯河）是土耳其的一条河流。正如你所料，它四处蜿蜒。但这并不是出于轻浮。"
    },
    {
      "original": "The path it has discovered is the most economical route to the sea. [6]The river's algorithm is simple. At each step, flow down. For the essayist this translates to: flow interesting. Of all the places to go next, choose the most interesting.",
      "translated": "它发现的路径是到达大海最经济的路线。河流的算法很简单。每一步，向下流淌。对于散文作家来说，这转化为：流淌有趣。在所有可能去的地方中，选择最有趣的地方。"
    },
    {
      "original": "One can't have quite as little foresight as a river. I always know generally what I want to write about. But not the specific conclusions I want to reach; from paragraph to paragraph I let the ideas take their course.This doesn't always work.",
      "translated": "一个人不能像河流那样毫无远见。我通常知道自己大致要写些什么。但并不是具体的结论；从一个段落到另一个段落，我让想法自由发展。这并不总是奏效。"
    },
    {
      "original": "Sometimes, like a river, one runs up against a wall. Then I do the same thing the river does: backtrack. At one point in this essay I found that after following a certain thread I ran out of ideas. I had to go back seven paragraphs and start over in another direction.Fundamentally an essay is a train of thought-- but a cleaned-up train of thought, as dialogue is cleaned-up conversation.",
      "translated": "有时候，就像一条河流遇到一堵墙一样，人也会碰到障碍。这时我就会像河流那样：溯流而上。在这篇文章的某个阶段，我发现沿着一条思路继续下去后，思维枯竭了。我不得不回到前七个段落，重新寻找另一个方向。从根本上说，一篇文章是一系列思想——但它是经过整理的思想，就像对话是经过整理的交谈一样。"
    },
    {
      "original": "Real thought, like real conversation, is full of false starts. It would be exhausting to read. You need to cut and fill to emphasize the central thread, like an illustrator inking over a pencil drawing.",
      "translated": "真正的思考，就像真正的对话一样，充满了不成功的尝试。读起来会让人感到疲惫。你需要删减和补充，以突出主线，就像插画师在铅笔草图上用墨水勾勒一样。"
    },
    {
      "original": "But don't change so much that you lose the spontaneity of the original.Err on the side of the river. An essay is not a reference work. It's not something you read looking for a specific answer, and feel cheated if you don't find it.",
      "translated": "但也不要改变得太多，以至于失去了原文的自然流畅。宁可在河边出错。文章不是参考书，不是你为了寻找特定答案去读的东西，如果找不到答案也不会感到失望。"
    },
    {
      "original": "I'd much rather read an essay that went off in an unexpected but interesting direction than one that plodded dutifully along a prescribed course.SurpriseSo what's interesting? For me, interesting means surprise.",
      "translated": "我更愿意读一篇出人意料但有趣的文章，而不是一篇循规蹈矩、按部就班的作品。那么，什么才算是有趣的？对我来说，有趣就意味着意外。"
    },
    {
      "original": "Interfaces, as Geoffrey James has said, should follow the principle of least astonishment. A button that looks like it will make a machine stop should make it stop, not speed up. Essays should do the opposite.",
      "translated": "接口，正如杰弗里·詹姆斯所说，应该遵循最小惊讶原则。一个看起来会让机器停止的按钮应该让它停止，而不是加速。文章则应该相反。"
    },
    {
      "original": "Essays should aim for maximum surprise.I was afraid of flying for a long time and could only travel vicariously. When friends came back from faraway places, it wasn't just out of politeness that I asked what they saw.",
      "translated": "文章应力求出其不意。我长期以来一直害怕飞行，只能通过他人体验旅行。当朋友们从远方归来时，我向他们询问所见所闻，并非仅出于礼貌。"
    },
    {
      "original": "I really wanted to know. And I found the best way to get information out of them was to ask what surprised them. How was the place different from what they expected? This is an extremely useful question.",
      "translated": "我真的很想知道。我发现从他们那里获取信息的最好方法是问他们什么让他们感到惊讶。这个地方与他们的预期有何不同？这是一个极其有用的问题。"
    },
    {
      "original": "You can ask it of the most unobservant people, and it will extract information they didn't even know they were recording.Surprises are things that you not only didn't know, but that contradict things you thought you knew.",
      "translated": "你可以向最不注意细节的人询问，它能够提取出他们自己都不知道已经记录下来的信息。惊喜不仅是你不知道的事情，而且是与你自认为知道的事情相矛盾的事情。"
    },
    {
      "original": "And so they're the most valuable sort of fact you can get. They're like a food that's not merely healthy, but counteracts the unhealthy effects of things you've already eaten.How do you find surprises?",
      "translated": "因此，它们是你能得到的最有价值的事实。它们就像一种不仅健康，还能抵消你已经摄入的不健康物质影响的食物。如何找到惊喜？"
    },
    {
      "original": "Well, therein lies half the work of essay writing. (The other half is expressing yourself well.) The trick is to use yourself as a proxy for the reader. You should only write about things you've thought about a lot.",
      "translated": "嗯，这正是作文写作的一半功夫所在。（另一半则是良好的自我表达。）关键在于把自己当作读者的代表。你应该只写那些你思考了很多的事情。"
    },
    {
      "original": "And anything you come across that surprises you, who've thought about the topic a lot, will probably surprise most readers.For example, in a recent essay I pointed out that because you can only judge computer programmers by working with them, no one knows who the best programmers are overall.",
      "translated": "你遇到的任何让你这个对该主题思考良多的人都感到惊讶的事情，很可能也会让大多数读者感到惊讶。例如，在我最近的一篇文章中，我指出，由于只能通过与计算机程序员合作来评判他们，因此没有人知道总体上谁是最好的程序员。"
    },
    {
      "original": "I didn't realize this when I began that essay, and even now I find it kind of weird. That's what you're looking for.So if you want to write essays, you need two ingredients: a few topics you've thought about a lot, and some ability to ferret out the unexpected.What should you think about?",
      "translated": "我在开始写那篇文章时并没有意识到这一点，即使现在我仍然觉得有些奇怪。这就是你所寻找的。所以，如果你想写文章，你需要两个要素：一些你思考过很多的话题，以及挖掘意外发现的能力。你应该思考些什么呢？"
    },
    {
      "original": "My guess is that it doesn't matter-- that anything can be interesting if you get deeply enough into it. One possible exception might be things that have deliberately had all the variation sucked out of them, like working in fast food.",
      "translated": "我的猜测是这并不重要——只要你深入其中，任何事情都可能变得有趣。一个可能的例外或许是那些刻意将所有变化消除的事情，比如在快餐行业工作。"
    },
    {
      "original": "In retrospect, was there anything interesting about working at Baskin-Robbins? Well, it was interesting how important color was to the customers. Kids a certain age would point into the case and say that they wanted yellow.",
      "translated": "回想起来，在巴斯金·罗宾斯工作有什么有趣的事情吗？嗯，有趣的是顾客对颜色有多么重视。某个年龄段的孩子会指着展示柜说他们想要黄色的。"
    },
    {
      "original": "Did they want French Vanilla or Lemon? They would just look at you blankly. They wanted yellow. And then there was the mystery of why the perennial favorite Pralines 'n' Cream was so appealing. (I think now it was the salt.) And the difference in the way fathers and mothers bought ice cream for their kids: the fathers like benevolent kings bestowing largesse, the mothers harried, giving in to pressure.",
      "translated": "他们想要法式香草还是柠檬？他们只会茫然地看着你。他们要的是黄色的。然后是为什么常年受欢迎的太妃糖奶油如此吸引人，这成了一个谜。（现在我觉得是盐的缘故。）还有父亲和母亲为孩子买冰淇淋的方式不同：父亲像仁慈的国王慷慨赐予，而母亲则显得忙乱，是在屈服于压力。"
    },
    {
      "original": "So, yes, there does seem to be some material even in fast food.I didn't notice those things at the time, though. At sixteen I was about as observant as a lump of rock. I can see more now in the fragments of memory I preserve of that age than I could see at the time from having it all happening live, right in front of me.ObservationSo the ability to ferret out the unexpected must not merely be an inborn one.",
      "translated": "所以，是的，即使在快餐中也似乎有些材料。不过，当时我并没有注意到这些。十六岁时，我的观察力大概和一块石头差不多。现在，通过我保留的那年岁的记忆碎片，我能看出更多东西，而当时即使一切都在我眼前发生，我也没能察觉到。观察因此，发现意外的能力不仅仅是一种与生俱来的能力。"
    },
    {
      "original": "It must be something you can learn. How do you learn it?To some extent it's like learning history. When you first read history, it's just a whirl of names and dates. Nothing seems to stick. But the more you learn, the more hooks you have for new facts to stick onto-- which means you accumulate knowledge at an exponential rate.",
      "translated": "这必须是你能够学习的东西。你是如何学习它的呢？在某种程度上，这就像学习历史一样。当你第一次读历史时，只是一连串的名字和日期。似乎什么也记不住。但你学得越多，就会有越多的知识点可以让你记住新的事实——这意味着你的知识积累将以指数速度增长。"
    },
    {
      "original": "Once you remember that Normans conquered England in 1066, it will catch your attention when you hear that other Normans conquered southern Italy at about the same time. Which will make you wonder about Normandy, and take note when a third book mentions that Normans were not, like most of what is now called France, tribes that flowed in as the Roman empire collapsed, but Vikings (norman = north man) who arrived four centuries later in 911.",
      "translated": "一旦你记住了诺曼人于1066年征服英格兰，当你听说大约同一时期其他诺曼人征服了南意大利时，这会吸引你的注意。这会让你对诺曼底产生好奇，并在第三本书提到诺曼人并不是像现今法国大部分地区那样，在罗马帝国崩溃时涌入的部落，而是维京人（诺曼 = 北方人），他们在四世纪后的911年抵达时，你就会更加留意。"
    },
    {
      "original": "Which makes it easier to remember that Dublin was also established by Vikings in the 840s. Etc, etc squared.Collecting surprises is a similar process. The more anomalies you've seen, the more easily you'll notice new ones.",
      "translated": "这使得人们更容易记住都柏林是在9世纪40年代由维京人建立的。等等，等等的平方。收集意外发现是一个类似的过程。你见过的异常现象越多，就越容易注意到新的异常。"
    },
    {
      "original": "Which means, oddly enough, that as you grow older, life should become more and more surprising. When I was a kid, I used to think adults had it all figured out. I had it backwards. Kids are the ones who have it all figured out.",
      "translated": "这意味着，奇怪的是，随着年龄的增长，生活应该变得越来越令人惊讶。当我还是个孩子的时候，我曾经以为大人们把一切都搞定了。我弄反了。孩子们才是那些把一切都搞定了的人。"
    },
    {
      "original": "They're just mistaken.When it comes to surprises, the rich get richer. But (as with wealth) there may be habits of mind that will help the process along. It's good to have a habit of asking questions, especially questions beginning with Why.",
      "translated": "他们只是错了。说到惊喜，富人会越来越富。但是（就像财富一样），可能有一些思维习惯可以促进这一过程。养成提问的习惯是好的，尤其是那些以“为什么”开头的问题。"
    },
    {
      "original": "But not in the random way that three year olds ask why. There are an infinite number of questions. How do you find the fruitful ones?I find it especially useful to ask why about things that seem wrong.",
      "translated": "但并不是像三岁小孩那样随意地问为什么。问题有无数个，但如何找到那些富有成效的问题呢？我发现特别有用的是对那些看似不对的事情提出为什么。"
    },
    {
      "original": "For example, why should there be a connection between humor and misfortune? Why do we find it funny when a character, even one we like, slips on a banana peel? There's a whole essay's worth of surprises there for sure.If you want to notice things that seem wrong, you'll find a degree of skepticism helpful.",
      "translated": "例如，为什么幽默和不幸之间会有联系？为什么我们会觉得一个角色，即使是自己喜欢的角色，踩到香蕉皮滑倒很有趣？这其中确实有许多值得探讨的惊喜。如果你想注意到那些看似不对劲的事情，一定程度的怀疑态度会有所帮助。"
    },
    {
      "original": "I take it as an axiom that we're only achieving 1% of what we could. This helps counteract the rule that gets beaten into our heads as children: that things are the way they are because that is how things have to be.",
      "translated": "我将以下观点视为公理：我们目前只实现了潜在能力的1%。这有助于抵消我们在童年时被灌输的一种规则：事情之所以如此，是因为它们必须如此。"
    },
    {
      "original": "For example, everyone I've talked to while writing this essay felt the same about English classes-- that the whole process seemed pointless. But none of us had the balls at the time to hypothesize that it was, in fact, all a mistake.",
      "translated": "例如，我写这篇论文时与每个人都谈过，他们都对英语课有同样的感受——整个过程似乎毫无意义。但当时我们谁也没有勇气假设这实际上是一个错误。"
    },
    {
      "original": "We all thought there was just something we weren't getting.I have a hunch you want to pay attention not just to things that seem wrong, but things that seem wrong in a humorous way. I'm always pleased when I see someone laugh as they read a draft of an essay.",
      "translated": "我们都觉得有些事情我们还没有弄明白。我有一种预感，你不仅要关注那些看似不对的地方，还要关注那些以幽默方式显得不对的地方。每当我看到有人在阅读一篇论文的草稿时笑了，我总是感到很高兴。"
    },
    {
      "original": "But why should I be? I'm aiming for good ideas. Why should good ideas be funny? The connection may be surprise. Surprises make us laugh, and surprises are what one wants to deliver.I write down things that surprise me in notebooks.",
      "translated": "但为什么我应该这样呢？我追求的是好想法。为什么好想法一定要有趣呢？这之间的联系可能是出乎意料。出乎意料的事情会让我们发笑，而出乎意料正是我们想要传达的。我在笔记本上记录下那些让我感到意外的事情。"
    },
    {
      "original": "I never actually get around to reading them and using what I've written, but I do tend to reproduce the same thoughts later. So the main value of notebooks may be what writing things down leaves in your head.People trying to be cool will find themselves at a disadvantage when collecting surprises.",
      "translated": "我从未真正去阅读和使用自己写下的内容，但后来确实会重复相同的想法。所以，笔记本的主要价值可能在于写下东西后留在你脑海中的东西。那些试图装酷的人在收集意外惊喜时会发现自己处于不利地位。"
    },
    {
      "original": "To be surprised is to be mistaken. And the essence of cool, as any fourteen year old could tell you, is nil admirari. When you're mistaken, don't dwell on it; just act like nothing's wrong and maybe no one will notice.One of the keys to coolness is to avoid situations where inexperience may make you look foolish.",
      "translated": "感到惊讶就是犯错。而酷的本质，任何14岁的孩子都能告诉你，就是无动于衷。当你犯错时，不要耿耿于怀；只要表现得像什么都没发生，也许没有人会注意到。酷的一个关键就是避免那些可能因为缺乏经验而让你显得愚蠢的情境。"
    },
    {
      "original": "If you want to find surprises you should do the opposite. Study lots of different things, because some of the most interesting surprises are unexpected connections between different fields. For example, jam, bacon, pickles, and cheese, which are among the most pleasing of foods, were all originally intended as methods of preservation.",
      "translated": "如果你想寻找惊喜，就应该反其道而行之。研究许多不同的领域，因为一些最有趣的惊喜往往来自于不同领域之间的意外联系。例如，果酱、培根、泡菜和奶酪，这些最令人愉悦的食物，最初都是作为保存方法而发明的。"
    },
    {
      "original": "And so were books and paintings.Whatever you study, include history-- but social and economic history, not political history. History seems to me so important that it's misleading to treat it as a mere field of study.",
      "translated": "书籍和画作亦是如此。无论你学习什么，都要包括历史——但应是社会和经济史，而非政治史。在我看来，历史如此重要，以至于将其仅仅视为一个研究领域是具有误导性的。"
    },
    {
      "original": "Another way to describe it is all the data we have so far.Among other things, studying history gives one confidence that there are good ideas waiting to be discovered right under our noses. Swords evolved during the Bronze Age out of daggers, which (like their flint predecessors) had a hilt separate from the blade.",
      "translated": "另一种描述方式是迄今为止我们掌握的所有数据。研究历史的另一个好处是，它能让人相信有许多好想法正等着我们去发现，这些想法可能就在我们的眼皮子底下。剑是在青铜时代从匕首演变而来的，而匕首（像其石刃前身一样）的柄与blade（刃）是分开的。"
    },
    {
      "original": "Because swords are longer the hilts kept breaking off. But it took five hundred years before someone thought of casting hilt and blade as one piece.DisobedienceAbove all, make a habit of paying attention to things you're not supposed to, either because they're \"inappropriate,\" or not important, or not what you're supposed to be working on.",
      "translated": "因为剑身较长，剑柄经常断裂。但直到五百年后，才有人想到将剑柄和剑身铸成一体。不服从最重要的是，养成关注那些你不应该关注的事情的习惯，无论是因为它们“不恰当”，不重要，还是不是你应该在做的事情。"
    },
    {
      "original": "If you're curious about something, trust your instincts. Follow the threads that attract your attention. If there's something you're really interested in, you'll find they have an uncanny way of leading back to it anyway, just as the conversation of people who are especially proud of something always tends to lead back to it.For example, I've always been fascinated by comb-overs, especially the extreme sort that make a man look as if he's wearing a beret made of his own hair.",
      "translated": "如果你对某件事感到好奇，就相信你的直觉。追随那些吸引你注意力的线索。如果你对某件事真的感兴趣，你会发现它们总会以一种不可思议的方式引导你回到那个话题，就像那些特别自豪于某件事的人，谈话总会不自觉地回到那个话题上。例如，我一直对梳头遮掩头发的行为着迷，尤其是那些极端的情况，让一个人看起来仿佛戴着一顶由自己头发制成的贝雷帽。"
    },
    {
      "original": "Surely this is a lowly sort of thing to be interested in-- the sort of superficial quizzing best left to teenage girls. And yet there is something underneath. The key question, I realized, is how does the comber-over not see how odd he looks?",
      "translated": "这确实是一种低级的兴趣——那种表面化的测验最好留给十几岁的女孩子。然而，其中却有某些深层的东西。我意识到，关键的问题是：这个梳头的人怎么不觉得自己看起来很奇怪？"
    },
    {
      "original": "And the answer is that he got to look that way incrementally. What began as combing his hair a little carefully over a thin patch has gradually, over 20 years, grown into a monstrosity. Gradualness is very powerful.",
      "translated": "答案是他逐渐变成了这样。最初只是稍微仔细地把头发梳到稀疏的地方，但在20年的时间里，这逐渐演变成了一种怪状。渐变的力量非常强大。"
    },
    {
      "original": "And that power can be used for constructive purposes too: just as you can trick yourself into looking like a freak, you can trick yourself into creating something so grand that you would never have dared to plan such a thing.",
      "translated": "这种力量也可以用于建设性目的：就像你可以让自己看起来像个怪胎一样，你也可以让自己创造出一些宏伟到你从未敢计划过的东西。"
    },
    {
      "original": "Indeed, this is just how most good software gets created. You start by writing a stripped-down kernel (how hard can it be?) and gradually it grows into a complete operating system. Hence the next leap: could you do the same thing in painting, or in a novel?See what you can extract from a frivolous question?",
      "translated": "确实，这正是大多数优秀软件的创建方式。你先写出一个精简的内核（有多难呢？），然后它逐渐发展成为一个完整的操作系统。因此，下一个飞跃是：你能否在绘画或小说创作中也这样做呢？看看你能从一个看似轻率的问题中提炼出什么？"
    },
    {
      "original": "If there's one piece of advice I would give about writing essays, it would be: don't do as you're told. Don't believe what you're supposed to. Don't write the essay readers expect; one learns nothing from what one expects.",
      "translated": "如果我有一条关于写作文的建议，那就是：不要照着别人说的去做。不要相信所谓的正确观念。不要写读者期待的作文；从预期中人们学不到任何东西。"
    },
    {
      "original": "And don't write the way they taught you to in school.The most important sort of disobedience is to write essays at all. Fortunately, this sort of disobedience shows signs of becoming rampant. It used to be that only a tiny number of officially approved writers were allowed to write essays.",
      "translated": "不要用学校教的那种方式来写作。最重要的一种不遵从就是写散文本身。幸运的是，这种不遵从的迹象正变得越来越普遍。过去，只有少数经过官方认可的作家才被允许写散文。"
    },
    {
      "original": "Magazines published few of them, and judged them less by what they said than who wrote them; a magazine might publish a story by an unknown writer if it was good enough, but if they published an essay on x it had to be by someone who was at least forty and whose job title had x in it.",
      "translated": "杂志很少发表这些作品，而且评判的标准更多是作者而非内容；如果一个不知名作家的故事足够好，杂志可能会发表，但如果是一篇关于x的散文，则必须由至少四十岁且职位头衔中带有x的人来撰写。"
    },
    {
      "original": "Which is a problem, because there are a lot of things insiders can't say precisely because they're insiders.The Internet is changing that. Anyone can publish an essay on the Web, and it gets judged, as any writing should, by what it says, not who wrote it.",
      "translated": "这是一个问题，因为内部人士有很多事情不能说，恰恰因为他们是内部人士。互联网正在改变这一点。任何人都可以在网络上发表一篇文章，而文章的价值应该由其内容来评判，而不是作者的身份。"
    },
    {
      "original": "Who are you to write about x? You are whatever you wrote.Popular magazines made the period between the spread of literacy and the arrival of TV the golden age of the short story. The Web may well make this the golden age of the essay.",
      "translated": "你有什么资格写关于x的文章？你就是你所写的内容。大众杂志使识字普及和电视到来之间的时期成为了短篇小说的黄金时代。网络很可能使这个时代成为散文的黄金时代。"
    },
    {
      "original": "And that's certainly not something I realized when I started writing this.Notes[1] I'm thinking of Oresme (c. 1323-82). But it's hard to pick a date, because there was a sudden drop-off in scholarship just as Europeans finished assimilating classical science.",
      "translated": "而这绝对不是我在开始写作时意识到的。注[1] 我想到了奥雷姆（约1323-82年）。但是很难确定一个日期，因为就在欧洲人完成对古典科学的吸收之际，学术研究突然出现了断崖式的下降。"
    },
    {
      "original": "The cause may have been the plague of 1347; the trend in scientific progress matches the population curve.[2] Parker, William R. \"Where Do College English Departments Come From?\" College English 28 (1966-67), pp.",
      "translated": "原因可能是1347年的瘟疫；科学进步的趋势与人口曲线相吻合。[2] 帕克，威廉·R. “大学英语系是从哪里来的？”《大学英语》28（1966-67年），第"
    },
    {
      "original": "339-351. Reprinted in Gray, Donald J. (ed). The Department of English at Indiana University Bloomington 1868-1970. Indiana University Publications.Daniels, Robert V. The University of Vermont: The First Two Hundred Years.",
      "translated": "339-351。重印于 Gray, Donald J.（编）。《印第安纳大学布鲁明顿分校英语系1868-1970》。印第安纳大学出版物。Daniels, Robert V.《佛蒙特大学：最初的两百年》。"
    },
    {
      "original": "University of Vermont, 1991.Mueller, Friedrich M. Letter to the Pall Mall Gazette. 1886/87. Reprinted in Bacon, Alan (ed). The Nineteenth-Century History of English Studies. Ashgate, 1998.[3] I'm compressing the story a bit.",
      "translated": "佛蒙特大学，1991。穆勒，弗里德里希·M。致《帕尔马尔公报》的信。1886/87。重印于培根，艾伦（编）。《十九世纪英语研究史》。Ashgate出版社，1998。[3] 我在这里简化了故事。"
    },
    {
      "original": "At first literature took a back seat to philology, which (a) seemed more serious and (b) was popular in Germany, where many of the leading scholars of that generation had been trained.In some cases the writing teachers were transformed in situ into English professors.",
      "translated": "起初，文学研究的地位落后于语文学，后者（a）显得更为严肃，（b）在德国非常流行，而当时许多顶尖学者都在那里受过训练。在某些情况下，写作教师就地转变为英语教授。"
    },
    {
      "original": "Francis James Child, who had been Boylston Professor of Rhetoric at Harvard since 1851, became in 1876 the university's first professor of English.[4] Parker, op. cit., p. 25.[5] The undergraduate curriculum or trivium (whence \"trivial\") consisted of Latin grammar, rhetoric, and logic.",
      "translated": "弗朗西斯·詹姆斯·柴尔德自1851年起担任哈佛大学的博尔斯顿修辞学教授，1876年成为该校首位英语教授。[4] 帕克，同前引书，第25页。[5] 本科课程或三艺（由此衍生出“琐碎”一词）包括拉丁语语法、修辞学和逻辑学。"
    },
    {
      "original": "Candidates for masters' degrees went on to study the quadrivium of arithmetic, geometry, music, and astronomy. Together these were the seven liberal arts.The study of rhetoric was inherited directly from Rome, where it was considered the most important subject.",
      "translated": "攻读硕士学位的候选人继续学习算术、几何、音乐和天文学这四门学科，合称为七艺。修辞学则是直接从罗马继承而来，在那里它被认为是最重要的学科。"
    },
    {
      "original": "It would not be far from the truth to say that education in the classical world meant training landowners' sons to speak well enough to defend their interests in political and legal disputes.[6] Trevor Blackwell points out that this isn't strictly true, because the outside edges of curves erode faster.",
      "translated": "说古典世界的教育意味着训练土地所有者的儿子们，使他们能够口才足够好地在政治和法律纠纷中捍卫自己的利益，这并不算离谱。[6] 特雷弗·布莱克威尔指出，这并不完全正确，因为曲线的边缘侵蚀得更快。"
    },
    {
      "original": "Thanks to Ken Anderson, Trevor Blackwell, Sarah Harlin, Jessica Livingston, Jackie McDonough, and Robert Morris for reading drafts of this.Russian TranslationSpanish TranslationJapanese TranslationHungarian TranslationTraditional Chinese Translation If you liked this, you may also like Hackers & Painters.",
      "translated": "感谢 Ken Anderson、Trevor Blackwell、Sarah Harlin、Jessica Livingston、Jackie McDonough 和 Robert Morris 阅读本文的草稿。俄文翻译西班牙文翻译日文翻译匈牙利文翻译繁体中文翻译如果你喜欢这篇文章，你可能也会喜欢《黑客与画家》。"
    }
  ],
  "translation_completed": "2025-07-28T14:58:27.565878",
  "translation_stats": {
    "total_paragraphs": 93,
    "success_count": 93,
    "success_rate": "100.0%"
  }
}