{
  "title": "Haters",
  "title_zh": "[待翻译] Haters",
  "url": "https://www.paulgraham.com/fh.html",
  "filename": "fh.html",
  "date": "2020-10-06",
  "id": 81,
  "content": {
    "success": true,
    "paragraphs": [
      "January 2020(I originally intended this for startup founders, who are often surprised by the attention they get as their companies grow, but it applies equally to anyone who becomes famous.)If you become sufficiently famous, you'll acquire some fans who like you too much.",
      "These people are sometimes called \"fanboys,\" and though I dislike that term, I'm going to have to use it here. We need some word for them, because this is a distinct phenomenon from someone simply liking your work.A fanboy is obsessive and uncritical.",
      "Liking you becomes part of their identity, and they create an image of you in their own head that is much better than reality. Everything you do is good, because you do it. If you do something bad, they find a way to see it as good.",
      "And their love for you is not, usually, a quiet, private one. They want everyone to know how great you are.Well, you may be thinking, I could do without this kind of obsessive fan, but I know there are all kinds of people in the world, and if this is the worst consequence of fame, that's not so bad.Unfortunately this is not the worst consequence of fame.",
      "As well as fanboys, you'll have haters.A hater is obsessive and uncritical. Disliking you becomes part of their identity, and they create an image of you in their own head that is much worse than reality.",
      "Everything you do is bad, because you do it. If you do something good, they find a way to see it as bad. And their dislike for you is not, usually, a quiet, private one. They want everyone to know how awful you are.If you're thinking of checking, I'll save you the trouble.",
      "The second and fifth paragraphs are identical except for \"good\" being switched to \"bad\" and so on.I spent years puzzling about haters. What are they, and where do they come from? Then one day it dawned on me.",
      "Haters are just fanboys with the sign switched.Note that by haters, I don't simply mean trolls. I'm not talking about people who say bad things about you and then move on. I'm talking about the much smaller group of people for whom this becomes a kind of obsession and who do it repeatedly over a long period.Like fans, haters seem to be an automatic consequence of fame.",
      "Anyone sufficiently famous will have them. And like fans, haters are energized by the fame of whoever they hate. They hear a song by some pop singer. They don't like it much. If the singer were an obscure one, they'd just forget about it.",
      "But instead they keep hearing her name, and this seems to drive some people crazy. Everyone's always going on about this singer, but she's no good! She's a fraud!That word \"fraud\" is an important one.",
      "It's the spectral signature of a hater to regard the object of their hatred as a fraud. They can't deny their fame. Indeed, their fame is if anything exaggerated in the hater's mind. They notice every mention of the singer's name, because every mention makes them angrier.",
      "In their own minds they exaggerate both the singer's fame and her lack of talent, and the only way to reconcile those two ideas is to conclude that she has tricked everyone.What sort of people become haters?",
      "Can anyone become one? I'm not sure about this, but I've noticed some patterns. Haters are generally losers in a very specific sense: although they are occasionally talented, they have never achieved much.",
      "And indeed, anyone successful enough to have achieved significant fame would be unlikely to regard another famous person as a fraud on that account, because anyone famous knows how random fame is.But haters are not always complete losers.",
      "They are not always the proverbial guy living in his mom's basement. Many are, but some have some amount of talent. In fact I suspect that a sense of frustrated talent is what drives some people to become haters.",
      "They're not just saying \"It's unfair that so-and-so is famous,\" but \"It's unfair that so-and-so is famous, and not me.\"Could a hater be cured if they achieved something impressive? My guess is that's a moot point, because they never will.",
      "I've been able to observe for long enough that I'm fairly confident the pattern works both ways: not only do people who do great work never become haters, haters never do great work. Although I dislike the word \"fanboy,\" it's evocative of something important about both haters and fanboys.",
      "It implies that the fanboy is so slavishly predictable in his admiration that he's diminished as a result, that he's less than a man.Haters seem even more diminished. I can imagine being a fanboy. I can think of people whose work I admire so much that I could abase myself before them out of sheer gratitude.",
      "If P. G. Wodehouse were still alive, I could see myself being a Wodehouse fanboy. But I could not imagine being a hater.Knowing that haters are just fanboys with the sign bit flipped makes it much easier to deal with them.",
      "We don't need a separate theory of haters. We can just use existing techniques for dealing with obsessive fans.The most important of which is simply not to think much about them. If you're like most people who become famous enough to acquire haters, your initial reaction will be one of mystification.",
      "Why does this guy seem to have it in for me? Where does his obsessive energy come from, and what makes him so appallingly nasty? What did I do to set him off? Is it something I can fix?The mistake here is to think of the hater as someone you have a dispute with.",
      "When you have a dispute with someone, it's usually a good idea to try to understand why they're upset and then fix things if you can. Disputes are distracting. But it's a false analogy to think of a hater as someone you have a dispute with.",
      "It's an understandable mistake, if you've never encountered haters before. But when you realize that you're dealing with a hater, and what a hater is, it's clear that it's a waste of time even to think about them.",
      "If you have obsessive fans, do you spend any time wondering what makes them love you so much? No, you just think \"some people are kind of crazy,\" and that's the end of it.Since haters are equivalent to fanboys, that's the way to deal with them too.",
      "There may have been something that set them off. But it's not something that would have set off a normal person, so there's no reason to spend any time thinking about it. It's not you, it's them.Notes[1] There are of course some people who are genuine frauds.",
      "How can you distinguish between x calling y a fraud because x is a hater, and because y is a fraud? Look at neutral opinion. Actual frauds are usually pretty conspicuous. Thoughtful people are rarely taken in by them.",
      "So if there are some thoughtful people who like y, you can usually assume y is not a fraud.[2] I would make an exception for teenagers, who sometimes act in such extreme ways that they are literally not themselves.",
      "I can imagine a teenage kid being a hater and then growing out of it. But not anyone over 25.[3] I have a much worse memory for misdeeds than my wife Jessica, who is a connoisseur of character, but I don't wish it were better.",
      "Most disputes are a waste of time even if you're in the right, and it's easy to bury the hatchet with someone if you can't remember why you were mad at them.[4] A competent hater will not merely attack you individually but will try to get mobs after you.",
      "In some cases you may want to refute whatever bogus claim they made in order to do so. But err on the side of not, because ultimately it probably won't matter.Thanks to Austen Allred, Trevor Blackwell, Patrick Collison, Christine Ford, Daniel Gackle, Jessica Livingston, Robert Morris, Elon Musk, Harj Taggar, and Peter Thiel for reading drafts of this.Japanese TranslationArabic TranslationPolish Translation"
    ],
    "word_count": 1369,
    "paragraph_count": 30
  },
  "processed_at": "2025-07-26T19:04:03.793124",
  "paragraphs": [
    {
      "original": "January 2020(I originally intended this for startup founders, who are often surprised by the attention they get as their companies grow, but it applies equally to anyone who becomes famous.)If you become sufficiently famous, you'll acquire some fans who like you too much.",
      "translated": "2020年1月（我原本是为初创企业的创始人写的，他们经常在公司成长过程中对所获得的关注感到惊讶，但这同样适用于任何成名的人。）如果你足够出名，你会吸引到一些喜欢你过头的粉丝。"
    },
    {
      "original": "These people are sometimes called \"fanboys,\" and though I dislike that term, I'm going to have to use it here. We need some word for them, because this is a distinct phenomenon from someone simply liking your work.A fanboy is obsessive and uncritical.",
      "translated": "这些人有时被称为“粉丝狂热者”，虽然我不喜欢这个称呼，但在这里我不得不使用它。我们需要一个词来形容他们，因为这与某人单纯喜欢你的作品是不同的现象。粉丝狂热者是痴迷且不加批判的。"
    },
    {
      "original": "Liking you becomes part of their identity, and they create an image of you in their own head that is much better than reality. Everything you do is good, because you do it. If you do something bad, they find a way to see it as good.",
      "translated": "喜欢你成为他们身份的一部分，他们在脑海中塑造了一个比现实更好的你的形象。你所做的一切都是好的，因为你做的。即使你做了不好的事情，他们也会找到理由认为那是好的。"
    },
    {
      "original": "And their love for you is not, usually, a quiet, private one. They want everyone to know how great you are.Well, you may be thinking, I could do without this kind of obsessive fan, but I know there are all kinds of people in the world, and if this is the worst consequence of fame, that's not so bad.Unfortunately this is not the worst consequence of fame.",
      "translated": "他们对你的爱通常不是安静和私密的。他们希望所有人都知道你有多棒。你或许会想，没有这种痴迷的粉丝也罢，但我知道世界上有各种各样的人，如果这是成名带来的最坏后果，那也不算太糟。不幸的是，这并不是成名最糟糕的后果。"
    },
    {
      "original": "As well as fanboys, you'll have haters.A hater is obsessive and uncritical. Disliking you becomes part of their identity, and they create an image of you in their own head that is much worse than reality.",
      "translated": "除了粉丝，你还会遇到黑子。黑子是痴迷且不加批判的。讨厌你成了他们身份的一部分，他们在自己脑海中塑造的你的形象比现实要糟糕得多。"
    },
    {
      "original": "Everything you do is bad, because you do it. If you do something good, they find a way to see it as bad. And their dislike for you is not, usually, a quiet, private one. They want everyone to know how awful you are.If you're thinking of checking, I'll save you the trouble.",
      "translated": "你做的每一件事都是坏的，因为你就是你。即使你做了一些好事，他们也会找到办法将其视为坏事。而且，他们对你的厌恶通常不是静悄悄的、私下的。他们希望每个人都知道你有多糟糕。如果你正打算去核实，我给你省省麻烦吧。"
    },
    {
      "original": "The second and fifth paragraphs are identical except for \"good\" being switched to \"bad\" and so on.I spent years puzzling about haters. What are they, and where do they come from? Then one day it dawned on me.",
      "translated": "第二段和第五段除了将“好”换成“坏”等词语外，内容完全相同。我花了多年时间思考那些恨我的人。他们是什么人，从哪里来？直到有一天，我恍然大悟。"
    },
    {
      "original": "Haters are just fanboys with the sign switched.Note that by haters, I don't simply mean trolls. I'm not talking about people who say bad things about you and then move on. I'm talking about the much smaller group of people for whom this becomes a kind of obsession and who do it repeatedly over a long period.Like fans, haters seem to be an automatic consequence of fame.",
      "translated": "黑子其实就是粉丝，只是态度相反。请注意，我所说的黑子并不简单指那些喷子。我不是指那些说你坏话然后就走开的人。我是指那更小一部分人，对他们来说，这成了一种 obsession，会长期反复地这样做。和粉丝一样，黑子似乎也是成名的自然结果。"
    },
    {
      "original": "Anyone sufficiently famous will have them. And like fans, haters are energized by the fame of whoever they hate. They hear a song by some pop singer. They don't like it much. If the singer were an obscure one, they'd just forget about it.",
      "translated": "任何足够有名的人都会有。和粉丝一样，黑粉也会因他们所憎恨对象的名气而受到鼓舞。他们听了一首流行歌手的歌，不太喜欢。如果这个歌手默默无闻，他们就会直接忘了这件事。"
    },
    {
      "original": "But instead they keep hearing her name, and this seems to drive some people crazy. Everyone's always going on about this singer, but she's no good! She's a fraud!That word \"fraud\" is an important one.",
      "translated": "但他们却不断地听到她的名字，这似乎让一些人抓狂。大家总是谈论这位歌手，但她根本不行！她是个骗子！“骗子”这个词很重要。"
    },
    {
      "original": "It's the spectral signature of a hater to regard the object of their hatred as a fraud. They can't deny their fame. Indeed, their fame is if anything exaggerated in the hater's mind. They notice every mention of the singer's name, because every mention makes them angrier.",
      "translated": "憎恨者的典型特征是将他们憎恨的对象视为骗子。他们无法否认对方的名声。事实上，在憎恨者的心中，这种名声甚至被夸大了。他们注意到歌手名字的每一次提及，因为每一次提及都会让他们更加愤怒。"
    },
    {
      "original": "In their own minds they exaggerate both the singer's fame and her lack of talent, and the only way to reconcile those two ideas is to conclude that she has tricked everyone.What sort of people become haters?",
      "translated": "在他们自己的心目中，他们既夸大了歌手的名气，又夸大了她缺乏才华的情况，唯一能调和这两种想法的方法就是认为她欺骗了所有人。那么，什么样的人会成为黑粉呢？"
    },
    {
      "original": "Can anyone become one? I'm not sure about this, but I've noticed some patterns. Haters are generally losers in a very specific sense: although they are occasionally talented, they have never achieved much.",
      "translated": "任何人都能成为那样的人吗？我不确定，但我注意到了一些规律。憎恨者通常在某种特定意义上是失败者：虽然他们偶尔很有才华，但从未取得过什么成就。"
    },
    {
      "original": "And indeed, anyone successful enough to have achieved significant fame would be unlikely to regard another famous person as a fraud on that account, because anyone famous knows how random fame is.But haters are not always complete losers.",
      "translated": "确实，任何足够成功以获得显著名声的人，都不会因为这一点而认为另一个名人是骗子，因为任何有名的人都知道名声是多么的随机。但恨者并不总是彻底的失败者。"
    },
    {
      "original": "They are not always the proverbial guy living in his mom's basement. Many are, but some have some amount of talent. In fact I suspect that a sense of frustrated talent is what drives some people to become haters.",
      "translated": "他们并不总是那个住在妈妈地下室里的典型人物。确实有很多是这样，但也有些人拥有一些才华。事实上，我认为一种受挫的才华感可能是驱使一些人成为愤世嫉俗者的原因。"
    },
    {
      "original": "They're not just saying \"It's unfair that so-and-so is famous,\" but \"It's unfair that so-and-so is famous, and not me.\"Could a hater be cured if they achieved something impressive? My guess is that's a moot point, because they never will.",
      "translated": "他们不只是在说“某某人出名不公平”，而是在说“某某人出名而我没有出名不公平。”如果一个憎恨者取得了一些令人印象深刻的成就，他们能被治愈吗？我猜这是一个无解的问题，因为他们永远不会成功。"
    },
    {
      "original": "I've been able to observe for long enough that I'm fairly confident the pattern works both ways: not only do people who do great work never become haters, haters never do great work. Although I dislike the word \"fanboy,\" it's evocative of something important about both haters and fanboys.",
      "translated": "我观察了足够长的时间，相当确信这种模式是双向的：不仅做伟大工作的人永远不会成为憎恨者，憎恨者也永远不会做出伟大的工作。尽管我不喜欢“粉丝男孩”这个词，但它确实揭示了憎恨者和粉丝男孩两者身上某些重要的特质。"
    },
    {
      "original": "It implies that the fanboy is so slavishly predictable in his admiration that he's diminished as a result, that he's less than a man.Haters seem even more diminished. I can imagine being a fanboy. I can think of people whose work I admire so much that I could abase myself before them out of sheer gratitude.",
      "translated": "这暗示着粉丝的崇拜是如此盲目和可预见，以至于他因此而被贬低，变得不再像一个真正的男人。相比之下，憎恨者显得更加低微。我可以想象成为粉丝的样子。我可以想到一些我如此钦佩的人，以至于我可能因为纯粹的感激之情而自甘卑微地跪倒在他们面前。"
    },
    {
      "original": "If P. G. Wodehouse were still alive, I could see myself being a Wodehouse fanboy. But I could not imagine being a hater.Knowing that haters are just fanboys with the sign bit flipped makes it much easier to deal with them.",
      "translated": "如果P. G. Wodehouse还活着，我完全可以想象自己会成为他的忠实粉丝。但我无法想象自己会成为他的反对者。了解反对者只不过是粉丝的负面表现，这使应对他们变得容易得多。"
    },
    {
      "original": "We don't need a separate theory of haters. We can just use existing techniques for dealing with obsessive fans.The most important of which is simply not to think much about them. If you're like most people who become famous enough to acquire haters, your initial reaction will be one of mystification.",
      "translated": "我们不需要为仇恨者制定一套独立的理论。我们只需要使用现有的应对狂热粉丝的技巧即可。其中最重要的一点就是不要过多地去想他们。如果你像大多数因足够出名而招致仇恨的人一样，你最初的反应可能会是感到困惑。"
    },
    {
      "original": "Why does this guy seem to have it in for me? Where does his obsessive energy come from, and what makes him so appallingly nasty? What did I do to set him off? Is it something I can fix?The mistake here is to think of the hater as someone you have a dispute with.",
      "translated": "为什么这家伙好像对我有意见？他的这种痴迷能量是从哪里来的，又是什么让他变得如此令人厌恶？我做了什么激怒了他？这是我可以解决的问题吗？这里的错误在于将仇视你的人视为与你有争端的人。"
    },
    {
      "original": "When you have a dispute with someone, it's usually a good idea to try to understand why they're upset and then fix things if you can. Disputes are distracting. But it's a false analogy to think of a hater as someone you have a dispute with.",
      "translated": "当你与某人发生争执时，通常最好尝试理解他们为什么生气，然后如果可能的话，解决问题。争执会分散注意力。但将讨厌你的人比作与你有争执的人是一个错误的类比。"
    },
    {
      "original": "It's an understandable mistake, if you've never encountered haters before. But when you realize that you're dealing with a hater, and what a hater is, it's clear that it's a waste of time even to think about them.",
      "translated": "这是一个可以理解的错误，如果你以前从未遇到过喷子。但当你意识到自己在对付一个喷子，以及喷子是什么样的人时，就会明白，哪怕是花时间去想他们也是在浪费时间。"
    },
    {
      "original": "If you have obsessive fans, do you spend any time wondering what makes them love you so much? No, you just think \"some people are kind of crazy,\" and that's the end of it.Since haters are equivalent to fanboys, that's the way to deal with them too.",
      "translated": "如果你有狂热的粉丝，你会花时间思考他们为什么如此爱你吗？不，你只会觉得“有些人有点疯狂”，然后就不再想了。既然反对者和粉丝是一样的，对待他们的方式也是一样的。"
    },
    {
      "original": "There may have been something that set them off. But it's not something that would have set off a normal person, so there's no reason to spend any time thinking about it. It's not you, it's them.Notes[1] There are of course some people who are genuine frauds.",
      "translated": "可能有什么事情触发了他们。但这并不是什么会让正常人反应的事情，所以不值得花时间去想。问题不在你，而在他们。注[1] 当然，也有一些人是真正的骗子。"
    },
    {
      "original": "How can you distinguish between x calling y a fraud because x is a hater, and because y is a fraud? Look at neutral opinion. Actual frauds are usually pretty conspicuous. Thoughtful people are rarely taken in by them.",
      "translated": "如何区分x称y为骗子是因为x怀有恶意，还是因为y确实是个骗子？看看中立的意见。真正的骗局通常非常明显。有思想的人很少会被它们蒙蔽。"
    },
    {
      "original": "So if there are some thoughtful people who like y, you can usually assume y is not a fraud.[2] I would make an exception for teenagers, who sometimes act in such extreme ways that they are literally not themselves.",
      "translated": "所以，如果有一些有思想的人喜欢 y，你通常可以认为 y 不是骗子。[2] 但对于青少年，我会另当别论，因为他们有时会表现出极端的行为，简直不像他们自己。"
    },
    {
      "original": "I can imagine a teenage kid being a hater and then growing out of it. But not anyone over 25.[3] I have a much worse memory for misdeeds than my wife Jessica, who is a connoisseur of character, but I don't wish it were better.",
      "translated": "我可以想象一个十几岁的孩子是个讨厌鬼，但后来长大了就改掉了。但对于25岁以上的人，我可不这么认为。[3] 我对别人的恶行记忆不如我妻子杰西卡那么深刻，她是个识人高手，但我并不希望我的记忆力能更好。"
    },
    {
      "original": "Most disputes are a waste of time even if you're in the right, and it's easy to bury the hatchet with someone if you can't remember why you were mad at them.[4] A competent hater will not merely attack you individually but will try to get mobs after you.",
      "translated": "大多数争端即使你是对的也是浪费时间，而且如果你不记得为什么生气，与人和解也很容易。一个有能力的仇敌不会仅仅单独攻击你，还会试图煽动群体来对付你。"
    },
    {
      "original": "In some cases you may want to refute whatever bogus claim they made in order to do so. But err on the side of not, because ultimately it probably won't matter.Thanks to Austen Allred, Trevor Blackwell, Patrick Collison, Christine Ford, Daniel Gackle, Jessica Livingston, Robert Morris, Elon Musk, Harj Taggar, and Peter Thiel for reading drafts of this.Japanese TranslationArabic TranslationPolish Translation",
      "translated": "在某些情况下，你可能想要反驳他们提出的任何谬论。但最好还是不要这么做，因为最终这可能并不会产生影响。感谢 Austin Allred、Trevor Blackwell、Patrick Collison、Christine Ford、Daniel Gackle、Jessica Livingston、Robert Morris、Elon Musk、Harj Taggar 和 Peter Thiel 阅读本文的草稿。日语翻译阿拉伯语翻译波兰语翻译"
    }
  ],
  "translation_completed": "2025-07-28T14:49:13.049616",
  "translation_stats": {
    "total_paragraphs": 30,
    "success_count": 30,
    "success_rate": "100.0%"
  }
}