{
  "title": "Founder Mode",
  "title_zh": "创始人模式",
  "url": "https://www.paulgraham.com/foundermode.html",
  "filename": "foundermode.html",
  "date": "2020-08-10",
  "id": 94,
  "content": {
    "success": true,
    "paragraphs": [
      "September 2024At a YC event last week Brian Chesky gave a talk that everyone who was there will remember. Most founders I talked to afterward said it was the best they'd ever heard. Ron Conway, for the first time in his life, forgot to take notes.",
      "I'm not going to try to reproduce it here. Instead I want to talk about a question it raised.The theme of Brian's talk was that the conventional wisdom about how to run larger companies is mistaken. As Airbnb grew, well-meaning people advised him that he had to run the company in a certain way for it to scale.",
      "Their advice could be optimistically summarized as \"hire good people and give them room to do their jobs.\" He followed this advice and the results were disastrous. So he had to figure out a better way on his own, which he did partly by studying how Steve Jobs ran Apple.",
      "So far it seems to be working. Airbnb's free cash flow margin is now among the best in Silicon Valley.The audience at this event included a lot of the most successful founders we've funded, and one after another said that the same thing had happened to them.",
      "They'd been given the same advice about how to run their companies as they grew, but instead of helping their companies, it had damaged them.Why was everyone telling these founders the wrong thing? That was the big mystery to me.",
      "And after mulling it over for a bit I figured out the answer: what they were being told was how to run a company you hadn't founded — how to run a company if you're merely a professional manager. But this m.o.",
      "is so much less effective that to founders it feels broken. There are things founders can do that managers can't, and not doing them feels wrong to founders, because it is.In effect there are two different ways to run a company: founder mode and manager mode.",
      "Till now most people even in Silicon Valley have implicitly assumed that scaling a startup meant switching to manager mode. But we can infer the existence of another mode from the dismay of founders who've tried it, and the success of their attempts to escape from it.There are as far as I know no books specifically about founder mode.",
      "Business schools don't know it exists. All we have so far are the experiments of individual founders who've been figuring it out for themselves. But now that we know what we're looking for, we can search for it.",
      "I hope in a few years founder mode will be as well understood as manager mode. We can already guess at some of the ways it will differ.The way managers are taught to run companies seems to be like modular design in the sense that you treat subtrees of the org chart as black boxes.",
      "You tell your direct reports what to do, and it's up to them to figure out how. But you don't get involved in the details of what they do. That would be micromanaging them, which is bad.Hire good people and give them room to do their jobs.",
      "Sounds great when it's described that way, doesn't it? Except in practice, judging from the report of founder after founder, what this often turns out to mean is: hire professional fakers and let them drive the company into the ground.One theme I noticed both in Brian's talk and when talking to founders afterward was the idea of being gaslit.",
      "Founders feel like they're being gaslit from both sides — by the people telling them they have to run their companies like managers, and by the people working for them when they do. Usually when everyone around you disagrees with you, your default assumption should be that you're mistaken.",
      "But this is one of the rare exceptions. VCs who haven't been founders themselves don't know how founders should run companies, and C-level execs, as a class, include some of the most skillful liars in the world.",
      "[1]Whatever founder mode consists of, it's pretty clear that it's going to break the principle that the CEO should engage with the company only via his or her direct reports. \"Skip-level\" meetings will become the norm instead of a practice so unusual that there's a name for it.",
      "And once you abandon that constraint there are a huge number of permutations to choose from.For example, Steve Jobs used to run an annual retreat for what he considered the 100 most important people at Apple, and these were not the 100 people highest on the org chart.",
      "Can you imagine the force of will it would take to do this at the average company? And yet imagine how useful such a thing could be. It could make a big company feel like a startup. Steve presumably wouldn't have kept having these retreats if they didn't work.",
      "But I've never heard of another company doing this. So is it a good idea, or a bad one? We still don't know. That's how little we know about founder mode. [2]Obviously founders can't keep running a 2000 person company the way they ran it when it had 20.",
      "There's going to have to be some amount of delegation. Where the borders of autonomy end up, and how sharp they are, will probably vary from company to company. They'll even vary from time to time within the same company, as managers earn trust.",
      "So founder mode will be more complicated than manager mode. But it will also work better. We already know that from the examples of individual founders groping their way toward it.Indeed, another prediction I'll make about founder mode is that once we figure out what it is, we'll find that a number of individual founders were already most of the way there — except that in doing what they did they were regarded by many as eccentric or worse.",
      "[3]Curiously enough it's an encouraging thought that we still know so little about founder mode. Look at what founders have achieved already, and yet they've achieved this against a headwind of bad advice.",
      "Imagine what they'll do once we can tell them how to run their companies like Steve Jobs instead of John Sculley.Notes[1] The more diplomatic way of phrasing this statement would be to say that experienced C-level execs are often very skilled at managing up.",
      "And I don't think anyone with knowledge of this world would dispute that.[2] If the practice of having such retreats became so widespread that even mature companies dominated by politics started to do it, we could quantify the senescence of companies by the average depth on the org chart of those invited.[3] I also have another less optimistic prediction: as soon as the concept of founder mode becomes established, people will start misusing it.",
      "Founders who are unable to delegate even things they should will use founder mode as the excuse. Or managers who aren't founders will decide they should try to act like founders. That may even work, to some extent, but the results will be messy when it doesn't; the modular approach does at least limit the damage a bad CEO can do.Thanks to Brian Chesky, Patrick Collison, Ron Conway, Jessica Livingston, Elon Musk, Ryan Petersen, Harj Taggar, and Garry Tan for reading drafts of this."
    ],
    "word_count": 1225,
    "paragraph_count": 24
  },
  "processed_at": "2025-07-26T19:04:27.884036",
  "paragraphs": [
    {
      "original": "September 2024At a YC event last week Brian Chesky gave a talk that everyone who was there will remember. Most founders I talked to afterward said it was the best they'd ever heard. Ron Conway, for the first time in his life, forgot to take notes.",
      "translated": "2024年9月，在上周的一次YC活动中，Brian Chesky 发表了一场演讲，所有在场的人都会铭记。我后来和大多数创始人交谈时，他们都说这是他们听过的最好的演讲。Ron Conway 有生以来第一次忘了做笔记。"
    },
    {
      "original": "I'm not going to try to reproduce it here. Instead I want to talk about a question it raised.The theme of Brian's talk was that the conventional wisdom about how to run larger companies is mistaken. As Airbnb grew, well-meaning people advised him that he had to run the company in a certain way for it to scale.",
      "translated": "我不打算在这里复述它。相反，我想讨论它提出的一个问题。布莱恩演讲的主题是，关于如何管理大型公司的传统观点是错误的。随着Airbnb的发展，好心的人建议他必须以某种方式管理公司，以便公司能够发展壮大。"
    },
    {
      "original": "Their advice could be optimistically summarized as \"hire good people and give them room to do their jobs.\" He followed this advice and the results were disastrous. So he had to figure out a better way on his own, which he did partly by studying how Steve Jobs ran Apple.",
      "translated": "他们的建议可以乐观地概括为“招聘优秀的人才，并给他们足够的空间去完成工作。”他遵循了这些建议，但结果却是一场灾难。因此，他不得不自己找出更好的方法，部分是通过研究史蒂夫·乔布斯如何管理苹果公司来实现的。"
    },
    {
      "original": "So far it seems to be working. Airbnb's free cash flow margin is now among the best in Silicon Valley.The audience at this event included a lot of the most successful founders we've funded, and one after another said that the same thing had happened to them.",
      "translated": "到目前为止，似乎效果不错。Airbnb 的自由现金流利润率现在已是硅谷最佳之一。参加此次会议的有许多我们资助过的最成功的创始人，他们一个接一个地说，同样的事情也发生在他们身上。"
    },
    {
      "original": "They'd been given the same advice about how to run their companies as they grew, but instead of helping their companies, it had damaged them.Why was everyone telling these founders the wrong thing? That was the big mystery to me.",
      "translated": "他们得到了同样的建议，关于如何在公司成长过程中进行管理，但这些建议非但没有帮助他们的公司，反而损害了公司。为什么每个人都在告诉这些创始人错误的信息？这对我来说是个巨大的谜团。"
    },
    {
      "original": "And after mulling it over for a bit I figured out the answer: what they were being told was how to run a company you hadn't founded — how to run a company if you're merely a professional manager. But this m.o.",
      "translated": "经过一番思考，我找到了答案：他们被告知的是如何管理一家你并非创始人创建的公司——如果你只是一个职业经理人，应该如何管理公司。但这种模式"
    },
    {
      "original": "is so much less effective that to founders it feels broken. There are things founders can do that managers can't, and not doing them feels wrong to founders, because it is.In effect there are two different ways to run a company: founder mode and manager mode.",
      "translated": "效果差到让创始人觉得它已经失效了。有些事情只有创始人能做，而管理者却做不到，不做这些事情会让创始人感到不对劲，因为确实如此。实际上，公司有两种不同的运营方式：创始人模式和管理者模式。"
    },
    {
      "original": "Till now most people even in Silicon Valley have implicitly assumed that scaling a startup meant switching to manager mode. But we can infer the existence of another mode from the dismay of founders who've tried it, and the success of their attempts to escape from it.There are as far as I know no books specifically about founder mode.",
      "translated": "到目前为止，即使在硅谷，大多数人也普遍认为扩展初创公司意味着切换到管理者的模式。但我们可以通过尝试这种模式的创始人的失望，以及他们试图摆脱这种模式的成功，推断出另一种模式的存在。据我所知，目前还没有专门关于创始人模式的书籍。"
    },
    {
      "original": "Business schools don't know it exists. All we have so far are the experiments of individual founders who've been figuring it out for themselves. But now that we know what we're looking for, we can search for it.",
      "translated": "商学院对此一无所知。到目前为止，我们只有个别创始人自己摸索出来的实验。但现在我们知道该寻找什么了，就可以去寻找了。"
    },
    {
      "original": "I hope in a few years founder mode will be as well understood as manager mode. We can already guess at some of the ways it will differ.The way managers are taught to run companies seems to be like modular design in the sense that you treat subtrees of the org chart as black boxes.",
      "translated": "我希望在几年后，创始人模式能够像管理者模式一样被广泛理解。我们已经可以预见到它在某些方面会有所不同。管理者被教导管理公司的方式似乎类似于模块化设计，即把组织结构图中的子树视为黑盒子。"
    },
    {
      "original": "You tell your direct reports what to do, and it's up to them to figure out how. But you don't get involved in the details of what they do. That would be micromanaging them, which is bad.Hire good people and give them room to do their jobs.",
      "translated": "你告诉你的直接下属该做什么，由他们来决定如何做。但你不会介入他们工作的具体细节。那将是对他们进行微观管理，这是不好的。雇佣优秀的人才并给他们足够的空间去完成工作。"
    },
    {
      "original": "Sounds great when it's described that way, doesn't it? Except in practice, judging from the report of founder after founder, what this often turns out to mean is: hire professional fakers and let them drive the company into the ground.One theme I noticed both in Brian's talk and when talking to founders afterward was the idea of being gaslit.",
      "translated": "这样描述听起来很棒，不是吗？但实际上，根据一位又一位创始人报告的情况，这往往意味着：聘请专业的冒牌货，让他们把公司搞垮。我在布莱恩的演讲和之后与创始人们的交谈中注意到的一个主题是“被操纵”的想法。"
    },
    {
      "original": "Founders feel like they're being gaslit from both sides — by the people telling them they have to run their companies like managers, and by the people working for them when they do. Usually when everyone around you disagrees with you, your default assumption should be that you're mistaken.",
      "translated": "创始人感觉他们像是被两方面的人“煤气灯”了——一方面是那些告诉他们必须像管理者一样经营公司的人，另一方面是当他们这样做的时候，那些为他们工作的人。通常，当周围的人都不同意你的观点时，你的默认假设应该是你可能错了。"
    },
    {
      "original": "But this is one of the rare exceptions. VCs who haven't been founders themselves don't know how founders should run companies, and C-level execs, as a class, include some of the most skillful liars in the world.",
      "translated": "但这是一个罕见的例外。没有当过创始人的风险投资家不知道创始人应该如何管理公司，而作为一类人，C级高管中包括了一些世界上最擅长撒谎的人。"
    },
    {
      "original": "[1]Whatever founder mode consists of, it's pretty clear that it's going to break the principle that the CEO should engage with the company only via his or her direct reports. \"Skip-level\" meetings will become the norm instead of a practice so unusual that there's a name for it.",
      "translated": "[1]无论创始人模式包含什么，很明显，它将打破首席执行官应仅通过直接下属与公司互动的原则。“跨级”会议将成为常态，而不再是一种罕见到需要专门命名的做法。"
    },
    {
      "original": "And once you abandon that constraint there are a huge number of permutations to choose from.For example, Steve Jobs used to run an annual retreat for what he considered the 100 most important people at Apple, and these were not the 100 people highest on the org chart.",
      "translated": "一旦放弃这个限制，你就会有大量选择的排列组合。例如，史蒂夫·乔布斯过去每年都会为他认定的苹果公司最重要的100人举办一次年度 retreat，而这些并不是公司组织结构图上职位最高的100人。"
    },
    {
      "original": "Can you imagine the force of will it would take to do this at the average company? And yet imagine how useful such a thing could be. It could make a big company feel like a startup. Steve presumably wouldn't have kept having these retreats if they didn't work.",
      "translated": "你能想象在普通公司这样做需要多大的意志力吗？然而，试想一下这样做会有多么有用。它能让一家大公司感觉像是一家初创公司。如果这些闭门会议没有效果，史蒂夫想必也不会一直坚持举办。"
    },
    {
      "original": "But I've never heard of another company doing this. So is it a good idea, or a bad one? We still don't know. That's how little we know about founder mode. [2]Obviously founders can't keep running a 2000 person company the way they ran it when it had 20.",
      "translated": "但我从未听说过有其他公司这样做过。所以这是一个好主意，还是一个坏主意？我们仍然不知道。我们对创始人模式的了解就是这么少。[2]显然，创始人无法像公司只有20人时那样管理一个2000人的公司。"
    },
    {
      "original": "There's going to have to be some amount of delegation. Where the borders of autonomy end up, and how sharp they are, will probably vary from company to company. They'll even vary from time to time within the same company, as managers earn trust.",
      "translated": "必须要有一定程度的授权。自主权的边界最终会在哪里，以及这些边界有多明确，可能因公司而异。即使在同一公司内，这些边界也会随着时间的推移而变化，因为管理者会逐渐赢得信任。"
    },
    {
      "original": "So founder mode will be more complicated than manager mode. But it will also work better. We already know that from the examples of individual founders groping their way toward it.Indeed, another prediction I'll make about founder mode is that once we figure out what it is, we'll find that a number of individual founders were already most of the way there — except that in doing what they did they were regarded by many as eccentric or worse.",
      "translated": "因此，创始人模式将比管理者模式更为复杂。但它的效果也会更好。我们从个别创始人摸索前进的例子中已经知道了这一点。实际上，关于创始人模式，我还有一个预测：一旦我们弄清楚它是什么，我们会发现许多个别创始人实际上已经非常接近——只不过他们在做这些事情时，被许多人视为古怪或更糟。"
    },
    {
      "original": "[3]Curiously enough it's an encouraging thought that we still know so little about founder mode. Look at what founders have achieved already, and yet they've achieved this against a headwind of bad advice.",
      "translated": "有趣的是，我们对创始人模式仍然知之甚少，这其实是一个鼓舞人心的想法。看看创始人们已经取得的成就，而他们是在逆着错误建议的风向取得这些成就的。"
    },
    {
      "original": "Imagine what they'll do once we can tell them how to run their companies like Steve Jobs instead of John Sculley.Notes[1] The more diplomatic way of phrasing this statement would be to say that experienced C-level execs are often very skilled at managing up.",
      "translated": "想象一下，一旦我们可以告诉他们如何像史蒂夫·乔布斯而不是约翰·斯卡利那样经营公司，他们会做些什么。更委婉的说法是，有经验的C级高管通常非常擅长向上管理。"
    },
    {
      "original": "And I don't think anyone with knowledge of this world would dispute that.[2] If the practice of having such retreats became so widespread that even mature companies dominated by politics started to do it, we could quantify the senescence of companies by the average depth on the org chart of those invited.[3] I also have another less optimistic prediction: as soon as the concept of founder mode becomes established, people will start misusing it.",
      "translated": "而且，我认为任何了解这个世界的人对此都不会有异议。[2] 如果这种退修活动变得如此普遍，以至于连那些被政治主导的成熟公司也开始效仿，我们可以通过受邀人员在组织架构图中的平均层级来量化公司的老化程度。[3] 我还有另一个不太乐观的预测：一旦创始人模式这个概念被确立，人们就会开始滥用它。"
    },
    {
      "original": "Founders who are unable to delegate even things they should will use founder mode as the excuse. Or managers who aren't founders will decide they should try to act like founders. That may even work, to some extent, but the results will be messy when it doesn't; the modular approach does at least limit the damage a bad CEO can do.Thanks to Brian Chesky, Patrick Collison, Ron Conway, Jessica Livingston, Elon Musk, Ryan Petersen, Harj Taggar, and Garry Tan for reading drafts of this.",
      "translated": "无法委托甚至应该委托的事务的创始人会以创始人模式为借口。或者，不是创始人的管理者会决定他们应该尝试像创始人那样行事。这在某种程度上可能奏效，但如果行不通，结果将会一团糟；至少，模块化方法可以限制一个糟糕的首席执行官所造成的损害。感谢 Brian Chesky、Patrick Collison、Ron Conway、Jessica Livingston、Elon Musk、Ryan Petersen、Harj Taggar 和 Garry Tan 阅读本文的草稿。"
    }
  ],
  "translation_completed": "2025-07-28T14:29:43.220472",
  "translation_stats": {
    "total_paragraphs": 24,
    "success_count": 24,
    "success_rate": "100.0%"
  }
}