{
  "title": "The Bus Ticket Theory of Genius",
  "title_zh": "[待翻译] The Bus Ticket Theory of Genius",
  "url": "https://www.paulgraham.com/genius.html",
  "filename": "genius.html",
  "date": "2019-11-01",
  "id": 109,
  "content": {
    "success": true,
    "paragraphs": [
      "November 2019Everyone knows that to do great work you need both natural ability and determination. But there's a third ingredient that's not as well understood: an obsessive interest in a particular topic.To explain this point I need to burn my reputation with some group of people, and I'm going to choose bus ticket collectors.",
      "There are people who collect old bus tickets. Like many collectors, they have an obsessive interest in the minutiae of what they collect. They can keep track of distinctions between different types of bus tickets that would be hard for the rest of us to remember.",
      "Because we don't care enough. What's the point of spending so much time thinking about old bus tickets?Which leads us to the second feature of this kind of obsession: there is no point. A bus ticket collector's love is disinterested.",
      "They're not doing it to impress us or to make themselves rich, but for its own sake.When you look at the lives of people who've done great work, you see a consistent pattern. They often begin with a bus ticket collector's obsessive interest in something that would have seemed pointless to most of their contemporaries.",
      "One of the most striking features of Darwin's book about his voyage on the Beagle is the sheer depth of his interest in natural history. His curiosity seems infinite. Ditto for Ramanujan, sitting by the hour working out on his slate what happens to series.It's a mistake to think they were \"laying the groundwork\" for the discoveries they made later.",
      "There's too much intention in that metaphor. Like bus ticket collectors, they were doing it because they liked it.But there is a difference between Ramanujan and a bus ticket collector. Series matter, and bus tickets don't.If I had to put the recipe for genius into one sentence, that might be it: to have a disinterested obsession with something that matters.Aren't I forgetting about the other two ingredients?",
      "Less than you might think. An obsessive interest in a topic is both a proxy for ability and a substitute for determination. Unless you have sufficient mathematical aptitude, you won't find series interesting.",
      "And when you're obsessively interested in something, you don't need as much determination: you don't need to push yourself as hard when curiosity is pulling you.An obsessive interest will even bring you luck, to the extent anything can.",
      "Chance, as Pasteur said, favors the prepared mind, and if there's one thing an obsessed mind is, it's prepared.The disinterestedness of this kind of obsession is its most important feature. Not just because it's a filter for earnestness, but because it helps you discover new ideas.The paths that lead to new ideas tend to look unpromising.",
      "If they looked promising, other people would already have explored them. How do the people who do great work discover these paths that others overlook? The popular story is that they simply have better vision: because they're so talented, they see paths that others miss.",
      "But if you look at the way great discoveries are made, that's not what happens. Darwin didn't pay closer attention to individual species than other people because he saw that this would lead to great discoveries, and they didn't.",
      "He was just really, really interested in such things.Darwin couldn't turn it off. Neither could Ramanujan. They didn't discover the hidden paths that they did because they seemed promising, but because they couldn't help it.",
      "That's what allowed them to follow paths that someone who was merely ambitious would have ignored.What rational person would decide that the way to write great novels was to begin by spending several years creating an imaginary elvish language, like Tolkien, or visiting every household in southwestern Britain, like Trollope?",
      "No one, including Tolkien and Trollope.The bus ticket theory is similar to Carlyle's famous definition of genius as an infinite capacity for taking pains. But there are two differences. The bus ticket theory makes it clear that the source of this infinite capacity for taking pains is not infinite diligence, as Carlyle seems to have meant, but the sort of infinite interest that collectors have.",
      "It also adds an important qualification: an infinite capacity for taking pains about something that matters.So what matters? You can never be sure. It's precisely because no one can tell in advance which paths are promising that you can discover new ideas by working on what you're interested in.But there are some heuristics you can use to guess whether an obsession might be one that matters.",
      "For example, it's more promising if you're creating something, rather than just consuming something someone else creates. It's more promising if something you're interested in is difficult, especially if it's more difficult for other people than it is for you.",
      "And the obsessions of talented people are more likely to be promising. When talented people become interested in random things, they're not truly random.But you can never be sure. In fact, here's an interesting idea that's also rather alarming if it's true: it may be that to do great work, you also have to waste a lot of time.In many different areas, reward is proportionate to risk.",
      "If that rule holds here, then the way to find paths that lead to truly great work is to be willing to expend a lot of effort on things that turn out to be every bit as unpromising as they seem.I'm not sure if this is true.",
      "On one hand, it seems surprisingly difficult to waste your time so long as you're working hard on something interesting. So much of what you do ends up being useful. But on the other hand, the rule about the relationship between risk and reward is so powerful that it seems to hold wherever risk occurs.",
      "Newton's case, at least, suggests that the risk/reward rule holds here. He's famous for one particular obsession of his that turned out to be unprecedentedly fruitful: using math to describe the world.",
      "But he had two other obsessions, alchemy and theology, that seem to have been complete wastes of time. He ended up net ahead. His bet on what we now call physics paid off so well that it more than compensated for the other two.",
      "But were the other two necessary, in the sense that he had to take big risks to make such big discoveries? I don't know.Here's an even more alarming idea: might one make all bad bets? It probably happens quite often.",
      "But we don't know how often, because these people don't become famous.It's not merely that the returns from following a path are hard to predict. They change dramatically over time. 1830 was a really good time to be obsessively interested in natural history.",
      "If Darwin had been born in 1709 instead of 1809, we might never have heard of him.What can one do in the face of such uncertainty? One solution is to hedge your bets, which in this case means to follow the obviously promising paths instead of your own private obsessions.",
      "But as with any hedge, you're decreasing reward when you decrease risk. If you forgo working on what you like in order to follow some more conventionally ambitious path, you might miss something wonderful that you'd otherwise have discovered.",
      "That too must happen all the time, perhaps even more often than the genius whose bets all fail.The other solution is to let yourself be interested in lots of different things. You don't decrease your upside if you switch between equally genuine interests based on which seems to be working so far.",
      "But there is a danger here too: if you work on too many different projects, you might not get deeply enough into any of them.One interesting thing about the bus ticket theory is that it may help explain why different types of people excel at different kinds of work.",
      "Interest is much more unevenly distributed than ability. If natural ability is all you need to do great work, and natural ability is evenly distributed, you have to invent elaborate theories to explain the skewed distributions we see among those who actually do great work in various fields.",
      "But it may be that much of the skew has a simpler explanation: different people are interested in different things.The bus ticket theory also explains why people are less likely to do great work after they have children.",
      "Here interest has to compete not just with external obstacles, but with another interest, and one that for most people is extremely powerful. It's harder to find time for work after you have kids, but that's the easy part.",
      "The real change is that you don't want to.But the most exciting implication of the bus ticket theory is that it suggests ways to encourage great work. If the recipe for genius is simply natural ability plus hard work, all we can do is hope we have a lot of ability, and work as hard as we can.",
      "But if interest is a critical ingredient in genius, we may be able, by cultivating interest, to cultivate genius.For example, for the very ambitious, the bus ticket theory suggests that the way to do great work is to relax a little.",
      "Instead of gritting your teeth and diligently pursuing what all your peers agree is the most promising line of research, maybe you should try doing something just for fun. And if you're stuck, that may be the vector along which to break out.I've always liked Hamming's famous double-barrelled question: what are the most important problems in your field, and why aren't you working on one of them?",
      "It's a great way to shake yourself up. But it may be overfitting a bit. It might be at least as useful to ask yourself: if you could take a year off to work on something that probably wouldn't be important but would be really interesting, what would it be?The bus ticket theory also suggests a way to avoid slowing down as you get older.",
      "Perhaps the reason people have fewer new ideas as they get older is not simply that they're losing their edge. It may also be because once you become established, you can no longer mess about with irresponsible side projects the way you could when you were young and no one cared what you did.The solution to that is obvious: remain irresponsible.",
      "It will be hard, though, because the apparently random projects you take up to stave off decline will read to outsiders as evidence of it. And you yourself won't know for sure that they're wrong. But it will at least be more fun to work on what you want.It may even be that we can cultivate a habit of intellectual bus ticket collecting in kids.",
      "The usual plan in education is to start with a broad, shallow focus, then gradually become more specialized. But I've done the opposite with my kids. I know I can count on their school to handle the broad, shallow part, so I take them deep.When they get interested in something, however random, I encourage them to go preposterously, bus ticket collectorly, deep.",
      "I don't do this because of the bus ticket theory. I do it because I want them to feel the joy of learning, and they're never going to feel that about something I'm making them learn. It has to be something they're interested in.",
      "I'm just following the path of least resistance; depth is a byproduct. But if in trying to show them the joy of learning I also end up training them to go deep, so much the better.Will it have any effect?",
      "I have no idea. But that uncertainty may be the most interesting point of all. There is so much more to learn about how to do great work. As old as human civilization feels, it's really still very young if we haven't nailed something so basic.",
      "It's exciting to think there are still discoveries to make about discovery. If that's the sort of thing you're interested in. Notes[1] There are other types of collecting that illustrate this point better than bus tickets, but they're also more popular.",
      "It seemed just as well to use an inferior example rather than offend more people by telling them their hobby doesn't matter.[2] I worried a little about using the word \"disinterested,\" since some people mistakenly believe it means not interested.",
      "But anyone who expects to be a genius will have to know the meaning of such a basic word, so I figure they may as well start now.[3] Think how often genius must have been nipped in the bud by people being told, or telling themselves, to stop messing about and be responsible.",
      "Ramanujan's mother was a huge enabler. Imagine if she hadn't been. Imagine if his parents had made him go out and get a job instead of sitting around at home doing math.On the other hand, anyone quoting the preceding paragraph to justify not getting a job is probably mistaken.[4] 1709 Darwin is to time what the Milanese Leonardo is to space.[5] \"An infinite capacity for taking pains\" is a paraphrase of what Carlyle wrote.",
      "What he wrote, in his History of Frederick the Great, was \"... it is the fruit of 'genius' (which means transcendent capacity of taking trouble, first of all)....\" Since the paraphrase seems the name of the idea at this point, I kept it.Carlyle's History was published in 1858.",
      "In 1785 Hérault de Séchelles quoted Buffon as saying \"Le génie n'est qu'une plus grande aptitude ŕ la patience.\" (Genius is only a greater aptitude for patience.)[6] Trollope was establishing the system of postal routes.",
      "He himself sensed the obsessiveness with which he pursued this goal. It is amusing to watch how a passion will grow upon a man. During those two years it was the ambition of my life to cover the country with rural letter-carriers.",
      "Even Newton occasionally sensed the degree of his obsessiveness. After computing pi to 15 digits, he wrote in a letter to a friend: I am ashamed to tell you to how many figures I carried these computations, having no other business at the time.",
      "Incidentally, Ramanujan was also a compulsive calculator. As Kanigel writes in his excellent biography: One Ramanujan scholar, B. M. Wilson, later told how Ramanujan's research into number theory was often \"preceded by a table of numerical results, carried usually to a length from which most of us would shrink.\" [7] Working to understand the natural world counts as creating rather than consuming.Newton tripped over this distinction when he chose to work on theology.",
      "His beliefs did not allow him to see it, but chasing down paradoxes in nature is fruitful in a way that chasing down paradoxes in sacred texts is not.[8] How much of people's propensity to become interested in a topic is inborn?",
      "My experience so far suggests the answer is: most of it. Different kids get interested in different things, and it's hard to make a child interested in something they wouldn't otherwise be. Not in a way that sticks.",
      "The most you can do on behalf of a topic is to make sure it gets a fair showing — to make it clear to them, for example, that there's more to math than the dull drills they do in school. After that it's up to the child.Thanks to Marc Andreessen, Trevor Blackwell, Patrick Collison, Kevin Lacker, Jessica Livingston, Jackie McDonough, Robert Morris, Lisa Randall, Zak Stone, and my 7 year old for reading drafts of this.Spanish TranslationRussian TranslationKorean TranslationArmenian Translation"
    ],
    "word_count": 2592,
    "paragraph_count": 52
  },
  "processed_at": "2025-07-26T19:04:54.807753",
  "paragraphs": [
    {
      "original": "November 2019Everyone knows that to do great work you need both natural ability and determination. But there's a third ingredient that's not as well understood: an obsessive interest in a particular topic.To explain this point I need to burn my reputation with some group of people, and I'm going to choose bus ticket collectors.",
      "translated": "2019年11月\n众所周知，要做出伟大的工作，既需要天赋，也需要决心。但还有第三个因素往往被人们忽视：对某一特定主题的痴迷兴趣。\n为了说明这一点，我需要在某些人中间毁掉我的声誉，而我选择的对象是公交售票员。"
    },
    {
      "original": "There are people who collect old bus tickets. Like many collectors, they have an obsessive interest in the minutiae of what they collect. They can keep track of distinctions between different types of bus tickets that would be hard for the rest of us to remember.",
      "translated": "有人收集旧的公交车票。像许多收藏家一样，他们对所收藏物品的细节有着痴迷的兴趣。他们能够记住不同类型的公交车票之间的区别，这些区别对我们大多数人来说是很难记住的。"
    },
    {
      "original": "Because we don't care enough. What's the point of spending so much time thinking about old bus tickets?Which leads us to the second feature of this kind of obsession: there is no point. A bus ticket collector's love is disinterested.",
      "translated": "因为我们不够在乎。花那么多时间去思考旧的公交车票有什么意义呢？这引出了这种痴迷的第二个特点：毫无意义。公交车票收藏者的爱是无私的。"
    },
    {
      "original": "They're not doing it to impress us or to make themselves rich, but for its own sake.When you look at the lives of people who've done great work, you see a consistent pattern. They often begin with a bus ticket collector's obsessive interest in something that would have seemed pointless to most of their contemporaries.",
      "translated": "他们这么做并不是为了给人留下深刻印象，也不是为了让自己致富，而是为了追求这件事本身的价值。当你观察那些做出伟大工作的人的生活时，你会发现一个一致的模式。他们往往是从一种对大多数人同时代人来说看似毫无意义的事物的痴迷开始的。"
    },
    {
      "original": "One of the most striking features of Darwin's book about his voyage on the Beagle is the sheer depth of his interest in natural history. His curiosity seems infinite. Ditto for Ramanujan, sitting by the hour working out on his slate what happens to series.It's a mistake to think they were \"laying the groundwork\" for the discoveries they made later.",
      "translated": "达尔文在《贝格尔号航行》一书中的一个最引人注目的特点是他对自然史的深厚兴趣。他的好奇心似乎无穷无尽。拉马努金也是如此，他常常一坐就是几个小时，在石板上研究数列的变化。认为他们是在为后来的发现“奠定基础”是一种误解。"
    },
    {
      "original": "There's too much intention in that metaphor. Like bus ticket collectors, they were doing it because they liked it.But there is a difference between Ramanujan and a bus ticket collector. Series matter, and bus tickets don't.If I had to put the recipe for genius into one sentence, that might be it: to have a disinterested obsession with something that matters.Aren't I forgetting about the other two ingredients?",
      "translated": "那个比喻里包含了太多的意图。像公交车票务员一样，他们做这些是因为喜欢。但拉马努金和公交车票务员之间存在差异。数列很重要，而车票则不然。如果要把天才的配方浓缩成一句话，那可能就是：对重要的事物保持一种无功利的痴迷。难道我忘记了另外两个成分吗？"
    },
    {
      "original": "Less than you might think. An obsessive interest in a topic is both a proxy for ability and a substitute for determination. Unless you have sufficient mathematical aptitude, you won't find series interesting.",
      "translated": "比你想象的要少。对某个话题的痴迷既是对能力的一种反映，也是对决心的一种替代。除非你有足够的数学天赋，否则你不会觉得数列有趣。"
    },
    {
      "original": "And when you're obsessively interested in something, you don't need as much determination: you don't need to push yourself as hard when curiosity is pulling you.An obsessive interest will even bring you luck, to the extent anything can.",
      "translated": "当你对某件事有着强烈的兴趣时，你就不需要那么多的毅力：当好奇心在牵引你时，你不需要那么努力地推动自己。强烈的兴趣甚至会给你带来好运，至少在某种程度上是这样。"
    },
    {
      "original": "Chance, as Pasteur said, favors the prepared mind, and if there's one thing an obsessed mind is, it's prepared.The disinterestedness of this kind of obsession is its most important feature. Not just because it's a filter for earnestness, but because it helps you discover new ideas.The paths that lead to new ideas tend to look unpromising.",
      "translated": "正如巴斯德所说，机遇偏爱有准备的头脑，而一个痴迷的头脑最显著的特点就是它的无功利性。这不仅仅是因为它能筛选出真诚的态度，还因为它能帮助你发现新的想法。通向新想法的道路往往看起来并不令人看好。"
    },
    {
      "original": "If they looked promising, other people would already have explored them. How do the people who do great work discover these paths that others overlook? The popular story is that they simply have better vision: because they're so talented, they see paths that others miss.",
      "translated": "如果这些领域有潜力，别人早就已经探索过了。那些做出杰出工作的人是如何发现别人忽略的道路的？流行的说法是，他们只是有更高的眼界：因为他们非常有才华，所以能看到别人忽视的道路。"
    },
    {
      "original": "But if you look at the way great discoveries are made, that's not what happens. Darwin didn't pay closer attention to individual species than other people because he saw that this would lead to great discoveries, and they didn't.",
      "translated": "但如果你观察伟大发现的产生方式，就会发现并非如此。达尔文并没有比其他人更关注个别物种，因为他认为这会导致重大发现，而其他人也没有这么做。"
    },
    {
      "original": "He was just really, really interested in such things.Darwin couldn't turn it off. Neither could Ramanujan. They didn't discover the hidden paths that they did because they seemed promising, but because they couldn't help it.",
      "translated": "他对这类事物非常非常感兴趣。达尔文无法抑制这种兴趣。拉马努金也是如此。他们发现那些隐秘的路径，并不是因为看起来有希望，而是因为他们无法控制自己。"
    },
    {
      "original": "That's what allowed them to follow paths that someone who was merely ambitious would have ignored.What rational person would decide that the way to write great novels was to begin by spending several years creating an imaginary elvish language, like Tolkien, or visiting every household in southwestern Britain, like Trollope?",
      "translated": "这使他们能够沿着一个仅仅有野心的人会忽视的道路前进。哪个理性的人会决定，要写伟大的小说，就得先花几年时间创造一种想象中的精灵语言，像托尔金那样，或者走访英国西南部的每一户人家，像特罗洛普那样？"
    },
    {
      "original": "No one, including Tolkien and Trollope.The bus ticket theory is similar to Carlyle's famous definition of genius as an infinite capacity for taking pains. But there are two differences. The bus ticket theory makes it clear that the source of this infinite capacity for taking pains is not infinite diligence, as Carlyle seems to have meant, but the sort of infinite interest that collectors have.",
      "translated": "没有人，包括托尔金和特罗洛普。车票理论类似于卡莱尔对天才的著名定义，即天才拥有无限的忍耐力。但存在两个差异。车票理论明确指出，这种无限忍耐力的来源并非卡莱尔所指的无限勤奋，而是收藏家所拥有的那种无限兴趣。"
    },
    {
      "original": "It also adds an important qualification: an infinite capacity for taking pains about something that matters.So what matters? You can never be sure. It's precisely because no one can tell in advance which paths are promising that you can discover new ideas by working on what you're interested in.But there are some heuristics you can use to guess whether an obsession might be one that matters.",
      "translated": "它还增加了一个重要的限定条件：对重要事物的不懈追求能力。那么，什么才是重要的呢？你永远无法确定。正是因为没有人能够提前判断哪些路径是有希望的，你才能通过致力于自己感兴趣的事物来发现新思想。但有一些启发式的方法可以帮助你猜测某个执着是否可能是重要的。"
    },
    {
      "original": "For example, it's more promising if you're creating something, rather than just consuming something someone else creates. It's more promising if something you're interested in is difficult, especially if it's more difficult for other people than it is for you.",
      "translated": "例如，创造东西比仅仅消费别人创造的东西更有前景。如果你对某件事感兴趣，而且这件事很难，特别是对其他人来说比对你来说更难的话，那么这件事就更有前景。"
    },
    {
      "original": "And the obsessions of talented people are more likely to be promising. When talented people become interested in random things, they're not truly random.But you can never be sure. In fact, here's an interesting idea that's also rather alarming if it's true: it may be that to do great work, you also have to waste a lot of time.In many different areas, reward is proportionate to risk.",
      "translated": "有才华的人的痴迷更有可能是值得期待的。当有才华的人对某些随机事物产生兴趣时，这些事物其实并不真正随机。但你永远无法确定。事实上，这里有一个有趣的想法，如果它是真的，也会令人感到不安：要做好伟大的工作，你可能也需要浪费大量的时间。在许多不同的领域，回报与风险成正比。"
    },
    {
      "original": "If that rule holds here, then the way to find paths that lead to truly great work is to be willing to expend a lot of effort on things that turn out to be every bit as unpromising as they seem.I'm not sure if this is true.",
      "translated": "如果这条规则在这里适用，那么找到通向真正伟大工作的路径的方法就是愿意在那些最终证明与最初看起来一样没有希望的事情上投入大量努力。我不确定这是否正确。"
    },
    {
      "original": "On one hand, it seems surprisingly difficult to waste your time so long as you're working hard on something interesting. So much of what you do ends up being useful. But on the other hand, the rule about the relationship between risk and reward is so powerful that it seems to hold wherever risk occurs.",
      "translated": "一方面，只要你努力做一件有趣的事情，似乎很难浪费时间。你所做的很多事情最终都会变得有用。但另一方面，风险与回报之间的关系规则如此强大，以至于似乎在任何存在风险的地方都适用。"
    },
    {
      "original": "Newton's case, at least, suggests that the risk/reward rule holds here. He's famous for one particular obsession of his that turned out to be unprecedentedly fruitful: using math to describe the world.",
      "translated": "牛顿的例子至少表明，风险与回报的规则在这里是适用的。他因一个特别的痴迷而闻名，这个痴迷最终证明是前所未有的富有成效：用数学来描述世界。"
    },
    {
      "original": "But he had two other obsessions, alchemy and theology, that seem to have been complete wastes of time. He ended up net ahead. His bet on what we now call physics paid off so well that it more than compensated for the other two.",
      "translated": "但他还有两个痴迷，炼金术和神学，这些似乎完全是浪费时间。最终他还是有所收获。他对我们现在称为物理学的押注得到了如此丰厚的回报，足以抵消另外两者的损失。"
    },
    {
      "original": "But were the other two necessary, in the sense that he had to take big risks to make such big discoveries? I don't know.Here's an even more alarming idea: might one make all bad bets? It probably happens quite often.",
      "translated": "但另外两个是否有必要，也就是说，他必须冒大风险才能有如此重大的发现？我不知道。这里有一个更令人担忧的想法：一个人会不会所有赌注都押错了？这种情况可能相当常见。"
    },
    {
      "original": "But we don't know how often, because these people don't become famous.It's not merely that the returns from following a path are hard to predict. They change dramatically over time. 1830 was a really good time to be obsessively interested in natural history.",
      "translated": "但我们不知道这种情况发生的频率，因为这些人都没有成名。这不仅仅是因为遵循某条道路的回报难以预测，这些回报还会随着时间发生巨大变化。1830年是一个对自然史痴迷的好时机。"
    },
    {
      "original": "If Darwin had been born in 1709 instead of 1809, we might never have heard of him.What can one do in the face of such uncertainty? One solution is to hedge your bets, which in this case means to follow the obviously promising paths instead of your own private obsessions.",
      "translated": "如果达尔文出生于1709年而不是1809年，我们可能就永远不会听说过他。面对这样的不确定性，我们能做些什么呢？一个解决办法是分散风险，在这种情况下意味着追随那些明显有前景的道路，而不是你个人的私密兴趣。"
    },
    {
      "original": "But as with any hedge, you're decreasing reward when you decrease risk. If you forgo working on what you like in order to follow some more conventionally ambitious path, you might miss something wonderful that you'd otherwise have discovered.",
      "translated": "但是，就像任何一种对冲一样，当你降低风险时，也同时减少了回报。如果你放弃做自己喜欢的事情，转而去追求一些更为传统意义上的雄心勃勃的道路，你可能会错失一些原本可以发现的美妙事物。"
    },
    {
      "original": "That too must happen all the time, perhaps even more often than the genius whose bets all fail.The other solution is to let yourself be interested in lots of different things. You don't decrease your upside if you switch between equally genuine interests based on which seems to be working so far.",
      "translated": "这种情况也时有发生，可能甚至比那些赌注全军覆没的天才更加频繁。另一种解决办法是让自己对许多不同的事物保持兴趣。如果你根据哪些兴趣目前看起来更有效果而在它们之间切换，这并不会减少你的潜在收益。"
    },
    {
      "original": "But there is a danger here too: if you work on too many different projects, you might not get deeply enough into any of them.One interesting thing about the bus ticket theory is that it may help explain why different types of people excel at different kinds of work.",
      "translated": "但是这里也存在一个危险：如果你同时进行的项目太多，可能无法深入到任何一个项目中。关于车票理论的一个有趣之处在于，它或许能解释为什么不同的人擅长不同类型的工作。"
    },
    {
      "original": "Interest is much more unevenly distributed than ability. If natural ability is all you need to do great work, and natural ability is evenly distributed, you have to invent elaborate theories to explain the skewed distributions we see among those who actually do great work in various fields.",
      "translated": "兴趣的分布远比能力的分布不均匀。如果认为只需要天生的能力就能做出伟大的工作，而天生的能力是均匀分布的，那么你就必须提出复杂的理论来解释在各个领域中实际做出伟大工作的人之间所观察到的不均匀分布。"
    },
    {
      "original": "But it may be that much of the skew has a simpler explanation: different people are interested in different things.The bus ticket theory also explains why people are less likely to do great work after they have children.",
      "translated": "但可能很多的偏差有一个更简单的解释：不同的人对不同的事物感兴趣。公交车票理论也解释了为什么人们在有了孩子之后不太可能做出杰出的工作。"
    },
    {
      "original": "Here interest has to compete not just with external obstacles, but with another interest, and one that for most people is extremely powerful. It's harder to find time for work after you have kids, but that's the easy part.",
      "translated": "在这里，兴趣不仅要与外部障碍竞争，还要与另一种兴趣竞争，而这种兴趣对大多数人来说极为强大。有了孩子后，很难再抽出时间工作，但这还只是容易的部分。"
    },
    {
      "original": "The real change is that you don't want to.But the most exciting implication of the bus ticket theory is that it suggests ways to encourage great work. If the recipe for genius is simply natural ability plus hard work, all we can do is hope we have a lot of ability, and work as hard as we can.",
      "translated": "真正的变化是你不愿意。但是公车票理论最令人兴奋的含义在于，它提出了鼓励出色工作的方法。如果天才的配方仅仅是天赋加上努力工作，我们能做的就是希望我们有足够的能力，并且尽我们所能地努力工作。"
    },
    {
      "original": "But if interest is a critical ingredient in genius, we may be able, by cultivating interest, to cultivate genius.For example, for the very ambitious, the bus ticket theory suggests that the way to do great work is to relax a little.",
      "translated": "但是，如果兴趣是天才的关键成分，那么我们可能通过培养兴趣来培养天才。例如，对于那些非常有抱负的人来说，车票理论建议，要做出伟大的工作，稍微放松一点可能会更好。"
    },
    {
      "original": "Instead of gritting your teeth and diligently pursuing what all your peers agree is the most promising line of research, maybe you should try doing something just for fun. And if you're stuck, that may be the vector along which to break out.I've always liked Hamming's famous double-barrelled question: what are the most important problems in your field, and why aren't you working on one of them?",
      "translated": "与其咬紧牙关，勤奋地追求所有同行都认为最有前景的研究方向，也许你应该尝试做些有趣的事情。如果你感到迷茫，这可能就是你突破的方向。我一直以来都很喜欢汉明的那个著名的双重问题：你所在领域最重要的问题是什么，为什么你没有在研究其中之一？"
    },
    {
      "original": "It's a great way to shake yourself up. But it may be overfitting a bit. It might be at least as useful to ask yourself: if you could take a year off to work on something that probably wouldn't be important but would be really interesting, what would it be?The bus ticket theory also suggests a way to avoid slowing down as you get older.",
      "translated": "这是一个让自己振作起来的好方法。但可能有点过拟合了。至少问问自己：如果你可以抽出一年时间去做一件可能不重要但非常有趣的事情，那会是什么？公交车票理论还提供了一种避免随着年龄增长而放慢速度的方法。"
    },
    {
      "original": "Perhaps the reason people have fewer new ideas as they get older is not simply that they're losing their edge. It may also be because once you become established, you can no longer mess about with irresponsible side projects the way you could when you were young and no one cared what you did.The solution to that is obvious: remain irresponsible.",
      "translated": "也许人们随着年龄增长而减少新想法的原因，并不仅仅是他们失去了敏锐度。还可能是因为一旦你站稳了脚跟，就无法像年轻时那样随心所欲地进行不负责任的副业了，那时候没人关心你做什么。解决这个问题的方法显而易见：保持不负责。"
    },
    {
      "original": "It will be hard, though, because the apparently random projects you take up to stave off decline will read to outsiders as evidence of it. And you yourself won't know for sure that they're wrong. But it will at least be more fun to work on what you want.It may even be that we can cultivate a habit of intellectual bus ticket collecting in kids.",
      "translated": "这将很困难，因为你为了防止衰退而进行的看似随机的项目，在外人看来可能是衰退的证据。而你自己也无法确定他们错了。但至少，从事自己感兴趣的项目会更有趣。或许，我们甚至可以在孩子中培养一种收集知识“车票”的习惯。"
    },
    {
      "original": "The usual plan in education is to start with a broad, shallow focus, then gradually become more specialized. But I've done the opposite with my kids. I know I can count on their school to handle the broad, shallow part, so I take them deep.When they get interested in something, however random, I encourage them to go preposterously, bus ticket collectorly, deep.",
      "translated": "通常的教育计划是先从广泛而浅显的内容开始，然后逐渐变得更加专业。但我对我的孩子们采取了相反的做法。我知道我可以依赖他们的学校来处理广泛而浅显的部分，所以我带他们深入探索。当他们对某件事产生兴趣，无论多么随机，我都鼓励他们深入研究，深入到荒诞不经、像售票员一样深入。"
    },
    {
      "original": "I don't do this because of the bus ticket theory. I do it because I want them to feel the joy of learning, and they're never going to feel that about something I'm making them learn. It has to be something they're interested in.",
      "translated": "我不这样做是因为“车票理论”。我这样做是因为我想让他们感受到学习的快乐，而他们永远不会对我强迫他们学习的东西感到快乐。这必须是他们感兴趣的东西。"
    },
    {
      "original": "I'm just following the path of least resistance; depth is a byproduct. But if in trying to show them the joy of learning I also end up training them to go deep, so much the better.Will it have any effect?",
      "translated": "我只是在走阻力最小的路；深度是副产品。但如果在试图向他们展示学习的乐趣时，我也能教会他们深入研究，那更好不过了。这会有任何效果吗？"
    },
    {
      "original": "I have no idea. But that uncertainty may be the most interesting point of all. There is so much more to learn about how to do great work. As old as human civilization feels, it's really still very young if we haven't nailed something so basic.",
      "translated": "我不知道。但这种不确定性可能是最有趣的一点。我们还需要学习很多关于如何做好工作。尽管人类文明感觉已经很古老，但如果连这么基本的事情都还没有掌握，其实它仍然非常年轻。"
    },
    {
      "original": "It's exciting to think there are still discoveries to make about discovery. If that's the sort of thing you're interested in. Notes[1] There are other types of collecting that illustrate this point better than bus tickets, but they're also more popular.",
      "translated": "想到关于发现本身还有待发现的事情，这真是令人兴奋。当然，这得是你感兴趣的事。注释[1] 除了公交车票，还有其他类型的收藏能更好地说明这一点，但它们也更受欢迎。"
    },
    {
      "original": "It seemed just as well to use an inferior example rather than offend more people by telling them their hobby doesn't matter.[2] I worried a little about using the word \"disinterested,\" since some people mistakenly believe it means not interested.",
      "translated": "使用一个较差的例子似乎也是个不错的选择，总比告诉人们他们的爱好无关紧要而冒犯更多人要好。[2] 我对使用“不偏不倚”这个词有点担心，因为有些人错误地认为它的意思是不感兴趣。"
    },
    {
      "original": "But anyone who expects to be a genius will have to know the meaning of such a basic word, so I figure they may as well start now.[3] Think how often genius must have been nipped in the bud by people being told, or telling themselves, to stop messing about and be responsible.",
      "translated": "但任何一个期望成为天才的人都必须知道这样一个基本词汇的意义，所以我认为他们最好现在就开始。[3] 想想看，天才的想法有多少次因为人们被告知或自我告诫要停止胡闹、变得负责任而被扼杀在萌芽状态。"
    },
    {
      "original": "Ramanujan's mother was a huge enabler. Imagine if she hadn't been. Imagine if his parents had made him go out and get a job instead of sitting around at home doing math.On the other hand, anyone quoting the preceding paragraph to justify not getting a job is probably mistaken.[4] 1709 Darwin is to time what the Milanese Leonardo is to space.[5] \"An infinite capacity for taking pains\" is a paraphrase of what Carlyle wrote.",
      "translated": "拉马努金的母亲是一个巨大的支持者。想象一下，如果她不是这样的人会怎样。想象一下，如果他的父母让他出去找工作，而不是整天待在家里做数学。另一方面，任何引用上面这段话来为自己不找工作辩解的人可能是错误的。[4] 1709 达尔文对时间的意义就像米兰的莱昂纳多对空间的意义一样。[5] “无限的耐心”是卡莱尔所写内容的一种转述。"
    },
    {
      "original": "What he wrote, in his History of Frederick the Great, was \"... it is the fruit of 'genius' (which means transcendent capacity of taking trouble, first of all)....\" Since the paraphrase seems the name of the idea at this point, I kept it.Carlyle's History was published in 1858.",
      "translated": "他在《腓特烈大帝传》中写道：“……这是‘天才’的果实（首先意味着超凡的吃苦耐劳能力）……”由于此处的意译似乎更符合这个概念的名称，我保留了这种表达。卡莱尔的《腓特烈大帝传》出版于1858年。"
    },
    {
      "original": "In 1785 Hérault de Séchelles quoted Buffon as saying \"Le génie n'est qu'une plus grande aptitude ŕ la patience.\" (Genius is only a greater aptitude for patience.)[6] Trollope was establishing the system of postal routes.",
      "translated": "1785年，赫尔奥·德·塞歇尔引用布丰的话说：“天才不过是更善于忍耐罢了。”（Genius is only a greater aptitude for patience.）特罗洛普正在建立邮政线路系统。"
    },
    {
      "original": "He himself sensed the obsessiveness with which he pursued this goal. It is amusing to watch how a passion will grow upon a man. During those two years it was the ambition of my life to cover the country with rural letter-carriers.",
      "translated": "他自己也意识到了自己对这一目标的痴迷程度。看着一个人对某种热情如何逐渐加深，真是有趣。在那两年里，我的生活目标就是让乡村邮递员遍布全国。"
    },
    {
      "original": "Even Newton occasionally sensed the degree of his obsessiveness. After computing pi to 15 digits, he wrote in a letter to a friend: I am ashamed to tell you to how many figures I carried these computations, having no other business at the time.",
      "translated": "就连牛顿偶尔也会意识到自己的痴迷程度。在将圆周率计算到15位后，他在给朋友的一封信中写道：我羞于告诉你我将这些计算进行了多少位，在那段时间里我没有任何其他事情可做。"
    },
    {
      "original": "Incidentally, Ramanujan was also a compulsive calculator. As Kanigel writes in his excellent biography: One Ramanujan scholar, B. M. Wilson, later told how Ramanujan's research into number theory was often \"preceded by a table of numerical results, carried usually to a length from which most of us would shrink.\" [7] Working to understand the natural world counts as creating rather than consuming.Newton tripped over this distinction when he chose to work on theology.",
      "translated": "顺便提一下，拉马努金也是一个强迫性的计算者。正如卡尼格尔在他出色的传记中所写的：拉马努金的研究学者之一，B. M. 威尔逊后来回忆说，拉马努金对数论的研究常常“以一张数值结果表为先导，这些表格通常长到大多数人都会望而却步的程度。”[7] 研究自然世界的行为被视为创造而非消费。牛顿在选择研究神学时，就忽略了这一区分。"
    },
    {
      "original": "His beliefs did not allow him to see it, but chasing down paradoxes in nature is fruitful in a way that chasing down paradoxes in sacred texts is not.[8] How much of people's propensity to become interested in a topic is inborn?",
      "translated": "他的信仰使他无法看到这一点，但在自然界中追寻悖论比在圣典中追寻悖论更有成效。人们对于某个话题产生兴趣的倾向中有多少是天生的？"
    },
    {
      "original": "My experience so far suggests the answer is: most of it. Different kids get interested in different things, and it's hard to make a child interested in something they wouldn't otherwise be. Not in a way that sticks.",
      "translated": "我的经验表明，答案是：大部分如此。不同的孩子对不同的事物感兴趣，很难让一个孩子对原本不感兴趣的事物产生兴趣。而且这种兴趣很难持久。"
    },
    {
      "original": "The most you can do on behalf of a topic is to make sure it gets a fair showing — to make it clear to them, for example, that there's more to math than the dull drills they do in school. After that it's up to the child.Thanks to Marc Andreessen, Trevor Blackwell, Patrick Collison, Kevin Lacker, Jessica Livingston, Jackie McDonough, Robert Morris, Lisa Randall, Zak Stone, and my 7 year old for reading drafts of this.Spanish TranslationRussian TranslationKorean TranslationArmenian Translation",
      "translated": "你为一个主题所能做的最多就是确保它得到公正的呈现——例如，让他们明白数学不仅仅是学校里那些枯燥的练习。之后就取决于孩子了。感谢 Marc Andreessen、Trevor Blackwell、Patrick Collison、Kevin Lacker、Jessica Livingston、Jackie McDonough、Robert Morris、Lisa Randall、Zak Stone 以及我的七岁孩子审阅本文的草稿。西班牙语翻译俄语翻译韩语翻译亚美尼亚语翻译"
    }
  ],
  "translation_completed": "2025-07-28T15:39:11.217012",
  "translation_stats": {
    "total_paragraphs": 52,
    "success_count": 52,
    "success_rate": "100.0%"
  }
}