{
  "title": "How Art Can Be Good",
  "title_zh": "[待翻译] How Art Can Be Good",
  "url": "https://www.paulgraham.com/goodart.html",
  "filename": "goodart.html",
  "date": "2006-12-01",
  "id": 186,
  "content": {
    "success": true,
    "paragraphs": [
      "December 2006I grew up believing that taste is just a matter of personal preference. Each person has things they like, but no one's preferences are any better than anyone else's. There is no such thing as good taste.Like a lot of things I grew up believing, this turns out to be false, and I'm going to try to explain why.One problem with saying there's no such thing as good taste is that it also means there's no such thing as good art.",
      "If there were good art, then people who liked it would have better taste than people who didn't. So if you discard taste, you also have to discard the idea of art being good, and artists being good at making it.It was pulling on that thread that unravelled my childhood faith in relativism.",
      "When you're trying to make things, taste becomes a practical matter. You have to decide what to do next. Would it make the painting better if I changed that part? If there's no such thing as better, it doesn't matter what you do.",
      "In fact, it doesn't matter if you paint at all. You could just go out and buy a ready-made blank canvas. If there's no such thing as good, that would be just as great an achievement as the ceiling of the Sistine Chapel.",
      "Less laborious, certainly, but if you can achieve the same level of performance with less effort, surely that's more impressive, not less.Yet that doesn't seem quite right, does it?AudienceI think the key to this puzzle is to remember that art has an audience.",
      "Art has a purpose, which is to interest its audience. Good art (like good anything) is art that achieves its purpose particularly well. The meaning of \"interest\" can vary. Some works of art are meant to shock, and others to please; some are meant to jump out at you, and others to sit quietly in the background.",
      "But all art has to work on an audience, and—here's the critical point—members of the audience share things in common.For example, nearly all humans find human faces engaging. It seems to be wired into us.",
      "Babies can recognize faces practically from birth. In fact, faces seem to have co-evolved with our interest in them; the face is the body's billboard. So all other things being equal, a painting with faces in it will interest people more than one without.",
      "[1]One reason it's easy to believe that taste is merely personal preference is that, if it isn't, how do you pick out the people with better taste? There are billions of people, each with their own opinion; on what grounds can you prefer one to another?",
      "[2]But if audiences have a lot in common, you're not in a position of having to choose one out of a random set of individual biases, because the set isn't random. All humans find faces engaging—practically by definition: face recognition is in our DNA.",
      "And so having a notion of good art, in the sense of art that does its job well, doesn't require you to pick out a few individuals and label their opinions as correct. No matter who you pick, they'll find faces engaging.Of course, space aliens probably wouldn't find human faces engaging.",
      "But there might be other things they shared in common with us. The most likely source of examples is math. I expect space aliens would agree with us most of the time about which of two proofs was better.",
      "Erdos thought so. He called a maximally elegant proof one out of God's book, and presumably God's book is universal. [3]Once you start talking about audiences, you don't have to argue simply that there are or aren't standards of taste.",
      "Instead tastes are a series of concentric rings, like ripples in a pond. There are some things that will appeal to you and your friends, others that will appeal to most people your age, others that will appeal to most humans, and perhaps others that would appeal to most sentient beings (whatever that means).The picture is slightly more complicated than that, because in the middle of the pond there are overlapping sets of ripples.",
      "For example, there might be things that appealed particularly to men, or to people from a certain culture.If good art is art that interests its audience, then when you talk about art being good, you also have to say for what audience.",
      "So is it meaningless to talk about art simply being good or bad? No, because one audience is the set of all possible humans. I think that's the audience people are implicitly talking about when they say a work of art is good: they mean it would engage any human.",
      "[4]And that is a meaningful test, because although, like any everyday concept, \"human\" is fuzzy around the edges, there are a lot of things practically all humans have in common. In addition to our interest in faces, there's something special about primary colors for nearly all of us, because it's an artifact of the way our eyes work.",
      "Most humans will also find images of 3D objects engaging, because that also seems to be built into our visual perception. [5] And beneath that there's edge-finding, which makes images with definite shapes more engaging than mere blur.Humans have a lot more in common than this, of course.",
      "My goal is not to compile a complete list, just to show that there's some solid ground here. People's preferences aren't random. So an artist working on a painting and trying to decide whether to change some part of it doesn't have to think \"Why bother?",
      "I might as well flip a coin.\" Instead he can ask \"What would make the painting more interesting to people?\" And the reason you can't equal Michelangelo by going out and buying a blank canvas is that the ceiling of the Sistine Chapel is more interesting to people.A lot of philosophers have had a hard time believing it was possible for there to be objective standards for art.",
      "It seemed obvious that beauty, for example, was something that happened in the head of the observer, not something that was a property of objects. It was thus \"subjective\" rather than \"objective.\" But in fact if you narrow the definition of beauty to something that works a certain way on humans, and you observe how much humans have in common, it turns out to be a property of objects after all.",
      "You don't have to choose between something being a property of the subject or the object if subjects all react similarly. Being good art is thus a property of objects as much as, say, being toxic to humans is: it's good art if it consistently affects humans in a certain way.",
      "ErrorSo could we figure out what the best art is by taking a vote? After all, if appealing to humans is the test, we should be able to just ask them, right?Well, not quite. For products of nature that might work.",
      "I'd be willing to eat the apple the world's population had voted most delicious, and I'd probably be willing to visit the beach they voted most beautiful, but having to look at the painting they voted the best would be a crapshoot.Man-made stuff is different.",
      "For one thing, artists, unlike apple trees, often deliberately try to trick us. Some tricks are quite subtle. For example, any work of art sets expectations by its level of finish. You don't expect photographic accuracy in something that looks like a quick sketch.",
      "So one widely used trick, especially among illustrators, is to intentionally make a painting or drawing look like it was done faster than it was. The average person looks at it and thinks: how amazingly skillful.",
      "It's like saying something clever in a conversation as if you'd thought of it on the spur of the moment, when in fact you'd worked it out the day before.Another much less subtle influence is brand. If you go to see the Mona Lisa, you'll probably be disappointed, because it's hidden behind a thick glass wall and surrounded by a frenzied crowd taking pictures of themselves in front of it.",
      "At best you can see it the way you see a friend across the room at a crowded party. The Louvre might as well replace it with copy; no one would be able to tell. And yet the Mona Lisa is a small, dark painting.",
      "If you found people who'd never seen an image of it and sent them to a museum in which it was hanging among other paintings with a tag labelling it as a portrait by an unknown fifteenth century artist, most would walk by without giving it a second look.For the average person, brand dominates all other factors in the judgement of art.",
      "Seeing a painting they recognize from reproductions is so overwhelming that their response to it as a painting is drowned out.And then of course there are the tricks people play on themselves. Most adults looking at art worry that if they don't like what they're supposed to, they'll be thought uncultured.",
      "This doesn't just affect what they claim to like; they actually make themselves like things they're supposed to.That's why you can't just take a vote. Though appeal to people is a meaningful test, in practice you can't measure it, just as you can't find north using a compass with a magnet sitting next to it.",
      "There are sources of error so powerful that if you take a vote, all you're measuring is the error.We can, however, approach our goal from another direction, by using ourselves as guinea pigs. You're human.",
      "If you want to know what the basic human reaction to a piece of art would be, you can at least approach that by getting rid of the sources of error in your own judgements.For example, while anyone's reaction to a famous painting will be warped at first by its fame, there are ways to decrease its effects.",
      "One is to come back to the painting over and over. After a few days the fame wears off, and you can start to see it as a painting. Another is to stand close. A painting familiar from reproductions looks more familiar from ten feet away; close in you see details that get lost in reproductions, and which you're therefore seeing for the first time.There are two main kinds of error that get in the way of seeing a work of art: biases you bring from your own circumstances, and tricks played by the artist.",
      "Tricks are straightforward to correct for. Merely being aware of them usually prevents them from working. For example, when I was ten I used to be very impressed by airbrushed lettering that looked like shiny metal.",
      "But once you study how it's done, you see that it's a pretty cheesy trick—one of the sort that relies on pushing a few visual buttons really hard to temporarily overwhelm the viewer. It's like trying to convince someone by shouting at them.The way not to be vulnerable to tricks is to explicitly seek out and catalog them.",
      "When you notice a whiff of dishonesty coming from some kind of art, stop and figure out what's going on. When someone is obviously pandering to an audience that's easily fooled, whether it's someone making shiny stuff to impress ten year olds, or someone making conspicuously avant-garde stuff to impress would-be intellectuals, learn how they do it.",
      "Once you've seen enough examples of specific types of tricks, you start to become a connoisseur of trickery in general, just as professional magicians are.What counts as a trick? Roughly, it's something done with contempt for the audience.",
      "For example, the guys designing Ferraris in the 1950s were probably designing cars that they themselves admired. Whereas I suspect over at General Motors the marketing people are telling the designers, \"Most people who buy SUVs do it to seem manly, not to drive off-road.",
      "So don't worry about the suspension; just make that sucker as big and tough-looking as you can.\" [6]I think with some effort you can make yourself nearly immune to tricks. It's harder to escape the influence of your own circumstances, but you can at least move in that direction.",
      "The way to do it is to travel widely, in both time and space. If you go and see all the different kinds of things people like in other cultures, and learn about all the different things people have liked in the past, you'll probably find it changes what you like.",
      "I doubt you could ever make yourself into a completely universal person, if only because you can only travel in one direction in time. But if you find a work of art that would appeal equally to your friends, to people in Nepal, and to the ancient Greeks, you're probably onto something.My main point here is not how to have good taste, but that there can even be such a thing.",
      "And I think I've shown that. There is such a thing as good art. It's art that interests its human audience, and since humans have a lot in common, what interests them is not random. Since there's such a thing as good art, there's also such a thing as good taste, which is the ability to recognize it.If we were talking about the taste of apples, I'd agree that taste is just personal preference.",
      "Some people like certain kinds of apples and others like other kinds, but how can you say that one is right and the other wrong? [7]The thing is, art isn't apples. Art is man-made. It comes with a lot of cultural baggage, and in addition the people who make it often try to trick us.",
      "Most people's judgement of art is dominated by these extraneous factors; they're like someone trying to judge the taste of apples in a dish made of equal parts apples and jalapeno peppers. All they're tasting is the peppers.",
      "So it turns out you can pick out some people and say that they have better taste than others: they're the ones who actually taste art like apples.Or to put it more prosaically, they're the people who (a) are hard to trick, and (b) don't just like whatever they grew up with.",
      "If you could find people who'd eliminated all such influences on their judgement, you'd probably still see variation in what they liked. But because humans have so much in common, you'd also find they agreed on a lot.",
      "They'd nearly all prefer the ceiling of the Sistine Chapel to a blank canvas.Making ItI wrote this essay because I was tired of hearing \"taste is subjective\" and wanted to kill it once and for all. Anyone who makes things knows intuitively that's not true.",
      "When you're trying to make art, the temptation to be lazy is as great as in any other kind of work. Of course it matters to do a good job. And yet you can see how great a hold \"taste is subjective\" has even in the art world by how nervous it makes people to talk about art being good or bad.",
      "Those whose jobs require them to judge art, like curators, mostly resort to euphemisms like \"significant\" or \"important\" or (getting dangerously close) \"realized.\" [8]I don't have any illusions that being able to talk about art being good or bad will cause the people who talk about it to have anything more useful to say.",
      "Indeed, one of the reasons \"taste is subjective\" found such a receptive audience is that, historically, the things people have said about good taste have generally been such nonsense.It's not for the people who talk about art that I want to free the idea of good art, but for those who make it.",
      "Right now, ambitious kids going to art school run smack into a brick wall. They arrive hoping one day to be as good as the famous artists they've seen in books, and the first thing they learn is that the concept of good has been retired.",
      "Instead everyone is just supposed to explore their own personal vision. [9]When I was in art school, we were looking one day at a slide of some great fifteenth century painting, and one of the students asked \"Why don't artists paint like that now?\" The room suddenly got quiet.",
      "Though rarely asked out loud, this question lurks uncomfortably in the back of every art student's mind. It was as if someone had brought up the topic of lung cancer in a meeting within Philip Morris.\"Well,\" the professor replied, \"we're interested in different questions now.\" He was a pretty nice guy, but at the time I couldn't help wishing I could send him back to fifteenth century Florence to explain in person to Leonardo & Co.",
      "how we had moved beyond their early, limited concept of art. Just imagine that conversation.In fact, one of the reasons artists in fifteenth century Florence made such great things was that they believed you could make great things.",
      "[10] They were intensely competitive and were always trying to outdo one another, like mathematicians or physicists today—maybe like anyone who has ever done anything really well.The idea that you could make great things was not just a useful illusion.",
      "They were actually right. So the most important consequence of realizing there can be good art is that it frees artists to try to make it. To the ambitious kids arriving at art school this year hoping one day to make great things, I say: don't believe it when they tell you this is a naive and outdated ambition.",
      "There is such a thing as good art, and if you try to make it, there are people who will notice.Notes[1] This is not to say, of course, that good paintings must have faces in them, just that everyone's visual piano has that key on it.",
      "There are situations in which you want to avoid faces, precisely because they attract so much attention. But you can see how universally faces work by their prevalence in advertising.[2] The other reason it's easy to believe is that it makes people feel good.",
      "To a kid, this idea is crack. In every other respect they're constantly being told that they have a lot to learn. But in this they're perfect. Their opinion carries the same weight as any adult's. You should probably question anything you believed as a kid that you'd want to believe this much.[3] It's conceivable that the elegance of proofs is quantifiable, in the sense that there may be some formal measure that turns out to coincide with mathematicians' judgements.",
      "Perhaps it would be worth trying to make a formal language for proofs in which those considered more elegant consistently came out shorter (perhaps after being macroexpanded or compiled).[4] Maybe it would be possible to make art that would appeal to space aliens, but I'm not going to get into that because (a) it's too hard to answer, and (b) I'm satisfied if I can establish that good art is a meaningful idea for human audiences.[5] If early abstract paintings seem more interesting than later ones, it may be because the first abstract painters were trained to paint from life, and their hands thus tended to make the kind of gestures you use in representing physical things.",
      "In effect they were saying \"scaramara\" instead of \"uebfgbsb.\"[6] It's a bit more complicated, because sometimes artists unconsciously use tricks by imitating art that does.[7] I phrased this in terms of the taste of apples because if people can see the apples, they can be fooled.",
      "When I was a kid most apples were a variety called Red Delicious that had been bred to look appealing in stores, but which didn't taste very good.[8] To be fair, curators are in a difficult position.",
      "If they're dealing with recent art, they have to include things in shows that they think are bad. That's because the test for what gets included in shows is basically the market price, and for recent art that is largely determined by successful businessmen and their wives.",
      "So it's not always intellectual dishonesty that makes curators and dealers use neutral-sounding language.[9] What happens in practice is that everyone gets really good at talking about art. As the art itself gets more random, the effort that would have gone into the work goes instead into the intellectual sounding theory behind it.",
      "\"My work represents an exploration of gender and sexuality in an urban context,\" etc. Different people win at that game.[10] There were several other reasons, including that Florence was then the richest and most sophisticated city in the world, and that they lived in a time before photography had (a) killed portraiture as a source of income and (b) made brand the dominant factor in the sale of art.Incidentally, I'm not saying that good art = fifteenth century European art.",
      "I'm not saying we should make what they made, but that we should work like they worked. There are fields now in which many people work with the same energy and honesty that fifteenth century artists did, but art is not one of them.Thanks to Trevor Blackwell, Jessica Livingston, and Robert Morris for reading drafts of this, and to Paul Watson for permission to use the image at the top.Japanese TranslationSimplified Chinese Translation"
    ],
    "word_count": 3572,
    "paragraph_count": 67
  },
  "processed_at": "2025-07-26T19:07:27.829571",
  "paragraphs": [
    {
      "original": "December 2006I grew up believing that taste is just a matter of personal preference. Each person has things they like, but no one's preferences are any better than anyone else's. There is no such thing as good taste.Like a lot of things I grew up believing, this turns out to be false, and I'm going to try to explain why.One problem with saying there's no such thing as good taste is that it also means there's no such thing as good art.",
      "translated": "2006年12月，我从小坚信品味仅仅是一种个人偏好。每个人都有自己喜欢的东西，但没有人的偏好比其他人的更好。所谓的“好品味”根本不存在。和我成长过程中相信的许多事情一样，这一点也被证明是错误的，我将尝试解释原因。\n\n说没有好品味这回事的一个问题是，这同时也意味着没有好的艺术。"
    },
    {
      "original": "If there were good art, then people who liked it would have better taste than people who didn't. So if you discard taste, you also have to discard the idea of art being good, and artists being good at making it.It was pulling on that thread that unravelled my childhood faith in relativism.",
      "translated": "如果有好的艺术，那么喜欢它的人就会比不喜欢它的人有更好的品味。所以，如果你抛弃了品味，也就必须抛弃艺术有好坏之分以及艺术家擅长创作艺术的观点。正是这种思考让我童年时对相对主义的信仰土崩瓦解。"
    },
    {
      "original": "When you're trying to make things, taste becomes a practical matter. You have to decide what to do next. Would it make the painting better if I changed that part? If there's no such thing as better, it doesn't matter what you do.",
      "translated": "当你试图创作时，品味就变成了一件实际的事情。你必须决定下一步该做什么。如果我改变那部分，画会更好吗？如果没有更好的说法，那么你做什么都无关紧要。"
    },
    {
      "original": "In fact, it doesn't matter if you paint at all. You could just go out and buy a ready-made blank canvas. If there's no such thing as good, that would be just as great an achievement as the ceiling of the Sistine Chapel.",
      "translated": "事实上，你是否画画并不重要。你可以出去买一张现成的空白画布。如果根本就没有“好”这回事，那么这将与西斯廷教堂的天顶画一样伟大。"
    },
    {
      "original": "Less laborious, certainly, but if you can achieve the same level of performance with less effort, surely that's more impressive, not less.Yet that doesn't seem quite right, does it?AudienceI think the key to this puzzle is to remember that art has an audience.",
      "translated": "当然不那么费力，但如果你能以较少的努力达到同样的效果，这难道不更令人印象深刻吗？然而，这似乎有点不对劲，不是吗？观众我认为这个谜题的关键在于记住艺术是有观众的。"
    },
    {
      "original": "Art has a purpose, which is to interest its audience. Good art (like good anything) is art that achieves its purpose particularly well. The meaning of \"interest\" can vary. Some works of art are meant to shock, and others to please; some are meant to jump out at you, and others to sit quietly in the background.",
      "translated": "艺术有其目的，那就是引起观众的兴趣。好的艺术（就像其他所有好的事物一样）是那些特别成功地实现其目的的艺术。\"兴趣\"的含义可以各不相同。有些艺术作品旨在让人震惊，而有些则旨在让人愉悦；有些作品旨在引起你的注意，而有些则旨在安静地融入背景。"
    },
    {
      "original": "But all art has to work on an audience, and—here's the critical point—members of the audience share things in common.For example, nearly all humans find human faces engaging. It seems to be wired into us.",
      "translated": "但所有艺术都必须对观众产生作用，而关键在于——观众成员之间有共同之处。例如，几乎所有人都对人脸感兴趣。这似乎是与生俱来的。"
    },
    {
      "original": "Babies can recognize faces practically from birth. In fact, faces seem to have co-evolved with our interest in them; the face is the body's billboard. So all other things being equal, a painting with faces in it will interest people more than one without.",
      "translated": "婴儿几乎从出生起就能辨识人脸。事实上，人脸似乎与我们对人脸的兴趣共同进化；人脸是身体的广告牌。所以，在其他条件相同的情况下，有脸的画作比没有脸的画作更能引起人们的兴趣。"
    },
    {
      "original": "[1]One reason it's easy to believe that taste is merely personal preference is that, if it isn't, how do you pick out the people with better taste? There are billions of people, each with their own opinion; on what grounds can you prefer one to another?",
      "translated": "[1]人们很容易认为品味只是个人偏好，因为如果不是这样的话，你如何挑选出那些品味更好的人呢？世界上有数十亿人，每个人都有自己的观点；你凭什么认为某些人的观点比其他人更好呢？"
    },
    {
      "original": "[2]But if audiences have a lot in common, you're not in a position of having to choose one out of a random set of individual biases, because the set isn't random. All humans find faces engaging—practically by definition: face recognition is in our DNA.",
      "translated": "但当观众有很多共同点时，你就没有必要从一组随机的个人偏见中做出选择，因为这组偏见并不是随机的。所有人类都认为面孔具有吸引力——几乎可以说这是定义上的：人脸识别在我们的DNA中。"
    },
    {
      "original": "And so having a notion of good art, in the sense of art that does its job well, doesn't require you to pick out a few individuals and label their opinions as correct. No matter who you pick, they'll find faces engaging.Of course, space aliens probably wouldn't find human faces engaging.",
      "translated": "因此，对好艺术的理解，即艺术作品能够很好地完成其功能，并不需要你挑选出某些个人并将他们的观点视为正确。无论你选择谁，他们都会觉得人脸具有吸引力。当然，外星人可能不会觉得人脸有吸引力。"
    },
    {
      "original": "But there might be other things they shared in common with us. The most likely source of examples is math. I expect space aliens would agree with us most of the time about which of two proofs was better.",
      "translated": "但他们可能在其他方面也与我们有共同点。最有可能的例子来源是数学。我预计外星人会在大多数时候同意我们对于两个证明中哪一个更好的看法。"
    },
    {
      "original": "Erdos thought so. He called a maximally elegant proof one out of God's book, and presumably God's book is universal. [3]Once you start talking about audiences, you don't have to argue simply that there are or aren't standards of taste.",
      "translated": "埃德斯是这么认为的。他称最优雅的证明为出自上帝之书的证明，而上帝之书显然是普遍的。[3]一旦开始谈论观众，你就无需仅仅争论是否存在审美标准。"
    },
    {
      "original": "Instead tastes are a series of concentric rings, like ripples in a pond. There are some things that will appeal to you and your friends, others that will appeal to most people your age, others that will appeal to most humans, and perhaps others that would appeal to most sentient beings (whatever that means).The picture is slightly more complicated than that, because in the middle of the pond there are overlapping sets of ripples.",
      "translated": "兴趣爱好像池塘中的同心圆涟漪。有些事情会吸引你和你的朋友，有些会吸引大多数与你同龄的人，有些会吸引大多数人类，也许还有些会吸引大多数有感知能力的生物（无论那意味着什么）。这个图景稍微复杂一些，因为池塘中心有相互重叠的涟漪集合。"
    },
    {
      "original": "For example, there might be things that appealed particularly to men, or to people from a certain culture.If good art is art that interests its audience, then when you talk about art being good, you also have to say for what audience.",
      "translated": "例如，可能有些东西特别吸引男性，或者来自特定文化的人。如果好的艺术是能引起观众兴趣的艺术，那么当你谈论艺术的好坏时，你也必须说明是针对哪个观众群体的。"
    },
    {
      "original": "So is it meaningless to talk about art simply being good or bad? No, because one audience is the set of all possible humans. I think that's the audience people are implicitly talking about when they say a work of art is good: they mean it would engage any human.",
      "translated": "那么，讨论艺术作品的好坏是否有意义呢？有意义，因为有一个观众群体是所有可能的人类。我认为，当人们说一件艺术作品很好时，他们实际上指的是这件作品能够吸引任何人类。"
    },
    {
      "original": "[4]And that is a meaningful test, because although, like any everyday concept, \"human\" is fuzzy around the edges, there are a lot of things practically all humans have in common. In addition to our interest in faces, there's something special about primary colors for nearly all of us, because it's an artifact of the way our eyes work.",
      "translated": "这是一项有意义的测试，因为虽然像任何日常概念一样，“人类”这一概念在边缘上是模糊的，但几乎所有人类都有许多共同点。除了我们对人脸的兴趣之外，几乎所有人对原色都有某种特别的感觉，因为这是由于我们的眼睛的运作方式所造成的。"
    },
    {
      "original": "Most humans will also find images of 3D objects engaging, because that also seems to be built into our visual perception. [5] And beneath that there's edge-finding, which makes images with definite shapes more engaging than mere blur.Humans have a lot more in common than this, of course.",
      "translated": "大多数人也会对3D物体的图像感到吸引，因为这似乎也是我们视觉感知的一部分。[5] 而在其背后是边缘检测，这使得具有明确形状的图像比单纯的模糊图像更具吸引力。当然，人类之间还有很多其他的共同点。"
    },
    {
      "original": "My goal is not to compile a complete list, just to show that there's some solid ground here. People's preferences aren't random. So an artist working on a painting and trying to decide whether to change some part of it doesn't have to think \"Why bother?",
      "translated": "我的目标不是编制一个完整的清单，只是想表明这里有一些坚实的基础。人们的偏好并非随机。因此，一位艺术家在创作一幅画时，试图决定是否要改变画中的某个部分，不必想“何必费这个劲？”"
    },
    {
      "original": "I might as well flip a coin.\" Instead he can ask \"What would make the painting more interesting to people?\" And the reason you can't equal Michelangelo by going out and buying a blank canvas is that the ceiling of the Sistine Chapel is more interesting to people.A lot of philosophers have had a hard time believing it was possible for there to be objective standards for art.",
      "translated": "我还不如抛硬币算了。” 相反，他可以问：“怎样才能让这幅画更吸引人？” 你无法通过去买一块空白画布来与米开朗基罗相提并论，因为西斯廷教堂的天花板对人们来说更具有吸引力。许多哲学家都难以相信艺术存在客观标准。"
    },
    {
      "original": "It seemed obvious that beauty, for example, was something that happened in the head of the observer, not something that was a property of objects. It was thus \"subjective\" rather than \"objective.\" But in fact if you narrow the definition of beauty to something that works a certain way on humans, and you observe how much humans have in common, it turns out to be a property of objects after all.",
      "translated": "美似乎显然是存在于观察者头脑中的东西，而不是物体本身的属性。因此，它是“主观的”而非“客观的”。但事实上，如果你将美的定义缩小到对人类产生特定影响的事物，并考虑到人类的共性，最终会发现美仍然是物体的属性。"
    },
    {
      "original": "You don't have to choose between something being a property of the subject or the object if subjects all react similarly. Being good art is thus a property of objects as much as, say, being toxic to humans is: it's good art if it consistently affects humans in a certain way.",
      "translated": "你不必在某事物是主体的属性还是客体的属性之间做出选择，如果所有主体的反应都相似的话。因此，好的艺术作品是一种属性，就像对人类有毒性一样：如果它能持续以某种方式影响人类，那就是好的艺术。"
    },
    {
      "original": "ErrorSo could we figure out what the best art is by taking a vote? After all, if appealing to humans is the test, we should be able to just ask them, right?Well, not quite. For products of nature that might work.",
      "translated": "那么，我们能否通过投票来确定什么是最好的艺术呢？毕竟，如果以吸引人类为标准，我们应该可以直接询问他们，对吧？然而，这并不完全正确。对于自然的产物，这种方法可能奏效。"
    },
    {
      "original": "I'd be willing to eat the apple the world's population had voted most delicious, and I'd probably be willing to visit the beach they voted most beautiful, but having to look at the painting they voted the best would be a crapshoot.Man-made stuff is different.",
      "translated": "我愿意品尝全球投票选出的最美味的苹果，也可能会去参观被投票认为最美的海滩，但要看他们选为最好的画作，那就纯属碰运气了。人为创造的东西就是这样。"
    },
    {
      "original": "For one thing, artists, unlike apple trees, often deliberately try to trick us. Some tricks are quite subtle. For example, any work of art sets expectations by its level of finish. You don't expect photographic accuracy in something that looks like a quick sketch.",
      "translated": "一方面，艺术家与苹果树不同，常常故意试图愚弄我们。有些伎俩相当微妙。例如，任何艺术作品都会通过其完成度来设定预期。你不会期望一幅看起来像是快速草图的作品具有照片般的精确度。"
    },
    {
      "original": "So one widely used trick, especially among illustrators, is to intentionally make a painting or drawing look like it was done faster than it was. The average person looks at it and thinks: how amazingly skillful.",
      "translated": "因此，一个广泛使用的技巧，尤其是在插画师中，就是故意让一幅画或素描看起来比实际完成得更快。普通人看到后会想：真是太有技巧了。"
    },
    {
      "original": "It's like saying something clever in a conversation as if you'd thought of it on the spur of the moment, when in fact you'd worked it out the day before.Another much less subtle influence is brand. If you go to see the Mona Lisa, you'll probably be disappointed, because it's hidden behind a thick glass wall and surrounded by a frenzied crowd taking pictures of themselves in front of it.",
      "translated": "这就像在对话中说出一句机智的话，仿佛是你即兴想到的，而事实上你前一天就已经想好了。另一个影响则要粗糙得多，那就是品牌效应。如果你去参观《蒙娜丽莎》，你可能会感到失望，因为这幅画被一层厚厚的玻璃墙遮挡着，周围还有一群人疯狂地在它前面自拍。"
    },
    {
      "original": "At best you can see it the way you see a friend across the room at a crowded party. The Louvre might as well replace it with copy; no one would be able to tell. And yet the Mona Lisa is a small, dark painting.",
      "translated": "你最多只能像在熙熙攘攘的派对上看到房间对面的朋友那样看到它。卢浮宫完全可以把它换成复制品，没有人能分辨得出。然而，《蒙娜丽莎》却是一幅小而暗的画。"
    },
    {
      "original": "If you found people who'd never seen an image of it and sent them to a museum in which it was hanging among other paintings with a tag labelling it as a portrait by an unknown fifteenth century artist, most would walk by without giving it a second look.For the average person, brand dominates all other factors in the judgement of art.",
      "translated": "如果你找到一些从未见过这幅画的人，把他们带到一个挂着这幅画的博物馆，这幅画与其他画作一起展示，并标有一个标签，称其为一位不知名的十五世纪艺术家的肖像画，大多数人会走过而不会多看一眼。对普通人来说，在艺术品的评价中，品牌影响力超过了所有其他因素。"
    },
    {
      "original": "Seeing a painting they recognize from reproductions is so overwhelming that their response to it as a painting is drowned out.And then of course there are the tricks people play on themselves. Most adults looking at art worry that if they don't like what they're supposed to, they'll be thought uncultured.",
      "translated": "看到一幅他们从复制品中认识的画作时，这种感觉是如此强烈，以至于他们对这幅画本身的反应被淹没了。当然，还有人们对自己玩的一些心理把戏。大多数成年人在看艺术作品时，都会担心如果不喜欢那些他们本应喜欢的作品，会被认为是没有文化修养。"
    },
    {
      "original": "This doesn't just affect what they claim to like; they actually make themselves like things they're supposed to.That's why you can't just take a vote. Though appeal to people is a meaningful test, in practice you can't measure it, just as you can't find north using a compass with a magnet sitting next to it.",
      "translated": "这不仅影响他们声称喜欢的东西；他们实际上会让自己喜欢那些他们应该喜欢的东西。这就是为什么你不能仅仅通过投票来决定。尽管吸引人是 meaningful 的测试，但在实践中你无法衡量它，就像你不能用一个旁边放着磁铁的指南针来找到北方一样。"
    },
    {
      "original": "There are sources of error so powerful that if you take a vote, all you're measuring is the error.We can, however, approach our goal from another direction, by using ourselves as guinea pigs. You're human.",
      "translated": "有些错误的来源如此强大，以至于如果你进行投票，你所测量的只是这些错误。然而，我们可以从另一个角度接近我们的目标，即用我们自己作为实验对象。你是人类。"
    },
    {
      "original": "If you want to know what the basic human reaction to a piece of art would be, you can at least approach that by getting rid of the sources of error in your own judgements.For example, while anyone's reaction to a famous painting will be warped at first by its fame, there are ways to decrease its effects.",
      "translated": "如果你想了解人们对一件艺术品的基本反应，至少可以通过消除自己判断中的误差来源来接近这一目标。例如，虽然任何人对一幅著名画作的初始反应都会受到其名声的影响，但有方法可以减少这种影响。"
    },
    {
      "original": "One is to come back to the painting over and over. After a few days the fame wears off, and you can start to see it as a painting. Another is to stand close. A painting familiar from reproductions looks more familiar from ten feet away; close in you see details that get lost in reproductions, and which you're therefore seeing for the first time.There are two main kinds of error that get in the way of seeing a work of art: biases you bring from your own circumstances, and tricks played by the artist.",
      "translated": "一是反复回到画作前。几天后，光环褪去，你就能开始把它当作一幅画来看。另一种方法是靠近看。一幅在复制品中熟悉的画作从十英尺外看会显得更熟悉；而当你靠近时，会看到复制品中丧失的细节，这些细节因此是你第一次看到的。妨碍我们欣赏艺术作品的两种主要错误是：来自个人处境的偏见，以及艺术家所玩的技巧。"
    },
    {
      "original": "Tricks are straightforward to correct for. Merely being aware of them usually prevents them from working. For example, when I was ten I used to be very impressed by airbrushed lettering that looked like shiny metal.",
      "translated": "骗局很容易纠正。只要意识到它们，通常就能防止其奏效。例如，当我十岁的时候，我曾对看起来像闪亮金属的喷漆字母印象深刻。"
    },
    {
      "original": "But once you study how it's done, you see that it's a pretty cheesy trick—one of the sort that relies on pushing a few visual buttons really hard to temporarily overwhelm the viewer. It's like trying to convince someone by shouting at them.The way not to be vulnerable to tricks is to explicitly seek out and catalog them.",
      "translated": "但一旦你研究了它是如何实现的，就会发现这其实是一个相当粗糙的把戏——一种依靠强烈刺激观众的几个视觉点来暂时压倒观众的把戏。这就像是通过大声喊叫来试图说服某人一样。避免受骗的方法是主动寻找并记录这些把戏。"
    },
    {
      "original": "When you notice a whiff of dishonesty coming from some kind of art, stop and figure out what's going on. When someone is obviously pandering to an audience that's easily fooled, whether it's someone making shiny stuff to impress ten year olds, or someone making conspicuously avant-garde stuff to impress would-be intellectuals, learn how they do it.",
      "translated": "当你察觉到某种艺术作品中有一丝不诚实的气息时，停下来弄清楚是怎么回事。当有人显然是在迎合那些容易被愚弄的观众时，无论是制作闪亮的东西来吸引十岁小孩，还是制作刻意前卫的东西来吸引自认为是知识分子的人，都要学会他们是如何做到的。"
    },
    {
      "original": "Once you've seen enough examples of specific types of tricks, you start to become a connoisseur of trickery in general, just as professional magicians are.What counts as a trick? Roughly, it's something done with contempt for the audience.",
      "translated": "一旦你看过足够多的特定类型的戏法，你就会开始成为一般意义上的戏法鉴赏家，就像职业魔术师一样。什么可以算作戏法？大致来说，就是以蔑视观众的态度所做的事情。"
    },
    {
      "original": "For example, the guys designing Ferraris in the 1950s were probably designing cars that they themselves admired. Whereas I suspect over at General Motors the marketing people are telling the designers, \"Most people who buy SUVs do it to seem manly, not to drive off-road.",
      "translated": "例如，20世纪50年代设计法拉利的那些人，可能是在设计他们自己欣赏的汽车。而我怀疑在通用汽车那边，市场人员可能会告诉设计人员，“大多数购买SUV的人是为了显得阳刚，而不是为了越野驾驶。”"
    },
    {
      "original": "So don't worry about the suspension; just make that sucker as big and tough-looking as you can.\" [6]I think with some effort you can make yourself nearly immune to tricks. It's harder to escape the influence of your own circumstances, but you can at least move in that direction.",
      "translated": "所以不要担心悬挂问题；只要把它做得尽可能大且看起来结实就行。[6]我认为通过一些努力，你可以让自己几乎不受诡计的影响。摆脱自身环境的影响要困难得多，但至少你可以朝这个方向努力。"
    },
    {
      "original": "The way to do it is to travel widely, in both time and space. If you go and see all the different kinds of things people like in other cultures, and learn about all the different things people have liked in the past, you'll probably find it changes what you like.",
      "translated": "要做到这一点，就需要广泛地游历，穿越时空。如果你去观察其他文化中人们喜欢的各种事物，并了解过去人们喜爱的各种事物，你可能会发现自己的喜好也会随之改变。"
    },
    {
      "original": "I doubt you could ever make yourself into a completely universal person, if only because you can only travel in one direction in time. But if you find a work of art that would appeal equally to your friends, to people in Nepal, and to the ancient Greeks, you're probably onto something.My main point here is not how to have good taste, but that there can even be such a thing.",
      "translated": "我怀疑你能否把自己变成一个完全全能的人，仅仅因为时间只能朝一个方向流动。但如果你发现一件艺术品，同样能吸引你的朋友、尼泊尔人和古希腊人，那你可能真的找到了什么。我在这里的主要观点并不是如何培养良好的品味，而是这样的品味确实可能存在。"
    },
    {
      "original": "And I think I've shown that. There is such a thing as good art. It's art that interests its human audience, and since humans have a lot in common, what interests them is not random. Since there's such a thing as good art, there's also such a thing as good taste, which is the ability to recognize it.If we were talking about the taste of apples, I'd agree that taste is just personal preference.",
      "translated": "我想我已经证明了这一点。确实存在好的艺术。这种艺术能够吸引它的观众，而由于人类有很多共通之处，能够引起他们兴趣的东西并非随机。既然存在好的艺术，也就存在着好的品味，即识别这种艺术的能力。如果我们谈论的是苹果的味道，我会同意品味只是个人偏好。"
    },
    {
      "original": "Some people like certain kinds of apples and others like other kinds, but how can you say that one is right and the other wrong? [7]The thing is, art isn't apples. Art is man-made. It comes with a lot of cultural baggage, and in addition the people who make it often try to trick us.",
      "translated": "有些人喜欢某种苹果，而其他人则喜欢其他种类，但你怎么能说一种是对的，另一种是错的呢？[7] 问题在于，艺术不是苹果。艺术是人为创造的，它带有大量的文化背景，而且创作者往往试图愚弄我们。"
    },
    {
      "original": "Most people's judgement of art is dominated by these extraneous factors; they're like someone trying to judge the taste of apples in a dish made of equal parts apples and jalapeno peppers. All they're tasting is the peppers.",
      "translated": "大多数人的艺术判断都受到这些外来因素的主导；他们就像试图评判一道苹果和墨西哥辣椒各占一半的菜肴中苹果的味道一样，他们尝到的只有辣椒。"
    },
    {
      "original": "So it turns out you can pick out some people and say that they have better taste than others: they're the ones who actually taste art like apples.Or to put it more prosaically, they're the people who (a) are hard to trick, and (b) don't just like whatever they grew up with.",
      "translated": "所以事实证明，你可以挑选出一些人，说他们的品味比其他人更好：这些人真正像品尝苹果一样去品味艺术。或者说得更通俗一些，他们（a）不容易被愚弄，（b）不仅仅喜欢他们成长过程中接触的事物。"
    },
    {
      "original": "If you could find people who'd eliminated all such influences on their judgement, you'd probably still see variation in what they liked. But because humans have so much in common, you'd also find they agreed on a lot.",
      "translated": "如果你能找到一些人，他们完全排除了所有这些对判断的影响，你可能仍然会看到他们喜好上的差异。但因为人类有如此多的共通之处，你也会发现他们在很多方面达成一致。"
    },
    {
      "original": "They'd nearly all prefer the ceiling of the Sistine Chapel to a blank canvas.Making ItI wrote this essay because I was tired of hearing \"taste is subjective\" and wanted to kill it once and for all. Anyone who makes things knows intuitively that's not true.",
      "translated": "他们几乎都更喜欢西斯廷教堂的天顶画而不是空白的画布。我写这篇文章是因为听腻了“品味是主观的”这句话，并想一劳永逸地反驳它。任何创造东西的人都会直观地知道这不是真的。"
    },
    {
      "original": "When you're trying to make art, the temptation to be lazy is as great as in any other kind of work. Of course it matters to do a good job. And yet you can see how great a hold \"taste is subjective\" has even in the art world by how nervous it makes people to talk about art being good or bad.",
      "translated": "当你尝试创作艺术时，偷懒的诱惑和其他任何工作一样大。当然，做好工作是很重要的。然而，你也可以看出“品味是主观的”这一观点在艺术界有多么根深蒂固，以至于人们在谈论艺术的好坏时会感到多么紧张。"
    },
    {
      "original": "Those whose jobs require them to judge art, like curators, mostly resort to euphemisms like \"significant\" or \"important\" or (getting dangerously close) \"realized.\" [8]I don't have any illusions that being able to talk about art being good or bad will cause the people who talk about it to have anything more useful to say.",
      "translated": "那些需要对艺术作品进行评判的人，比如策展人，通常会使用“重要”、“显著”或（接近危险的边缘）“完成”等委婉语。[8]我并不幻想，能够谈论艺术作品的好坏会让那些谈论它的人说出更有意义的话。"
    },
    {
      "original": "Indeed, one of the reasons \"taste is subjective\" found such a receptive audience is that, historically, the things people have said about good taste have generally been such nonsense.It's not for the people who talk about art that I want to free the idea of good art, but for those who make it.",
      "translated": "的确，“品味是主观的”这一观点之所以能被广泛接受，原因之一在于，历史上人们对好品味的言论通常都是一派胡言。我想要解放好的艺术这一概念，并不是为了那些谈论艺术的人，而是为了那些创作艺术的人。"
    },
    {
      "original": "Right now, ambitious kids going to art school run smack into a brick wall. They arrive hoping one day to be as good as the famous artists they've seen in books, and the first thing they learn is that the concept of good has been retired.",
      "translated": "现在，有抱负的艺术学子们刚进入艺术学校就撞上了现实的墙。他们怀着有朝一日能像书中看到的著名艺术家那样优秀的梦想而来，却首先得知“优秀”这个概念已经被抛弃了。"
    },
    {
      "original": "Instead everyone is just supposed to explore their own personal vision. [9]When I was in art school, we were looking one day at a slide of some great fifteenth century painting, and one of the students asked \"Why don't artists paint like that now?\" The room suddenly got quiet.",
      "translated": "相反，每个人都应该探索自己独特的个人愿景。[9]当我还在艺术学校时，有一天我们在看一张伟大的十五世纪画作的幻灯片，一个学生问道：“为什么现在的艺术家不再这样画画了？” 教室里突然变得安静起来。"
    },
    {
      "original": "Though rarely asked out loud, this question lurks uncomfortably in the back of every art student's mind. It was as if someone had brought up the topic of lung cancer in a meeting within Philip Morris.\"Well,\" the professor replied, \"we're interested in different questions now.\" He was a pretty nice guy, but at the time I couldn't help wishing I could send him back to fifteenth century Florence to explain in person to Leonardo & Co.",
      "translated": "虽然很少有人直言不讳地提出这个问题，但它却不安地潜藏在每个艺术学生的脑海中。这就好比有人在菲利普莫里斯公司的会议中提到了肺癌的话题。“嗯，”教授回答说，“我们现在关注的是不同的问题。”他其实是个很好的人，但在当时，我忍不住希望把他送回15世纪的佛罗伦萨，亲自向达·芬奇及其同仁解释一番。"
    },
    {
      "original": "how we had moved beyond their early, limited concept of art. Just imagine that conversation.In fact, one of the reasons artists in fifteenth century Florence made such great things was that they believed you could make great things.",
      "translated": "我们已经超越了他们早期对艺术的狭隘概念。想象一下那场对话吧。事实上，15世纪佛罗伦萨的艺术家们之所以能够创作出如此伟大的作品，原因之一就是他们相信自己能够创作出伟大的作品。"
    },
    {
      "original": "[10] They were intensely competitive and were always trying to outdo one another, like mathematicians or physicists today—maybe like anyone who has ever done anything really well.The idea that you could make great things was not just a useful illusion.",
      "translated": "他们竞争激烈，总是试图超越彼此，就像今天的数学家或物理学家——或许就像任何曾经真正做得出色的人一样。认为可以创造伟大的事物不仅仅是一种有用的幻觉。"
    },
    {
      "original": "They were actually right. So the most important consequence of realizing there can be good art is that it frees artists to try to make it. To the ambitious kids arriving at art school this year hoping one day to make great things, I say: don't believe it when they tell you this is a naive and outdated ambition.",
      "translated": "他们确实是对的。所以，认识到可以有好的艺术作品的最重要结果是，这使艺术家们得以尝试去创造它。对于今年怀着希望有朝一日能创作出伟大作品的雄心勃勃的年轻人来说，我想说：当他们告诉你这是一个天真的、过时的志向时，不要相信。"
    },
    {
      "original": "There is such a thing as good art, and if you try to make it, there are people who will notice.Notes[1] This is not to say, of course, that good paintings must have faces in them, just that everyone's visual piano has that key on it.",
      "translated": "有好艺术这样的东西，如果你努力去创作，就会有人注意到。这并不是说，好的画作必须有面孔，只是每个人的眼睛这架钢琴上都有这样的琴键。"
    },
    {
      "original": "There are situations in which you want to avoid faces, precisely because they attract so much attention. But you can see how universally faces work by their prevalence in advertising.[2] The other reason it's easy to believe is that it makes people feel good.",
      "translated": "有些情况下，你希望避免出现人脸，正是因为它们会吸引过多的注意力。但你也可以通过广告中人脸的普遍使用看出人脸的普遍吸引力。另一个容易让人相信的原因是，它能让人感觉良好。"
    },
    {
      "original": "To a kid, this idea is crack. In every other respect they're constantly being told that they have a lot to learn. But in this they're perfect. Their opinion carries the same weight as any adult's. You should probably question anything you believed as a kid that you'd want to believe this much.[3] It's conceivable that the elegance of proofs is quantifiable, in the sense that there may be some formal measure that turns out to coincide with mathematicians' judgements.",
      "translated": "对孩子来说，这个想法太棒了。在其他所有方面，他们总被告知还有很多东西要学。但在这一点上，他们是完美的。他们的意见和任何成年人的意见一样重要。你大概应该质疑你在童年时如此坚信的任何事情。[3] 有可能证明的优美是可以量化的，也就是说，可能存在某种形式的度量标准，最终与数学家的判断相一致。"
    },
    {
      "original": "Perhaps it would be worth trying to make a formal language for proofs in which those considered more elegant consistently came out shorter (perhaps after being macroexpanded or compiled).[4] Maybe it would be possible to make art that would appeal to space aliens, but I'm not going to get into that because (a) it's too hard to answer, and (b) I'm satisfied if I can establish that good art is a meaningful idea for human audiences.[5] If early abstract paintings seem more interesting than later ones, it may be because the first abstract painters were trained to paint from life, and their hands thus tended to make the kind of gestures you use in representing physical things.",
      "translated": "或许可以尝试创建一种用于证明的形式语言，使得那些被认为更优雅的证明在经过宏扩展或编译后能更简洁。[4] 或许有可能创作出能吸引外星人的艺术作品，但我不会深入探讨这个问题，因为（a）这个问题太难回答，（b）只要我能证明对人类观众来说，优秀的艺术是一个有意义的概念，我就感到满意了。[5] 如果早期的抽象画比后期的更有趣，可能是因为第一批抽象画家是接受过写实绘画训练的，因此他们的手倾向于做出在表现具体事物时所用的那些动作。"
    },
    {
      "original": "In effect they were saying \"scaramara\" instead of \"uebfgbsb.\"[6] It's a bit more complicated, because sometimes artists unconsciously use tricks by imitating art that does.[7] I phrased this in terms of the taste of apples because if people can see the apples, they can be fooled.",
      "translated": "实际上，他们说的是“scaramara”而不是“uebfgbsb”[6]。这有点复杂，因为有时艺术家会无意识地模仿那些使用技巧的艺术作品[7]。我用苹果的口味来表述这一点，因为如果人们能看到苹果，他们就可能被蒙骗。"
    },
    {
      "original": "When I was a kid most apples were a variety called Red Delicious that had been bred to look appealing in stores, but which didn't taste very good.[8] To be fair, curators are in a difficult position.",
      "translated": "当我还是个孩子的时候，大多数苹果都是一个叫做红元帅的品种，这种苹果是为了在商店里看起来吸引人而培育的，但其实味道并不好。公平地说，策展人处在一个很为难的位置。"
    },
    {
      "original": "If they're dealing with recent art, they have to include things in shows that they think are bad. That's because the test for what gets included in shows is basically the market price, and for recent art that is largely determined by successful businessmen and their wives.",
      "translated": "如果他们处理的是当代艺术，就必须在展览中包含他们认为质量较差的作品。这是因为入选展览的标准基本上是市场价格，而当代艺术的市场价格在很大程度上是由成功的企业家及其妻子决定的。"
    },
    {
      "original": "So it's not always intellectual dishonesty that makes curators and dealers use neutral-sounding language.[9] What happens in practice is that everyone gets really good at talking about art. As the art itself gets more random, the effort that would have gone into the work goes instead into the intellectual sounding theory behind it.",
      "translated": "所以，策展人和经销商使用听起来中立的语言并不总是出于智力上的不诚实。实际上，每个人都非常善于谈论艺术。随着艺术本身变得越来越随意，原本应该投入到作品中的努力反而被用在了听起来高深的理论背后。"
    },
    {
      "original": "\"My work represents an exploration of gender and sexuality in an urban context,\" etc. Different people win at that game.[10] There were several other reasons, including that Florence was then the richest and most sophisticated city in the world, and that they lived in a time before photography had (a) killed portraiture as a source of income and (b) made brand the dominant factor in the sale of art.Incidentally, I'm not saying that good art = fifteenth century European art.",
      "translated": "“我的作品是对城市背景下性别和性取向的探索，”等等。不同的人在那场游戏中获胜。[10] 还有其他几个原因，包括佛罗伦萨当时是世界上最富有、最发达的城市，以及他们生活在摄影尚未（a）使肖像画失去作为收入来源的价值和（b）使品牌成为艺术销售中主导因素的时代。顺便说一句，我并不是说好的艺术就等于15世纪的欧洲艺术。"
    },
    {
      "original": "I'm not saying we should make what they made, but that we should work like they worked. There are fields now in which many people work with the same energy and honesty that fifteenth century artists did, but art is not one of them.Thanks to Trevor Blackwell, Jessica Livingston, and Robert Morris for reading drafts of this, and to Paul Watson for permission to use the image at the top.Japanese TranslationSimplified Chinese Translation",
      "translated": "我不是说我们应该制作他们制作的东西，而是说我们应该像他们那样工作。如今，有许多领域的人们以十五世纪艺术家同样的精力和真诚工作，但艺术领域却不是其中之一。感谢 Trevor Blackwell、Jessica Livingston 和 Robert Morris 阅读本文的草稿，也感谢 Paul Watson 允许使用顶部的图片。日文翻译简体中文翻译"
    }
  ],
  "translation_completed": "2025-07-28T22:04:01.446242",
  "translation_stats": {
    "total_paragraphs": 67,
    "success_count": 67,
    "success_rate": "100.0%"
  }
}