{
  "title": "Some Heroes",
  "title_zh": "[待翻译] Some Heroes",
  "url": "https://www.paulgraham.com/heroes.html",
  "filename": "heroes.html",
  "date": "2008-04-01",
  "id": 169,
  "content": {
    "success": true,
    "paragraphs": [
      "April 2008There are some topics I save up because they'll be so much fun to write about. This is one of them: a list of my heroes.I'm not claiming this is a list of the n most admirable people. Who could make such a list, even if they wanted to?Einstein isn't on the list, for example, even though he probably deserves to be on any shortlist of admirable people.",
      "I once asked a physicist friend if Einstein was really as smart as his fame implies, and she said that yes, he was. So why isn't he on the list? Because I had to ask. This is a list of people who've influenced me, not people who would have if I understood their work.My test was to think of someone and ask \"is this person my hero?\" It often returned surprising answers.",
      "For example, it returned false for Montaigne, who was arguably the inventor of the essay. Why? When I thought about what it meant to call someone a hero, it meant I'd decide what to do by asking what they'd do in the same situation.",
      "That's a stricter standard than admiration.After I made the list, I looked to see if there was a pattern, and there was, a very clear one. Everyone on the list had two qualities: they cared almost excessively about their work, and they were absolutely honest.",
      "By honest I don't mean trustworthy so much as that they never pander: they never say or do something because that's what the audience wants. They are all fundamentally subversive for this reason, though they conceal it to varying degrees.",
      "Jack LambertI grew up in Pittsburgh in the 1970s. Unless you were there it's hard to imagine how that town felt about the Steelers. Locally, all the news was bad. The steel industry was dying. But the Steelers were the best team in football — and moreover, in a way that seemed to reflect the personality of the city.",
      "They didn't do anything fancy. They just got the job done.Other players were more famous: Terry Bradshaw, Franco Harris, Lynn Swann. But they played offense, and you always get more attention for that.",
      "It seemed to me as a twelve year old football expert that the best of them all was Jack Lambert. And what made him so good was that he was utterly relentless. He didn't just care about playing well; he cared almost too much.",
      "He seemed to regard it as a personal insult when someone from the other team had possession of the ball on his side of the line of scrimmage.The suburbs of Pittsburgh in the 1970s were a pretty dull place.",
      "School was boring. All the adults around were bored with their jobs working for big companies. Everything that came to us through the mass media was (a) blandly uniform and (b) produced elsewhere. Jack Lambert was the exception.",
      "He was like nothing else I'd seen. Kenneth ClarkKenneth Clark is the best nonfiction writer I know of, on any subject. Most people who write about art history don't really like art; you can tell from a thousand little signs.",
      "But Clark did, and not just intellectually, but the way one anticipates a delicious dinner.What really makes him stand out, though, is the quality of his ideas. His style is deceptively casual, but there is more in his books than in a library of art monographs.",
      "Reading The Nude is like a ride in a Ferrari. Just as you're getting settled, you're slammed back in your seat by the acceleration. Before you can adjust, you're thrown sideways as the car screeches into the first turn.",
      "His brain throws off ideas almost too fast to grasp them. Finally at the end of the chapter you come to a halt, with your eyes wide and a big smile on your face.Kenneth Clark was a star in his day, thanks to the documentary series Civilisation.",
      "And if you read only one book about art history, Civilisation is the one I'd recommend. It's much better than the drab Sears Catalogs of art that undergraduates are forced to buy for Art History 101.",
      "Larry MihalkoA lot of people have a great teacher at some point in their childhood. Larry Mihalko was mine. When I look back it's like there's a line drawn between third and fourth grade. After Mr. Mihalko, everything was different.Why?",
      "First of all, he was intellectually curious. I had a few other teachers who were smart, but I wouldn't describe them as intellectually curious. In retrospect, he was out of place as an elementary school teacher, and I think he knew it.",
      "That must have been hard for him, but it was wonderful for us, his students. His class was a constant adventure. I used to like going to school every day.The other thing that made him different was that he liked us.",
      "Kids are good at telling that. The other teachers were at best benevolently indifferent. But Mr. Mihalko seemed like he actually wanted to be our friend. On the last day of fourth grade, he got out one of the heavy school record players and played James Taylor's \"You've Got a Friend\" to us.",
      "Just call out my name, and you know wherever I am, I'll come running. He died at 59 of lung cancer. I've never cried like I cried at his funeral. LeonardoOne of the things I've learned about making things that I didn't realize when I was a kid is that much of the best stuff isn't made for audiences, but for oneself.",
      "You see paintings and drawings in museums and imagine they were made for you to look at. Actually a lot of the best ones were made as a way of exploring the world, not as a way to please other people.",
      "The best of these explorations are sometimes more pleasing than stuff made explicitly to please.Leonardo did a lot of things. One of his most admirable qualities was that he did so many different things that were admirable.",
      "What people know of him now is his paintings and his more flamboyant inventions, like flying machines. That makes him seem like some kind of dreamer who sketched artists' conceptions of rocket ships on the side.",
      "In fact he made a large number of far more practical technical discoveries. He was as good an engineer as a painter.His most impressive work, to me, is his drawings. They're clearly made more as a way of studying the world than producing something beautiful.",
      "And yet they can hold their own with any work of art ever made. No one else, before or since, was that good when no one was looking. Robert MorrisRobert Morris has a very unusual quality: he's never wrong.",
      "It might seem this would require you to be omniscient, but actually it's surprisingly easy. Don't say anything unless you're fairly sure of it. If you're not omniscient, you just don't end up saying much.More precisely, the trick is to pay careful attention to how you qualify what you say.",
      "By using this trick, Robert has, as far as I know, managed to be mistaken only once, and that was when he was an undergrad. When the Mac came out, he said that little desktop computers would never be suitable for real hacking.It's wrong to call it a trick in his case, though.",
      "If it were a conscious trick, he would have slipped in a moment of excitement. With Robert this quality is wired-in. He has an almost superhuman integrity. He's not just generally correct, but also correct about how correct he is.You'd think it would be such a great thing never to be wrong that everyone would do this.",
      "It doesn't seem like that much extra work to pay as much attention to the error on an idea as to the idea itself. And yet practically no one does. I know how hard it is, because since meeting Robert I've tried to do in software what he seems to do in hardware.",
      "P. G. WodehousePeople are finally starting to admit that Wodehouse was a great writer. If you want to be thought a great novelist in your own time, you have to sound intellectual. If what you write is popular, or entertaining, or funny, you're ipso facto suspect.",
      "That makes Wodehouse doubly impressive, because it meant that to write as he wanted to, he had to commit to being despised in his own lifetime.Evelyn Waugh called him a great writer, but to most people at the time that would have read as a chivalrous or deliberately perverse gesture.",
      "At the time any random autobiographical novel by a recent college grad could count on more respectful treatment from the literary establishment.Wodehouse may have begun with simple atoms, but the way he composed them into molecules was near faultless.",
      "His rhythm in particular. It makes me self-conscious to write about it. I can think of only two other writers who came near him for style: Evelyn Waugh and Nancy Mitford. Those three used the English language like they owned it.But Wodehouse has something neither of them did.",
      "He's at ease. Evelyn Waugh and Nancy Mitford cared what other people thought of them: he wanted to seem aristocratic; she was afraid she wasn't smart enough. But Wodehouse didn't give a damn what anyone thought of him.",
      "He wrote exactly what he wanted. Alexander CalderCalder's on this list because he makes me happy. Can his work stand up to Leonardo's? Probably not. There might not be anything from the 20th Century that can.",
      "But what was good about Modernism, Calder had, and had in a way that he made seem effortless.What was good about Modernism was its freshness. Art became stuffy in the nineteenth century. The paintings that were popular at the time were mostly the art equivalent of McMansions—big, pretentious, and fake.",
      "Modernism meant starting over, making things with the same earnest motives that children might. The artists who benefited most from this were the ones who had preserved a child's confidence, like Klee and Calder.Klee was impressive because he could work in so many different styles.",
      "But between the two I like Calder better, because his work seemed happier. Ultimately the point of art is to engage the viewer. It's hard to predict what will; often something that seems interesting at first will bore you after a month.",
      "Calder's sculptures never get boring. They just sit there quietly radiating optimism, like a battery that never runs out. As far as I can tell from books and photographs, the happiness of Calder's work is his own happiness showing through.",
      "Jane AustenEveryone admires Jane Austen. Add my name to the list. To me she seems the best novelist of all time.I'm interested in how things work. When I read most novels, I pay as much attention to the author's choices as to the story.",
      "But in her novels I can't see the gears at work. Though I'd really like to know how she does what she does, I can't figure it out, because she's so good that her stories don't seem made up. I feel like I'm reading a description of something that actually happened.I used to read a lot of novels when I was younger.",
      "I can't read most anymore, because they don't have enough information in them. Novels seem so impoverished compared to history and biography. But reading Austen is like reading nonfiction. She writes so well you don't even notice her.",
      "John McCarthyJohn McCarthy invented Lisp, the field of (or at least the term) artificial intelligence, and was an early member of both of the top two computer science departments, MIT and Stanford. No one would dispute that he's one of the greats, but he's an especial hero to me because of Lisp.It's hard for us now to understand what a conceptual leap that was at the time.",
      "Paradoxically, one of the reasons his achievement is hard to appreciate is that it was so successful. Practically every programming language invented in the last 20 years includes ideas from Lisp, and each year the median language gets more Lisplike.In 1958 these ideas were anything but obvious.",
      "In 1958 there seem to have been two ways of thinking about programming. Some people thought of it as math, and proved things about Turing Machines. Others thought of it as a way to get things done, and designed languages all too influenced by the technology of the day.",
      "McCarthy alone bridged the gap. He designed a language that was math. But designed is not really the word; discovered is more like it. The SpitfireAs I was making this list I found myself thinking of people like Douglas Bader and R.J.",
      "Mitchell and Jeffrey Quill and I realized that though all of them had done many things in their lives, there was one factor above all that connected them: the Spitfire.This is supposed to be a list of heroes.",
      "How can a machine be on it? Because that machine was not just a machine. It was a lens of heroes. Extraordinary devotion went into it, and extraordinary courage came out.It's a cliche to call World War II a contest between good and evil, but between fighter designs, it really was.",
      "The Spitfire's original nemesis, the ME 109, was a brutally practical plane. It was a killing machine. The Spitfire was optimism embodied. And not just in its beautiful lines: it was at the edge of what could be manufactured.",
      "But taking the high road worked. In the air, beauty had the edge, just. Steve JobsPeople alive when Kennedy was killed usually remember exactly where they were when they heard about it. I remember exactly where I was when a friend asked if I'd heard Steve Jobs had cancer.",
      "It was like the floor dropped out. A few seconds later she told me that it was a rare operable type, and that he'd be ok. But those seconds seemed long.I wasn't sure whether to include Jobs on this list.",
      "A lot of people at Apple seem to be afraid of him, which is a bad sign. But he compels admiration.There's no name for what Steve Jobs is, because there hasn't been anyone quite like him before. He doesn't design Apple's products himself.",
      "Historically the closest analogy to what he does are the great Renaissance patrons of the arts. As the CEO of a company, that makes him unique.Most CEOs delegate taste to a subordinate. The design paradox means they're choosing more or less at random.",
      "But Steve Jobs actually has taste himself — such good taste that he's shown the world how much more important taste is than they realized. Isaac NewtonNewton has a strange role in my pantheon of heroes: he's the one I reproach myself with.",
      "He worked on big things, at least for part of his life. It's so easy to get distracted working on small stuff. The questions you're answering are pleasantly familiar. You get immediate rewards — in fact, you get bigger rewards in your time if you work on matters of passing importance.",
      "But I'm uncomfortably aware that this is the route to well-deserved obscurity.To do really great things, you have to seek out questions people didn't even realize were questions. There have probably been other people who did this as well as Newton, for their time, but Newton is my model of this kind of thought.",
      "I can just begin to understand what it must have felt like for him.You only get one life. Why not do something huge? The phrase \"paradigm shift\" is overused now, but Kuhn was onto something. And you know more are out there, separated from us by what will later seem a surprisingly thin wall of laziness and stupidity.",
      "If we work like Newton.Thanks to Trevor Blackwell, Jessica Livingston, and Jackie McDonough for reading drafts of this.Japanese Translation"
    ],
    "word_count": 2651,
    "paragraph_count": 58
  },
  "processed_at": "2025-07-26T19:06:52.350516",
  "paragraphs": [
    {
      "original": "April 2008There are some topics I save up because they'll be so much fun to write about. This is one of them: a list of my heroes.I'm not claiming this is a list of the n most admirable people. Who could make such a list, even if they wanted to?Einstein isn't on the list, for example, even though he probably deserves to be on any shortlist of admirable people.",
      "translated": "2008年4月有一些话题我一直留着，因为写起来会非常有趣。这就是其中之一：一份我的英雄名单。我并不是说这是最值得钦佩的n个人的名单。即使有人想这么做，谁又能列出这样的名单呢？例如，爱因斯坦并没有在这份名单上，尽管他可能应该被列入任何值得钦佩的人物短名单中。"
    },
    {
      "original": "I once asked a physicist friend if Einstein was really as smart as his fame implies, and she said that yes, he was. So why isn't he on the list? Because I had to ask. This is a list of people who've influenced me, not people who would have if I understood their work.My test was to think of someone and ask \"is this person my hero?\" It often returned surprising answers.",
      "translated": "我曾经问过一个物理学家朋友，爱因斯坦是否真的像他的名声所暗示的那样聪明，她说是的。那么为什么他不在名单上呢？因为我必须问。这是一个对我产生影响的人的名单，而不是那些如果我理解了他们的工作就可能对我产生影响的人。我的标准是想到一个人就问自己“这个人是我的英雄吗？” 这个问题经常给出令人惊讶的答案。"
    },
    {
      "original": "For example, it returned false for Montaigne, who was arguably the inventor of the essay. Why? When I thought about what it meant to call someone a hero, it meant I'd decide what to do by asking what they'd do in the same situation.",
      "translated": "例如，对于蒙田——可以说是散文的创始人——它却给出了错误的结果。为什么？当我思考称某人为英雄的意义时，这意味着我将通过询问他们在相同情况下会怎么做来决定自己的行动。"
    },
    {
      "original": "That's a stricter standard than admiration.After I made the list, I looked to see if there was a pattern, and there was, a very clear one. Everyone on the list had two qualities: they cared almost excessively about their work, and they were absolutely honest.",
      "translated": "那是一个比敬仰更为严格的标准。在列出名单后，我查看是否有什么规律，的确有一个非常明显的规律。名单上的每个人都有两个特点：他们对自己的工作几乎过于关心，并且绝对诚实。"
    },
    {
      "original": "By honest I don't mean trustworthy so much as that they never pander: they never say or do something because that's what the audience wants. They are all fundamentally subversive for this reason, though they conceal it to varying degrees.",
      "translated": "所谓的诚实，并不是指值得信赖，而是指他们从不迎合：他们从不说或做任何事情只是因为这是观众想要的。正因为如此，他们从根本上都是颠覆性的，尽管他们以不同程度掩饰了这一点。"
    },
    {
      "original": "Jack LambertI grew up in Pittsburgh in the 1970s. Unless you were there it's hard to imagine how that town felt about the Steelers. Locally, all the news was bad. The steel industry was dying. But the Steelers were the best team in football — and moreover, in a way that seemed to reflect the personality of the city.",
      "translated": "杰克·兰伯特在20世纪70年代成长于匹兹堡。除非你亲身经历过，否则很难想象这座城市对钢人队的感情。当时，本地的消息都是负面的。钢铁工业正在衰落。但钢人队却是美式橄榄球中最好的球队——而且，他们以一种似乎反映了这座城市性格的方式成为了最佳球队。"
    },
    {
      "original": "They didn't do anything fancy. They just got the job done.Other players were more famous: Terry Bradshaw, Franco Harris, Lynn Swann. But they played offense, and you always get more attention for that.",
      "translated": "他们并没有做什么花哨的事情。他们只是完成了任务。其他球员更为有名：特里·布拉德肖、弗兰科·哈里斯、林恩·斯万。但他们打的是进攻，因此总是能获得更多关注。"
    },
    {
      "original": "It seemed to me as a twelve year old football expert that the best of them all was Jack Lambert. And what made him so good was that he was utterly relentless. He didn't just care about playing well; he cared almost too much.",
      "translated": "在我十二岁的时候，作为一个足球专家，我认为最好的球员是杰克·兰伯特。让他如此出色的是他完全不屈不挠的精神。他不仅关心踢得好，而且几乎可以说是过于在意。"
    },
    {
      "original": "He seemed to regard it as a personal insult when someone from the other team had possession of the ball on his side of the line of scrimmage.The suburbs of Pittsburgh in the 1970s were a pretty dull place.",
      "translated": "当对方球队的球员在他这一侧的争球线后持球时，他似乎将其视为个人侮辱。20世纪70年代的匹兹堡郊区是一个相当沉闷的地方。"
    },
    {
      "original": "School was boring. All the adults around were bored with their jobs working for big companies. Everything that came to us through the mass media was (a) blandly uniform and (b) produced elsewhere. Jack Lambert was the exception.",
      "translated": "上学很无聊。周围的大人们对自己的工作也感到厌倦，他们为大公司工作。通过大众媒体传到我们这里的一切都（a）单调乏味，（b）而且是别处生产的。杰克·兰伯特是个例外。"
    },
    {
      "original": "He was like nothing else I'd seen. Kenneth ClarkKenneth Clark is the best nonfiction writer I know of, on any subject. Most people who write about art history don't really like art; you can tell from a thousand little signs.",
      "translated": "他和我见过的任何东西都不一样。Kenneth Clark 是我所知的最好的非小说类作家，无论主题为何。大多数写艺术史的人其实并不真正喜欢艺术；从上千个细微之处可以看出来。"
    },
    {
      "original": "But Clark did, and not just intellectually, but the way one anticipates a delicious dinner.What really makes him stand out, though, is the quality of his ideas. His style is deceptively casual, but there is more in his books than in a library of art monographs.",
      "translated": "但克拉克确实如此，不仅在理智上，更像期待一顿美味的晚餐一样。真正使他脱颖而出的是他的思想质量。他的风格表面上看似随意，但他的书中内容比艺术专著图书馆里的还要丰富。"
    },
    {
      "original": "Reading The Nude is like a ride in a Ferrari. Just as you're getting settled, you're slammed back in your seat by the acceleration. Before you can adjust, you're thrown sideways as the car screeches into the first turn.",
      "translated": "阅读《裸体》就像乘坐一辆法拉利。正当你刚坐稳时，你会被突然的加速猛推回座位。还没等你适应，车已急转弯，将你甩向一边。"
    },
    {
      "original": "His brain throws off ideas almost too fast to grasp them. Finally at the end of the chapter you come to a halt, with your eyes wide and a big smile on your face.Kenneth Clark was a star in his day, thanks to the documentary series Civilisation.",
      "translated": "他的大脑几乎以令人难以捕捉的速度抛出各种想法。最后，在章节的末尾，你停下了脚步，眼睛睁得大大的，脸上带着灿烂的笑容。肯尼斯·克拉克在他的时代是一颗明星，这要归功于他主持的纪录片系列《文明》。"
    },
    {
      "original": "And if you read only one book about art history, Civilisation is the one I'd recommend. It's much better than the drab Sears Catalogs of art that undergraduates are forced to buy for Art History 101.",
      "translated": "如果你只读一本关于艺术史的书，我推荐《文明》。它比那些本科生被迫在艺术史101课程中购买的枯燥乏味的艺术目录要好得多。"
    },
    {
      "original": "Larry MihalkoA lot of people have a great teacher at some point in their childhood. Larry Mihalko was mine. When I look back it's like there's a line drawn between third and fourth grade. After Mr. Mihalko, everything was different.Why?",
      "translated": "拉里·米哈尔科在我们童年的某个时刻，很多人都有一位优秀的老师。拉里·米哈尔科就是我的。回想起那段时光，就像是在三年级和四年级之间画了一条线。在米哈尔科先生之后，一切都变得不同了。为什么呢？"
    },
    {
      "original": "First of all, he was intellectually curious. I had a few other teachers who were smart, but I wouldn't describe them as intellectually curious. In retrospect, he was out of place as an elementary school teacher, and I think he knew it.",
      "translated": "首先，他对知识充满好奇。我以前也有一些聪明的老师，但我不认为他们对知识有同样的好奇心。回过头来看，他作为一个小学老师确实显得格格不入，我想他自己也意识到了这一点。"
    },
    {
      "original": "That must have been hard for him, but it was wonderful for us, his students. His class was a constant adventure. I used to like going to school every day.The other thing that made him different was that he liked us.",
      "translated": "那对他来说一定很艰难，但对我们这些学生来说却非常美妙。他的课总是一场冒险。我以前喜欢每天去上学。另让他与众不同的是，他喜欢我们。"
    },
    {
      "original": "Kids are good at telling that. The other teachers were at best benevolently indifferent. But Mr. Mihalko seemed like he actually wanted to be our friend. On the last day of fourth grade, he got out one of the heavy school record players and played James Taylor's \"You've Got a Friend\" to us.",
      "translated": "孩子们很擅长分辨这一点。其他老师最多只是善意地漠不关心。但米哈科先生看起来真的想成为我们的朋友。在四年级的最后一天，他拿出了一台学校的重型唱片机，为我们播放了詹姆斯·泰勒的《你有一个朋友》。"
    },
    {
      "original": "Just call out my name, and you know wherever I am, I'll come running. He died at 59 of lung cancer. I've never cried like I cried at his funeral. LeonardoOne of the things I've learned about making things that I didn't realize when I was a kid is that much of the best stuff isn't made for audiences, but for oneself.",
      "translated": "只要喊我的名字，你知道无论我在哪儿，我都会跑过来。他因肺癌在59岁时去世。在他的葬礼上，我哭得比任何时候都厉害。莱昂纳多。我小时候没有意识到的一件事是，制作东西时，最好的作品往往不是为观众而作，而是为自己而作。"
    },
    {
      "original": "You see paintings and drawings in museums and imagine they were made for you to look at. Actually a lot of the best ones were made as a way of exploring the world, not as a way to please other people.",
      "translated": "你在博物馆里看到绘画和素描，想象它们是为你而创作的。其实，许多最优秀的作品是为了探索世界而创作的，而不是为了取悦他人。"
    },
    {
      "original": "The best of these explorations are sometimes more pleasing than stuff made explicitly to please.Leonardo did a lot of things. One of his most admirable qualities was that he did so many different things that were admirable.",
      "translated": "这些探索中最好的有时比那些刻意取悦人的东西更令人愉悦。达芬奇做了很多事情。他最令人钦佩的品质之一就是他做了许多不同且令人钦佩的事情。"
    },
    {
      "original": "What people know of him now is his paintings and his more flamboyant inventions, like flying machines. That makes him seem like some kind of dreamer who sketched artists' conceptions of rocket ships on the side.",
      "translated": "现在人们所熟知的是他的画作和那些更为华丽的发明，比如飞行器。这让他看起来像是一个梦想家，偶尔还会勾勒出火箭飞船的艺术构想。"
    },
    {
      "original": "In fact he made a large number of far more practical technical discoveries. He was as good an engineer as a painter.His most impressive work, to me, is his drawings. They're clearly made more as a way of studying the world than producing something beautiful.",
      "translated": "事实上，他做出了大量更为实用的技术发现。他是一位与画家一样优秀的工程师。最让我印象深刻的是他的素描。这些素描明显是为了研究世界而作，而不仅仅是创作美丽的事物。"
    },
    {
      "original": "And yet they can hold their own with any work of art ever made. No one else, before or since, was that good when no one was looking. Robert MorrisRobert Morris has a very unusual quality: he's never wrong.",
      "translated": "然而，他们的作品可以与任何已知的艺术作品相媲美。在无人关注的情况下，没有人能比得上他的水平。罗伯特·莫里斯拥有一种非常特殊的品质：他从不出错。"
    },
    {
      "original": "It might seem this would require you to be omniscient, but actually it's surprisingly easy. Don't say anything unless you're fairly sure of it. If you're not omniscient, you just don't end up saying much.More precisely, the trick is to pay careful attention to how you qualify what you say.",
      "translated": "这可能看起来需要你无所不知，但实际上却出奇地简单。除非你相当确定，否则不要轻易发表意见。如果你并非无所不知，那么你最终说出的话就不会太多。更准确地说，关键在于你要仔细注意你如何对自己的言论进行限定。"
    },
    {
      "original": "By using this trick, Robert has, as far as I know, managed to be mistaken only once, and that was when he was an undergrad. When the Mac came out, he said that little desktop computers would never be suitable for real hacking.It's wrong to call it a trick in his case, though.",
      "translated": "据我所知，罗伯特用了这个方法后，至今只出错过一次，那还是在他读本科的时候。当时Mac电脑推出时，他说小型台式机永远不适合真正的黑客活动。不过，称它为方法在他身上并不准确。"
    },
    {
      "original": "If it were a conscious trick, he would have slipped in a moment of excitement. With Robert this quality is wired-in. He has an almost superhuman integrity. He's not just generally correct, but also correct about how correct he is.You'd think it would be such a great thing never to be wrong that everyone would do this.",
      "translated": "如果这是一种有意为之的把戏，他在兴奋的时刻就会露出破绽。罗伯特的这种品质是与生俱来的。他几乎拥有超人的正直。他不仅通常是对的，而且对自己有多正确也十分清楚。你可能会认为从不犯错是一件如此美好的事情，以至于每个人都会这样做。"
    },
    {
      "original": "It doesn't seem like that much extra work to pay as much attention to the error on an idea as to the idea itself. And yet practically no one does. I know how hard it is, because since meeting Robert I've tried to do in software what he seems to do in hardware.",
      "translated": "似乎并不需要额外付出太多努力，就可以像关注一个想法本身那样关注这个想法的错误。然而实际上几乎没有人这样做。我知道这有多难，因为自从认识罗伯特之后，我一直在尝试在软件方面做到他似乎在硬件方面所做的事情。"
    },
    {
      "original": "P. G. WodehousePeople are finally starting to admit that Wodehouse was a great writer. If you want to be thought a great novelist in your own time, you have to sound intellectual. If what you write is popular, or entertaining, or funny, you're ipso facto suspect.",
      "translated": "P. G. 沃德豪斯\n人们终于开始承认沃德豪斯是一位伟大的作家。如果你想在你自己的时代被认为是一位伟大的小说家，你就必须显得有学识。如果你写的东西受欢迎、娱乐性强或有趣，那你自然而然就会受到怀疑。"
    },
    {
      "original": "That makes Wodehouse doubly impressive, because it meant that to write as he wanted to, he had to commit to being despised in his own lifetime.Evelyn Waugh called him a great writer, but to most people at the time that would have read as a chivalrous or deliberately perverse gesture.",
      "translated": "这使得伍德豪斯更加令人敬佩，因为他为了按照自己的方式写作，不得不接受在自己生前被人们所鄙视。伊夫林·沃称他为伟大的作家，但在当时，大多数人会把这看作是一种骑士精神或故意标新立异的行为。"
    },
    {
      "original": "At the time any random autobiographical novel by a recent college grad could count on more respectful treatment from the literary establishment.Wodehouse may have begun with simple atoms, but the way he composed them into molecules was near faultless.",
      "translated": "当时，任何一位刚毕业的大学生所写的自传体小说都能得到文学界较为尊重的对待。伍德豪斯虽然从简单的元素开始，但他将这些元素组合成分子的方式几乎无懈可击。"
    },
    {
      "original": "His rhythm in particular. It makes me self-conscious to write about it. I can think of only two other writers who came near him for style: Evelyn Waugh and Nancy Mitford. Those three used the English language like they owned it.But Wodehouse has something neither of them did.",
      "translated": "尤其是他的节奏。让我写到这儿都觉得有些自愧不如。我只能想到另外两位在文风上接近他的作家：伊夫林·沃和南希·米特福德。这三位使用英语时就像这语言是他们的一样。但伍德豪斯拥有一种他们所没有的东西。"
    },
    {
      "original": "He's at ease. Evelyn Waugh and Nancy Mitford cared what other people thought of them: he wanted to seem aristocratic; she was afraid she wasn't smart enough. But Wodehouse didn't give a damn what anyone thought of him.",
      "translated": "他很自在。伊夫林·沃和南希·米特福德在意别人的看法：他想显得有贵族气派；她则担心自己不够聪明。但伍德豪斯完全不在乎别人对他的看法。"
    },
    {
      "original": "He wrote exactly what he wanted. Alexander CalderCalder's on this list because he makes me happy. Can his work stand up to Leonardo's? Probably not. There might not be anything from the 20th Century that can.",
      "translated": "他写下了他想要的一切。亚历山大·考尔德在这份名单上，因为他让我快乐。他的作品能与达·芬奇的作品相媲美吗？可能不能。20世纪可能没有什么作品能够做到。"
    },
    {
      "original": "But what was good about Modernism, Calder had, and had in a way that he made seem effortless.What was good about Modernism was its freshness. Art became stuffy in the nineteenth century. The paintings that were popular at the time were mostly the art equivalent of McMansions—big, pretentious, and fake.",
      "translated": "但是，现代主义的优点，考尔德都具备了，并且他以一种看似毫不费力的方式做到了这一点。现代主义的优点在于它的新鲜感。艺术在19世纪变得沉闷。当时流行的绘画作品大多是艺术界的麦ansion——宏大、矫揉造作且不真实。"
    },
    {
      "original": "Modernism meant starting over, making things with the same earnest motives that children might. The artists who benefited most from this were the ones who had preserved a child's confidence, like Klee and Calder.Klee was impressive because he could work in so many different styles.",
      "translated": "现代主义意味着重新开始，以孩子们可能具有的同样真诚的动机来创作。从中受益最多的艺术家是那些保留了孩子般自信的人，比如克利和卡尔德。克利令人印象深刻，因为他能够以多种不同的风格进行创作。"
    },
    {
      "original": "But between the two I like Calder better, because his work seemed happier. Ultimately the point of art is to engage the viewer. It's hard to predict what will; often something that seems interesting at first will bore you after a month.",
      "translated": "但在两者之间，我更喜欢考尔德的作品，因为他的作品看起来更欢快。艺术的最终目的是吸引观众。很难预测什么能做到这一点；通常，一开始看起来有趣的东西，一个月后可能会让你感到厌烦。"
    },
    {
      "original": "Calder's sculptures never get boring. They just sit there quietly radiating optimism, like a battery that never runs out. As far as I can tell from books and photographs, the happiness of Calder's work is his own happiness showing through.",
      "translated": "考尔德的雕塑永远不会让人感到厌倦。它们静静地坐在那里，散发着乐观的气息，就像一块永远不会耗尽电量的电池。从书本和照片中我能感受到，考尔德作品中的幸福感正是他本人的幸福感的体现。"
    },
    {
      "original": "Jane AustenEveryone admires Jane Austen. Add my name to the list. To me she seems the best novelist of all time.I'm interested in how things work. When I read most novels, I pay as much attention to the author's choices as to the story.",
      "translated": "简·奥斯汀\n每个人都崇拜简·奥斯汀。把我的名字也加到这个名单上。对我来说，她似乎是史上最优秀的小说家。我对事物的运作方式很感兴趣。当我阅读大多数小说时，我不仅关注故事本身，也关注作者的选择。"
    },
    {
      "original": "But in her novels I can't see the gears at work. Though I'd really like to know how she does what she does, I can't figure it out, because she's so good that her stories don't seem made up. I feel like I'm reading a description of something that actually happened.I used to read a lot of novels when I was younger.",
      "translated": "但在她的小说中，我看不到那些机制的运作。虽然我真的很想知道她是如何做到的，但我却无从得知，因为她实在太出色，以至于她的故事看起来并不像是虚构的。我感觉像是在读一段真实发生过的事情的描述。我年轻时读过很多小说。"
    },
    {
      "original": "I can't read most anymore, because they don't have enough information in them. Novels seem so impoverished compared to history and biography. But reading Austen is like reading nonfiction. She writes so well you don't even notice her.",
      "translated": "我已无法阅读大多数作品，因为它们缺乏足够的信息。相比历史和传记，小说显得如此贫乏。但阅读奥斯汀的作品就像在读非小说类作品。她写得如此之好，以至于你甚至不会注意到她的存在。"
    },
    {
      "original": "John McCarthyJohn McCarthy invented Lisp, the field of (or at least the term) artificial intelligence, and was an early member of both of the top two computer science departments, MIT and Stanford. No one would dispute that he's one of the greats, but he's an especial hero to me because of Lisp.It's hard for us now to understand what a conceptual leap that was at the time.",
      "translated": "约翰·麦卡锡发明了Lisp语言，创立了（或者至少是提出了）人工智能这个领域，并且是MIT和斯坦福这两所顶级计算机科学系的早期成员之一。没有人会质疑他是计算机科学领域的一位伟人，但对我来说，他尤其是一位英雄，这都归功于Lisp。现在我们很难理解当时这是一个多么巨大的概念飞跃。"
    },
    {
      "original": "Paradoxically, one of the reasons his achievement is hard to appreciate is that it was so successful. Practically every programming language invented in the last 20 years includes ideas from Lisp, and each year the median language gets more Lisplike.In 1958 these ideas were anything but obvious.",
      "translated": "悖论的是，他的成就之所以难以被欣赏，恰恰是因为它太成功了。几乎过去20年中发明的每一种编程语言都包含了来自Lisp的思想，而且每年主流语言都变得更加像Lisp。而在1958年，这些思想远非显而易见。"
    },
    {
      "original": "In 1958 there seem to have been two ways of thinking about programming. Some people thought of it as math, and proved things about Turing Machines. Others thought of it as a way to get things done, and designed languages all too influenced by the technology of the day.",
      "translated": "1958年，对编程似乎存在两种不同的看法。一些人将其视为数学，并证明了图灵机的性质。另一些人则将其视为完成任务的手段，并设计了受当时技术影响过大的语言。"
    },
    {
      "original": "McCarthy alone bridged the gap. He designed a language that was math. But designed is not really the word; discovered is more like it. The SpitfireAs I was making this list I found myself thinking of people like Douglas Bader and R.J.",
      "translated": "麦卡锡独自弥合了这一差距。他设计了一种数学语言。但说设计并不十分准确；发现可能更为贴切。在制作这份名单时，我不禁想起了道格拉斯·贝德和R.J.这样的人。"
    },
    {
      "original": "Mitchell and Jeffrey Quill and I realized that though all of them had done many things in their lives, there was one factor above all that connected them: the Spitfire.This is supposed to be a list of heroes.",
      "translated": "米切尔和杰弗里·奎尔以及我意识到，尽管他们一生中做了许多事情，但有一个因素将他们联系在一起：喷火战机。这应该是一份英雄名单。"
    },
    {
      "original": "How can a machine be on it? Because that machine was not just a machine. It was a lens of heroes. Extraordinary devotion went into it, and extraordinary courage came out.It's a cliche to call World War II a contest between good and evil, but between fighter designs, it really was.",
      "translated": "这台机器怎么可能如此出色？因为那不仅仅是一台机器。它是一面英雄的镜子。非凡的奉献铸就了它，非凡的勇气由此而生。说第二次世界大战是一场正义与邪恶的较量可能已成陈词滥调，但就战斗机设计而言，这确实是一场较量。"
    },
    {
      "original": "The Spitfire's original nemesis, the ME 109, was a brutally practical plane. It was a killing machine. The Spitfire was optimism embodied. And not just in its beautiful lines: it was at the edge of what could be manufactured.",
      "translated": "喷火战斗机的原始对手，ME 109，是一款极其实用的飞机。它是一架杀戮机器。而喷火战斗机则体现了乐观主义。这不仅体现在它优美的线条上：它代表了当时制造技术的极限。"
    },
    {
      "original": "But taking the high road worked. In the air, beauty had the edge, just. Steve JobsPeople alive when Kennedy was killed usually remember exactly where they were when they heard about it. I remember exactly where I was when a friend asked if I'd heard Steve Jobs had cancer.",
      "translated": "但走高端路线奏效了。在空中，美丽稍占上风。史蒂夫·乔布斯那一代人中，肯尼迪遇刺时在世的人通常都能准确记得他们当时在哪里。我也清楚地记得，当一个朋友问我是否听说史蒂夫·乔布斯患了癌症时，我正身处何地。"
    },
    {
      "original": "It was like the floor dropped out. A few seconds later she told me that it was a rare operable type, and that he'd be ok. But those seconds seemed long.I wasn't sure whether to include Jobs on this list.",
      "translated": "就像地板突然塌陷了一样。几秒后，她告诉我这是一种罕见的可手术类型，他会没事的。但那几秒显得那么漫长。我不确定是否应该把乔布斯列入这个名单。"
    },
    {
      "original": "A lot of people at Apple seem to be afraid of him, which is a bad sign. But he compels admiration.There's no name for what Steve Jobs is, because there hasn't been anyone quite like him before. He doesn't design Apple's products himself.",
      "translated": "苹果公司里很多人似乎都对他感到害怕，这是一个不好的信号。但他却令人不得不钦佩。史蒂夫·乔布斯这样的角色是前所未有的，因此无法用一个特定的名称来定义。他本人并不亲自设计苹果的产品。"
    },
    {
      "original": "Historically the closest analogy to what he does are the great Renaissance patrons of the arts. As the CEO of a company, that makes him unique.Most CEOs delegate taste to a subordinate. The design paradox means they're choosing more or less at random.",
      "translated": "历史上，最接近他所做事情的类比是文艺复兴时期的伟大艺术赞助人。作为一家公司的首席执行官，这使他独具一格。大多数首席执行官会将品味的决策委托给下属。设计悖论意味着他们的选择几乎是随机的。"
    },
    {
      "original": "But Steve Jobs actually has taste himself — such good taste that he's shown the world how much more important taste is than they realized. Isaac NewtonNewton has a strange role in my pantheon of heroes: he's the one I reproach myself with.",
      "translated": "但史蒂夫·乔布斯本人确实有品位——这种品位如此之高，以至于他向世人展示了品位比人们意识到的要重要得多。艾萨克·牛顿在我心中的英雄殿堂中扮演着一个奇特的角色：他是我用来自我反省的人。"
    },
    {
      "original": "He worked on big things, at least for part of his life. It's so easy to get distracted working on small stuff. The questions you're answering are pleasantly familiar. You get immediate rewards — in fact, you get bigger rewards in your time if you work on matters of passing importance.",
      "translated": "他一生中至少有一部分时间是在处理大事。专注于小事很容易分心。你回答的问题虽然令人愉快地熟悉，但你立刻就能得到回报——事实上，如果你处理的是一些暂时重要的事情，你在这个时代会得到更大的回报。"
    },
    {
      "original": "But I'm uncomfortably aware that this is the route to well-deserved obscurity.To do really great things, you have to seek out questions people didn't even realize were questions. There have probably been other people who did this as well as Newton, for their time, but Newton is my model of this kind of thought.",
      "translated": "但我清楚地意识到，这是一条通向应得的默默无闻的道路。要做出真正伟大的事情，你必须去寻找人们甚至没有意识到是问题的问题。可能还有其他人在他们的时代也像牛顿一样做到了这一点，但牛顿是我这种思维方式的典范。"
    },
    {
      "original": "I can just begin to understand what it must have felt like for him.You only get one life. Why not do something huge? The phrase \"paradigm shift\" is overused now, but Kuhn was onto something. And you know more are out there, separated from us by what will later seem a surprisingly thin wall of laziness and stupidity.",
      "translated": "我开始能理解他当时的感觉了。人只有一次生命，为什么不干点大事呢？“范式转换”这个词现在用得太多了，但库恩确实抓住了什么。你知道还有更多的人存在，只是被一层看似薄薄的懒惰和愚蠢之墙隔开了。"
    },
    {
      "original": "If we work like Newton.Thanks to Trevor Blackwell, Jessica Livingston, and Jackie McDonough for reading drafts of this.Japanese Translation",
      "translated": "如果我们像牛顿一样工作。感谢特雷弗·布莱克威尔、杰西卡·利文斯顿和杰基·麦克唐纳阅读此稿。日文翻译"
    }
  ],
  "translation_completed": "2025-07-28T16:00:39.370037",
  "translation_stats": {
    "total_paragraphs": 58,
    "success_count": 58,
    "success_rate": "100.0%"
  }
}