{
  "title": "The High-Res Society",
  "title_zh": "[待翻译] The High-Res Society",
  "url": "https://www.paulgraham.com/highres.html",
  "filename": "highres.html",
  "date": "2008-12-01",
  "id": 163,
  "content": {
    "success": true,
    "paragraphs": [
      "December 2008For nearly all of history the success of a society was proportionate to its ability to assemble large and disciplined organizations. Those who bet on economies of scale generally won, which meant the largest organizations were the most successful ones.Things have already changed so much that this is hard for us to believe, but till just a few decades ago the largest organizations tended to be the most progressive.",
      "An ambitious kid graduating from college in 1960 wanted to work in the huge, gleaming offices of Ford, or General Electric, or NASA. Small meant small-time. Small in 1960 didn't mean a cool little startup.",
      "It meant uncle Sid's shoe store.When I grew up in the 1970s, the idea of the \"corporate ladder\" was still very much alive. The standard plan was to try to get into a good college, from which one would be drafted into some organization and then rise to positions of gradually increasing responsibility.",
      "The more ambitious merely hoped to climb the same ladder faster. [1]But in the late twentieth century something changed. It turned out that economies of scale were not the only force at work. Particularly in technology, the increase in speed one could get from smaller groups started to trump the advantages of size.The future turned out to be different from the one we were expecting in 1970.",
      "The domed cities and flying cars we expected have failed to materialize. But fortunately so have the jumpsuits with badges indicating our specialty and rank. Instead of being dominated by a few, giant tree-structured organizations, it's now looking like the economy of the future will be a fluid network of smaller, independent units.It's not so much that large organizations stopped working.",
      "There's no evidence that famously successful organizations like the Roman army or the British East India Company were any less afflicted by protocol and politics than organizations of the same size today.",
      "But they were competing against opponents who couldn't change the rules on the fly by discovering new technology. Now it turns out the rule \"large and disciplined organizations win\" needs to have a qualification appended: \"at games that change slowly.\" No one knew till change reached a sufficient speed.Large organizations will start to do worse now, though, because for the first time in history they're no longer getting the best people.",
      "An ambitious kid graduating from college now doesn't want to work for a big company. They want to work for the hot startup that's rapidly growing into one. If they're really ambitious, they want to start it.",
      "[2]This doesn't mean big companies will disappear. To say that startups will succeed implies that big companies will exist, because startups that succeed either become big companies or are acquired by them.",
      "[3] But large organizations will probably never again play the leading role they did up till the last quarter of the twentieth century.It's kind of surprising that a trend that lasted so long would ever run out.",
      "How often does it happen that a rule works for thousands of years, then switches polarity?The millennia-long run of bigger-is-better left us with a lot of traditions that are now obsolete, but extremely deeply rooted.",
      "Which means the ambitious can now do arbitrage on them. It will be very valuable to understand precisely which ideas to keep and which can now be discarded.The place to look is where the spread of smallness began: in the world of startups.There have always been occasional cases, particularly in the US, of ambitious people who grew the ladder under them instead of climbing it.",
      "But till recently this was an anomalous route that tended to be followed only by outsiders. It was no coincidence that the great industrialists of the nineteenth century had so little formal education.",
      "As huge as their companies eventually became, they were all essentially mechanics and shopkeepers at first. That was a social step no one with a college education would take if they could avoid it. Till the rise of technology startups, and in particular, Internet startups, it was very unusual for educated people to start their own businesses.The eight men who left Shockley Semiconductor to found Fairchild Semiconductor, the original Silicon Valley startup, weren't even trying to start a company at first.",
      "They were just looking for a company willing to hire them as a group. Then one of their parents introduced them to a small investment bank that offered to find funding for them to start their own, so they did.",
      "But starting a company was an alien idea to them; it was something they backed into. [4]Now I would guess that practically every Stanford or Berkeley undergrad who knows how to program has at least considered the idea of starting a startup.",
      "East Coast universities are not far behind, and British universities only a little behind them. This pattern suggests that attitudes at Stanford and Berkeley are not an anomaly, but a leading indicator.",
      "This is the way the world is going.Of course, Internet startups are still only a fraction of the world's economy. Could a trend based on them be that powerful?I think so. There's no reason to suppose there's any limit to the amount of work that could be done in this area.",
      "Like science, wealth seems to expand fractally. Steam power was a sliver of the British economy when Watt started working on it. But his work led to more work till that sliver had expanded into something bigger than the whole economy of which it had initially been a part.The same thing could happen with the Internet.",
      "If Internet startups offer the best opportunity for ambitious people, then a lot of ambitious people will start them, and this bit of the economy will balloon in the usual fractal way.Even if Internet-related applications only become a tenth of the world's economy, this component will set the tone for the rest.",
      "The most dynamic part of the economy always does, in everything from salaries to standards of dress. Not just because of its prestige, but because the principles underlying the most dynamic part of the economy tend to be ones that work.For the future, the trend to bet on seems to be networks of small, autonomous groups whose performance is measured individually.",
      "And the societies that win will be the ones with the least impedance.As with the original industrial revolution, some societies are going to be better at this than others. Within a generation of its birth in England, the Industrial Revolution had spread to continental Europe and North America.",
      "But it didn't spread everywhere. This new way of doing things could only take root in places that were prepared for it. It could only spread to places that already had a vigorous middle class.There is a similar social component to the transformation that began in Silicon Valley in the 1960s.",
      "Two new kinds of techniques were developed there: techniques for building integrated circuits, and techniques for building a new type of company designed to grow fast by creating new technology. The techniques for building integrated circuits spread rapidly to other countries.",
      "But the techniques for building startups didn't. Fifty years later, startups are ubiquitous in Silicon Valley and common in a handful of other US cities, but they're still an anomaly in most of the world.Part of the reason—possibly the main reason—that startups have not spread as broadly as the Industrial Revolution did is their social disruptiveness.",
      "Though it brought many social changes, the Industrial Revolution was not fighting the principle that bigger is better. Quite the opposite: the two dovetailed beautifully. The new industrial companies adapted the customs of existing large organizations like the military and the civil service, and the resulting hybrid worked well.",
      "\"Captains of industry\" issued orders to \"armies of workers,\" and everyone knew what they were supposed to do.Startups seem to go more against the grain, socially. It's hard for them to flourish in societies that value hierarchy and stability, just as it was hard for industrialization to flourish in societies ruled by people who stole at will from the merchant class.",
      "But there were already a handful of countries past that stage when the Industrial Revolution happened. There do not seem to be that many ready this time. Notes[1] One of the bizarre consequences of this model was that the usual way to make more money was to become a manager.",
      "This is one of the things startups fix.[2] There are a lot of reasons American car companies have been doing so much worse than Japanese car companies, but at least one of them is a cause for optimism: American graduates have more options.[3] It's possible that companies will one day be able to grow big in revenues without growing big in people, but we are not very far along that trend yet.[4] Lecuyer, Christophe, Making Silicon Valley, MIT Press, 2006.Thanks to Trevor Blackwell, Paul Buchheit, Jessica Livingston, and Robert Morris for reading drafts of this."
    ],
    "word_count": 1494,
    "paragraph_count": 29
  },
  "processed_at": "2025-07-26T19:06:41.477969",
  "paragraphs": [
    {
      "original": "December 2008For nearly all of history the success of a society was proportionate to its ability to assemble large and disciplined organizations. Those who bet on economies of scale generally won, which meant the largest organizations were the most successful ones.Things have already changed so much that this is hard for us to believe, but till just a few decades ago the largest organizations tended to be the most progressive.",
      "translated": "2008年12月\n\n在几乎整个历史长河中，一个社会的成功与其组织大规模且纪律严明的机构的能力成正比。那些押注规模经济的人通常会获胜，这意味着最大的组织往往是最成功的。事情已经发生了如此大的变化，以至于我们很难相信，但在仅仅几十年前，最大的组织往往是最先进的。"
    },
    {
      "original": "An ambitious kid graduating from college in 1960 wanted to work in the huge, gleaming offices of Ford, or General Electric, or NASA. Small meant small-time. Small in 1960 didn't mean a cool little startup.",
      "translated": "1960年从大学毕业的有志青年渴望在福特、通用电气或NASA那些庞大而光鲜的办公室里工作。小公司就意味着没什么大出息。1960年的小公司并不是指那些酷炫的小型创业公司。"
    },
    {
      "original": "It meant uncle Sid's shoe store.When I grew up in the 1970s, the idea of the \"corporate ladder\" was still very much alive. The standard plan was to try to get into a good college, from which one would be drafted into some organization and then rise to positions of gradually increasing responsibility.",
      "translated": "这意味着西德叔叔的鞋店。当我70年代长大的时候，“企业阶梯”的概念仍然非常盛行。标准的计划是努力进入一所好大学，从那里会被招入某个组织，然后逐步升任越来越重要的职位。"
    },
    {
      "original": "The more ambitious merely hoped to climb the same ladder faster. [1]But in the late twentieth century something changed. It turned out that economies of scale were not the only force at work. Particularly in technology, the increase in speed one could get from smaller groups started to trump the advantages of size.The future turned out to be different from the one we were expecting in 1970.",
      "translated": "更雄心勃勃的人只是希望更快地攀爬同一架梯子。[1]但在20世纪末，情况发生了变化。事实证明，规模经济并不是唯一在起作用的力量。特别是在技术领域，小团队所能获得的速度提升开始超越规模的优势。未来与我们在1970年所预期的不同。"
    },
    {
      "original": "The domed cities and flying cars we expected have failed to materialize. But fortunately so have the jumpsuits with badges indicating our specialty and rank. Instead of being dominated by a few, giant tree-structured organizations, it's now looking like the economy of the future will be a fluid network of smaller, independent units.It's not so much that large organizations stopped working.",
      "translated": "我们期待的圆顶城市和飞行汽车都没有实现。但幸运的是，那些标有我们专业和等级的连体服也没有出现。未来的经济看起来不会被少数几个巨大的树状结构组织所主导，而将是一个由较小的独立单元组成的流动网络。并不是说大型组织不再有效。"
    },
    {
      "original": "There's no evidence that famously successful organizations like the Roman army or the British East India Company were any less afflicted by protocol and politics than organizations of the same size today.",
      "translated": "没有证据表明，诸如罗马军队或英国东印度公司这样著名成功的组织，在规章制度和政治斗争方面比今天相同规模的组织少受困扰。"
    },
    {
      "original": "But they were competing against opponents who couldn't change the rules on the fly by discovering new technology. Now it turns out the rule \"large and disciplined organizations win\" needs to have a qualification appended: \"at games that change slowly.\" No one knew till change reached a sufficient speed.Large organizations will start to do worse now, though, because for the first time in history they're no longer getting the best people.",
      "translated": "但他们面对的是无法通过发现新技术而随意改变规则的对手。现在看来，“大型且有纪律的组织获胜”这一规则需要加上一个限定条件：“在变化缓慢的游戏中。”直到变化达到足够的速度，这一点才为人所知。然而，大型组织现在将开始表现得更差，因为历史上首次，它们不再能够吸引到最优秀的人才。"
    },
    {
      "original": "An ambitious kid graduating from college now doesn't want to work for a big company. They want to work for the hot startup that's rapidly growing into one. If they're really ambitious, they want to start it.",
      "translated": "一个有志向的大学生毕业后现在不想去大公司工作。他们想为那个正在迅速成长为大公司的热门初创企业工作。如果他们真的很有雄心，他们想自己创办这样的企业。"
    },
    {
      "original": "[2]This doesn't mean big companies will disappear. To say that startups will succeed implies that big companies will exist, because startups that succeed either become big companies or are acquired by them.",
      "translated": "这并不意味着大公司会消失。说初创公司会成功，就意味着大公司会存在，因为成功的初创公司要么自己成长为大公司，要么被大公司收购。"
    },
    {
      "original": "[3] But large organizations will probably never again play the leading role they did up till the last quarter of the twentieth century.It's kind of surprising that a trend that lasted so long would ever run out.",
      "translated": "但是，大型组织可能再也不会像20世纪最后四分之一那样扮演主角了。一个持续如此之久的趋势最终会耗尽，这多少让人感到意外。"
    },
    {
      "original": "How often does it happen that a rule works for thousands of years, then switches polarity?The millennia-long run of bigger-is-better left us with a lot of traditions that are now obsolete, but extremely deeply rooted.",
      "translated": "一条规则能延续数千年，然后突然转变方向，这种情况发生的频率有多高？长期以来，更大就是更好的观念为我们留下了许多现在已经过时但根深蒂固的传统。"
    },
    {
      "original": "Which means the ambitious can now do arbitrage on them. It will be very valuable to understand precisely which ideas to keep and which can now be discarded.The place to look is where the spread of smallness began: in the world of startups.There have always been occasional cases, particularly in the US, of ambitious people who grew the ladder under them instead of climbing it.",
      "translated": "这意味着有野心的人现在可以在这上面进行套利。准确地了解哪些想法应该保留，哪些现在可以舍弃，将非常有价值。要寻找的地方是小规模扩张开始的地方：在创业公司世界。一直以来，尤其是在美国，偶尔会有这样的人，他们不是去攀爬梯子，而是去扩展自己脚下的梯子。"
    },
    {
      "original": "But till recently this was an anomalous route that tended to be followed only by outsiders. It was no coincidence that the great industrialists of the nineteenth century had so little formal education.",
      "translated": "但直到最近，这还是一条异常的路径，通常只有局外人会选择。十九世纪的伟大工业家们受过很少的正规教育，这并非偶然。"
    },
    {
      "original": "As huge as their companies eventually became, they were all essentially mechanics and shopkeepers at first. That was a social step no one with a college education would take if they could avoid it. Till the rise of technology startups, and in particular, Internet startups, it was very unusual for educated people to start their own businesses.The eight men who left Shockley Semiconductor to found Fairchild Semiconductor, the original Silicon Valley startup, weren't even trying to start a company at first.",
      "translated": "尽管他们的公司最终变得如此庞大，但起初他们基本上都是机械师和店主。在可以避免的情况下，受过大学教育的人是不会选择走这条路的。直到科技初创企业的兴起，尤其是互联网初创企业的兴起，受过教育的人自己创业才变得不同寻常。创建了第一家硅谷初创企业——仙童半导体公司的八位离开肖克利半导体公司的人，起初甚至不是想创办一家公司。"
    },
    {
      "original": "They were just looking for a company willing to hire them as a group. Then one of their parents introduced them to a small investment bank that offered to find funding for them to start their own, so they did.",
      "translated": "他们只是想找一家公司愿意集体雇佣他们。后来，他们的一个家长介绍他们认识了一家小型投资银行，这家银行愿意为他们提供资金，帮助他们创业，于是他们就这么做了。"
    },
    {
      "original": "But starting a company was an alien idea to them; it was something they backed into. [4]Now I would guess that practically every Stanford or Berkeley undergrad who knows how to program has at least considered the idea of starting a startup.",
      "translated": "但创办公司对他们来说是一个完全陌生的概念；这是他们无意中涉足的领域。[4]现在我猜测，几乎每一个懂编程的斯坦福或伯克利本科生都至少考虑过创办一家初创公司的想法。"
    },
    {
      "original": "East Coast universities are not far behind, and British universities only a little behind them. This pattern suggests that attitudes at Stanford and Berkeley are not an anomaly, but a leading indicator.",
      "translated": "东海岸的大学紧随其后，英国的大学也相差不远。这种模式表明，斯坦福和伯克利的态度并非异常，而是领先指标。"
    },
    {
      "original": "This is the way the world is going.Of course, Internet startups are still only a fraction of the world's economy. Could a trend based on them be that powerful?I think so. There's no reason to suppose there's any limit to the amount of work that could be done in this area.",
      "translated": "这就是世界的发展方向。当然，互联网初创企业仍然只占世界经济的一小部分。基于这些企业的趋势会有如此强大的影响力吗？我认为会。没有理由认为在这个领域可以完成的工作量有任何限制。"
    },
    {
      "original": "Like science, wealth seems to expand fractally. Steam power was a sliver of the British economy when Watt started working on it. But his work led to more work till that sliver had expanded into something bigger than the whole economy of which it had initially been a part.The same thing could happen with the Internet.",
      "translated": "像科学一样，财富似乎也以分形的方式增长。瓦特开始研究蒸汽动力时，它只是英国经济的一小部分。但他的工作引发了一系列的进展，直到这一小部分扩展成了比其最初所属的整个经济还要大的东西。同样的情况也可能发生在互联网上。"
    },
    {
      "original": "If Internet startups offer the best opportunity for ambitious people, then a lot of ambitious people will start them, and this bit of the economy will balloon in the usual fractal way.Even if Internet-related applications only become a tenth of the world's economy, this component will set the tone for the rest.",
      "translated": "如果互联网创业为有抱负的人提供了最好的机会，那么许多有抱负的人将会投身其中，这一部分经济将以惯常的分形方式迅速膨胀。即使与互联网相关的应用只占世界经济的十分之一，这一部分也将为其余部分定下基调。"
    },
    {
      "original": "The most dynamic part of the economy always does, in everything from salaries to standards of dress. Not just because of its prestige, but because the principles underlying the most dynamic part of the economy tend to be ones that work.For the future, the trend to bet on seems to be networks of small, autonomous groups whose performance is measured individually.",
      "translated": "经济中最活跃的部分总是如此，从薪资到着装标准，无一例外。这不仅是因为它的声望，还因为经济中最活跃部分所基于的原则往往是行之有效的。对于未来，似乎值得押注的趋势是小规模、自主的团队网络，其表现将被单独衡量。"
    },
    {
      "original": "And the societies that win will be the ones with the least impedance.As with the original industrial revolution, some societies are going to be better at this than others. Within a generation of its birth in England, the Industrial Revolution had spread to continental Europe and North America.",
      "translated": "而获胜的社会将是那些阻力最小的社会。就像最初的工业革命一样，有些社会在这方面的表现会比其他社会更好。在工业革命在英国诞生后的一代之内，它就传播到了欧洲大陆和北美洲。"
    },
    {
      "original": "But it didn't spread everywhere. This new way of doing things could only take root in places that were prepared for it. It could only spread to places that already had a vigorous middle class.There is a similar social component to the transformation that began in Silicon Valley in the 1960s.",
      "translated": "但它并没有到处传播。这种新的做事方式只能在那些为此做好准备的地方生根发芽。它只能传播到那些已经拥有活跃的中产阶级的地方。始于20世纪60年代硅谷的转型也有类似的社会成分。"
    },
    {
      "original": "Two new kinds of techniques were developed there: techniques for building integrated circuits, and techniques for building a new type of company designed to grow fast by creating new technology. The techniques for building integrated circuits spread rapidly to other countries.",
      "translated": "那里发展了两种新技术：一种是制造集成电路的技术，另一种是建立新型公司以通过创造新技术实现快速成长的技术。制造集成电路的技术迅速传播到了其他国家。"
    },
    {
      "original": "But the techniques for building startups didn't. Fifty years later, startups are ubiquitous in Silicon Valley and common in a handful of other US cities, but they're still an anomaly in most of the world.Part of the reason—possibly the main reason—that startups have not spread as broadly as the Industrial Revolution did is their social disruptiveness.",
      "translated": "但创建初创公司的方法并没有改变。五十年后，初创公司在硅谷无处不在，在美国其他少数几个城市也很常见，但在世界大多数地方仍然是个例外。初创公司没有像工业革命那样广泛传播的原因之一——可能是主要原因——在于它们的社会颠覆性。"
    },
    {
      "original": "Though it brought many social changes, the Industrial Revolution was not fighting the principle that bigger is better. Quite the opposite: the two dovetailed beautifully. The new industrial companies adapted the customs of existing large organizations like the military and the civil service, and the resulting hybrid worked well.",
      "translated": "尽管工业革命带来了许多社会变迁，但它并没有挑战“越大越好”的原则。相反，两者相得益彰。新兴的工业公司借鉴了军事和文官系统等大型组织的惯例，这一融合的结果非常成功。"
    },
    {
      "original": "\"Captains of industry\" issued orders to \"armies of workers,\" and everyone knew what they were supposed to do.Startups seem to go more against the grain, socially. It's hard for them to flourish in societies that value hierarchy and stability, just as it was hard for industrialization to flourish in societies ruled by people who stole at will from the merchant class.",
      "translated": "“行业领袖”向“工人大军”发布命令，每个人都清楚自己的职责所在。创业公司似乎更具有社会反叛性。它们难以在重视等级和稳定的环境中蓬勃发展，正如工业化难以在那些统治者随意掠夺商人阶层的社会中繁荣一样。"
    },
    {
      "original": "But there were already a handful of countries past that stage when the Industrial Revolution happened. There do not seem to be that many ready this time. Notes[1] One of the bizarre consequences of this model was that the usual way to make more money was to become a manager.",
      "translated": "但当工业革命发生时，已经有一些国家度过了那个阶段。这次似乎没有那么多国家准备好了。注[1] 这种模式的一个奇怪后果是，通常增加收入的方法是成为管理者。"
    },
    {
      "original": "This is one of the things startups fix.[2] There are a lot of reasons American car companies have been doing so much worse than Japanese car companies, but at least one of them is a cause for optimism: American graduates have more options.[3] It's possible that companies will one day be able to grow big in revenues without growing big in people, but we are not very far along that trend yet.[4] Lecuyer, Christophe, Making Silicon Valley, MIT Press, 2006.Thanks to Trevor Blackwell, Paul Buchheit, Jessica Livingston, and Robert Morris for reading drafts of this.",
      "translated": "这是初创企业解决的问题之一。[2] 美国汽车公司表现远不如日本汽车公司的原因有很多，但至少其中有一个原因是令人乐观的：美国的毕业生有更多选择。[3] 有可能有一天公司可以在不大幅增加员工的情况下实现收入大幅增长，但我们离这一趋势还很远。[4] Lecuyer, Christophe,《硅谷的形成》，MIT Press，2006年。感谢 Trevor Blackwell、Paul Buchheit、Jessica Livingston 和 Robert Morris 阅读本文草稿。"
    }
  ],
  "translation_completed": "2025-07-28T14:45:35.028620",
  "translation_stats": {
    "total_paragraphs": 29,
    "success_count": 29,
    "success_rate": "100.0%"
  }
}