{
  "title": "How to Work Hard",
  "title_zh": "[待翻译] How to Work Hard",
  "url": "https://www.paulgraham.com/hwh.html",
  "filename": "hwh.html",
  "date": "2021-06-01",
  "id": 17,
  "content": {
    "success": true,
    "paragraphs": [
      "June 2021It might not seem there's much to learn about how to work hard. Anyone who's been to school knows what it entails, even if they chose not to do it. There are 12 year olds who work amazingly hard.",
      "And yet when I ask if I know more about working hard now than when I was in school, the answer is definitely yes.One thing I know is that if you want to do great things, you'll have to work very hard.",
      "I wasn't sure of that as a kid. Schoolwork varied in difficulty; one didn't always have to work super hard to do well. And some of the things famous adults did, they seemed to do almost effortlessly.",
      "Was there, perhaps, some way to evade hard work through sheer brilliance? Now I know the answer to that question. There isn't.The reason some subjects seemed easy was that my school had low standards.",
      "And the reason famous adults seemed to do things effortlessly was years of practice; they made it look easy.Of course, those famous adults usually had a lot of natural ability too. There are three ingredients in great work: natural ability, practice, and effort.",
      "You can do pretty well with just two, but to do the best work you need all three: you need great natural ability and to have practiced a lot and to be trying very hard. [1]Bill Gates, for example, was among the smartest people in business in his era, but he was also among the hardest working.",
      "\"I never took a day off in my twenties,\" he said. \"Not one.\" It was similar with Lionel Messi. He had great natural ability, but when his youth coaches talk about him, what they remember is not his talent but his dedication and his desire to win.",
      "P. G. Wodehouse would probably get my vote for best English writer of the 20th century, if I had to choose. Certainly no one ever made it look easier. But no one ever worked harder. At 74, he wrote with each new book of mine I have, as I say, the feeling that this time I have picked a lemon in the garden of literature.",
      "A good thing, really, I suppose. Keeps one up on one's toes and makes one rewrite every sentence ten times. Or in many cases twenty times. Sounds a bit extreme, you think. And yet Bill Gates sounds even more extreme.",
      "Not one day off in ten years? These two had about as much natural ability as anyone could have, and yet they also worked about as hard as anyone could work. You need both.That seems so obvious, and yet in practice we find it slightly hard to grasp.",
      "There's a faint xor between talent and hard work. It comes partly from popular culture, where it seems to run very deep, and partly from the fact that the outliers are so rare. If great talent and great drive are both rare, then people with both are rare squared.",
      "Most people you meet who have a lot of one will have less of the other. But you'll need both if you want to be an outlier yourself. And since you can't really change how much natural talent you have, in practice doing great work, insofar as you can, reduces to working very hard.It's straightforward to work hard if you have clearly defined, externally imposed goals, as you do in school.",
      "There is some technique to it: you have to learn not to lie to yourself, not to procrastinate (which is a form of lying to yourself), not to get distracted, and not to give up when things go wrong. But this level of discipline seems to be within the reach of quite young children, if they want it.What I've learned since I was a kid is how to work toward goals that are neither clearly defined nor externally imposed.",
      "You'll probably have to learn both if you want to do really great things.The most basic level of which is simply to feel you should be working without anyone telling you to. Now, when I'm not working hard, alarm bells go off.",
      "I can't be sure I'm getting anywhere when I'm working hard, but I can be sure I'm getting nowhere when I'm not, and it feels awful. [2]There wasn't a single point when I learned this. Like most little kids, I enjoyed the feeling of achievement when I learned or did something new.",
      "As I grew older, this morphed into a feeling of disgust when I wasn't achieving anything. The one precisely dateable landmark I have is when I stopped watching TV, at age 13.Several people I've talked to remember getting serious about work around this age.",
      "When I asked Patrick Collison when he started to find idleness distasteful, he said I think around age 13 or 14. I have a clear memory from around then of sitting in the sitting room, staring outside, and wondering why I was wasting my summer holiday.",
      "Perhaps something changes at adolescence. That would make sense.Strangely enough, the biggest obstacle to getting serious about work was probably school, which made work (what they called work) seem boring and pointless.",
      "I had to learn what real work was before I could wholeheartedly desire to do it. That took a while, because even in college a lot of the work is pointless; there are entire departments that are pointless.",
      "But as I learned the shape of real work, I found that my desire to do it slotted into it as if they'd been made for each other.I suspect most people have to learn what work is before they can love it.",
      "Hardy wrote eloquently about this in A Mathematician's Apology: I do not remember having felt, as a boy, any passion for mathematics, and such notions as I may have had of the career of a mathematician were far from noble.",
      "I thought of mathematics in terms of examinations and scholarships: I wanted to beat other boys, and this seemed to be the way in which I could do so most decisively. He didn't learn what math was really about till part way through college, when he read Jordan's Cours d'analyse.",
      "I shall never forget the astonishment with which I read that remarkable work, the first inspiration for so many mathematicians of my generation, and learnt for the first time as I read it what mathematics really meant.",
      "There are two separate kinds of fakeness you need to learn to discount in order to understand what real work is. One is the kind Hardy encountered in school. Subjects get distorted when they're adapted to be taught to kids — often so distorted that they're nothing like the work done by actual practitioners.",
      "[3] The other kind of fakeness is intrinsic to certain types of work. Some types of work are inherently bogus, or at best mere busywork.There's a kind of solidity to real work. It's not all writing the Principia, but it all feels necessary.",
      "That's a vague criterion, but it's deliberately vague, because it has to cover a lot of different types. [4]Once you know the shape of real work, you have to learn how many hours a day to spend on it.",
      "You can't solve this problem by simply working every waking hour, because in many kinds of work there's a point beyond which the quality of the result will start to decline.That limit varies depending on the type of work and the person.",
      "I've done several different kinds of work, and the limits were different for each. My limit for the harder types of writing or programming is about five hours a day. Whereas when I was running a startup, I could work all the time.",
      "At least for the three years I did it; if I'd kept going much longer, I'd probably have needed to take occasional vacations. [5]The only way to find the limit is by crossing it. Cultivate a sensitivity to the quality of the work you're doing, and then you'll notice if it decreases because you're working too hard.",
      "Honesty is critical here, in both directions: you have to notice when you're being lazy, but also when you're working too hard. And if you think there's something admirable about working too hard, get that idea out of your head.",
      "You're not merely getting worse results, but getting them because you're showing off — if not to other people, then to yourself. [6]Finding the limit of working hard is a constant, ongoing process, not something you do just once.",
      "Both the difficulty of the work and your ability to do it can vary hour to hour, so you need to be constantly judging both how hard you're trying and how well you're doing.Trying hard doesn't mean constantly pushing yourself to work, though.",
      "There may be some people who do, but I think my experience is fairly typical, and I only have to push myself occasionally when I'm starting a project or when I encounter some sort of check. That's when I'm in danger of procrastinating.",
      "But once I get rolling, I tend to keep going.What keeps me going depends on the type of work. When I was working on Viaweb, I was driven by fear of failure. I barely procrastinated at all then, because there was always something that needed doing, and if I could put more distance between me and the pursuing beast by doing it, why wait?",
      "[7] Whereas what drives me now, writing essays, is the flaws in them. Between essays I fuss for a few days, like a dog circling while it decides exactly where to lie down. But once I get started on one, I don't have to push myself to work, because there's always some error or omission already pushing me.I do make some amount of effort to focus on important topics.",
      "Many problems have a hard core at the center, surrounded by easier stuff at the edges. Working hard means aiming toward the center to the extent you can. Some days you may not be able to; some days you'll only be able to work on the easier, peripheral stuff.",
      "But you should always be aiming as close to the center as you can without stalling.The bigger question of what to do with your life is one of these problems with a hard core. There are important problems at the center, which tend to be hard, and less important, easier ones at the edges.",
      "So as well as the small, daily adjustments involved in working on a specific problem, you'll occasionally have to make big, lifetime-scale adjustments about which type of work to do. And the rule is the same: working hard means aiming toward the center — toward the most ambitious problems.By center, though, I mean the actual center, not merely the current consensus about the center.",
      "The consensus about which problems are most important is often mistaken, both in general and within specific fields. If you disagree with it, and you're right, that could represent a valuable opportunity to do something new.The more ambitious types of work will usually be harder, but although you should not be in denial about this, neither should you treat difficulty as an infallible guide in deciding what to do.",
      "If you discover some ambitious type of work that's a bargain in the sense of being easier for you than other people, either because of the abilities you happen to have, or because of some new way you've found to approach it, or simply because you're more excited about it, by all means work on that.",
      "Some of the best work is done by people who find an easy way to do something hard.As well as learning the shape of real work, you need to figure out which kind you're suited for. And that doesn't just mean figuring out which kind your natural abilities match the best; it doesn't mean that if you're 7 feet tall, you have to play basketball.",
      "What you're suited for depends not just on your talents but perhaps even more on your interests. A deep interest in a topic makes people work harder than any amount of discipline can.It can be harder to discover your interests than your talents.",
      "There are fewer types of talent than interest, and they start to be judged early in childhood, whereas interest in a topic is a subtle thing that may not mature till your twenties, or even later. The topic may not even exist earlier.",
      "Plus there are some powerful sources of error you need to learn to discount. Are you really interested in x, or do you want to work on it because you'll make a lot of money, or because other people will be impressed with you, or because your parents want you to?",
      "[8]The difficulty of figuring out what to work on varies enormously from one person to another. That's one of the most important things I've learned about work since I was a kid. As a kid, you get the impression that everyone has a calling, and all they have to do is figure out what it is.",
      "That's how it works in movies, and in the streamlined biographies fed to kids. Sometimes it works that way in real life. Some people figure out what to do as children and just do it, like Mozart. But others, like Newton, turn restlessly from one kind of work to another.",
      "Maybe in retrospect we can identify one as their calling — we can wish Newton spent more time on math and physics and less on alchemy and theology — but this is an illusion induced by hindsight bias.",
      "There was no voice calling to him that he could have heard.So while some people's lives converge fast, there will be others whose lives never converge. And for these people, figuring out what to work on is not so much a prelude to working hard as an ongoing part of it, like one of a set of simultaneous equations.",
      "For these people, the process I described earlier has a third component: along with measuring both how hard you're working and how well you're doing, you have to think about whether you should keep working in this field or switch to another.",
      "If you're working hard but not getting good enough results, you should switch. It sounds simple expressed that way, but in practice it's very difficult. You shouldn't give up on the first day just because you work hard and don't get anywhere.",
      "You need to give yourself time to get going. But how much time? And what should you do if work that was going well stops going well? How much time do you give yourself then? [9]What even counts as good results?",
      "That can be really hard to decide. If you're exploring an area few others have worked in, you may not even know what good results look like. History is full of examples of people who misjudged the importance of what they were working on.The best test of whether it's worthwhile to work on something is whether you find it interesting.",
      "That may sound like a dangerously subjective measure, but it's probably the most accurate one you're going to get. You're the one working on the stuff. Who's in a better position than you to judge whether it's important, and what's a better predictor of its importance than whether it's interesting?For this test to work, though, you have to be honest with yourself.",
      "Indeed, that's the most striking thing about the whole question of working hard: how at each point it depends on being honest with yourself.Working hard is not just a dial you turn up to 11. It's a complicated, dynamic system that has to be tuned just right at each point.",
      "You have to understand the shape of real work, see clearly what kind you're best suited for, aim as close to the true core of it as you can, accurately judge at each moment both what you're capable of and how you're doing, and put in as many hours each day as you can without harming the quality of the result.",
      "This network is too complicated to trick. But if you're consistently honest and clear-sighted, it will automatically assume an optimal shape, and you'll be productive in a way few people are.Notes[1] In \"The Bus Ticket Theory of Genius\" I said the three ingredients in great work were natural ability, determination, and interest.",
      "That's the formula in the preceding stage; determination and interest yield practice and effort.[2] I mean this at a resolution of days, not hours. You'll often get somewhere while not working in the sense that the solution to a problem comes to you while taking a shower, or even in your sleep, but only because you were working hard on it the day before.It's good to go on vacation occasionally, but when I go on vacation, I like to learn new things.",
      "I wouldn't like just sitting on a beach.[3] The thing kids do in school that's most like the real version is sports. Admittedly because many sports originated as games played in schools. But in this one area, at least, kids are doing exactly what adults do.In the average American high school, you have a choice of pretending to do something serious, or seriously doing something pretend.",
      "Arguably the latter is no worse.[4] Knowing what you want to work on doesn't mean you'll be able to. Most people have to spend a lot of their time working on things they don't want to, especially early on.",
      "But if you know what you want to do, you at least know what direction to nudge your life in.[5] The lower time limits for intense work suggest a solution to the problem of having less time to work after you have kids: switch to harder problems.",
      "In effect I did that, though not deliberately.[6] Some cultures have a tradition of performative hard work. I don't love this idea, because (a) it makes a parody of something important and (b) it causes people to wear themselves out doing things that don't matter.",
      "I don't know enough to say for sure whether it's net good or bad, but my guess is bad.[7] One of the reasons people work so hard on startups is that startups can fail, and when they do, that failure tends to be both decisive and conspicuous.[8] It's ok to work on something to make a lot of money.",
      "You need to solve the money problem somehow, and there's nothing wrong with doing that efficiently by trying to make a lot at once. I suppose it would even be ok to be interested in money for its own sake; whatever floats your boat.",
      "Just so long as you're conscious of your motivations. The thing to avoid is unconsciously letting the need for money warp your ideas about what kind of work you find most interesting.[9] Many people face this question on a smaller scale with individual projects.",
      "But it's easier both to recognize and to accept a dead end in a single project than to abandon some type of work entirely. The more determined you are, the harder it gets. Like a Spanish Flu victim, you're fighting your own immune system: Instead of giving up, you tell yourself, I should just try harder.",
      "And who can say you're not right? Thanks to Trevor Blackwell, John Carmack, John Collison, Patrick Collison, Robert Morris, Geoff Ralston, and Harj Taggar for reading drafts of this.Arabic Translation"
    ],
    "word_count": 3270,
    "paragraph_count": 66
  },
  "processed_at": "2025-07-26T19:01:54.781207",
  "paragraphs": [
    {
      "original": "June 2021It might not seem there's much to learn about how to work hard. Anyone who's been to school knows what it entails, even if they chose not to do it. There are 12 year olds who work amazingly hard.",
      "translated": "2021年6月，可能看起来关于如何努力工作没有什么可以学的。任何上过学的人都知道这包含什么，即使他们选择不去做。有12岁的孩子工作得非常努力。"
    },
    {
      "original": "And yet when I ask if I know more about working hard now than when I was in school, the answer is definitely yes.One thing I know is that if you want to do great things, you'll have to work very hard.",
      "translated": "而且，当我问自己现在是否比在学校时更懂得努力工作，答案肯定是肯定的。我知道的一点是，如果你想成就伟大的事情，就必须非常努力地工作。"
    },
    {
      "original": "I wasn't sure of that as a kid. Schoolwork varied in difficulty; one didn't always have to work super hard to do well. And some of the things famous adults did, they seemed to do almost effortlessly.",
      "translated": "我小时候并不确定这一点。学校的功课难度不一；并不是每次都需要非常努力才能取得好成绩。而且，一些名人做的事情，看起来他们几乎是毫不费力就能做到。"
    },
    {
      "original": "Was there, perhaps, some way to evade hard work through sheer brilliance? Now I know the answer to that question. There isn't.The reason some subjects seemed easy was that my school had low standards.",
      "translated": "或许，有什么方法可以通过纯智力来逃避辛勤工作？现在我明白了这个问题的答案。没有这样的方法。有些科目显得容易，只是因为我的学校标准很低。"
    },
    {
      "original": "And the reason famous adults seemed to do things effortlessly was years of practice; they made it look easy.Of course, those famous adults usually had a lot of natural ability too. There are three ingredients in great work: natural ability, practice, and effort.",
      "translated": "著名的成年人之所以做事看起来毫不费力，是因为他们经过了多年的练习；他们让事情看起来很简单。当然，这些著名的成年人通常也拥有相当的天赋。伟大的工作包含三个要素：天赋、练习和努力。"
    },
    {
      "original": "You can do pretty well with just two, but to do the best work you need all three: you need great natural ability and to have practiced a lot and to be trying very hard. [1]Bill Gates, for example, was among the smartest people in business in his era, but he was also among the hardest working.",
      "translated": "你只要有两个条件就能做得相当不错，但要想做到最好，你需要全部三个条件：需要有出色的天赋，需要进行大量的练习，还需要非常努力。[1]例如，比尔·盖茨在他那个时代是商业界最聪明的人之一，但他也是最努力工作的人之一。"
    },
    {
      "original": "\"I never took a day off in my twenties,\" he said. \"Not one.\" It was similar with Lionel Messi. He had great natural ability, but when his youth coaches talk about him, what they remember is not his talent but his dedication and his desire to win.",
      "translated": "“我在二十多岁的时候从没请过一天假，”他说。“一天都没有。”莱昂内尔·梅西也是如此。他天赋异禀，但当他年轻时的教练们谈论起他时，他们记住的不是他的才华，而是他的敬业精神和对胜利的渴望。"
    },
    {
      "original": "P. G. Wodehouse would probably get my vote for best English writer of the 20th century, if I had to choose. Certainly no one ever made it look easier. But no one ever worked harder. At 74, he wrote with each new book of mine I have, as I say, the feeling that this time I have picked a lemon in the garden of literature.",
      "translated": "如果非要我选择的话，P. G. 韦德豪斯可能会获得我心中的20世纪最佳英国作家的票。确实，没有人能让写作看起来如此轻松。但也没有人比他更努力。74岁时，他每写一本新书，我都会有一种感觉，这次我在文学的花园里摘到了一颗柠檬。"
    },
    {
      "original": "A good thing, really, I suppose. Keeps one up on one's toes and makes one rewrite every sentence ten times. Or in many cases twenty times. Sounds a bit extreme, you think. And yet Bill Gates sounds even more extreme.",
      "translated": "这确实是一件好事，我想。它能让人保持警觉，让每一句话都要反复修改十次。或者在很多情况下，要改二十次。你可能会觉得这有点过分。然而，比尔·盖茨的说法听起来更加极端。"
    },
    {
      "original": "Not one day off in ten years? These two had about as much natural ability as anyone could have, and yet they also worked about as hard as anyone could work. You need both.That seems so obvious, and yet in practice we find it slightly hard to grasp.",
      "translated": "十年没有休息过一天？这两个人的天赋已经达到了极致，而且他们的努力程度也是常人难以企及的。你需要两者兼备。这看起来显而易见，但在实践中，我们却觉得有点难以理解。"
    },
    {
      "original": "There's a faint xor between talent and hard work. It comes partly from popular culture, where it seems to run very deep, and partly from the fact that the outliers are so rare. If great talent and great drive are both rare, then people with both are rare squared.",
      "translated": "才华和勤奋之间存在着一种淡淡的异或。这 partly 来自流行文化，其中这种观念似乎根深蒂固，partly 因为那些出类拔萃的人极为罕见。如果极高的才华和极强的驱动力都很少见，那么两者兼具的人就更是凤毛麟角了。"
    },
    {
      "original": "Most people you meet who have a lot of one will have less of the other. But you'll need both if you want to be an outlier yourself. And since you can't really change how much natural talent you have, in practice doing great work, insofar as you can, reduces to working very hard.It's straightforward to work hard if you have clearly defined, externally imposed goals, as you do in school.",
      "translated": "你遇到的大多数人，如果在某一方面拥有很多，那么在另一方面就会相对较少。但如果你想成为一个脱颖而出的人，就需要同时具备这两方面。由于你无法真正改变自己天生的才能有多少，所以在实际操作中，想要做出卓越的成就，在你力所能及的范围内，就归结为非常努力地工作。如果你有明确的、外部强加的目标，就像在学校里那样，努力工作就变得简单直接。"
    },
    {
      "original": "There is some technique to it: you have to learn not to lie to yourself, not to procrastinate (which is a form of lying to yourself), not to get distracted, and not to give up when things go wrong. But this level of discipline seems to be within the reach of quite young children, if they want it.What I've learned since I was a kid is how to work toward goals that are neither clearly defined nor externally imposed.",
      "translated": "这需要一些技巧：你必须学会不欺骗自己，不拖延（这其实也是一种自我欺骗），不被干扰，以及在事情出错时不放弃。但这种自律似乎即使是很小的孩子也能做到，只要他们愿意。自从我小时候起，我学到的是如何朝着那些既不明确又非外界强加的目标努力。"
    },
    {
      "original": "You'll probably have to learn both if you want to do really great things.The most basic level of which is simply to feel you should be working without anyone telling you to. Now, when I'm not working hard, alarm bells go off.",
      "translated": "如果你想做出真正伟大的事情，可能需要同时学习这两方面。最基本的一层就是，你应该有自觉地工作，而不需要别人催促。现在，当我工作不努力时，警报就会响起。"
    },
    {
      "original": "I can't be sure I'm getting anywhere when I'm working hard, but I can be sure I'm getting nowhere when I'm not, and it feels awful. [2]There wasn't a single point when I learned this. Like most little kids, I enjoyed the feeling of achievement when I learned or did something new.",
      "translated": "当我努力工作时，我不能确定自己是否有所进展，但当我无所作为时，我可以确定自己不会有任何进展，这种感觉糟透了。[2]我并不是在某个特定的时刻学到这一点的。像大多数小孩一样，我在学习或做新事物时享受成就感。"
    },
    {
      "original": "As I grew older, this morphed into a feeling of disgust when I wasn't achieving anything. The one precisely dateable landmark I have is when I stopped watching TV, at age 13.Several people I've talked to remember getting serious about work around this age.",
      "translated": "随着年龄的增长，这种感觉演变成了在我无所作为时的厌恶。我有一个确切可追溯的标志性事件，那就是我13岁时停止看电视。我与一些人交谈过，他们记得自己也是在这个年纪左右开始认真对待工作的。"
    },
    {
      "original": "When I asked Patrick Collison when he started to find idleness distasteful, he said I think around age 13 or 14. I have a clear memory from around then of sitting in the sitting room, staring outside, and wondering why I was wasting my summer holiday.",
      "translated": "当我问帕特里克·柯里森是什么时候开始觉得无所事事令人不快时，他说，大概是在13或14岁左右。我清楚地记得，大约在那时候，我坐在客厅里，望着窗外，心想为什么我要虚度我的暑假。"
    },
    {
      "original": "Perhaps something changes at adolescence. That would make sense.Strangely enough, the biggest obstacle to getting serious about work was probably school, which made work (what they called work) seem boring and pointless.",
      "translated": "也许在青春期会发生一些变化。这合乎情理。奇怪的是，对待工作认真起来的最大障碍可能是学校，学校使工作（他们称之为工作）显得枯燥无味且毫无意义。"
    },
    {
      "original": "I had to learn what real work was before I could wholeheartedly desire to do it. That took a while, because even in college a lot of the work is pointless; there are entire departments that are pointless.",
      "translated": "我必须先了解什么是真正的工作，才能全心全意地想要去完成它。这花了一些时间，因为即使在大学里，很多工作也是没有意义的；有些整个系都是没有意义的。"
    },
    {
      "original": "But as I learned the shape of real work, I found that my desire to do it slotted into it as if they'd been made for each other.I suspect most people have to learn what work is before they can love it.",
      "translated": "但当我逐渐了解了实际工作的形态时，我发现自己的工作热情仿佛是为这工作量身定做的。我猜大多数人只有先了解了工作的真谛，才能真正爱上它。"
    },
    {
      "original": "Hardy wrote eloquently about this in A Mathematician's Apology: I do not remember having felt, as a boy, any passion for mathematics, and such notions as I may have had of the career of a mathematician were far from noble.",
      "translated": "哈代在《一个数学家的辩白》中对此作了生动的描述：我不记得自己小时候对数学有什么激情，而我对数学家这一职业的概念也远非高尚。"
    },
    {
      "original": "I thought of mathematics in terms of examinations and scholarships: I wanted to beat other boys, and this seemed to be the way in which I could do so most decisively. He didn't learn what math was really about till part way through college, when he read Jordan's Cours d'analyse.",
      "translated": "我将数学视为考试和奖学金：我想胜过其他男生，而这也似乎是我能够最果断地做到的一点。直到大学中途读了乔丹的《分析教程》后，他才真正理解数学的内涵。"
    },
    {
      "original": "I shall never forget the astonishment with which I read that remarkable work, the first inspiration for so many mathematicians of my generation, and learnt for the first time as I read it what mathematics really meant.",
      "translated": "我永远忘不了阅读那部非凡著作时的惊讶之情，这部作品激发了我们这一代许多数学家的初次灵感，正是在阅读它的过程中，我第一次真正理解了数学的含义。"
    },
    {
      "original": "There are two separate kinds of fakeness you need to learn to discount in order to understand what real work is. One is the kind Hardy encountered in school. Subjects get distorted when they're adapted to be taught to kids — often so distorted that they're nothing like the work done by actual practitioners.",
      "translated": "为了理解什么是真正的工作，你需要学会辨别两种不同的虚假性。一种是哈代在学校遇到的那种。当学科被改编成适合教授给孩子们时，它们会变得失真——往往失真到与实际从业者所做的工作完全不同。"
    },
    {
      "original": "[3] The other kind of fakeness is intrinsic to certain types of work. Some types of work are inherently bogus, or at best mere busywork.There's a kind of solidity to real work. It's not all writing the Principia, but it all feels necessary.",
      "translated": "另一种虚假性是某些类型工作的固有属性。有些工作本质上就是虚假的，或者充其量只是徒劳无功的忙碌。真正的工作有一种实在感。虽然并不是所有的工作都像撰写《自然哲学的数学原理》那样，但所有的工作都让人觉得是必要的。"
    },
    {
      "original": "That's a vague criterion, but it's deliberately vague, because it has to cover a lot of different types. [4]Once you know the shape of real work, you have to learn how many hours a day to spend on it.",
      "translated": "这是一个模糊的标准，但它是故意模糊的，因为必须涵盖许多不同的类型。[4]一旦你知道了实际工作的形态，你就必须学会每天应该投入多少时间在上面。"
    },
    {
      "original": "You can't solve this problem by simply working every waking hour, because in many kinds of work there's a point beyond which the quality of the result will start to decline.That limit varies depending on the type of work and the person.",
      "translated": "你不能仅仅通过每天醒着的每一刻都工作来解决这个问题，因为在许多类型的工作中，存在一个超越了这个点之后，工作成果的质量将会开始下降。这个极限因工作类型和个人而异。"
    },
    {
      "original": "I've done several different kinds of work, and the limits were different for each. My limit for the harder types of writing or programming is about five hours a day. Whereas when I was running a startup, I could work all the time.",
      "translated": "我做过几种不同类型的工作，每种工作的极限都不相同。对于比较困难的写作或编程，我每天的极限大约是五个小时。而当我经营一家初创公司时，我可以一直工作。"
    },
    {
      "original": "At least for the three years I did it; if I'd kept going much longer, I'd probably have needed to take occasional vacations. [5]The only way to find the limit is by crossing it. Cultivate a sensitivity to the quality of the work you're doing, and then you'll notice if it decreases because you're working too hard.",
      "translated": "至少在我做的这三年里是这样；如果我继续做更长时间，我可能就需要偶尔休个假了。[5]找到极限的唯一方法就是超越它。培养对工作质量的敏感度，这样你就能注意到如果工作太辛苦，质量就会下降。"
    },
    {
      "original": "Honesty is critical here, in both directions: you have to notice when you're being lazy, but also when you're working too hard. And if you think there's something admirable about working too hard, get that idea out of your head.",
      "translated": "诚实在这里至关重要，双向都是如此：你必须注意到自己何时偷懒，也要意识到自己何时过度工作。如果你认为过度工作有什么值得称赞的地方，那请你改掉这种想法。"
    },
    {
      "original": "You're not merely getting worse results, but getting them because you're showing off — if not to other people, then to yourself. [6]Finding the limit of working hard is a constant, ongoing process, not something you do just once.",
      "translated": "你不仅得到了更差的结果，而且这些结果是因为你在炫耀——即使不是向别人，也是向自己。[6]找到努力工作的极限是一个持续不断的过程，而不是一次性的行为。"
    },
    {
      "original": "Both the difficulty of the work and your ability to do it can vary hour to hour, so you need to be constantly judging both how hard you're trying and how well you're doing.Trying hard doesn't mean constantly pushing yourself to work, though.",
      "translated": "工作的难度和你完成工作的能力都会随着时间的推移而变化，因此你需要不断评估自己付出的努力和取得的效果。然而，努力并不意味着要不断逼迫自己工作。"
    },
    {
      "original": "There may be some people who do, but I think my experience is fairly typical, and I only have to push myself occasionally when I'm starting a project or when I encounter some sort of check. That's when I'm in danger of procrastinating.",
      "translated": "可能有些人不是这样，但我觉得我的经历还算典型，只有在开始一个项目或遇到某种阻碍时，我才需要偶尔激励一下自己。这时候，我容易拖延。"
    },
    {
      "original": "But once I get rolling, I tend to keep going.What keeps me going depends on the type of work. When I was working on Viaweb, I was driven by fear of failure. I barely procrastinated at all then, because there was always something that needed doing, and if I could put more distance between me and the pursuing beast by doing it, why wait?",
      "translated": "但是一旦我开始行动，我就会持续下去。能否持续下去取决于工作的类型。当我在Viaweb工作时，是失败的恐惧在推动我。那时我几乎没有拖延，因为总有一些事情需要去做，如果通过做这些事情可以让我与追逐的野兽之间拉开更大的距离，为什么还要等待呢？"
    },
    {
      "original": "[7] Whereas what drives me now, writing essays, is the flaws in them. Between essays I fuss for a few days, like a dog circling while it decides exactly where to lie down. But once I get started on one, I don't have to push myself to work, because there's always some error or omission already pushing me.I do make some amount of effort to focus on important topics.",
      "translated": "[7] 而现在驱使我写文章的，是文章中的缺陷。在写作之间的日子里，我会像一只狗在决定确切的躺下位置时那样，焦虑几天。但一旦开始写，我就无需逼迫自己去工作，因为总有一些错误或遗漏在推动我。我确实会努力关注重要的主题。"
    },
    {
      "original": "Many problems have a hard core at the center, surrounded by easier stuff at the edges. Working hard means aiming toward the center to the extent you can. Some days you may not be able to; some days you'll only be able to work on the easier, peripheral stuff.",
      "translated": "许多问题的核心都很难，而边缘部分则相对容易。努力工作意味着在能力所及的范围内尽量向核心进发。有些日子你可能做不到；有些日子你只能处理那些比较简单、边缘的工作。"
    },
    {
      "original": "But you should always be aiming as close to the center as you can without stalling.The bigger question of what to do with your life is one of these problems with a hard core. There are important problems at the center, which tend to be hard, and less important, easier ones at the edges.",
      "translated": "但你应该尽可能接近中心，同时避免停滞。生活目标这个更大的问题是一个核心难题。核心的问题往往重要且困难，而边缘的问题则相对次要且容易解决。"
    },
    {
      "original": "So as well as the small, daily adjustments involved in working on a specific problem, you'll occasionally have to make big, lifetime-scale adjustments about which type of work to do. And the rule is the same: working hard means aiming toward the center — toward the most ambitious problems.By center, though, I mean the actual center, not merely the current consensus about the center.",
      "translated": "因此，除了在解决具体问题时所需的小的、日常的调整外，你偶尔还需要做出大的、关乎一生的调整，以决定从事哪类工作。而规则是相同的：努力工作意味着朝着中心目标前进——即最雄心勃勃的问题。但这里所说的中心，是指真正的中心，而不仅仅是当前对中心的共识。"
    },
    {
      "original": "The consensus about which problems are most important is often mistaken, both in general and within specific fields. If you disagree with it, and you're right, that could represent a valuable opportunity to do something new.The more ambitious types of work will usually be harder, but although you should not be in denial about this, neither should you treat difficulty as an infallible guide in deciding what to do.",
      "translated": "关于哪些问题最重要，人们普遍存在的共识往往是有误的，无论是在一般情况下还是在特定领域内。如果你对此持有异议，并且你是对的，这可能代表了一个有价值的机遇，去做一些新的事情。更具雄心的工作通常会更加困难，虽然你不应对这一点视而不见，但也不应将困难视为决定行动方向的绝对指南。"
    },
    {
      "original": "If you discover some ambitious type of work that's a bargain in the sense of being easier for you than other people, either because of the abilities you happen to have, or because of some new way you've found to approach it, or simply because you're more excited about it, by all means work on that.",
      "translated": "如果你发现某种雄心勃勃的工作对你来说是个便宜货，也就是说，由于你所拥有的能力，或者因为你找到了一种新的处理方法，或者仅仅是因为你对它更感兴趣，那么请务必致力于这项工作。"
    },
    {
      "original": "Some of the best work is done by people who find an easy way to do something hard.As well as learning the shape of real work, you need to figure out which kind you're suited for. And that doesn't just mean figuring out which kind your natural abilities match the best; it doesn't mean that if you're 7 feet tall, you have to play basketball.",
      "translated": "最好的工作往往是由那些找到简单方法来解决难题的人完成的。除了了解实际工作的形态，你还需要弄清楚自己适合哪种类型的工作。这不仅仅意味着要找出最符合你天生能力的工作类型；并不是说如果你身高七英尺，就必须打篮球。"
    },
    {
      "original": "What you're suited for depends not just on your talents but perhaps even more on your interests. A deep interest in a topic makes people work harder than any amount of discipline can.It can be harder to discover your interests than your talents.",
      "translated": "你适合什么不仅取决于你的才能，也许更取决于你的兴趣。对某个主题的深厚兴趣能让人比任何程度的自律都更加努力工作。发现自己的兴趣可能比发现才能更加困难。"
    },
    {
      "original": "There are fewer types of talent than interest, and they start to be judged early in childhood, whereas interest in a topic is a subtle thing that may not mature till your twenties, or even later. The topic may not even exist earlier.",
      "translated": "人才的种类比兴趣少，而且往往在童年早期就开始被评判，而对某个主题的兴趣则是一种微妙的事情，可能要到二十多岁，甚至更晚才会成熟。这个主题在此之前可能甚至都不存在。"
    },
    {
      "original": "Plus there are some powerful sources of error you need to learn to discount. Are you really interested in x, or do you want to work on it because you'll make a lot of money, or because other people will be impressed with you, or because your parents want you to?",
      "translated": "还有一些强大的错误来源你需要学会忽略。你真正对x感兴趣吗，还是因为你想要赚很多钱，或者希望别人对你印象深刻，或者因为你的父母希望你这样做？"
    },
    {
      "original": "[8]The difficulty of figuring out what to work on varies enormously from one person to another. That's one of the most important things I've learned about work since I was a kid. As a kid, you get the impression that everyone has a calling, and all they have to do is figure out what it is.",
      "translated": "[8]确定要从事的工作的难度因人而异。这是我从小到大在工作中学到的最重要的事情之一。小时候，你可能会觉得每个人都有自己的天职，他们只需要弄清楚是什么。"
    },
    {
      "original": "That's how it works in movies, and in the streamlined biographies fed to kids. Sometimes it works that way in real life. Some people figure out what to do as children and just do it, like Mozart. But others, like Newton, turn restlessly from one kind of work to another.",
      "translated": "这在电影中是这样呈现的，在提供给孩子们的简化的传记中也是如此。有时现实生活中也确实如此。有些人像莫扎特一样，从小就知道自己要做什么，并且一直坚持下去。但另一些人，比如牛顿，则不安地从一种工作转向另一种工作。"
    },
    {
      "original": "Maybe in retrospect we can identify one as their calling — we can wish Newton spent more time on math and physics and less on alchemy and theology — but this is an illusion induced by hindsight bias.",
      "translated": "也许事后我们能认定某一项是他们的天职——我们可以希望牛顿多花些时间在数学和物理学上，而少花在炼金术和神学上——但这是由于后见之明偏差造成的错觉。"
    },
    {
      "original": "There was no voice calling to him that he could have heard.So while some people's lives converge fast, there will be others whose lives never converge. And for these people, figuring out what to work on is not so much a prelude to working hard as an ongoing part of it, like one of a set of simultaneous equations.",
      "translated": "没有声音在呼唤他，即使有他也听不见。所以，有些人的生活很快就会交汇，而另一些人的生活却永远不会交汇。对于这些人来说，确定该做什么并不是努力工作的前奏，而是努力工作的一部分，就像是一组同时进行的方程中的一部分。"
    },
    {
      "original": "For these people, the process I described earlier has a third component: along with measuring both how hard you're working and how well you're doing, you have to think about whether you should keep working in this field or switch to another.",
      "translated": "对于这些人来说，我之前描述的过程还有一个第三个组成部分：除了衡量你工作的努力程度和表现好坏之外，你还必须考虑是否应该继续在这个领域工作，或者转行到其他领域。"
    },
    {
      "original": "If you're working hard but not getting good enough results, you should switch. It sounds simple expressed that way, but in practice it's very difficult. You shouldn't give up on the first day just because you work hard and don't get anywhere.",
      "translated": "如果你努力工作但没有得到足够好的结果，就应该做出改变。这样说起来很简单，但在实际操作中却非常困难。你不应该因为努力工作却毫无进展就在第一天就放弃。"
    },
    {
      "original": "You need to give yourself time to get going. But how much time? And what should you do if work that was going well stops going well? How much time do you give yourself then? [9]What even counts as good results?",
      "translated": "你需要给自己时间来进入状态。但需要多少时间呢？如果之前进展顺利的工作突然不顺了，你应该怎么办？那时你又该给自己多少时间？什么才能算作是好的结果？"
    },
    {
      "original": "That can be really hard to decide. If you're exploring an area few others have worked in, you may not even know what good results look like. History is full of examples of people who misjudged the importance of what they were working on.The best test of whether it's worthwhile to work on something is whether you find it interesting.",
      "translated": "这确实很难决定。如果你正在探索一个少有人涉足的领域，你甚至可能不知道好的成果是什么样的。历史上充满了人们误判自己工作重要性的例子。判断某项工作是否值得投入的最好标准是，你是否对其感兴趣。"
    },
    {
      "original": "That may sound like a dangerously subjective measure, but it's probably the most accurate one you're going to get. You're the one working on the stuff. Who's in a better position than you to judge whether it's important, and what's a better predictor of its importance than whether it's interesting?For this test to work, though, you have to be honest with yourself.",
      "translated": "这听起来可能是一个危险的主观标准，但可能是你能得到的最准确的标准。你是在做这些工作的人。谁比你更适合判断这些工作是否重要，还有什么比它是否有趣更能预测其重要性呢？不过，要让这个测试有效，你必须对自己诚实。"
    },
    {
      "original": "Indeed, that's the most striking thing about the whole question of working hard: how at each point it depends on being honest with yourself.Working hard is not just a dial you turn up to 11. It's a complicated, dynamic system that has to be tuned just right at each point.",
      "translated": "确实，关于努力工作这个问题，最引人注目的就是它在每个阶段都依赖于对自己诚实。努力工作不仅仅是将强度调到11那么简单。它是一个复杂且动态的系统，每个环节都需要恰到好处地调整。"
    },
    {
      "original": "You have to understand the shape of real work, see clearly what kind you're best suited for, aim as close to the true core of it as you can, accurately judge at each moment both what you're capable of and how you're doing, and put in as many hours each day as you can without harming the quality of the result.",
      "translated": "你必须了解实际工作的形态，清晰地认识到自己最适合哪种类型的工作，尽可能接近其核心去追求，准确判断在每个时刻自己能做什么以及做得如何，并且每天投入尽可能多的时间，同时不损害结果的质量。"
    },
    {
      "original": "This network is too complicated to trick. But if you're consistently honest and clear-sighted, it will automatically assume an optimal shape, and you'll be productive in a way few people are.Notes[1] In \"The Bus Ticket Theory of Genius\" I said the three ingredients in great work were natural ability, determination, and interest.",
      "translated": "这个网络太复杂，难以愚弄。但如果你始终诚实且眼光敏锐，它将自动形成最优的结构，你将以少数人能达到的方式变得高效。注[1] 在《天才的车票理论》中，我说过伟大工作的三个要素是天赋、决心和兴趣。"
    },
    {
      "original": "That's the formula in the preceding stage; determination and interest yield practice and effort.[2] I mean this at a resolution of days, not hours. You'll often get somewhere while not working in the sense that the solution to a problem comes to you while taking a shower, or even in your sleep, but only because you were working hard on it the day before.It's good to go on vacation occasionally, but when I go on vacation, I like to learn new things.",
      "translated": "那是前一个阶段的公式；决心和兴趣产生实践和努力。[2] 我指的是以天为单位，而不是以小时为单位。你常常会在不工作的时候有所进展，比如在洗澡时，甚至在睡眠中，想到问题的解决方法，但这只是因为你前一天努力工作过。偶尔休假是好事，但我休假时喜欢学习新东西。"
    },
    {
      "original": "I wouldn't like just sitting on a beach.[3] The thing kids do in school that's most like the real version is sports. Admittedly because many sports originated as games played in schools. But in this one area, at least, kids are doing exactly what adults do.In the average American high school, you have a choice of pretending to do something serious, or seriously doing something pretend.",
      "translated": "我不喜欢只是坐在海滩上。孩子们在学校里做的最接近现实版的事情是体育。诚然，许多体育项目起源于学校里的游戏。但在这一领域，至少孩子们做的事情和成年人是一样的。在美国的普通高中，你可以选择假装做些严肃的事情，或者认真地做一些假装的事情。"
    },
    {
      "original": "Arguably the latter is no worse.[4] Knowing what you want to work on doesn't mean you'll be able to. Most people have to spend a lot of their time working on things they don't want to, especially early on.",
      "translated": "可以说后者并不更糟。知道自己想做什么并不意味着你就能做到。大多数人都必须花大量的时间去做他们不想做的事情，尤其是在早期。"
    },
    {
      "original": "But if you know what you want to do, you at least know what direction to nudge your life in.[5] The lower time limits for intense work suggest a solution to the problem of having less time to work after you have kids: switch to harder problems.",
      "translated": "但如果你知道自己想做什么，至少你就会知道该朝着哪个方向引导自己的人生。[5] 对于高强度工作时间的下限建议，为了解决有了孩子之后工作时间减少的问题，可以转向更难的问题。"
    },
    {
      "original": "In effect I did that, though not deliberately.[6] Some cultures have a tradition of performative hard work. I don't love this idea, because (a) it makes a parody of something important and (b) it causes people to wear themselves out doing things that don't matter.",
      "translated": "实际上我确实那样做了，尽管不是有意为之。[6] 有些文化中存在着表演式的辛勤工作的传统。我不喜欢这个观念，因为（a）它将重要的事情变成了讽刺的对象，（b）它导致人们为了无关紧要的事情而耗尽自己。"
    },
    {
      "original": "I don't know enough to say for sure whether it's net good or bad, but my guess is bad.[7] One of the reasons people work so hard on startups is that startups can fail, and when they do, that failure tends to be both decisive and conspicuous.[8] It's ok to work on something to make a lot of money.",
      "translated": "我不知道是否有足够的信息来确定这究竟是好事还是坏事，但我的猜测是坏事。[7] 人们如此努力地投身于创业的一个原因是，创业可能会失败，而一旦失败，这种失败往往是既明确又显而易见的。[8] 追求财富本身并没有错。"
    },
    {
      "original": "You need to solve the money problem somehow, and there's nothing wrong with doing that efficiently by trying to make a lot at once. I suppose it would even be ok to be interested in money for its own sake; whatever floats your boat.",
      "translated": "你需要 somehow 解决资金问题，通过一次性赚一大笔来高效解决问题也并无不妥。我想，即使单纯对金钱本身感兴趣也未尝不可；反正各有所好。"
    },
    {
      "original": "Just so long as you're conscious of your motivations. The thing to avoid is unconsciously letting the need for money warp your ideas about what kind of work you find most interesting.[9] Many people face this question on a smaller scale with individual projects.",
      "translated": "只要你意识到自己的动机。要避免的是无意识地让金钱需求扭曲你对最感兴趣的工作类型的看法。许多人在这个问题上以较小的规模面对个别项目。"
    },
    {
      "original": "But it's easier both to recognize and to accept a dead end in a single project than to abandon some type of work entirely. The more determined you are, the harder it gets. Like a Spanish Flu victim, you're fighting your own immune system: Instead of giving up, you tell yourself, I should just try harder.",
      "translated": "但是，承认并接受单个项目走入死胡同，要比彻底放弃某种类型的工作容易得多。你越坚定，事情就越难。就像西班牙流感患者一样，你是在与自己的免疫系统作斗争：你不是选择放弃，而是告诉自己，我只是应该更加努力。"
    },
    {
      "original": "And who can say you're not right? Thanks to Trevor Blackwell, John Carmack, John Collison, Patrick Collison, Robert Morris, Geoff Ralston, and Harj Taggar for reading drafts of this.Arabic Translation",
      "translated": "谁又能说你不对呢？感谢 Trevor Blackwell、John Carmack、John Collison、Patrick Collison、Robert Morris、Geoff Ralston 和 Harj Taggar 阅读本文的草稿。阿拉伯语翻译"
    }
  ],
  "translation_completed": "2025-07-28T22:57:09.930620",
  "translation_stats": {
    "total_paragraphs": 66,
    "success_count": 66,
    "success_rate": "100.0%"
  }
}