{
  "title": "How to Present to Investors",
  "title_zh": "[待翻译] How to Present to Investors",
  "url": "https://www.paulgraham.com/investors.html",
  "filename": "investors.html",
  "date": "2006-08-01",
  "id": 188,
  "content": {
    "success": true,
    "paragraphs": [
      "Want to start a startup? Get funded by Y Combinator. August 2006, rev. April 2007, September 2010In a few days it will be Demo Day, when the startups we funded this summer present to investors. Y Combinator funds startups twice a year, in January and June.",
      "Ten weeks later we invite all the investors we know to hear them present what they've built so far.Ten weeks is not much time. The average startup probably doesn't have much to show for itself after ten weeks.",
      "But the average startup fails. When you look at the ones that went on to do great things, you find a lot that began with someone pounding out a prototype in a week or two of nonstop work. Startups are a counterexample to the rule that haste makes waste.(Too much money seems to be as bad for startups as too much time, so we don't give them much money either.)A week before Demo Day, we have a dress rehearsal called Rehearsal Day.",
      "At other Y Combinator events we allow outside guests, but not at Rehearsal Day. No one except the other founders gets to see the rehearsals.The presentations on Rehearsal Day are often pretty rough. But this is to be expected.",
      "We try to pick founders who are good at building things, not ones who are slick presenters. Some of the founders are just out of college, or even still in it, and have never spoken to a group of people they didn't already know.So we concentrate on the basics.",
      "On Demo Day each startup will only get ten minutes, so we encourage them to focus on just two goals: (a) explain what you're doing, and (b) explain why users will want it.That might sound easy, but it's not when the speakers have no experience presenting, and they're explaining technical matters to an audience that's mostly non-technical.This situation is constantly repeated when startups present to investors: people who are bad at explaining, talking to people who are bad at understanding.",
      "Practically every successful startup, including stars like Google, presented at some point to investors who didn't get it and turned them down. Was it because the founders were bad at presenting, or because the investors were obtuse?",
      "It's probably always some of both.At the most recent Rehearsal Day, we four Y Combinator partners found ourselves saying a lot of the same things we said at the last two. So at dinner afterward we collected all our tips about presenting to investors.",
      "Most startups face similar challenges, so we hope these will be useful to a wider audience. 1. Explain what you're doing.Investors' main question when judging a very early startup is whether you've made a compelling product.",
      "Before they can judge whether you've built a good x, they have to understand what kind of x you've built. They will get very frustrated if instead of telling them what you do, you make them sit through some kind of preamble.Say what you're doing as soon as possible, preferably in the first sentence.",
      "\"We're Jeff and Bob and we've built an easy to use web-based database. Now we'll show it to you and explain why people need this.\"If you're a great public speaker you may be able to violate this rule.",
      "Last year one founder spent the whole first half of his talk on a fascinating analysis of the limits of the conventional desktop metaphor. He got away with it, but unless you're a captivating speaker, which most hackers aren't, it's better to play it safe.2.",
      "Get rapidly to demo.This section is now obsolete for YC founders presenting at Demo Day, because Demo Day presentations are now so short that they rarely include much if any demo. They seem to work just as well without, however, which makes me think I was wrong to emphasize demos so much before.A demo explains what you've made more effectively than any verbal description.",
      "The only thing worth talking about first is the problem you're trying to solve and why it's important. But don't spend more than a tenth of your time on that. Then demo.When you demo, don't run through a catalog of features.",
      "Instead start with the problem you're solving, and then show how your product solves it. Show features in an order driven by some kind of purpose, rather than the order in which they happen to appear on the screen.If you're demoing something web-based, assume that the network connection will mysteriously die 30 seconds into your presentation, and come prepared with a copy of the server software running on your laptop.3.",
      "Better a narrow description than a vague one.One reason founders resist describing their projects concisely is that, at this early stage, there are all kinds of possibilities. The most concise descriptions seem misleadingly narrow.",
      "So for example a group that has built an easy web-based database might resist calling their applicaton that, because it could be so much more. In fact, it could be anything...The problem is, as you approach (in the calculus sense) a description of something that could be anything, the content of your description approaches zero.",
      "If you describe your web-based database as \"a system to allow people to collaboratively leverage the value of information,\" it will go in one investor ear and out the other. They'll just discard that sentence as meaningless boilerplate, and hope, with increasing impatience, that in the next sentence you'll actually explain what you've made.Your primary goal is not to describe everything your system might one day become, but simply to convince investors you're worth talking to further.",
      "So approach this like an algorithm that gets the right answer by successive approximations. Begin with a description that's gripping but perhaps overly narrow, then flesh it out to the extent you can.",
      "It's the same principle as incremental development: start with a simple prototype, then add features, but at every point have working code. In this case, \"working code\" means a working description in the investor's head.4.",
      "Don't talk and drive.Have one person talk while another uses the computer. If the same person does both, they'll inevitably mumble downwards at the computer screen instead of talking clearly at the audience.As long as you're standing near the audience and looking at them, politeness (and habit) compel them to pay attention to you.",
      "Once you stop looking at them to fuss with something on your computer, their minds drift off to the errands they have to run later.5. Don't talk about secondary matters at length.If you only have a few minutes, spend them explaining what your product does and why it's great.",
      "Second order issues like competitors or resumes should be single slides you go through quickly at the end. If you have impressive resumes, just flash them on the screen for 15 seconds and say a few words.",
      "For competitors, list the top 3 and explain in one sentence each what they lack that you have. And put this kind of thing at the end, after you've made it clear what you've built.6. Don't get too deeply into business models.It's good to talk about how you plan to make money, but mainly because it shows you care about that and have thought about it.",
      "Don't go into detail about your business model, because (a) that's not what smart investors care about in a brief presentation, and (b) any business model you have at this point is probably wrong anyway.Recently a VC who came to speak at Y Combinator talked about a company he just invested in.",
      "He said their business model was wrong and would probably change three times before they got it right. The founders were experienced guys who'd done startups before and who'd just succeeded in getting millions from one of the top VC firms, and even their business model was crap.",
      "(And yet he invested anyway, because he expected it to be crap at this stage.)If you're solving an important problem, you're going to sound a lot smarter talking about that than the business model. The business model is just a bunch of guesses, and guesses about stuff that's probably not your area of expertise.",
      "So don't spend your precious few minutes talking about crap when you could be talking about solid, interesting things you know a lot about: the problem you're solving and what you've built so far.As well as being a bad use of time, if your business model seems spectacularly wrong, that will push the stuff you want investors to remember out of their heads.",
      "They'll just remember you as the company with the boneheaded plan for making money, rather than the company that solved that important problem.7. Talk slowly and clearly at the audience.Everyone at Rehearsal Day could see the difference between the people who'd been out in the world for a while and had presented to groups, and those who hadn't.You need to use a completely different voice and manner talking to a roomful of people than you would in conversation.",
      "Everyday life gives you no practice in this. If you can't already do it, the best solution is to treat it as a consciously artificial trick, like juggling.However, that doesn't mean you should talk like some kind of announcer.",
      "Audiences tune that out. What you need to do is talk in this artificial way, and yet make it seem conversational. (Writing is the same. Good writing is an elaborate effort to seem spontaneous.)If you want to write out your whole presentation beforehand and memorize it, that's ok.",
      "That has worked for some groups in the past. But make sure to write something that sounds like spontaneous, informal speech, and deliver it that way too.Err on the side of speaking slowly. At Rehearsal Day, one of the founders mentioned a rule actors use: if you feel you're speaking too slowly, you're speaking at about the right speed.8.",
      "Have one person talk.Startups often want to show that all the founders are equal partners. This is a good instinct; investors dislike unbalanced teams. But trying to show it by partitioning the presentation is going too far.",
      "It's distracting. You can demonstrate your respect for one another in more subtle ways. For example, when one of the groups presented at Demo Day, the more extroverted of the two founders did most of the talking, but he described his co-founder as the best hacker he'd ever met, and you could tell he meant it.Pick the one or at most two best speakers, and have them do most of the talking.Exception: If one of the founders is an expert in some specific technical field, it can be good for them to talk about that for a minute or so.",
      "This kind of \"expert witness\" can add credibility, even if the audience doesn't understand all the details. If Jobs and Wozniak had 10 minutes to present the Apple II, it might be a good plan to have Jobs speak for 9 minutes and have Woz speak for a minute in the middle about some of the technical feats he'd pulled off in the design.",
      "(Though of course if it were actually those two, Jobs would speak for the entire 10 minutes.)9. Seem confident.Between the brief time available and their lack of technical background, many in the audience will have a hard time evaluating what you're doing.",
      "Probably the single biggest piece of evidence, initially, will be your own confidence in it. You have to show you're impressed with what you've made.And I mean show, not tell. Never say \"we're passionate\" or \"our product is great.\" People just ignore that—or worse, write you off as bullshitters.",
      "Such messages must be implicit.What you must not do is seem nervous and apologetic. If you've truly made something good, you're doing investors a favor by telling them about it. If you don't genuinely believe that, perhaps you ought to change what your company is doing.",
      "If you don't believe your startup has such promise that you'd be doing them a favor by letting them invest, why are you investing your time in it?10. Don't try to seem more than you are.Don't worry if your company is just a few months old and doesn't have an office yet, or your founders are technical people with no business experience.",
      "Google was like that once, and they turned out ok. Smart investors can see past such superficial flaws. They're not looking for finished, smooth presentations. They're looking for raw talent. All you need to convince them of is that you're smart and that you're onto something good.",
      "If you try too hard to conceal your rawness—by trying to seem corporate, or pretending to know about stuff you don't—you may just conceal your talent.You can afford to be candid about what you haven't figured out yet.",
      "Don't go out of your way to bring it up (e.g. by having a slide about what might go wrong), but don't try to pretend either that you're further along than you are. If you're a hacker and you're presenting to experienced investors, they're probably better at detecting bullshit than you are at producing it.11.",
      "Don't put too many words on slides.When there are a lot of words on a slide, people just skip reading it. So look at your slides and ask of each word \"could I cross this out?\" This includes gratuitous clip art.",
      "Try to get your slides under 20 words if you can.Don't read your slides. They should be something in the background as you face the audience and talk to them, not something you face and read to an audience sitting behind you.Cluttered sites don't do well in demos, especially when they're projected onto a screen.",
      "At the very least, crank up the font size big enough to make all the text legible. But cluttered sites are bad anyway, so perhaps you should use this opportunity to make your design simpler.12. Specific numbers are good.If you have any kind of data, however preliminary, tell the audience.",
      "Numbers stick in people's heads. If you can claim that the median visitor generates 12 page views, that's great.But don't give them more than four or five numbers, and only give them numbers specific to you.",
      "You don't need to tell them the size of the market you're in. Who cares, really, if it's 500 million or 5 billion a year? Talking about that is like an actor at the beginning of his career telling his parents how much Tom Hanks makes.",
      "Yeah, sure, but first you have to become Tom Hanks. The important part is not whether he makes ten million a year or a hundred, but how you get there.13. Tell stories about users.The biggest fear of investors looking at early stage startups is that you've built something based on your own a priori theories of what the world needs, but that no one will actually want.",
      "So it's good if you can talk about problems specific users have and how you solve them.Greg Mcadoo said one thing Sequoia looks for is the \"proxy for demand.\" What are people doing now, using inadequate tools, that shows they need what you're making?Another sign of user need is when people pay a lot for something.",
      "It's easy to convince investors there will be demand for a cheaper alternative to something popular, if you preserve the qualities that made it popular.The best stories about user needs are about your own.",
      "A remarkable number of famous startups grew out of some need the founders had: Apple, Microsoft, Yahoo, Google. Experienced investors know that, so stories of this type will get their attention. The next best thing is to talk about the needs of people you know personally, like your friends or siblings.14.",
      "Make a soundbite stick in their heads.Professional investors hear a lot of pitches. After a while they all blur together. The first cut is simply to be one of those they remember. And the way to ensure that is to create a descriptive phrase about yourself that sticks in their heads.In Hollywood, these phrases seem to be of the form \"x meets y.\" In the startup world, they're usually \"the x of y\" or \"the x y.\" Viaweb's was \"the Microsoft Word of ecommerce.\"Find one and launch it clearly (but apparently casually) in your talk, preferably near the beginning.It's a good exercise for you, too, to sit down and try to figure out how to describe your startup in one compelling phrase.",
      "If you can't, your plans may not be sufficiently focused.How to Fund a StartupHackers' Guide to InvestorsSpanish TranslationJapanese TranslationRussian Translation Image: Casey Muller: Trevor Blackwell at Rehearsal Day, summer 2006"
    ],
    "word_count": 2772,
    "paragraph_count": 53
  },
  "processed_at": "2025-07-26T19:07:31.852096",
  "paragraphs": [
    {
      "original": "Want to start a startup? Get funded by Y Combinator. August 2006, rev. April 2007, September 2010In a few days it will be Demo Day, when the startups we funded this summer present to investors. Y Combinator funds startups twice a year, in January and June.",
      "translated": "想创办一家初创公司吗？获得Y Combinator的资助。2006年8月，2007年4月修订，2010年9月修订。几天后就是演示日，届时我们今年夏天资助的初创公司将向投资者展示。Y Combinator每年两次资助初创公司，分别在1月和6月。"
    },
    {
      "original": "Ten weeks later we invite all the investors we know to hear them present what they've built so far.Ten weeks is not much time. The average startup probably doesn't have much to show for itself after ten weeks.",
      "translated": "十周后，我们邀请所有认识的投资者来听他们介绍到目前为止的成果。十周时间并不长。对于一般的创业公司来说，十周后可能不会有太多东西可以展示。"
    },
    {
      "original": "But the average startup fails. When you look at the ones that went on to do great things, you find a lot that began with someone pounding out a prototype in a week or two of nonstop work. Startups are a counterexample to the rule that haste makes waste.(Too much money seems to be as bad for startups as too much time, so we don't give them much money either.)A week before Demo Day, we have a dress rehearsal called Rehearsal Day.",
      "translated": "但大多数初创公司都会失败。当你观察那些最终取得巨大成就的公司时，你会发现很多都是从某个人在一周或两周的不间断工作中敲出一个原型开始的。初创公司是“欲速则不达”这一规则的反例。（太多的钱似乎和太多的时间一样对初创公司有害，所以我们也不会给他们太多资金。）在演示日的一周前，我们会举行一次彩排，称为彩排日。"
    },
    {
      "original": "At other Y Combinator events we allow outside guests, but not at Rehearsal Day. No one except the other founders gets to see the rehearsals.The presentations on Rehearsal Day are often pretty rough. But this is to be expected.",
      "translated": "在其他 Y Combinator 活动中，我们允许外部嘉宾参加，但排练日不对外开放。除了其他创始人之外，没有人可以看到排练。排练日的演讲通常相当粗糙。但这在预料之中。"
    },
    {
      "original": "We try to pick founders who are good at building things, not ones who are slick presenters. Some of the founders are just out of college, or even still in it, and have never spoken to a group of people they didn't already know.So we concentrate on the basics.",
      "translated": "我们尽量选择那些善于建设事业的创始人，而不是擅长华丽演讲的人。有些创始人刚从大学毕业，甚至还在上学，从未向一群不熟悉的人发表过演讲。因此，我们专注于基础。"
    },
    {
      "original": "On Demo Day each startup will only get ten minutes, so we encourage them to focus on just two goals: (a) explain what you're doing, and (b) explain why users will want it.That might sound easy, but it's not when the speakers have no experience presenting, and they're explaining technical matters to an audience that's mostly non-technical.This situation is constantly repeated when startups present to investors: people who are bad at explaining, talking to people who are bad at understanding.",
      "translated": "在演示日，每个初创公司只有十分钟的时间，所以我们鼓励他们专注于两个目标：（a）解释你们在做什么，（b）解释用户为什么需要它。这听起来可能很简单，但当演讲者没有演讲经验，而且他们是在向主要非技术背景的听众解释技术问题时，就不是那么容易了。这种情形在初创公司向投资者展示时经常出现：不擅长解释的人在与不擅长理解的人交流。"
    },
    {
      "original": "Practically every successful startup, including stars like Google, presented at some point to investors who didn't get it and turned them down. Was it because the founders were bad at presenting, or because the investors were obtuse?",
      "translated": "几乎每一个成功的创业公司，包括像谷歌这样的明星企业，在某个时候都曾向那些不理解他们想法的投资者进行过展示，并被拒绝。这是由于创始人不善于表达，还是因为投资者目光短浅？"
    },
    {
      "original": "It's probably always some of both.At the most recent Rehearsal Day, we four Y Combinator partners found ourselves saying a lot of the same things we said at the last two. So at dinner afterward we collected all our tips about presenting to investors.",
      "translated": "这大概总是两者兼有。在最近的彩排日，我们四位Y Combinator的合伙人发现自己说了很多与前两次相同的话。所以，在晚上的聚餐后，我们汇总了所有关于向投资者展示的建议。"
    },
    {
      "original": "Most startups face similar challenges, so we hope these will be useful to a wider audience. 1. Explain what you're doing.Investors' main question when judging a very early startup is whether you've made a compelling product.",
      "translated": "大多数初创企业都会遇到类似的问题，因此我们希望这些建议能对更广泛的受众有所帮助。1. 解释你在做什么。投资者在评估一家非常早期的初创企业时，主要关心的问题是你们是否开发出了一款有吸引力的产品。"
    },
    {
      "original": "Before they can judge whether you've built a good x, they have to understand what kind of x you've built. They will get very frustrated if instead of telling them what you do, you make them sit through some kind of preamble.Say what you're doing as soon as possible, preferably in the first sentence.",
      "translated": "在他们能够判断你是否建立了一个好的x之前，他们必须先了解你建立的是什么样的x。如果你不告诉他们你在做什么，而是让他们坐下来听一些开场白，他们会感到非常沮丧。尽可能快地说出你在做什么，最好是在第一句话中。"
    },
    {
      "original": "\"We're Jeff and Bob and we've built an easy to use web-based database. Now we'll show it to you and explain why people need this.\"If you're a great public speaker you may be able to violate this rule.",
      "translated": "我们是杰夫和鲍勃，我们构建了一个易于使用的基于网络的数据库。现在我们将会向您展示，并解释为什么人们需要这个。如果您是一位出色的公众演讲者，您可能会打破这一规则。"
    },
    {
      "original": "Last year one founder spent the whole first half of his talk on a fascinating analysis of the limits of the conventional desktop metaphor. He got away with it, but unless you're a captivating speaker, which most hackers aren't, it's better to play it safe.2.",
      "translated": "去年，一位创始人在他的演讲中用了整个前半部分来深入分析传统桌面隐喻的局限性。他成功了，但除非你是一个非常吸引人的演讲者，而大多数黑客都不是，最好还是稳妥一些。"
    },
    {
      "original": "Get rapidly to demo.This section is now obsolete for YC founders presenting at Demo Day, because Demo Day presentations are now so short that they rarely include much if any demo. They seem to work just as well without, however, which makes me think I was wrong to emphasize demos so much before.A demo explains what you've made more effectively than any verbal description.",
      "translated": "迅速进入演示。这一部分对于YC创始人在演示日的展示已经过时，因为现在的演示日演讲非常简短，几乎不会包含任何演示。然而，即使没有演示，似乎效果也一样好，这让我认为之前过分强调演示是错误的。演示能比任何口头描述更有效地解释你所创造的东西。"
    },
    {
      "original": "The only thing worth talking about first is the problem you're trying to solve and why it's important. But don't spend more than a tenth of your time on that. Then demo.When you demo, don't run through a catalog of features.",
      "translated": "首先值得讨论的唯一问题是您试图解决的问题及其重要性。但不要在这方面花费超过十分之一的时间。然后进行演示。演示时，不要逐一列举功能。"
    },
    {
      "original": "Instead start with the problem you're solving, and then show how your product solves it. Show features in an order driven by some kind of purpose, rather than the order in which they happen to appear on the screen.If you're demoing something web-based, assume that the network connection will mysteriously die 30 seconds into your presentation, and come prepared with a copy of the server software running on your laptop.3.",
      "translated": "相反，先从你要解决的问题开始，然后展示你的产品是如何解决这个问题的。按照某种目的来安排功能的展示顺序，而不是按照它们在屏幕上出现的顺序。如果你演示的是基于网络的内容，假设网络连接会在你开始演示30秒后神秘地断开，并准备好在你的笔记本电脑上运行的服务器软件副本。"
    },
    {
      "original": "Better a narrow description than a vague one.One reason founders resist describing their projects concisely is that, at this early stage, there are all kinds of possibilities. The most concise descriptions seem misleadingly narrow.",
      "translated": "宁可描述得具体些，也不要含糊其辞。创始人往往不愿意简洁地描述他们的项目，其中一个原因是，在这个早期阶段，有各种各样的可能性。最简洁的描述似乎显得过于狭隘，容易让人误解。"
    },
    {
      "original": "So for example a group that has built an easy web-based database might resist calling their applicaton that, because it could be so much more. In fact, it could be anything...The problem is, as you approach (in the calculus sense) a description of something that could be anything, the content of your description approaches zero.",
      "translated": "例如，一个创建了简单基于网页的数据库的团队可能会抵制将他们的应用程序称为数据库，因为这可能远远不止如此。事实上，这可以是任何东西……问题在于，当你接近（在微积分意义上的）对某物的描述，而该物可以是任何东西时，你的描述内容实际上趋向于零。"
    },
    {
      "original": "If you describe your web-based database as \"a system to allow people to collaboratively leverage the value of information,\" it will go in one investor ear and out the other. They'll just discard that sentence as meaningless boilerplate, and hope, with increasing impatience, that in the next sentence you'll actually explain what you've made.Your primary goal is not to describe everything your system might one day become, but simply to convince investors you're worth talking to further.",
      "translated": "如果你将你的基于网络的数据库描述为“一个让人们协同发挥信息价值的系统”，那么这番话对投资者来说不过是左耳进右耳出。他们只会把这句话当作毫无意义的套话，并且越来越不耐烦地希望你能在下一句话中真正解释你所创造的东西。你的首要目标不是描述你的系统可能成为的一切，而是简单地让投资者相信你值得进一步交谈。"
    },
    {
      "original": "So approach this like an algorithm that gets the right answer by successive approximations. Begin with a description that's gripping but perhaps overly narrow, then flesh it out to the extent you can.",
      "translated": "因此，像一个通过逐步逼近得到正确答案的算法那样来处理这个问题。先从一个引人入胜但可能过于狭窄的描述开始，然后再尽可能地将其丰富和完善。"
    },
    {
      "original": "It's the same principle as incremental development: start with a simple prototype, then add features, but at every point have working code. In this case, \"working code\" means a working description in the investor's head.4.",
      "translated": "这与增量开发的原则相同：从一个简单的原型开始，然后逐步添加功能，但在每一个阶段都要有可运行的代码。在这个情境下，“可运行的代码”意味着在投资者脑海中有一个清晰的工作描述。"
    },
    {
      "original": "Don't talk and drive.Have one person talk while another uses the computer. If the same person does both, they'll inevitably mumble downwards at the computer screen instead of talking clearly at the audience.As long as you're standing near the audience and looking at them, politeness (and habit) compel them to pay attention to you.",
      "translated": "不要边谈话边操作电脑。应该由一个人负责讲话，另一个人负责使用电脑。如果同一个人同时做这两件事，他们必然会低头含糊地对着电脑屏幕讲话，而不是清晰地对着观众说话。只要你站在观众附近并看着他们，礼貌（和习惯）会促使他们注意你。"
    },
    {
      "original": "Once you stop looking at them to fuss with something on your computer, their minds drift off to the errands they have to run later.5. Don't talk about secondary matters at length.If you only have a few minutes, spend them explaining what your product does and why it's great.",
      "translated": "一旦你停止看着他们去摆弄电脑上的东西，他们的思绪就会飘到之后需要办的杂事上。不要花太多时间谈论次要的事情。如果你只有几分钟的时间，就用这些时间来解释你的产品是什么以及为什么它很棒。"
    },
    {
      "original": "Second order issues like competitors or resumes should be single slides you go through quickly at the end. If you have impressive resumes, just flash them on the screen for 15 seconds and say a few words.",
      "translated": "次要问题如竞争对手或简历应该在最后快速过一遍，每个问题用一张幻灯片。如果有令人印象深刻的简历，只需在屏幕上展示15秒，并简要说明几句。"
    },
    {
      "original": "For competitors, list the top 3 and explain in one sentence each what they lack that you have. And put this kind of thing at the end, after you've made it clear what you've built.6. Don't get too deeply into business models.It's good to talk about how you plan to make money, but mainly because it shows you care about that and have thought about it.",
      "translated": "对于竞争对手，列出前三名，并用一句话分别说明他们缺少你所拥有的优势。这类内容放在最后，先明确你所构建的产品或服务。6. 不要过于深入讨论商业模式。谈论你如何计划盈利是好的，主要是因为它表明你关心这一点并且已经考虑过。"
    },
    {
      "original": "Don't go into detail about your business model, because (a) that's not what smart investors care about in a brief presentation, and (b) any business model you have at this point is probably wrong anyway.Recently a VC who came to speak at Y Combinator talked about a company he just invested in.",
      "translated": "不要详细阐述你的商业模式，因为（a）在简短的演讲中，聪明的投资者并不关心这些，（b）你目前的任何商业模式可能都是错误的。最近，一位来到Y Combinator演讲的风险投资家谈到了他刚刚投资的一家公司。"
    },
    {
      "original": "He said their business model was wrong and would probably change three times before they got it right. The founders were experienced guys who'd done startups before and who'd just succeeded in getting millions from one of the top VC firms, and even their business model was crap.",
      "translated": "他说他们的商业模式是错误的，可能要调整三次才能找到正确的方向。这些创始人都是有经验的人，之前创办过初创公司，并且刚刚从一家顶级风投公司获得了数百万的资金，即便如此，他们的商业模式依然糟糕。"
    },
    {
      "original": "(And yet he invested anyway, because he expected it to be crap at this stage.)If you're solving an important problem, you're going to sound a lot smarter talking about that than the business model. The business model is just a bunch of guesses, and guesses about stuff that's probably not your area of expertise.",
      "translated": "（尽管如此，他还是投资了，因为他预料在这个阶段项目会表现得很糟糕。）如果你正在解决一个重要的问题，谈论这个问题会让你听起来比谈论商业模式聪明得多。商业模式不过是一系列的猜测，而且这些猜测通常涉及的领域可能并非你的专长。"
    },
    {
      "original": "So don't spend your precious few minutes talking about crap when you could be talking about solid, interesting things you know a lot about: the problem you're solving and what you've built so far.As well as being a bad use of time, if your business model seems spectacularly wrong, that will push the stuff you want investors to remember out of their heads.",
      "translated": "所以，不要把宝贵的几分钟浪费在无关紧要的事情上，而应该谈论你非常了解的、有趣且实质性的话题：你正在解决的问题以及到目前为止你所构建的成果。除了浪费时间，如果你的商业模式显得极其不合理，这会使投资者记住你希望他们记住的内容从他们的脑海中消失。"
    },
    {
      "original": "They'll just remember you as the company with the boneheaded plan for making money, rather than the company that solved that important problem.7. Talk slowly and clearly at the audience.Everyone at Rehearsal Day could see the difference between the people who'd been out in the world for a while and had presented to groups, and those who hadn't.You need to use a completely different voice and manner talking to a roomful of people than you would in conversation.",
      "translated": "他们只会记得你是那个有着愚蠢赚钱计划的公司，而不是解决了那个重要问题的公司。7. 对观众讲话时，要慢慢地说，清楚地表达。排练日那天，所有人都能看出来，那些已经在外面世界历练过、向群体做过演讲的人，和那些没有经验的人之间的差别。你需要用一种完全不同于日常对话的声音和方式来与一屋子人交谈。"
    },
    {
      "original": "Everyday life gives you no practice in this. If you can't already do it, the best solution is to treat it as a consciously artificial trick, like juggling.However, that doesn't mean you should talk like some kind of announcer.",
      "translated": "日常生活不会给你这方面的练习。如果你还不会，最好的办法就是把它当作一种有意识的人为技巧，就像耍杂技一样。然而，这并不意味着你应该像某种播音员那样说话。"
    },
    {
      "original": "Audiences tune that out. What you need to do is talk in this artificial way, and yet make it seem conversational. (Writing is the same. Good writing is an elaborate effort to seem spontaneous.)If you want to write out your whole presentation beforehand and memorize it, that's ok.",
      "translated": "观众会忽略那些。你需要以这种人工的方式说话，同时还要让它听起来像是在聊天。（写作也是如此。好的写作是一种精心的努力，旨在显得自然。）如果你想事先把整个演讲写下来并背下来，那是可以的。"
    },
    {
      "original": "That has worked for some groups in the past. But make sure to write something that sounds like spontaneous, informal speech, and deliver it that way too.Err on the side of speaking slowly. At Rehearsal Day, one of the founders mentioned a rule actors use: if you feel you're speaking too slowly, you're speaking at about the right speed.8.",
      "translated": "这种方法在过去对一些团体有效。但请确保你写的内容听起来像是即兴的、非正式的口语，并且也要以这种方式表达。说话时宁愿慢一些。在排练日，其中一位创始人提到了演员们使用的一个规则：如果你觉得自己说得太慢了，那你的语速大概就是合适的。"
    },
    {
      "original": "Have one person talk.Startups often want to show that all the founders are equal partners. This is a good instinct; investors dislike unbalanced teams. But trying to show it by partitioning the presentation is going too far.",
      "translated": "让一个人来讲。初创公司通常希望展示所有创始人都是平等的合作伙伴。这种想法很好；投资者不喜欢不均衡的团队。但试图通过分割演讲来展示这一点就走得太远了。"
    },
    {
      "original": "It's distracting. You can demonstrate your respect for one another in more subtle ways. For example, when one of the groups presented at Demo Day, the more extroverted of the two founders did most of the talking, but he described his co-founder as the best hacker he'd ever met, and you could tell he meant it.Pick the one or at most two best speakers, and have them do most of the talking.Exception: If one of the founders is an expert in some specific technical field, it can be good for them to talk about that for a minute or so.",
      "translated": "这会分散注意力。你们可以通过更微妙的方式展示彼此的尊重。例如，在演示日，两个创始人中较为外向的那个做了大部分的发言，但他描述他的联合创始人是他见过的最好的黑客，而且你可以看出他是真心实意的。选择一到两个最擅长演讲的人，让他们做大部分的发言。例外情况：如果某个创始人是某一特定技术领域的专家，让他们谈论一两分钟这个领域的内容会是个不错的选择。"
    },
    {
      "original": "This kind of \"expert witness\" can add credibility, even if the audience doesn't understand all the details. If Jobs and Wozniak had 10 minutes to present the Apple II, it might be a good plan to have Jobs speak for 9 minutes and have Woz speak for a minute in the middle about some of the technical feats he'd pulled off in the design.",
      "translated": "这种“专家证人”可以增加可信度，即使观众并不理解所有细节。如果乔布斯和沃兹尼亚克有10分钟的时间来介绍Apple II，一个好策略可能是让乔布斯讲9分钟，中间由沃兹讲1分钟，谈谈他在设计中实现的一些技术成就。"
    },
    {
      "original": "(Though of course if it were actually those two, Jobs would speak for the entire 10 minutes.)9. Seem confident.Between the brief time available and their lack of technical background, many in the audience will have a hard time evaluating what you're doing.",
      "translated": "（当然，如果真是那两个人，乔布斯会全程讲10分钟。）9. 显得自信。由于可用时间有限，加上观众大多没有技术背景，他们很难对你的工作做出评估。"
    },
    {
      "original": "Probably the single biggest piece of evidence, initially, will be your own confidence in it. You have to show you're impressed with what you've made.And I mean show, not tell. Never say \"we're passionate\" or \"our product is great.\" People just ignore that—or worse, write you off as bullshitters.",
      "translated": "最初，最有力的证据可能是你对自己所创造事物的信心。你必须展现出你对自己的成果印象深刻。我说的是展示，而不是讲述。不要说“我们充满热情”或“我们的产品很棒”。人们要么会忽略这些话，要么更糟糕的是，认为你在吹牛。"
    },
    {
      "original": "Such messages must be implicit.What you must not do is seem nervous and apologetic. If you've truly made something good, you're doing investors a favor by telling them about it. If you don't genuinely believe that, perhaps you ought to change what your company is doing.",
      "translated": "这类信息必须是隐含的。你绝对不能显得紧张和歉意。如果你真的做出了一些好东西，告诉投资者是在帮他们一个忙。如果你并不真正相信这一点，也许你应该改变公司的方向。"
    },
    {
      "original": "If you don't believe your startup has such promise that you'd be doing them a favor by letting them invest, why are you investing your time in it?10. Don't try to seem more than you are.Don't worry if your company is just a few months old and doesn't have an office yet, or your founders are technical people with no business experience.",
      "translated": "如果你不相信你的创业公司有如此大的潜力，以至于你让他们投资是在帮他们的忙，那你为什么还要投入自己的时间呢？10. 不要试图显得比你实际更强大。不要担心你的公司只有几个月的历史，还没有办公室，或者你的创始人是只有技术背景而没有商业经验的人。"
    },
    {
      "original": "Google was like that once, and they turned out ok. Smart investors can see past such superficial flaws. They're not looking for finished, smooth presentations. They're looking for raw talent. All you need to convince them of is that you're smart and that you're onto something good.",
      "translated": "谷歌也曾经历过这样的阶段，最终也发展得很好。聪明的投资者能够看到这些表面缺陷背后的东西。他们不寻找完美、圆滑的展示。他们寻找的是原始的才能。你只需要让他们相信你很聪明，并且你正在做一件好事。"
    },
    {
      "original": "If you try too hard to conceal your rawness—by trying to seem corporate, or pretending to know about stuff you don't—you may just conceal your talent.You can afford to be candid about what you haven't figured out yet.",
      "translated": "如果你过于努力地掩饰自己的青涩——比如试图显得很职业，或者假装了解自己不懂的东西——你可能会掩盖了自己的才华。你可以坦诚地面对自己尚未弄明白的事情。"
    },
    {
      "original": "Don't go out of your way to bring it up (e.g. by having a slide about what might go wrong), but don't try to pretend either that you're further along than you are. If you're a hacker and you're presenting to experienced investors, they're probably better at detecting bullshit than you are at producing it.11.",
      "translated": "不要刻意去提起它（比如通过展示可能会出错的幻灯片），但也不要试图假装你比实际更进一步。如果你是一个黑客，并且正在向有经验的投资者展示，他们可能比你更擅长识破夸大之词。"
    },
    {
      "original": "Don't put too many words on slides.When there are a lot of words on a slide, people just skip reading it. So look at your slides and ask of each word \"could I cross this out?\" This includes gratuitous clip art.",
      "translated": "不要在幻灯片上放太多文字。当幻灯片上的文字过多时，人们会跳过阅读。因此，请查看你的幻灯片，并对每个词问自己“我能否删掉这个？”这包括多余的剪贴画。"
    },
    {
      "original": "Try to get your slides under 20 words if you can.Don't read your slides. They should be something in the background as you face the audience and talk to them, not something you face and read to an audience sitting behind you.Cluttered sites don't do well in demos, especially when they're projected onto a screen.",
      "translated": "尽量将幻灯片内容控制在20个词以内。不要念幻灯片内容。它们应该是你在面对观众讲话时的背景辅助，而不是你面对并念给坐在你身后的观众听的东西。杂乱的界面在演示中效果不佳，尤其是在投影到屏幕上时。"
    },
    {
      "original": "At the very least, crank up the font size big enough to make all the text legible. But cluttered sites are bad anyway, so perhaps you should use this opportunity to make your design simpler.12. Specific numbers are good.If you have any kind of data, however preliminary, tell the audience.",
      "translated": "至少，将字体大小调整得足够大，以确保所有文本都清晰可读。但杂乱的网站本来就不好，所以你不妨借此机会简化你的设计。12. 具体数字很有用。如果你有任何数据，无论多么初步，都应告诉观众。"
    },
    {
      "original": "Numbers stick in people's heads. If you can claim that the median visitor generates 12 page views, that's great.But don't give them more than four or five numbers, and only give them numbers specific to you.",
      "translated": "数字容易被人记住。如果你能声称中位数访客产生12次页面浏览，那很好。但不要给他们超过四或五个数字，并且只提供与你自身相关的确切数字。"
    },
    {
      "original": "You don't need to tell them the size of the market you're in. Who cares, really, if it's 500 million or 5 billion a year? Talking about that is like an actor at the beginning of his career telling his parents how much Tom Hanks makes.",
      "translated": "你不需要告诉他们你所在市场的规模。真的，无论是每年5亿还是50亿，谁在乎呢？谈论这些就像一个刚起步的演员向父母讲述汤姆·汉克斯的收入一样。"
    },
    {
      "original": "Yeah, sure, but first you have to become Tom Hanks. The important part is not whether he makes ten million a year or a hundred, but how you get there.13. Tell stories about users.The biggest fear of investors looking at early stage startups is that you've built something based on your own a priori theories of what the world needs, but that no one will actually want.",
      "translated": "好的，没问题，但首先你得成为汤姆·汉克斯。关键不在于他一年赚一千万还是一亿，而在于你怎么达到那个水平。讲述用户的故事。早期投资人最担心的是，你基于自己对世界需求的先验理论构建了某些东西，但实际上却没人想要。"
    },
    {
      "original": "So it's good if you can talk about problems specific users have and how you solve them.Greg Mcadoo said one thing Sequoia looks for is the \"proxy for demand.\" What are people doing now, using inadequate tools, that shows they need what you're making?Another sign of user need is when people pay a lot for something.",
      "translated": "所以，如果你能谈论特定用户面临的问题以及你是如何解决这些问题的，这很好。Greg Mcadoo 曾提到，Sequoia 寻找的一个要素是“需求的代理指标”。现在人们在用哪些不充分的工具，这表明他们需要你正在开发的产品？另一个用户需求的迹象是当人们愿意为某件事支付高额费用时。"
    },
    {
      "original": "It's easy to convince investors there will be demand for a cheaper alternative to something popular, if you preserve the qualities that made it popular.The best stories about user needs are about your own.",
      "translated": "说服投资者相信对某款流行产品提供更便宜的替代品会有需求是很容易的，只要你保留了使其流行的特点。关于用户需求的最佳故事往往是你自己的故事。"
    },
    {
      "original": "A remarkable number of famous startups grew out of some need the founders had: Apple, Microsoft, Yahoo, Google. Experienced investors know that, so stories of this type will get their attention. The next best thing is to talk about the needs of people you know personally, like your friends or siblings.14.",
      "translated": "许多著名的企业都是从创始人自身的需求中发展起来的：苹果、微软、雅虎、谷歌。有经验的投资者深知这一点，因此这类故事会吸引他们的注意。其次，谈论你个人认识的人的需求，比如你的朋友或兄弟姐妹，也是一个不错的选择。14."
    },
    {
      "original": "Make a soundbite stick in their heads.Professional investors hear a lot of pitches. After a while they all blur together. The first cut is simply to be one of those they remember. And the way to ensure that is to create a descriptive phrase about yourself that sticks in their heads.In Hollywood, these phrases seem to be of the form \"x meets y.\" In the startup world, they're usually \"the x of y\" or \"the x y.\" Viaweb's was \"the Microsoft Word of ecommerce.\"Find one and launch it clearly (but apparently casually) in your talk, preferably near the beginning.It's a good exercise for you, too, to sit down and try to figure out how to describe your startup in one compelling phrase.",
      "translated": "让一句话深深印在他们的脑海中。专业的投资者听到了很多的推介。过了一段时间，这些推介就会逐渐模糊。首要的目标就是成为他们记得的那几个之一。确保这一点的方法就是创造一个关于你自己的描述性短语，让他们印象深刻。在好莱坞，这些短语通常是“x 遇上 y”的形式。在创业界，它们通常是“y 的 x”或“x y”。Viaweb 的描述是“电子商务界的微软 Word”。找到这样一个短语，并在你的演讲中清晰地（但看似随意地）抛出，最好是在演讲的开头。对你来说，坐下来尝试找出一个能够描述你的创业公司的一句话也是个很好的练习。"
    },
    {
      "original": "If you can't, your plans may not be sufficiently focused.How to Fund a StartupHackers' Guide to InvestorsSpanish TranslationJapanese TranslationRussian Translation Image: Casey Muller: Trevor Blackwell at Rehearsal Day, summer 2006",
      "translated": "如果你做不到，你的计划可能还不够集中。如何为初创企业融资黑客投资指南西班牙语翻译日语翻译俄语翻译 图片：Casey Muller：2006年夏季彩排日的Trevor Blackwell"
    }
  ],
  "translation_completed": "2025-07-28T15:41:24.096669",
  "translation_stats": {
    "total_paragraphs": 53,
    "success_count": 53,
    "success_rate": "100.0%"
  }
}