{
  "title": "Jessica Livingston",
  "title_zh": "[待翻译] Jessica Livingston",
  "url": "https://www.paulgraham.com/jessica.html",
  "filename": "jessica.html",
  "date": "2021-01-11",
  "id": 53,
  "content": {
    "success": true,
    "paragraphs": [
      "November 2015A few months ago an article about Y Combinator said that early on it had been a \"one-man show.\" It's sadly common to read that sort of thing. But the problem with that description is not just that it's unfair.",
      "It's also misleading. Much of what's most novel about YC is due to Jessica Livingston. If you don't understand her, you don't understand YC. So let me tell you a little about Jessica.YC had 4 founders.",
      "Jessica and I decided one night to start it, and the next day we recruited my friends Robert Morris and Trevor Blackwell. Jessica and I ran YC day to day, and Robert and Trevor read applications and did interviews with us.Jessica and I were already dating when we started YC.",
      "At first we tried to act \"professional\" about this, meaning we tried to conceal it. In retrospect that seems ridiculous, and we soon dropped the pretense. And the fact that Jessica and I were a couple is a big part of what made YC what it was.",
      "YC felt like a family. The founders early on were mostly young. We all had dinner together once a week, cooked for the first couple years by me. Our first building had been a private home. The overall atmosphere was shockingly different from a VC's office on Sand Hill Road, in a way that was entirely for the better.",
      "There was an authenticity that everyone who walked in could sense. And that didn't just mean that people trusted us. It was the perfect quality to instill in startups. Authenticity is one of the most important things YC looks for in founders, not just because fakers and opportunists are annoying, but because authenticity is one of the main things that separates the most successful startups from the rest.Early YC was a family, and Jessica was its mom.",
      "And the culture she defined was one of YC's most important innovations. Culture is important in any organization, but at YC culture wasn't just how we behaved when we built the product. At YC, the culture was the product.Jessica was also the mom in another sense: she had the last word.",
      "Everything we did as an organization went through her first — who to fund, what to say to the public, how to deal with other companies, who to hire, everything.Before we had kids, YC was more or less our life.",
      "There was no real distinction between working hours and not. We talked about YC all the time. And while there might be some businesses that it would be tedious to let infect your private life, we liked it.",
      "We'd started YC because it was something we were interested in. And some of the problems we were trying to solve were endlessly difficult. How do you recognize good founders? You could talk about that for years, and we did; we still do.I'm better at some things than Jessica, and she's better at some things than me.",
      "One of the things she's best at is judging people. She's one of those rare individuals with x-ray vision for character. She can see through any kind of faker almost immediately. Her nickname within YC was the Social Radar, and this special power of hers was critical in making YC what it is.",
      "The earlier you pick startups, the more you're picking the founders. Later stage investors get to try products and look at growth numbers. At the stage where YC invests, there is often neither a product nor any numbers.Others thought YC had some special insight about the future of technology.",
      "Mostly we had the same sort of insight Socrates claimed: we at least knew we knew nothing. What made YC successful was being able to pick good founders. We thought Airbnb was a bad idea. We funded it because we liked the founders.During interviews, Robert and Trevor and I would pepper the applicants with technical questions.",
      "Jessica would mostly watch. A lot of the applicants probably read her as some kind of secretary, especially early on, because she was the one who'd go out and get each new group and she didn't ask many questions.",
      "She was ok with that. It was easier for her to watch people if they didn't notice her. But after the interview, the three of us would turn to Jessica and ask \"What does the Social Radar say?\" [1]Having the Social Radar at interviews wasn't just how we picked founders who'd be successful.",
      "It was also how we picked founders who were good people. At first we did this because we couldn't help it. Imagine what it would feel like to have x-ray vision for character. Being around bad people would be intolerable.",
      "So we'd refuse to fund founders whose characters we had doubts about even if we thought they'd be successful.Though we initially did this out of self-indulgence, it turned out to be very valuable to YC.",
      "We didn't realize it in the beginning, but the people we were picking would become the YC alumni network. And once we picked them, unless they did something really egregious, they were going to be part of it for life.",
      "Some now think YC's alumni network is its most valuable feature. I personally think YC's advice is pretty good too, but the alumni network is certainly among the most valuable features. The level of trust and helpfulness is remarkable for a group of such size.",
      "And Jessica is the main reason why.(As we later learned, it probably cost us little to reject people whose characters we had doubts about, because how good founders are and how well they do are not orthogonal.",
      "If bad founders succeed at all, they tend to sell early. The most successful founders are almost all good.)If Jessica was so important to YC, why don't more people realize it? Partly because I'm a writer, and writers always get disproportionate attention.",
      "YC's brand was initially my brand, and our applicants were people who'd read my essays. But there is another reason: Jessica hates attention. Talking to reporters makes her nervous. The thought of giving a talk paralyzes her.",
      "She was even uncomfortable at our wedding, because the bride is always the center of attention. [2]It's not just because she's shy that she hates attention, but because it throws off the Social Radar.",
      "She can't be herself. You can't watch people when everyone is watching you.Another reason attention worries her is that she hates bragging. In anything she does that's publicly visible, her biggest fear (after the obvious fear that it will be bad) is that it will seem ostentatious.",
      "She says being too modest is a common problem for women. But in her case it goes beyond that. She has a horror of ostentation so visceral it's almost a phobia.She also hates fighting. She can't do it; she just shuts down.",
      "And unfortunately there is a good deal of fighting in being the public face of an organization.So although Jessica more than anyone made YC unique, the very qualities that enabled her to do it mean she tends to get written out of YC's history.",
      "Everyone buys this story that PG started YC and his wife just kind of helped. Even YC's haters buy it. A couple years ago when people were attacking us for not funding more female founders (than exist), they all treated YC as identical with PG.",
      "It would have spoiled the narrative to acknowledge Jessica's central role at YC.Jessica was boiling mad that people were accusing her company of sexism. I've never seen her angrier about anything. But she did not contradict them.",
      "Not publicly. In private there was a great deal of profanity. And she wrote three separate essays about the question of female founders. But she could never bring herself to publish any of them. She'd seen the level of vitriol in this debate, and she shrank from engaging.",
      "[3]It wasn't just because she disliked fighting. She's so sensitive to character that it repels her even to fight with dishonest people. The idea of mixing it up with linkbait journalists or Twitter trolls would seem to her not merely frightening, but disgusting.But Jessica knew her example as a successful female founder would encourage more women to start companies, so last year she did something YC had never done before and hired a PR firm to get her some interviews.",
      "At one of the first she did, the reporter brushed aside her insights about startups and turned it into a sensationalistic story about how some guy had tried to chat her up as she was waiting outside the bar where they had arranged to meet.",
      "Jessica was mortified, partly because the guy had done nothing wrong, but more because the story treated her as a victim significant only for being a woman, rather than one of the most knowledgeable investors in the Valley.After that she told the PR firm to stop.You're not going to be hearing in the press about what Jessica has achieved.",
      "So let me tell you what Jessica has achieved. Y Combinator is fundamentally a nexus of people, like a university. It doesn't make a product. What defines it is the people. Jessica more than anyone curated and nurtured that collection of people.",
      "In that sense she literally made YC.Jessica knows more about the qualities of startup founders than anyone else ever has. Her immense data set and x-ray vision are the perfect storm in that respect. The qualities of the founders are the best predictor of how a startup will do.",
      "And startups are in turn the most important source of growth in mature economies.The person who knows the most about the most important factor in the growth of mature economies — that is who Jessica Livingston is.",
      "Doesn't that sound like someone who should be better known?Notes[1] Harj Taggar reminded me that while Jessica didn't ask many questions, they tended to be important ones:\"She was always good at sniffing out any red flags about the team or their determination and disarmingly asking the right question, which usually revealed more than the founders realized.\"[2] Or more precisely, while she likes getting attention in the sense of getting credit for what she has done, she doesn't like getting attention in the sense of being watched in real time.",
      "Unfortunately, not just for her but for a lot of people, how much you get of the former depends a lot on how much you get of the latter.Incidentally, if you saw Jessica at a public event, you would never guess she hates attention, because (a) she is very polite and (b) when she's nervous, she expresses it by smiling more.[3] The existence of people like Jessica is not just something the mainstream media needs to learn to acknowledge, but something feminists need to learn to acknowledge as well.",
      "There are successful women who don't like to fight. Which means if the public conversation about women consists of fighting, their voices will be silenced.There's a sort of Gresham's Law of conversations.",
      "If a conversation reaches a certain level of incivility, the more thoughtful people start to leave. No one understands female founders better than Jessica. But it's unlikely anyone will ever hear her speak candidly about the topic.",
      "She ventured a toe in that water a while ago, and the reaction was so violent that she decided \"never again.\" Thanks to Sam Altman, Paul Buchheit, Patrick Collison, Daniel Gackle, Carolynn Levy, Jon Levy, Kirsty Nathoo, Robert Morris, Geoff Ralston, and Harj Taggar for reading drafts of this.",
      "And yes, Jessica Livingston, who made me cut surprisingly little."
    ],
    "word_count": 1937,
    "paragraph_count": 41
  },
  "processed_at": "2025-07-26T19:03:09.339963",
  "paragraphs": [
    {
      "original": "November 2015A few months ago an article about Y Combinator said that early on it had been a \"one-man show.\" It's sadly common to read that sort of thing. But the problem with that description is not just that it's unfair.",
      "translated": "2015年11月，几个月前有一篇文章提到Y Combinator最初是一个“独角戏”。这类说法令人遗憾地很常见。但这个问题不仅在于不公平。"
    },
    {
      "original": "It's also misleading. Much of what's most novel about YC is due to Jessica Livingston. If you don't understand her, you don't understand YC. So let me tell you a little about Jessica.YC had 4 founders.",
      "translated": "这同样具有误导性。YC 最具创新性的许多方面都归功于 Jessica Livingston。如果你不了解她，你就无法真正理解 YC。所以，让我给你讲讲 Jessica 的一些情况。YC 有 4 位创始人。"
    },
    {
      "original": "Jessica and I decided one night to start it, and the next day we recruited my friends Robert Morris and Trevor Blackwell. Jessica and I ran YC day to day, and Robert and Trevor read applications and did interviews with us.Jessica and I were already dating when we started YC.",
      "translated": "杰西卡和我决定在一个晚上开始这个项目，第二天我们招募了我的朋友罗伯特·莫里斯和特雷弗·布莱克威尔。杰西卡和我负责YC的日常运营，罗伯特和特雷弗则和我们一起审阅申请并进行面试。我们开始YC的时候已经是在交往了。"
    },
    {
      "original": "At first we tried to act \"professional\" about this, meaning we tried to conceal it. In retrospect that seems ridiculous, and we soon dropped the pretense. And the fact that Jessica and I were a couple is a big part of what made YC what it was.",
      "translated": "起初我们试图表现得很“专业”，意思就是尽量掩饰。现在回想起来，这显得很可笑，我们很快就放弃了这种伪装。事实上，杰西卡和我是情侣这一点，是YC能够成为今天模样的重要组成部分。"
    },
    {
      "original": "YC felt like a family. The founders early on were mostly young. We all had dinner together once a week, cooked for the first couple years by me. Our first building had been a private home. The overall atmosphere was shockingly different from a VC's office on Sand Hill Road, in a way that was entirely for the better.",
      "translated": "YC 感觉像一个大家庭。早期的创始人大多是年轻人。我们每周一起吃一次晚餐，头几年都是由我亲自下厨。我们的第一个办公地点曾是一栋私人住宅。整体氛围与沙丘路上的风险投资公司办公室截然不同，这种不同完全是好的方面。"
    },
    {
      "original": "There was an authenticity that everyone who walked in could sense. And that didn't just mean that people trusted us. It was the perfect quality to instill in startups. Authenticity is one of the most important things YC looks for in founders, not just because fakers and opportunists are annoying, but because authenticity is one of the main things that separates the most successful startups from the rest.Early YC was a family, and Jessica was its mom.",
      "translated": "有一种真实性，每个走进来的人都能感受到。这不仅意味着人们信任我们。这种品质非常适合初创企业。真实性是YC在寻找创始人时最重视的品质之一，不仅仅是因为骗子和机会主义者令人讨厌，还因为真实性是将最成功的初创企业与其余企业区分开来的主要因素之一。早期的YC就像一个大家庭，而杰西卡就是这个家庭的妈妈。"
    },
    {
      "original": "And the culture she defined was one of YC's most important innovations. Culture is important in any organization, but at YC culture wasn't just how we behaved when we built the product. At YC, the culture was the product.Jessica was also the mom in another sense: she had the last word.",
      "translated": "她所定义的文化是YC最重要的创新之一。文化在任何组织中都很重要，但在YC，文化不仅仅是我们在构建产品时的行为方式。在YC，文化本身就是产品。杰西卡在另一个意义上也是“家长”：她有最终决定权。"
    },
    {
      "original": "Everything we did as an organization went through her first — who to fund, what to say to the public, how to deal with other companies, who to hire, everything.Before we had kids, YC was more or less our life.",
      "translated": "我们组织的每一件事都要先经过她——资助谁，对公众说什么，如何与其他公司打交道，雇用谁，一切事情。在我们有孩子之前，YC 差不多就是我们的全部生活。"
    },
    {
      "original": "There was no real distinction between working hours and not. We talked about YC all the time. And while there might be some businesses that it would be tedious to let infect your private life, we liked it.",
      "translated": "工作时间和非工作时间之间并没有真正的区分。我们一直都在谈论YC。虽然有些生意可能会让人觉得让它们影响私人生活很烦人，但我们喜欢这样。"
    },
    {
      "original": "We'd started YC because it was something we were interested in. And some of the problems we were trying to solve were endlessly difficult. How do you recognize good founders? You could talk about that for years, and we did; we still do.I'm better at some things than Jessica, and she's better at some things than me.",
      "translated": "我们创办YC是因为对此感兴趣。我们试图解决的一些问题极其困难。如何识别优秀的创始人？这个问题可以讨论多年，我们也确实这样做了；至今仍在讨论。我在某些方面比杰西卡强，而她在某些方面又比我强。"
    },
    {
      "original": "One of the things she's best at is judging people. She's one of those rare individuals with x-ray vision for character. She can see through any kind of faker almost immediately. Her nickname within YC was the Social Radar, and this special power of hers was critical in making YC what it is.",
      "translated": "她最擅长的事情之一就是识人。她是那种罕见的能够透视人性的人。她几乎能立即识破任何伪装者。在YC内部，她的绰号是社交雷达，而她这种特殊的能力对于YC能够达到今天的成就至关重要。"
    },
    {
      "original": "The earlier you pick startups, the more you're picking the founders. Later stage investors get to try products and look at growth numbers. At the stage where YC invests, there is often neither a product nor any numbers.Others thought YC had some special insight about the future of technology.",
      "translated": "你越早选择初创公司，就越是在挑选创始人。后期的投资者可以尝试产品并查看增长数据。而在YC投资的阶段，通常既没有产品也没有任何数据。其他人认为YC对技术的未来有某种特别的洞察。"
    },
    {
      "original": "Mostly we had the same sort of insight Socrates claimed: we at least knew we knew nothing. What made YC successful was being able to pick good founders. We thought Airbnb was a bad idea. We funded it because we liked the founders.During interviews, Robert and Trevor and I would pepper the applicants with technical questions.",
      "translated": "大多数时候，我们有着和苏格拉底类似的见解：至少我们知道我们什么都不知道。让YC成功的是能够挑选出优秀的创始人。我们认为Airbnb是一个糟糕的主意。我们资助它是因为我们喜欢这些创始人。在面试过程中，罗伯特、特雷弗和我会向申请人提出一系列技术问题。"
    },
    {
      "original": "Jessica would mostly watch. A lot of the applicants probably read her as some kind of secretary, especially early on, because she was the one who'd go out and get each new group and she didn't ask many questions.",
      "translated": "杰西卡大部分时间都在观察。许多申请者可能把她视为某种秘书，尤其是在一开始，因为她负责去迎接每一组新来的人，而且她问的问题不多。"
    },
    {
      "original": "She was ok with that. It was easier for her to watch people if they didn't notice her. But after the interview, the three of us would turn to Jessica and ask \"What does the Social Radar say?\" [1]Having the Social Radar at interviews wasn't just how we picked founders who'd be successful.",
      "translated": "她对此感到满意。如果人们没有注意到她，她反而更容易观察他们。但面试结束后，我们三个人会转向杰西卡，问：“社交雷达怎么说？”在面试中使用社交雷达不仅仅是我们挑选成功创始人的方法。"
    },
    {
      "original": "It was also how we picked founders who were good people. At first we did this because we couldn't help it. Imagine what it would feel like to have x-ray vision for character. Being around bad people would be intolerable.",
      "translated": "这也是我们选择品行良好的创始人的方式。起初，我们这样做是因为无法避免。想象一下，如果你有透视性格的能力，与不良之人相处将变得无法忍受。"
    },
    {
      "original": "So we'd refuse to fund founders whose characters we had doubts about even if we thought they'd be successful.Though we initially did this out of self-indulgence, it turned out to be very valuable to YC.",
      "translated": "因此，即使我们认为他们可能会成功，我们也会拒绝资助那些我们对其品格有疑虑的创始人。虽然我们最初这样做是出于自我满足，但事实证明这对YC非常有价值。"
    },
    {
      "original": "We didn't realize it in the beginning, but the people we were picking would become the YC alumni network. And once we picked them, unless they did something really egregious, they were going to be part of it for life.",
      "translated": "一开始我们并没有意识到，但我们挑选的人将会成为YC校友网络的一员。一旦我们选择了他们，除非他们做了极其恶劣的事情，否则他们将终身属于这个网络。"
    },
    {
      "original": "Some now think YC's alumni network is its most valuable feature. I personally think YC's advice is pretty good too, but the alumni network is certainly among the most valuable features. The level of trust and helpfulness is remarkable for a group of such size.",
      "translated": "现在有些人认为YC的校友网络是其最有价值的特色。我个人也认为YC的建议相当不错，但校友网络确实是最有价值的特点之一。这样一个庞大群体的互信和乐于助人的程度令人印象深刻。"
    },
    {
      "original": "And Jessica is the main reason why.(As we later learned, it probably cost us little to reject people whose characters we had doubts about, because how good founders are and how well they do are not orthogonal.",
      "translated": "而杰西卡是主要的原因。（后来我们得知，拒绝那些我们对其人品有疑虑的人可能代价很小，因为创始人的素质和他们的表现并不是独立的。）"
    },
    {
      "original": "If bad founders succeed at all, they tend to sell early. The most successful founders are almost all good.)If Jessica was so important to YC, why don't more people realize it? Partly because I'm a writer, and writers always get disproportionate attention.",
      "translated": "如果平庸的创始人能取得成功，他们往往倾向于早早出售公司。最成功的创始人几乎都是优秀的。如果杰西卡对YC如此重要，为什么没有更多人意识到这一点？部分原因是我是一名作家，而作家总是会得到不成比例的关注。"
    },
    {
      "original": "YC's brand was initially my brand, and our applicants were people who'd read my essays. But there is another reason: Jessica hates attention. Talking to reporters makes her nervous. The thought of giving a talk paralyzes her.",
      "translated": "YC的品牌最初是我的品牌，我们的申请者都是读过我的文章的人。但还有另一个原因：杰西卡讨厌成为焦点。接受记者采访让她感到紧张。一想到要发表演讲，她就感到束手无策。"
    },
    {
      "original": "She was even uncomfortable at our wedding, because the bride is always the center of attention. [2]It's not just because she's shy that she hates attention, but because it throws off the Social Radar.",
      "translated": "她在我们婚礼上甚至感到不自在，因为新娘总是全场的焦点。这不仅因为她害羞而讨厌成为焦点，还因为这会打乱她的社交雷达。"
    },
    {
      "original": "She can't be herself. You can't watch people when everyone is watching you.Another reason attention worries her is that she hates bragging. In anything she does that's publicly visible, her biggest fear (after the obvious fear that it will be bad) is that it will seem ostentatious.",
      "translated": "她无法做自己。当所有人都在注视着你时，你无法去观察别人。另一个让她担心的是，她讨厌吹嘘。在她所做的任何公开可见的事情中，除了显而易见的担心它会很糟糕之外，她最大的恐惧就是它会显得炫耀。"
    },
    {
      "original": "She says being too modest is a common problem for women. But in her case it goes beyond that. She has a horror of ostentation so visceral it's almost a phobia.She also hates fighting. She can't do it; she just shuts down.",
      "translated": "她说女性普遍过于谦虚。但对她而言，这不仅仅是谦虚的问题。她对炫耀有着几乎可以说是恐惧的强烈反感。她也讨厌争斗。她无法争斗，只能选择回避。"
    },
    {
      "original": "And unfortunately there is a good deal of fighting in being the public face of an organization.So although Jessica more than anyone made YC unique, the very qualities that enabled her to do it mean she tends to get written out of YC's history.",
      "translated": "不幸的是，成为一家组织的公众代表往往会伴随着许多争斗。因此，尽管杰西卡比任何人都更使YC独具特色，但正是这些使她能够做到这一点的品质，也意味着她往往会从YC的历史中被忽略。"
    },
    {
      "original": "Everyone buys this story that PG started YC and his wife just kind of helped. Even YC's haters buy it. A couple years ago when people were attacking us for not funding more female founders (than exist), they all treated YC as identical with PG.",
      "translated": "大家都相信这个说法，即PG创办了YC，而他的妻子只是顺便帮了点忙。即使YC的批评者也认可这一点。几年前，当人们指责我们没有资助更多的女性创始人（相比于实际存在的）时，他们都把YC和PG视为等同。"
    },
    {
      "original": "It would have spoiled the narrative to acknowledge Jessica's central role at YC.Jessica was boiling mad that people were accusing her company of sexism. I've never seen her angrier about anything. But she did not contradict them.",
      "translated": "承认杰西卡在 YC 的核心角色会破坏这个故事。杰西卡对人们指责她的公司性别歧视感到非常愤怒。我从未见过她对任何事情如此生气。但她并没有反驳他们。"
    },
    {
      "original": "Not publicly. In private there was a great deal of profanity. And she wrote three separate essays about the question of female founders. But she could never bring herself to publish any of them. She'd seen the level of vitriol in this debate, and she shrank from engaging.",
      "translated": "没有公开。私底下，她骂了不少粗话。她还写了三篇关于女性创始人问题的文章，但始终没有勇气发表任何一篇。她目睹了这场辩论中的恶毒程度，便退缩了。"
    },
    {
      "original": "[3]It wasn't just because she disliked fighting. She's so sensitive to character that it repels her even to fight with dishonest people. The idea of mixing it up with linkbait journalists or Twitter trolls would seem to her not merely frightening, but disgusting.But Jessica knew her example as a successful female founder would encourage more women to start companies, so last year she did something YC had never done before and hired a PR firm to get her some interviews.",
      "translated": "这不仅是因为她不喜欢争斗。她对人的品性如此敏感，以至于与不诚实的人争斗都会让她反感。对她来说，和制造点击诱饵的记者或推特喷子争论不仅令人恐惧，而且令人厌恶。但杰西卡知道，她作为一位成功的女性创始人，她的榜样作用会鼓励更多女性创业，所以去年她做了一件YC从未做过的事，聘请了一家公关公司为她安排了一些采访。"
    },
    {
      "original": "At one of the first she did, the reporter brushed aside her insights about startups and turned it into a sensationalistic story about how some guy had tried to chat her up as she was waiting outside the bar where they had arranged to meet.",
      "translated": "在最初的几次采访中，记者忽略了她对创业公司的深刻见解，反而将报道重点放在了一则耸人听闻的故事上：她在酒吧外等待会面时，有个男人试图搭讪。"
    },
    {
      "original": "Jessica was mortified, partly because the guy had done nothing wrong, but more because the story treated her as a victim significant only for being a woman, rather than one of the most knowledgeable investors in the Valley.After that she told the PR firm to stop.You're not going to be hearing in the press about what Jessica has achieved.",
      "translated": "杰西卡感到非常尴尬，部分原因是那个男士并没有做错什么，但更多的是因为这个故事将她描绘成一个仅仅因为是女性而重要的受害者，而不是硅谷最有知识的投资者之一。从那以后，她告诉公关公司停止宣传。你们不会在媒体上听到杰西卡所取得的成就了。"
    },
    {
      "original": "So let me tell you what Jessica has achieved. Y Combinator is fundamentally a nexus of people, like a university. It doesn't make a product. What defines it is the people. Jessica more than anyone curated and nurtured that collection of people.",
      "translated": "让我告诉你杰西卡取得了什么成就。Y Combinator 本质上是一个人才汇聚的中心，就像一所大学。它并不生产产品。定义它的是这里的人。杰西卡比任何人都更精心地挑选和培养了这批人才。"
    },
    {
      "original": "In that sense she literally made YC.Jessica knows more about the qualities of startup founders than anyone else ever has. Her immense data set and x-ray vision are the perfect storm in that respect. The qualities of the founders are the best predictor of how a startup will do.",
      "translated": "从这个意义上说，她确实创造了YC。杰西卡对创业公司创始人的品质了解得比任何人都多。她庞大的数据集和敏锐的洞察力在这方面堪称完美风暴。创始人的品质是预测一家创业公司表现的最佳指标。"
    },
    {
      "original": "And startups are in turn the most important source of growth in mature economies.The person who knows the most about the most important factor in the growth of mature economies — that is who Jessica Livingston is.",
      "translated": "创业公司反过来是成熟经济体增长的最重要来源。而最了解成熟经济体增长最重要因素的人就是杰西卡·利文斯顿。"
    },
    {
      "original": "Doesn't that sound like someone who should be better known?Notes[1] Harj Taggar reminded me that while Jessica didn't ask many questions, they tended to be important ones:\"She was always good at sniffing out any red flags about the team or their determination and disarmingly asking the right question, which usually revealed more than the founders realized.\"[2] Or more precisely, while she likes getting attention in the sense of getting credit for what she has done, she doesn't like getting attention in the sense of being watched in real time.",
      "translated": "这听起来不像是一个应该更出名的人吗？注释[1] Harj Taggar 提醒我，虽然 Jessica 提问不多，但她的问题往往很重要：“她总是善于发现团队或他们的决心中存在的任何警示信号，并且能够以令人意想不到的方式提出正确的问题，通常会揭示出比创始人意识到的更多的信息。”[2] 或者更准确地说，虽然她喜欢因为自己的成就而受到关注，但她不喜欢在实时情况下被关注。"
    },
    {
      "original": "Unfortunately, not just for her but for a lot of people, how much you get of the former depends a lot on how much you get of the latter.Incidentally, if you saw Jessica at a public event, you would never guess she hates attention, because (a) she is very polite and (b) when she's nervous, she expresses it by smiling more.[3] The existence of people like Jessica is not just something the mainstream media needs to learn to acknowledge, but something feminists need to learn to acknowledge as well.",
      "translated": "不幸的是，这不仅对她如此，对很多人也是如此，你得到前者多少很大程度上取决于你得到后者多少。顺便说一句，如果你在公共场合看到杰西卡，你绝不会猜到她讨厌成为焦点，因为（a）她非常有礼貌，（b）当她紧张时，她会通过更多的微笑来表达。[3] 像杰西卡这样的人的存在，不仅是主流媒体需要学会承认的，也是女权主义者需要学会承认的。"
    },
    {
      "original": "There are successful women who don't like to fight. Which means if the public conversation about women consists of fighting, their voices will be silenced.There's a sort of Gresham's Law of conversations.",
      "translated": "有成功的女性不喜欢争斗。这意味着，如果关于女性的公共讨论充满了争斗，她们的声音就会被压制。这有点像对话中的格雷欣法则。"
    },
    {
      "original": "If a conversation reaches a certain level of incivility, the more thoughtful people start to leave. No one understands female founders better than Jessica. But it's unlikely anyone will ever hear her speak candidly about the topic.",
      "translated": "如果对话达到了某种不文明的程度，那些更为理智的人就会开始离开。没有人比杰西卡更了解女性创业者。但很可能没有人会再听到她坦率地谈论这个话题。"
    },
    {
      "original": "She ventured a toe in that water a while ago, and the reaction was so violent that she decided \"never again.\" Thanks to Sam Altman, Paul Buchheit, Patrick Collison, Daniel Gackle, Carolynn Levy, Jon Levy, Kirsty Nathoo, Robert Morris, Geoff Ralston, and Harj Taggar for reading drafts of this.",
      "translated": "她之前曾尝试过涉足那片水域，但反应如此强烈，以至于她决定“再也不要”。感谢Sam Altman、Paul Buchheit、Patrick Collison、Daniel Gackle、Carolynn Levy、Jon Levy、Kirsty Nathoo、Robert Morris、Geoff Ralston和Harj Taggar审阅本文的草稿。"
    },
    {
      "original": "And yes, Jessica Livingston, who made me cut surprisingly little.",
      "translated": "是的，Jessica Livingston，她让我删减的内容出奇地少。"
    }
  ],
  "translation_completed": "2025-07-28T15:18:36.852045",
  "translation_stats": {
    "total_paragraphs": 41,
    "success_count": 41,
    "success_rate": "100.0%"
  }
}