{
  "title": "Lies We Tell Kids",
  "title_zh": "[待翻译] Lies We Tell Kids",
  "url": "https://www.paulgraham.com/lies.html",
  "filename": "lies.html",
  "date": "2008-05-01",
  "id": 168,
  "content": {
    "success": true,
    "paragraphs": [
      "May 2008Adults lie constantly to kids. I'm not saying we should stop, but I think we should at least examine which lies we tell and why.There may also be a benefit to us. We were all lied to as kids, and some of the lies we were told still affect us.",
      "So by studying the ways adults lie to kids, we may be able to clear our heads of lies we were told.I'm using the word \"lie\" in a very general sense: not just overt falsehoods, but also all the more subtle ways we mislead kids.",
      "Though \"lie\" has negative connotations, I don't mean to suggest we should never do this—just that we should pay attention when we do. [1]One of the most remarkable things about the way we lie to kids is how broad the conspiracy is.",
      "All adults know what their culture lies to kids about: they're the questions you answer \"Ask your parents.\" If a kid asked who won the World Series in 1982 or what the atomic weight of carbon was, you could just tell him.",
      "But if a kid asks you \"Is there a God?\" or \"What's a prostitute?\" you'll probably say \"Ask your parents.\"Since we all agree, kids see few cracks in the view of the world presented to them. The biggest disagreements are between parents and schools, but even those are small.",
      "Schools are careful what they say about controversial topics, and if they do contradict what parents want their kids to believe, parents either pressure the school into keeping quiet or move their kids to a new school.The conspiracy is so thorough that most kids who discover it do so only by discovering internal contradictions in what they're told.",
      "It can be traumatic for the ones who wake up during the operation. Here's what happened to Einstein: Through the reading of popular scientific books I soon reached the conviction that much in the stories of the Bible could not be true.",
      "The consequence was a positively fanatic freethinking coupled with the impression that youth is intentionally being deceived by the state through lies: it was a crushing impression. [2] I remember that feeling.",
      "By 15 I was convinced the world was corrupt from end to end. That's why movies like The Matrix have such resonance. Every kid grows up in a fake world. In a way it would be easier if the forces behind it were as clearly differentiated as a bunch of evil machines, and one could make a clean break just by taking a pill.",
      "ProtectionIf you ask adults why they lie to kids, the most common reason they give is to protect them. And kids do need protecting. The environment you want to create for a newborn child will be quite unlike the streets of a big city.That seems so obvious it seems wrong to call it a lie.",
      "It's certainly not a bad lie to tell, to give a baby the impression the world is quiet and warm and safe. But this harmless type of lie can turn sour if left unexamined.Imagine if you tried to keep someone in as protected an environment as a newborn till age 18.",
      "To mislead someone so grossly about the world would seem not protection but abuse. That's an extreme example, of course; when parents do that sort of thing it becomes national news. But you see the same problem on a smaller scale in the malaise teenagers feel in suburbia.The main purpose of suburbia is to provide a protected environment for children to grow up in.",
      "And it seems great for 10 year olds. I liked living in suburbia when I was 10. I didn't notice how sterile it was. My whole world was no bigger than a few friends' houses I bicycled to and some woods I ran around in.",
      "On a log scale I was midway between crib and globe. A suburban street was just the right size. But as I grew older, suburbia started to feel suffocatingly fake.Life can be pretty good at 10 or 20, but it's often frustrating at 15.",
      "This is too big a problem to solve here, but certainly one reason life sucks at 15 is that kids are trapped in a world designed for 10 year olds.What do parents hope to protect their children from by raising them in suburbia?",
      "A friend who moved out of Manhattan said merely that her 3 year old daughter \"saw too much.\" Off the top of my head, that might include: people who are high or drunk, poverty, madness, gruesome medical conditions, sexual behavior of various degrees of oddness, and violent anger.I think it's the anger that would worry me most if I had a 3 year old.",
      "I was 29 when I moved to New York and I was surprised even then. I wouldn't want a 3 year old to see some of the disputes I saw. It would be too frightening. A lot of the things adults conceal from smaller children, they conceal because they'd be frightening, not because they want to conceal the existence of such things.",
      "Misleading the child is just a byproduct.This seems one of the most justifiable types of lying adults do to kids. But because the lies are indirect we don't keep a very strict accounting of them. Parents know they've concealed the facts about sex, and many at some point sit their kids down and explain more.",
      "But few tell their kids about the differences between the real world and the cocoon they grew up in. Combine this with the confidence parents try to instill in their kids, and every year you get a new crop of 18 year olds who think they know how to run the world.Don't all 18 year olds think they know how to run the world?",
      "Actually this seems to be a recent innovation, no more than about 100 years old. In preindustrial times teenage kids were junior members of the adult world and comparatively well aware of their shortcomings.",
      "They could see they weren't as strong or skillful as the village smith. In past times people lied to kids about some things more than we do now, but the lies implicit in an artificial, protected environment are a recent invention.",
      "Like a lot of new inventions, the rich got this first. Children of kings and great magnates were the first to grow up out of touch with the world. Suburbia means half the population can live like kings in that respect.",
      "Sex (and Drugs)I'd have different worries about raising teenage kids in New York. I'd worry less about what they'd see, and more about what they'd do. I went to college with a lot of kids who grew up in Manhattan, and as a rule they seemed pretty jaded.",
      "They seemed to have lost their virginity at an average of about 14 and by college had tried more drugs than I'd even heard of.The reasons parents don't want their teenage kids having sex are complex.",
      "There are some obvious dangers: pregnancy and sexually transmitted diseases. But those aren't the only reasons parents don't want their kids having sex. The average parents of a 14 year old girl would hate the idea of her having sex even if there were zero risk of pregnancy or sexually transmitted diseases.Kids can probably sense they aren't being told the whole story.",
      "After all, pregnancy and sexually transmitted diseases are just as much a problem for adults, and they have sex.What really bothers parents about their teenage kids having sex? Their dislike of the idea is so visceral it's probably inborn.",
      "But if it's inborn it should be universal, and there are plenty of societies where parents don't mind if their teenage kids have sex—indeed, where it's normal for 14 year olds to become mothers. So what's going on?",
      "There does seem to be a universal taboo against sex with prepubescent children. One can imagine evolutionary reasons for that. And I think this is the main reason parents in industrialized societies dislike teenage kids having sex.",
      "They still think of them as children, even though biologically they're not, so the taboo against child sex still has force.One thing adults conceal about sex they also conceal about drugs: that it can cause great pleasure.",
      "That's what makes sex and drugs so dangerous. The desire for them can cloud one's judgement—which is especially frightening when the judgement being clouded is the already wretched judgement of a teenage kid.Here parents' desires conflict.",
      "Older societies told kids they had bad judgement, but modern parents want their children to be confident. This may well be a better plan than the old one of putting them in their place, but it has the side effect that after having implicitly lied to kids about how good their judgement is, we then have to lie again about all the things they might get into trouble with if they believed us.If parents told their kids the truth about sex and drugs, it would be: the reason you should avoid these things is that you have lousy judgement.",
      "People with twice your experience still get burned by them. But this may be one of those cases where the truth wouldn't be convincing, because one of the symptoms of bad judgement is believing you have good judgement.",
      "When you're too weak to lift something, you can tell, but when you're making a decision impetuously, you're all the more sure of it. InnocenceAnother reason parents don't want their kids having sex is that they want to keep them innocent.",
      "Adults have a certain model of how kids are supposed to behave, and it's different from what they expect of other adults.One of the most obvious differences is the words kids are allowed to use. Most parents use words when talking to other adults that they wouldn't want their kids using.",
      "They try to hide even the existence of these words for as long as they can. And this is another of those conspiracies everyone participates in: everyone knows you're not supposed to swear in front of kids.I've never heard more different explanations for anything parents tell kids than why they shouldn't swear.",
      "Every parent I know forbids their children to swear, and yet no two of them have the same justification. It's clear most start with not wanting kids to swear, then make up the reason afterward.So my theory about what's going on is that the function of swearwords is to mark the speaker as an adult.",
      "There's no difference in the meaning of \"shit\" and \"poopoo.\" So why should one be ok for kids to say and one forbidden? The only explanation is: by definition. [3]Why does it bother adults so much when kids do things reserved for adults?",
      "The idea of a foul-mouthed, cynical 10 year old leaning against a lamppost with a cigarette hanging out of the corner of his mouth is very disconcerting. But why?One reason we want kids to be innocent is that we're programmed to like certain kinds of helplessness.",
      "I've several times heard mothers say they deliberately refrained from correcting their young children's mispronunciations because they were so cute. And if you think about it, cuteness is helplessness.",
      "Toys and cartoon characters meant to be cute always have clueless expressions and stubby, ineffectual limbs.It's not surprising we'd have an inborn desire to love and protect helpless creatures, considering human offspring are so helpless for so long.",
      "Without the helplessness that makes kids cute, they'd be very annoying. They'd merely seem like incompetent adults. But there's more to it than that. The reason our hypothetical jaded 10 year old bothers me so much is not just that he'd be annoying, but that he'd have cut off his prospects for growth so early.",
      "To be jaded you have to think you know how the world works, and any theory a 10 year old had about that would probably be a pretty narrow one.Innocence is also open-mindedness. We want kids to be innocent so they can continue to learn.",
      "Paradoxical as it sounds, there are some kinds of knowledge that get in the way of other kinds of knowledge. If you're going to learn that the world is a brutal place full of people trying to take advantage of one another, you're better off learning it last.",
      "Otherwise you won't bother learning much more.Very smart adults often seem unusually innocent, and I don't think this is a coincidence. I think they've deliberately avoided learning about certain things.",
      "Certainly I do. I used to think I wanted to know everything. Now I know I don't. DeathAfter sex, death is the topic adults lie most conspicuously about to kids. Sex I believe they conceal because of deep taboos.",
      "But why do we conceal death from kids? Probably because small children are particularly horrified by it. They want to feel safe, and death is the ultimate threat.One of the most spectacular lies our parents told us was about the death of our first cat.",
      "Over the years, as we asked for more details, they were compelled to invent more, so the story grew quite elaborate. The cat had died at the vet's office. Of what? Of the anaesthesia itself. Why was the cat at the vet's office?",
      "To be fixed. And why had such a routine operation killed it? It wasn't the vet's fault; the cat had a congenitally weak heart; the anaesthesia was too much for it; but there was no way anyone could have known this in advance.",
      "It was not till we were in our twenties that the truth came out: my sister, then about three, had accidentally stepped on the cat and broken its back.They didn't feel the need to tell us the cat was now happily in cat heaven.",
      "My parents never claimed that people or animals who died had \"gone to a better place,\" or that we'd meet them again. It didn't seem to harm us.My grandmother told us an edited version of the death of my grandfather.",
      "She said they'd been sitting reading one day, and when she said something to him, he didn't answer. He seemed to be asleep, but when she tried to rouse him, she couldn't. \"He was gone.\" Having a heart attack sounded like falling asleep.",
      "Later I learned it hadn't been so neat, and the heart attack had taken most of a day to kill him.Along with such outright lies, there must have been a lot of changing the subject when death came up. I can't remember that, of course, but I can infer it from the fact that I didn't really grasp I was going to die till I was about 19.",
      "How could I have missed something so obvious for so long? Now that I've seen parents managing the subject, I can see how: questions about death are gently but firmly turned aside.On this topic, especially, they're met half-way by kids.",
      "Kids often want to be lied to. They want to believe they're living in a comfortable, safe world as much as their parents want them to believe it. [4] IdentitySome parents feel a strong adherence to an ethnic or religious group and want their kids to feel it too.",
      "This usually requires two different kinds of lying: the first is to tell the child that he or she is an X, and the second is whatever specific lies Xes differentiate themselves by believing. [5]Telling a child they have a particular ethnic or religious identity is one of the stickiest things you can tell them.",
      "Almost anything else you tell a kid, they can change their mind about later when they start to think for themselves. But if you tell a kid they're a member of a certain group, that seems nearly impossible to shake.This despite the fact that it can be one of the most premeditated lies parents tell.",
      "When parents are of different religions, they'll often agree between themselves that their children will be \"raised as Xes.\" And it works. The kids obligingly grow up considering themselves as Xes, despite the fact that if their parents had chosen the other way, they'd have grown up considering themselves as Ys.One reason this works so well is the second kind of lie involved.",
      "The truth is common property. You can't distinguish your group by doing things that are rational, and believing things that are true. If you want to set yourself apart from other people, you have to do things that are arbitrary, and believe things that are false.",
      "And after having spent their whole lives doing things that are arbitrary and believing things that are false, and being regarded as odd by \"outsiders\" on that account, the cognitive dissonance pushing children to regard themselves as Xes must be enormous.",
      "If they aren't an X, why are they attached to all these arbitrary beliefs and customs? If they aren't an X, why do all the non-Xes call them one?This form of lie is not without its uses. You can use it to carry a payload of beneficial beliefs, and they will also become part of the child's identity.",
      "You can tell the child that in addition to never wearing the color yellow, believing the world was created by a giant rabbit, and always snapping their fingers before eating fish, Xes are also particularly honest and industrious.",
      "Then X children will grow up feeling it's part of their identity to be honest and industrious.This probably accounts for a lot of the spread of modern religions, and explains why their doctrines are a combination of the useful and the bizarre.",
      "The bizarre half is what makes the religion stick, and the useful half is the payload. [6] AuthorityOne of the least excusable reasons adults lie to kids is to maintain power over them. Sometimes these lies are truly sinister, like a child molester telling his victims they'll get in trouble if they tell anyone what happened to them.",
      "Others seem more innocent; it depends how badly adults lie to maintain their power, and what they use it for.Most adults make some effort to conceal their flaws from children. Usually their motives are mixed.",
      "For example, a father who has an affair generally conceals it from his children. His motive is partly that it would worry them, partly that this would introduce the topic of sex, and partly (a larger part than he would admit) that he doesn't want to tarnish himself in their eyes.If you want to learn what lies are told to kids, read almost any book written to teach them about \"issues.\" [7] Peter Mayle wrote one called Why Are We Getting a Divorce?",
      "It begins with the three most important things to remember about divorce, one of which is: You shouldn't put the blame on one parent, because divorce is never only one person's fault. [8] Really? When a man runs off with his secretary, is it always partly his wife's fault?",
      "But I can see why Mayle might have said this. Maybe it's more important for kids to respect their parents than to know the truth about them.But because adults conceal their flaws, and at the same time insist on high standards of behavior for kids, a lot of kids grow up feeling they fall hopelessly short.",
      "They walk around feeling horribly evil for having used a swearword, while in fact most of the adults around them are doing much worse things.This happens in intellectual as well as moral questions. The more confident people are, the more willing they seem to be to answer a question \"I don't know.\" Less confident people feel they have to have an answer or they'll look bad.",
      "My parents were pretty good about admitting when they didn't know things, but I must have been told a lot of lies of this type by teachers, because I rarely heard a teacher say \"I don't know\" till I got to college.",
      "I remember because it was so surprising to hear someone say that in front of a class.The first hint I had that teachers weren't omniscient came in sixth grade, after my father contradicted something I'd learned in school.",
      "When I protested that the teacher had said the opposite, my father replied that the guy had no idea what he was talking about—that he was just an elementary school teacher, after all.Just a teacher? The phrase seemed almost grammatically ill-formed.",
      "Didn't teachers know everything about the subjects they taught? And if not, why were they the ones teaching us?The sad fact is, US public school teachers don't generally understand the stuff they're teaching very well.",
      "There are some sterling exceptions, but as a rule people planning to go into teaching rank academically near the bottom of the college population. So the fact that I still thought at age 11 that teachers were infallible shows what a job the system must have done on my brain.",
      "SchoolWhat kids get taught in school is a complex mix of lies. The most excusable are those told to simplify ideas to make them easy to learn. The problem is, a lot of propaganda gets slipped into the curriculum in the name of simplification.Public school textbooks represent a compromise between what various powerful groups want kids to be told.",
      "The lies are rarely overt. Usually they consist either of omissions or of over-emphasizing certain topics at the expense of others. The view of history we got in elementary school was a crude hagiography, with at least one representative of each powerful group.The famous scientists I remember were Einstein, Marie Curie, and George Washington Carver.",
      "Einstein was a big deal because his work led to the atom bomb. Marie Curie was involved with X-rays. But I was mystified about Carver. He seemed to have done stuff with peanuts.It's obvious now that he was on the list because he was black (and for that matter that Marie Curie was on it because she was a woman), but as a kid I was confused for years about him.",
      "I wonder if it wouldn't have been better just to tell us the truth: that there weren't any famous black scientists. Ranking George Washington Carver with Einstein misled us not only about science, but about the obstacles blacks faced in his time.As subjects got softer, the lies got more frequent.",
      "By the time you got to politics and recent history, what we were taught was pretty much pure propaganda. For example, we were taught to regard political leaders as saints—especially the recently martyred Kennedy and King.",
      "It was astonishing to learn later that they'd both been serial womanizers, and that Kennedy was a speed freak to boot. (By the time King's plagiarism emerged, I'd lost the ability to be surprised by the misdeeds of famous people.)I doubt you could teach kids recent history without teaching them lies, because practically everyone who has anything to say about it has some kind of spin to put on it.",
      "Much recent history consists of spin. It would probably be better just to teach them metafacts like that.Probably the biggest lie told in schools, though, is that the way to succeed is through following \"the rules.\" In fact most such rules are just hacks to manage large groups efficiently.",
      "PeaceOf all the reasons we lie to kids, the most powerful is probably the same mundane reason they lie to us.Often when we lie to people it's not part of any conscious strategy, but because they'd react violently to the truth.",
      "Kids, almost by definition, lack self-control. They react violently to things—and so they get lied to a lot. [9]A few Thanksgivings ago, a friend of mine found himself in a situation that perfectly illustrates the complex motives we have when we lie to kids.",
      "As the roast turkey appeared on the table, his alarmingly perceptive 5 year old son suddenly asked if the turkey had wanted to die. Foreseeing disaster, my friend and his wife rapidly improvised: yes, the turkey had wanted to die, and in fact had lived its whole life with the aim of being their Thanksgiving dinner.",
      "And that (phew) was the end of that.Whenever we lie to kids to protect them, we're usually also lying to keep the peace.One consequence of this sort of calming lie is that we grow up thinking horrible things are normal.",
      "It's hard for us to feel a sense of urgency as adults over something we've literally been trained not to worry about. When I was about 10 I saw a documentary on pollution that put me into a panic. It seemed the planet was being irretrievably ruined.",
      "I went to my mother afterward to ask if this was so. I don't remember what she said, but she made me feel better, so I stopped worrying about it.That was probably the best way to handle a frightened 10 year old.",
      "But we should understand the price. This sort of lie is one of the main reasons bad things persist: we're all trained to ignore them. DetoxA sprinter in a race almost immediately enters a state called \"oxygen debt.\" His body switches to an emergency source of energy that's faster than regular aerobic respiration.",
      "But this process builds up waste products that ultimately require extra oxygen to break down, so at the end of the race he has to stop and pant for a while to recover.We arrive at adulthood with a kind of truth debt.",
      "We were told a lot of lies to get us (and our parents) through our childhood. Some may have been necessary. Some probably weren't. But we all arrive at adulthood with heads full of lies.There's never a point where the adults sit you down and explain all the lies they told you.",
      "They've forgotten most of them. So if you're going to clear these lies out of your head, you're going to have to do it yourself.Few do. Most people go through life with bits of packing material adhering to their minds and never know it.",
      "You probably never can completely undo the effects of lies you were told as a kid, but it's worth trying. I've found that whenever I've been able to undo a lie I was told, a lot of other things fell into place.Fortunately, once you arrive at adulthood you get a valuable new resource you can use to figure out what lies you were told.",
      "You're now one of the liars. You get to watch behind the scenes as adults spin the world for the next generation of kids.The first step in clearing your head is to realize how far you are from a neutral observer.",
      "When I left high school I was, I thought, a complete skeptic. I'd realized high school was crap. I thought I was ready to question everything I knew. But among the many other things I was ignorant of was how much debris there already was in my head.",
      "It's not enough to consider your mind a blank slate. You have to consciously erase it. Notes[1] One reason I stuck with such a brutally simple word is that the lies we tell kids are probably not quite as harmless as we think.",
      "If you look at what adults told children in the past, it's shocking how much they lied to them. Like us, they did it with the best intentions. So if we think we're as open as one could reasonably be with children, we're probably fooling ourselves.",
      "Odds are people in 100 years will be as shocked at some of the lies we tell as we are at some of the lies people told 100 years ago.I can't predict which these will be, and I don't want to write an essay that will seem dumb in 100 years.",
      "So instead of using special euphemisms for lies that seem excusable according to present fashions, I'm just going to call all our lies lies.(I have omitted one type: lies told to play games with kids' credulity.",
      "These range from \"make-believe,\" which is not really a lie because it's told with a wink, to the frightening lies told by older siblings. There's not much to say about these: I wouldn't want the first type to go away, and wouldn't expect the second type to.)[2] Calaprice, Alice (ed.), The Quotable Einstein, Princeton University Press, 1996.[3] If you ask parents why kids shouldn't swear, the less educated ones usually reply with some question-begging answer like \"it's inappropriate,\" while the more educated ones come up with elaborate rationalizations.",
      "In fact the less educated parents seem closer to the truth.[4] As a friend with small children pointed out, it's easy for small children to consider themselves immortal, because time seems to pass so slowly for them.",
      "To a 3 year old, a day feels like a month might to an adult. So 80 years sounds to him like 2400 years would to us.[5] I realize I'm going to get endless grief for classifying religion as a type of lie.",
      "Usually people skirt that issue with some equivocation implying that lies believed for a sufficiently long time by sufficiently large numbers of people are immune to the usual standards for truth. But because I can't predict which lies future generations will consider inexcusable, I can't safely omit any type we tell.",
      "Yes, it seems unlikely that religion will be out of fashion in 100 years, but no more unlikely than it would have seemed to someone in 1880 that schoolchildren in 1980 would be taught that masturbation was perfectly normal and not to feel guilty about it.[6] Unfortunately the payload can consist of bad customs as well as good ones.",
      "For example, there are certain qualities that some groups in America consider \"acting white.\" In fact most of them could as accurately be called \"acting Japanese.\" There's nothing specifically white about such customs.",
      "They're common to all cultures with long traditions of living in cities. So it is probably a losing bet for a group to consider behaving the opposite way as part of its identity.[7] In this context, \"issues\" basically means \"things we're going to lie to them about.\" That's why there's a special name for these topics.[8] Mayle, Peter, Why Are We Getting a Divorce?, Harmony, 1988.[9] The ironic thing is, this is also the main reason kids lie to adults.",
      "If you freak out when people tell you alarming things, they won't tell you them. Teenagers don't tell their parents what happened that night they were supposed to be staying at a friend's house for the same reason parents don't tell 5 year olds the truth about the Thanksgiving turkey.",
      "They'd freak if they knew. Thanks to Sam Altman, Marc Andreessen, Trevor Blackwell, Patrick Collison, Jessica Livingston, Jackie McDonough, Robert Morris, and David Sloo for reading drafts of this. And since there are some controversial ideas here, I should add that none of them agreed with everything in it.German TranslationFrench TranslationRussian Translation"
    ],
    "word_count": 5169,
    "paragraph_count": 106
  },
  "processed_at": "2025-07-26T19:06:50.451704",
  "paragraphs": [
    {
      "original": "May 2008Adults lie constantly to kids. I'm not saying we should stop, but I think we should at least examine which lies we tell and why.There may also be a benefit to us. We were all lied to as kids, and some of the lies we were told still affect us.",
      "translated": "2008年5月\n成年人经常对孩子们撒谎。我不是说我们应该停止这样做，但我认为我们应该至少审视一下我们对孩子们撒的哪些谎以及为什么撒这些谎。这样做对我们也许也有好处。我们小时候都被撒过谎，其中一些谎言至今仍然影响着我们。"
    },
    {
      "original": "So by studying the ways adults lie to kids, we may be able to clear our heads of lies we were told.I'm using the word \"lie\" in a very general sense: not just overt falsehoods, but also all the more subtle ways we mislead kids.",
      "translated": "因此，通过研究成年人如何对孩子们撒谎，我们或许能够清除脑海中曾被灌输的谎言。我在这里使用的“谎言”一词具有广泛的含义：不仅指明显的虚假陈述，还包括我们误导孩子时所采用的所有更微妙的方式。"
    },
    {
      "original": "Though \"lie\" has negative connotations, I don't mean to suggest we should never do this—just that we should pay attention when we do. [1]One of the most remarkable things about the way we lie to kids is how broad the conspiracy is.",
      "translated": "虽然“撒谎”带有负面含义，但我的意思并不是说我们永远不应该这样做——只是说我们应该在这样做时保持警惕。[1]我们对孩子们撒谎的方式中最令人惊讶的一点是，这种行为的共谋范围有多么广泛。"
    },
    {
      "original": "All adults know what their culture lies to kids about: they're the questions you answer \"Ask your parents.\" If a kid asked who won the World Series in 1982 or what the atomic weight of carbon was, you could just tell him.",
      "translated": "所有成年人都知道文化对孩子们撒了哪些谎：这些问题你通常会回答“去问你的父母。”如果孩子问1982年谁赢得了世界系列赛或碳的原子量是多少，你可以直接告诉他。"
    },
    {
      "original": "But if a kid asks you \"Is there a God?\" or \"What's a prostitute?\" you'll probably say \"Ask your parents.\"Since we all agree, kids see few cracks in the view of the world presented to them. The biggest disagreements are between parents and schools, but even those are small.",
      "translated": "但如果孩子问你“有上帝吗？”或“妓女是什么？”你大概会说“去问你的父母。”既然我们都同意，孩子们看到的这个世界观的裂痕就很少。最大的分歧是在父母和学校之间，但即使是这些分歧也很小。"
    },
    {
      "original": "Schools are careful what they say about controversial topics, and if they do contradict what parents want their kids to believe, parents either pressure the school into keeping quiet or move their kids to a new school.The conspiracy is so thorough that most kids who discover it do so only by discovering internal contradictions in what they're told.",
      "translated": "学校在谈论有争议的话题时非常谨慎，如果学校的观点与家长希望孩子相信的相悖，家长要么向学校施压要求保持沉默，要么将孩子转到另一所学校。这一合谋如此彻底，以至于大多数孩子只有在发现他们被告知的内容中的内在矛盾时，才会意识到这一点。"
    },
    {
      "original": "It can be traumatic for the ones who wake up during the operation. Here's what happened to Einstein: Through the reading of popular scientific books I soon reached the conviction that much in the stories of the Bible could not be true.",
      "translated": "在手术中醒来对患者来说可能是创伤性的。以下是爱因斯坦的经历：通过阅读科普书籍，我很快就得出了这样的结论：《圣经》中的许多故事不可能是真实的。"
    },
    {
      "original": "The consequence was a positively fanatic freethinking coupled with the impression that youth is intentionally being deceived by the state through lies: it was a crushing impression. [2] I remember that feeling.",
      "translated": "结果是一种狂热的自由思想，同时伴随着一种被国家通过谎言故意欺骗的青年的印象：这是一种令人窒息的感觉。[2] 我记得那种感觉。"
    },
    {
      "original": "By 15 I was convinced the world was corrupt from end to end. That's why movies like The Matrix have such resonance. Every kid grows up in a fake world. In a way it would be easier if the forces behind it were as clearly differentiated as a bunch of evil machines, and one could make a clean break just by taking a pill.",
      "translated": "到15岁的时候，我已经确信这个世界从头到尾都是腐败的。这就是为什么像《黑客帝国》这样的电影会产生如此大的共鸣。每个孩子都是在一个虚假的世界中长大的。在某种意义上，如果背后的势力像一群邪恶的机器那样分明，只需吃一颗药丸就能彻底摆脱，那会更容易。"
    },
    {
      "original": "ProtectionIf you ask adults why they lie to kids, the most common reason they give is to protect them. And kids do need protecting. The environment you want to create for a newborn child will be quite unlike the streets of a big city.That seems so obvious it seems wrong to call it a lie.",
      "translated": "保护如果你问成年人为什么要对孩子撒谎，他们最常见的理由是为了保护孩子。孩子确实需要保护。你为新生儿创造的环境将与大城市的街道大不相同。这一点如此显而易见，以至于称之为谎言似乎都不恰当。"
    },
    {
      "original": "It's certainly not a bad lie to tell, to give a baby the impression the world is quiet and warm and safe. But this harmless type of lie can turn sour if left unexamined.Imagine if you tried to keep someone in as protected an environment as a newborn till age 18.",
      "translated": "当然，说这种谎话并不坏，给婴儿一种世界是安静、温暖和安全的印象。但这种无害的谎言如果未经审视，也会变质。试想，如果你试图让一个人像新生儿一样，在一个如此受保护的环境中生活到18岁。"
    },
    {
      "original": "To mislead someone so grossly about the world would seem not protection but abuse. That's an extreme example, of course; when parents do that sort of thing it becomes national news. But you see the same problem on a smaller scale in the malaise teenagers feel in suburbia.The main purpose of suburbia is to provide a protected environment for children to grow up in.",
      "translated": "如此严重地误导某人对世界的认识，似乎不是保护而是虐待。当然，这是一个极端的例子；当父母这样做时，就会成为全国新闻。但在郊区青少年感到的不适中，你可以看到同样的问题，只是规模较小。郊区的主要目的是为孩子们提供一个受保护的成长环境。"
    },
    {
      "original": "And it seems great for 10 year olds. I liked living in suburbia when I was 10. I didn't notice how sterile it was. My whole world was no bigger than a few friends' houses I bicycled to and some woods I ran around in.",
      "translated": "而且对于10岁的孩子来说似乎很好。我10岁时喜欢住在郊区。当时并没有注意到那里的单调。我的整个世界不过是我骑自行车去的几个朋友家和我跑来跑去的树林。"
    },
    {
      "original": "On a log scale I was midway between crib and globe. A suburban street was just the right size. But as I grew older, suburbia started to feel suffocatingly fake.Life can be pretty good at 10 or 20, but it's often frustrating at 15.",
      "translated": "在对数尺度上，我处于摇篮和地球之间的中点。一条郊区街道正好合适。但随着年龄的增长，郊区开始让我感到窒息般的虚假。生活可以在10岁或20岁时相当美好，但在15岁时往往令人感到沮丧。"
    },
    {
      "original": "This is too big a problem to solve here, but certainly one reason life sucks at 15 is that kids are trapped in a world designed for 10 year olds.What do parents hope to protect their children from by raising them in suburbia?",
      "translated": "这是一个太大、无法在这里解决的问题，但可以肯定的是，15岁的生活之所以糟糕，部分原因是孩子们被困在一个为10岁孩子设计的世界里。家长们希望通过在郊区抚养孩子来保护他们免受什么伤害呢？"
    },
    {
      "original": "A friend who moved out of Manhattan said merely that her 3 year old daughter \"saw too much.\" Off the top of my head, that might include: people who are high or drunk, poverty, madness, gruesome medical conditions, sexual behavior of various degrees of oddness, and violent anger.I think it's the anger that would worry me most if I had a 3 year old.",
      "translated": "一位搬出曼哈顿的朋友只是说她三岁的女儿“见得太多了。”仅凭直觉，这可能包括：吸毒或醉酒的人、贫困、疯癫、可怕的疾病状况、各种不同程度的异常性行为，以及暴力愤怒。如果我有三岁的孩子，我最担心的大概就是这股怒气。"
    },
    {
      "original": "I was 29 when I moved to New York and I was surprised even then. I wouldn't want a 3 year old to see some of the disputes I saw. It would be too frightening. A lot of the things adults conceal from smaller children, they conceal because they'd be frightening, not because they want to conceal the existence of such things.",
      "translated": "我29岁的时候搬到纽约，当时我就感到惊讶。我不会希望一个3岁的孩子看到我所见到的一些争执。那会太吓人了。成年人对小孩子隐瞒的许多事情，之所以隐瞒是因为这些事情会吓到他们，而不是因为他们想隐瞒这些事情的存在。"
    },
    {
      "original": "Misleading the child is just a byproduct.This seems one of the most justifiable types of lying adults do to kids. But because the lies are indirect we don't keep a very strict accounting of them. Parents know they've concealed the facts about sex, and many at some point sit their kids down and explain more.",
      "translated": "误导孩子只是副产品。这似乎是成人对孩子撒谎中最可接受的一种。但因为这些谎言是间接的，所以我们并没有对此进行严格的记录。父母知道他们对性事实有所隐瞒，许多人在某个时候会坐下来向孩子解释更多。"
    },
    {
      "original": "But few tell their kids about the differences between the real world and the cocoon they grew up in. Combine this with the confidence parents try to instill in their kids, and every year you get a new crop of 18 year olds who think they know how to run the world.Don't all 18 year olds think they know how to run the world?",
      "translated": "但很少有人向他们的孩子讲述现实世界与他们成长的温室之间的差异。再加上父母试图灌输给孩子的自信，每年都会有一批18岁的孩子认为自己知道如何管理世界。难道不是所有的18岁孩子都认为自己知道如何管理世界吗？"
    },
    {
      "original": "Actually this seems to be a recent innovation, no more than about 100 years old. In preindustrial times teenage kids were junior members of the adult world and comparatively well aware of their shortcomings.",
      "translated": "实际上，这似乎是近一百年内的新事物。在工业化前的时代，青少年是成人世界的初级成员，相对来说对自己的不足有较为清楚的认识。"
    },
    {
      "original": "They could see they weren't as strong or skillful as the village smith. In past times people lied to kids about some things more than we do now, but the lies implicit in an artificial, protected environment are a recent invention.",
      "translated": "他们可以看出自己既没有村里的铁匠那么强壮，也没有那么熟练。过去的人们在某些事情上对孩子的谎言比现在更多，但那种人为制造的、受保护的环境所隐含的谎言却是最近的发明。"
    },
    {
      "original": "Like a lot of new inventions, the rich got this first. Children of kings and great magnates were the first to grow up out of touch with the world. Suburbia means half the population can live like kings in that respect.",
      "translated": "像许多新发明一样，富人最先享用。国王和大亨的孩子们是最早脱离现实世界长大的。郊区生活意味着在这方面有一半的人可以像国王一样生活。"
    },
    {
      "original": "Sex (and Drugs)I'd have different worries about raising teenage kids in New York. I'd worry less about what they'd see, and more about what they'd do. I went to college with a lot of kids who grew up in Manhattan, and as a rule they seemed pretty jaded.",
      "translated": "性和（毒品）我在纽约抚养青少年孩子会有不同的担忧。我会更担心他们会做什么，而不是他们会看到什么。我在大学时认识很多在曼哈顿长大的孩子，他们普遍显得很世故。"
    },
    {
      "original": "They seemed to have lost their virginity at an average of about 14 and by college had tried more drugs than I'd even heard of.The reasons parents don't want their teenage kids having sex are complex.",
      "translated": "他们似乎在大约14岁时就失去了童贞，到大学时已经尝试过比我听说过的还要多的毒品。父母不希望他们的孩子在青少年时期发生性行为的原因是复杂的。"
    },
    {
      "original": "There are some obvious dangers: pregnancy and sexually transmitted diseases. But those aren't the only reasons parents don't want their kids having sex. The average parents of a 14 year old girl would hate the idea of her having sex even if there were zero risk of pregnancy or sexually transmitted diseases.Kids can probably sense they aren't being told the whole story.",
      "translated": "有一些显而易见的危险：怀孕和性传播疾病。但这些并不是父母不希望孩子发生性行为的唯一原因。即使没有怀孕或性传播疾病的风险，大多数14岁女孩的父母也会非常反对她发生性行为。孩子们可能感觉到他们并没有被告知全部的事实。"
    },
    {
      "original": "After all, pregnancy and sexually transmitted diseases are just as much a problem for adults, and they have sex.What really bothers parents about their teenage kids having sex? Their dislike of the idea is so visceral it's probably inborn.",
      "translated": "毕竟，怀孕和性传播疾病对成年人来说也是问题，而成年人也会有性行为。那么，父母真正担心的是他们的青少年孩子有性行为的什么呢？他们对这个想法的厌恶如此强烈，以至于可能是与生俱来的。"
    },
    {
      "original": "But if it's inborn it should be universal, and there are plenty of societies where parents don't mind if their teenage kids have sex—indeed, where it's normal for 14 year olds to become mothers. So what's going on?",
      "translated": "但如果这是与生俱来的，那么应该是普遍存在的，而事实上有很多社会中，父母并不介意他们的十几岁孩子发生性行为——事实上，14岁的女孩成为母亲也是正常的。那么，这到底是怎么回事？"
    },
    {
      "original": "There does seem to be a universal taboo against sex with prepubescent children. One can imagine evolutionary reasons for that. And I think this is the main reason parents in industrialized societies dislike teenage kids having sex.",
      "translated": "确实存在一种普遍的禁忌，反对与未到青春期的儿童发生性行为。可以想象这种禁忌背后有进化上的原因。我认为这也是工业社会中的父母不喜欢青少年发生性行为的主要原因。"
    },
    {
      "original": "They still think of them as children, even though biologically they're not, so the taboo against child sex still has force.One thing adults conceal about sex they also conceal about drugs: that it can cause great pleasure.",
      "translated": "他们仍然将这些人视为孩子，尽管从生物学上来说他们已经不是孩子了，因此对儿童性行为的禁忌仍然有效。成人对性所隐瞒的一点，同样也适用于毒品：那就是它们能带来极大的快感。"
    },
    {
      "original": "That's what makes sex and drugs so dangerous. The desire for them can cloud one's judgement—which is especially frightening when the judgement being clouded is the already wretched judgement of a teenage kid.Here parents' desires conflict.",
      "translated": "这就是性与毒品之所以如此危险的原因。对它们的渴望会蒙蔽人的判断力——当这种判断力本身已经糟糕透顶的青少年被蒙蔽时，这尤其令人害怕。这里，父母的愿望产生了冲突。"
    },
    {
      "original": "Older societies told kids they had bad judgement, but modern parents want their children to be confident. This may well be a better plan than the old one of putting them in their place, but it has the side effect that after having implicitly lied to kids about how good their judgement is, we then have to lie again about all the things they might get into trouble with if they believed us.If parents told their kids the truth about sex and drugs, it would be: the reason you should avoid these things is that you have lousy judgement.",
      "translated": "旧社会常告诉孩子们他们的判断力很差，但现代父母希望自己的孩子充满自信。这可能比过去那种打压孩子自尊的做法要好，但也有一个副作用，那就是在暗中夸大了孩子的判断力之后，我们又不得不对他们可能因相信我们而陷入的麻烦撒谎。如果父母对孩子们坦白关于性和毒品的真相，那会是：你应该避免这些事情的原因是你现在的判断力很差。"
    },
    {
      "original": "People with twice your experience still get burned by them. But this may be one of those cases where the truth wouldn't be convincing, because one of the symptoms of bad judgement is believing you have good judgement.",
      "translated": "比你经验多一倍的人也难逃其害。但这种情况可能是，真相根本无法令人信服，因为判断力差的一个症状就是自认为判断力很好。"
    },
    {
      "original": "When you're too weak to lift something, you can tell, but when you're making a decision impetuously, you're all the more sure of it. InnocenceAnother reason parents don't want their kids having sex is that they want to keep them innocent.",
      "translated": "当你太虚弱而无法举起某物时，你可以感觉到，但当你草率地做出决定时，你反而更加确信。保持纯真另一个家长不希望孩子发生性行为的原因是他们想保持孩子的纯真。"
    },
    {
      "original": "Adults have a certain model of how kids are supposed to behave, and it's different from what they expect of other adults.One of the most obvious differences is the words kids are allowed to use. Most parents use words when talking to other adults that they wouldn't want their kids using.",
      "translated": "成年人对孩子的行为有一套既定的模式，这与他们对其他成年人的期望不同。其中一个最明显的差异在于孩子可以使用的词汇。大多数父母在与其他成年人交谈时会使用一些他们不希望孩子使用的词汇。"
    },
    {
      "original": "They try to hide even the existence of these words for as long as they can. And this is another of those conspiracies everyone participates in: everyone knows you're not supposed to swear in front of kids.I've never heard more different explanations for anything parents tell kids than why they shouldn't swear.",
      "translated": "他们尽量长时间地隐瞒这些词语的存在。这是另一种人人参与的“阴谋”：每个人都知道不应该在孩子面前说脏话。我从未听过父母对孩子解释为什么不应该说脏话时有如此多不同的说法。"
    },
    {
      "original": "Every parent I know forbids their children to swear, and yet no two of them have the same justification. It's clear most start with not wanting kids to swear, then make up the reason afterward.So my theory about what's going on is that the function of swearwords is to mark the speaker as an adult.",
      "translated": "我认识的每位家长都会禁止孩子说脏话，但没有两个人的理由是相同的。显然，大多数家长一开始只是不想让孩子说脏话，之后才编出理由。因此，我关于这一现象的理论是，脏话的功能在于将说话者标记为成年人。"
    },
    {
      "original": "There's no difference in the meaning of \"shit\" and \"poopoo.\" So why should one be ok for kids to say and one forbidden? The only explanation is: by definition. [3]Why does it bother adults so much when kids do things reserved for adults?",
      "translated": "“shit”和“poopoo”在意思上没有区别。那么为什么一个词孩子可以说，而另一个就不行呢？唯一的解释是：按定义来说。为什么当孩子做那些只有成年人才能做的事时，成年人会如此介意？"
    },
    {
      "original": "The idea of a foul-mouthed, cynical 10 year old leaning against a lamppost with a cigarette hanging out of the corner of his mouth is very disconcerting. But why?One reason we want kids to be innocent is that we're programmed to like certain kinds of helplessness.",
      "translated": "一个满口脏话、愤世嫉俗的10岁小孩靠在路灯柱上，嘴角叼着一根烟，这种景象非常令人不安。但为什么呢？我们希望孩子们保持天真无邪的一个原因是，我们天生就会对某些类型的无助产生好感。"
    },
    {
      "original": "I've several times heard mothers say they deliberately refrained from correcting their young children's mispronunciations because they were so cute. And if you think about it, cuteness is helplessness.",
      "translated": "我多次听到母亲们说，她们故意不纠正年幼孩子发音不准确的地方，因为这些错误发音很可爱。仔细想想，可爱其实就是无助的表现。"
    },
    {
      "original": "Toys and cartoon characters meant to be cute always have clueless expressions and stubby, ineffectual limbs.It's not surprising we'd have an inborn desire to love and protect helpless creatures, considering human offspring are so helpless for so long.",
      "translated": "玩具和卡通角色如果想要显得可爱，总是会有不知所措的表情和短小无用的四肢。考虑到人类的后代在很长一段时间内都非常无助，我们天生就有爱和保护无助生物的欲望，这并不令人惊讶。"
    },
    {
      "original": "Without the helplessness that makes kids cute, they'd be very annoying. They'd merely seem like incompetent adults. But there's more to it than that. The reason our hypothetical jaded 10 year old bothers me so much is not just that he'd be annoying, but that he'd have cut off his prospects for growth so early.",
      "translated": "如果没有让孩子显得可爱的那种无助，他们会非常令人厌烦。他们只会像是无能的成年人。但问题不仅如此。我之所以对这个假设中的厌世10岁孩子感到如此困扰，不仅是因为他会令人厌烦，还因为他过早地切断了自己的成长前景。"
    },
    {
      "original": "To be jaded you have to think you know how the world works, and any theory a 10 year old had about that would probably be a pretty narrow one.Innocence is also open-mindedness. We want kids to be innocent so they can continue to learn.",
      "translated": "要想变得厌世，你必须认为自己了解世界的运作方式，而一个10岁孩子对这方面的任何理论大概都会相当狭隘。纯真同时也是开放的心态。我们希望孩子们保持纯真，这样他们才能继续学习。"
    },
    {
      "original": "Paradoxical as it sounds, there are some kinds of knowledge that get in the way of other kinds of knowledge. If you're going to learn that the world is a brutal place full of people trying to take advantage of one another, you're better off learning it last.",
      "translated": "听起来有些矛盾，但确实有些知识会妨碍其他知识的获取。如果你要了解到这个世界是一个充满残酷和人们互相算计的地方，那么最好晚一些再学这些。"
    },
    {
      "original": "Otherwise you won't bother learning much more.Very smart adults often seem unusually innocent, and I don't think this is a coincidence. I think they've deliberately avoided learning about certain things.",
      "translated": "否则你不会费心去学更多。非常聪明的成年人往往显得异常天真，我认为这并非巧合。我认为他们是故意避免了解某些事情。"
    },
    {
      "original": "Certainly I do. I used to think I wanted to know everything. Now I know I don't. DeathAfter sex, death is the topic adults lie most conspicuously about to kids. Sex I believe they conceal because of deep taboos.",
      "translated": "当然，我是这样认为的。我曾经以为我想知道一切。现在我知道并非如此。关于死亡，在性之后，死亡是成年人对孩子们最明显撒谎的话题。我认为他们隐瞒性是因为根深蒂固的禁忌。"
    },
    {
      "original": "But why do we conceal death from kids? Probably because small children are particularly horrified by it. They want to feel safe, and death is the ultimate threat.One of the most spectacular lies our parents told us was about the death of our first cat.",
      "translated": "但我们为什么要对孩子们隐瞒死亡呢？可能是因为小孩子对死亡特别恐惧。他们希望感到安全，而死亡是最根本的威胁。我们的父母对我们撒的一个最惊人的谎就是关于我们第一只猫的死亡。"
    },
    {
      "original": "Over the years, as we asked for more details, they were compelled to invent more, so the story grew quite elaborate. The cat had died at the vet's office. Of what? Of the anaesthesia itself. Why was the cat at the vet's office?",
      "translated": "这些年来，随着我们不断要求更多的细节，他们不得不编造更多的情节，所以这个故事变得相当复杂。猫是在兽医诊所死的。死于什么？死于麻醉。猫为什么会在兽医诊所？"
    },
    {
      "original": "To be fixed. And why had such a routine operation killed it? It wasn't the vet's fault; the cat had a congenitally weak heart; the anaesthesia was too much for it; but there was no way anyone could have known this in advance.",
      "translated": "需要修复。为什么这样一个常规操作会要了它的命？这不是兽医的错；这只猫天生心脏虚弱；麻醉对它来说太多了；但事先谁也无法知道这一点。"
    },
    {
      "original": "It was not till we were in our twenties that the truth came out: my sister, then about three, had accidentally stepped on the cat and broken its back.They didn't feel the need to tell us the cat was now happily in cat heaven.",
      "translated": "直到我们二十多岁的时候，真相才浮出水面：当时我妹妹大约三岁，不小心踩到了猫，弄断了它的脊椎。他们觉得没有必要告诉我们，猫现在已经开心地到了猫的天堂。"
    },
    {
      "original": "My parents never claimed that people or animals who died had \"gone to a better place,\" or that we'd meet them again. It didn't seem to harm us.My grandmother told us an edited version of the death of my grandfather.",
      "translated": "我的父母从未说过去世的人或动物去了“更好的地方”，也从未说过我们会再次相见。这并没有对我们造成伤害。我的祖母给我们讲述了一个经过删减的关于我祖父去世的故事。"
    },
    {
      "original": "She said they'd been sitting reading one day, and when she said something to him, he didn't answer. He seemed to be asleep, but when she tried to rouse him, she couldn't. \"He was gone.\" Having a heart attack sounded like falling asleep.",
      "translated": "她说有一天他们坐着看书，当她对他说些什么时，他没有回答。他似乎睡着了，但当她试图唤醒他时，却做不到。“他已经走了。”心脏病发作听起来就像是睡着了一样。"
    },
    {
      "original": "Later I learned it hadn't been so neat, and the heart attack had taken most of a day to kill him.Along with such outright lies, there must have been a lot of changing the subject when death came up. I can't remember that, of course, but I can infer it from the fact that I didn't really grasp I was going to die till I was about 19.",
      "translated": "后来我了解到，事情并没有那么简单，心脏病发作花了将近一整天才夺去他的生命。除了这些明显的谎言，当提到死亡时，一定还有很多转移话题的情形。当然，我不记得这些了，但我可以从一个事实推断出来，那就是直到19岁左右，我才真正意识到自己也会死去。"
    },
    {
      "original": "How could I have missed something so obvious for so long? Now that I've seen parents managing the subject, I can see how: questions about death are gently but firmly turned aside.On this topic, especially, they're met half-way by kids.",
      "translated": "我怎么会长时间忽略这么明显的事情呢？现在看到家长们处理这个问题的方式，我明白了：关于死亡的问题会被温和但坚定地转移开。在这个话题上，孩子们也会适当地配合。"
    },
    {
      "original": "Kids often want to be lied to. They want to believe they're living in a comfortable, safe world as much as their parents want them to believe it. [4] IdentitySome parents feel a strong adherence to an ethnic or religious group and want their kids to feel it too.",
      "translated": "孩子们常常希望被哄骗。他们希望相信自己生活在一个舒适、安全的世界里，就像他们的父母也希望他们这样相信一样。有些父母对某个族群或宗教有强烈的归属感，并希望他们的孩子也有同样的感觉。"
    },
    {
      "original": "This usually requires two different kinds of lying: the first is to tell the child that he or she is an X, and the second is whatever specific lies Xes differentiate themselves by believing. [5]Telling a child they have a particular ethnic or religious identity is one of the stickiest things you can tell them.",
      "translated": "这通常需要两种不同的谎言：第一种是告诉孩子他是X，第二种是X们用来区分自己的特定谎言。[5]告诉孩子他有特定的种族或宗教身份，是你可以告诉孩子的最根深蒂固的事情之一。"
    },
    {
      "original": "Almost anything else you tell a kid, they can change their mind about later when they start to think for themselves. But if you tell a kid they're a member of a certain group, that seems nearly impossible to shake.This despite the fact that it can be one of the most premeditated lies parents tell.",
      "translated": "你几乎可以改变孩子对你告诉他们的任何事情的看法，当他们开始独立思考时。但如果你告诉孩子他们是某个特定群体的成员，这一点似乎几乎无法改变。尽管事实上，这可能是父母最精心策划的谎言之一。"
    },
    {
      "original": "When parents are of different religions, they'll often agree between themselves that their children will be \"raised as Xes.\" And it works. The kids obligingly grow up considering themselves as Xes, despite the fact that if their parents had chosen the other way, they'd have grown up considering themselves as Ys.One reason this works so well is the second kind of lie involved.",
      "translated": "当父母的宗教信仰不同时，他们通常会在彼此之间达成一致，让孩子们“作为X教徒抚养长大”。而这也确实有效。孩子们顺从地长大后，认为自己是X教徒，尽管如果父母选择了另一条路，他们本会认为自己是Y教徒。这一做法之所以如此有效，其中一个原因是其中涉及的第二种谎言。"
    },
    {
      "original": "The truth is common property. You can't distinguish your group by doing things that are rational, and believing things that are true. If you want to set yourself apart from other people, you have to do things that are arbitrary, and believe things that are false.",
      "translated": "事实是公共资源。你不能通过做合理的事情和相信真实的事情来区分你的群体。如果你想与众不同，就必须做一些任意的事情，并相信一些虚假的事情。"
    },
    {
      "original": "And after having spent their whole lives doing things that are arbitrary and believing things that are false, and being regarded as odd by \"outsiders\" on that account, the cognitive dissonance pushing children to regard themselves as Xes must be enormous.",
      "translated": "而且，孩子们在一生中做了许多随意的事情，相信了许多不真实的事情，并因此被“局外人”视为异类，这种认知失调推动他们将自己视为X的力度必定是巨大的。"
    },
    {
      "original": "If they aren't an X, why are they attached to all these arbitrary beliefs and customs? If they aren't an X, why do all the non-Xes call them one?This form of lie is not without its uses. You can use it to carry a payload of beneficial beliefs, and they will also become part of the child's identity.",
      "translated": "如果他们不是X，为什么他们会依附于这些随意的信念和习俗？如果他们不是X，为什么所有的非X都称他们为X？这种形式的谎言并非没有用途。你可以用它来传递有益的信念，这些信念也会成为孩子身份的一部分。"
    },
    {
      "original": "You can tell the child that in addition to never wearing the color yellow, believing the world was created by a giant rabbit, and always snapping their fingers before eating fish, Xes are also particularly honest and industrious.",
      "translated": "你可以告诉孩子，除了从不穿黄色衣服、相信世界是由一只巨大的兔子创造的，以及在吃鱼前总是会弹手指外，X族人还特别诚实和勤劳。"
    },
    {
      "original": "Then X children will grow up feeling it's part of their identity to be honest and industrious.This probably accounts for a lot of the spread of modern religions, and explains why their doctrines are a combination of the useful and the bizarre.",
      "translated": "那么，X个孩子将成长过程中认为诚实和勤劳是他们身份的一部分。这大概可以解释现代宗教的广泛传播，以及它们的教义为何是实用与奇异的结合。"
    },
    {
      "original": "The bizarre half is what makes the religion stick, and the useful half is the payload. [6] AuthorityOne of the least excusable reasons adults lie to kids is to maintain power over them. Sometimes these lies are truly sinister, like a child molester telling his victims they'll get in trouble if they tell anyone what happened to them.",
      "translated": "古怪的那一半使宗教得以延续，而有用的那一半则是其核心内容。[6] 权威性 成年人对孩子们撒谎的最不可原谅的原因之一是为了维持对他们的控制。有时这些谎言确实非常阴险，比如性侵犯者告诉受害者，如果他们把发生的事情告诉任何人，就会受到惩罚。"
    },
    {
      "original": "Others seem more innocent; it depends how badly adults lie to maintain their power, and what they use it for.Most adults make some effort to conceal their flaws from children. Usually their motives are mixed.",
      "translated": "其他人则显得更加无辜；这取决于成年人为了维持权力而撒谎的严重程度，以及他们用这些权力做什么。大多数成年人会努力在孩子面前掩饰自己的缺点。通常，他们的动机是复杂的。"
    },
    {
      "original": "For example, a father who has an affair generally conceals it from his children. His motive is partly that it would worry them, partly that this would introduce the topic of sex, and partly (a larger part than he would admit) that he doesn't want to tarnish himself in their eyes.If you want to learn what lies are told to kids, read almost any book written to teach them about \"issues.\" [7] Peter Mayle wrote one called Why Are We Getting a Divorce?",
      "translated": "例如，一个有外遇的父亲通常会向他的孩子们隐瞒这件事。他的动机部分是因为这会让他们担心，部分是因为这会引入性的话题，还有部分原因是（他不愿承认这是更大的原因）他不想在孩子们眼中损害自己的形象。如果你想了解家长会向孩子撒哪些谎，可以阅读几乎任何一本为教导孩子解决“问题”而写的书。[7] 彼得·梅尔就写过一本叫《我们为什么要离婚？》的书。"
    },
    {
      "original": "It begins with the three most important things to remember about divorce, one of which is: You shouldn't put the blame on one parent, because divorce is never only one person's fault. [8] Really? When a man runs off with his secretary, is it always partly his wife's fault?",
      "translated": "这始于关于离婚最需要记住的三件事，其中之一是：你不应该将责任归咎于一方父母，因为离婚从来不是某一个人的错。[8] 真的吗？当一个男人和秘书私奔时，难道这总是部分归咎于他的妻子吗？"
    },
    {
      "original": "But I can see why Mayle might have said this. Maybe it's more important for kids to respect their parents than to know the truth about them.But because adults conceal their flaws, and at the same time insist on high standards of behavior for kids, a lot of kids grow up feeling they fall hopelessly short.",
      "translated": "但我知道梅尔为什么会这么说。或许对孩子来说，尊重父母比了解父母的真相更为重要。但由于成年人隐藏自己的缺点，同时又对孩子的行为要求极高，许多孩子长大后会觉得他们根本达不到这些期望。"
    },
    {
      "original": "They walk around feeling horribly evil for having used a swearword, while in fact most of the adults around them are doing much worse things.This happens in intellectual as well as moral questions. The more confident people are, the more willing they seem to be to answer a question \"I don't know.\" Less confident people feel they have to have an answer or they'll look bad.",
      "translated": "他们四处走动，因为使用了一个脏字而感到极其邪恶，而事实上，周围大多数成年人都在做更糟糕的事情。这种情况不仅出现在道德问题上，也出现在智力问题上。越自信的人似乎越愿意回答“我不知道”。而不太自信的人则觉得他们必须有一个答案，否则就会显得自己很差。"
    },
    {
      "original": "My parents were pretty good about admitting when they didn't know things, but I must have been told a lot of lies of this type by teachers, because I rarely heard a teacher say \"I don't know\" till I got to college.",
      "translated": "我的父母在不知道某些事情时，通常会坦诚相告，但我在上大学之前，很少听到老师说“我不知道”，所以肯定有不少老师曾对我撒过这种谎。"
    },
    {
      "original": "I remember because it was so surprising to hear someone say that in front of a class.The first hint I had that teachers weren't omniscient came in sixth grade, after my father contradicted something I'd learned in school.",
      "translated": "我记得，因为当时听到有人在课堂上这么说，让我感到非常意外。我第一次意识到老师并不是无所不知，是在六年级，那时我父亲反驳了我在学校学到的某件事。"
    },
    {
      "original": "When I protested that the teacher had said the opposite, my father replied that the guy had no idea what he was talking about—that he was just an elementary school teacher, after all.Just a teacher? The phrase seemed almost grammatically ill-formed.",
      "translated": "当我抗议说老师说过相反的话时，我父亲回答说，那人根本不知道自己在说什么——毕竟他只是一个小学老师。只是一个老师？这句话听起来几乎像是语法错误。"
    },
    {
      "original": "Didn't teachers know everything about the subjects they taught? And if not, why were they the ones teaching us?The sad fact is, US public school teachers don't generally understand the stuff they're teaching very well.",
      "translated": "老师们不是对他们教授的科目了如指掌吗？如果不是，那为什么他们来教我们呢？事实的悲哀之处在于，美国公立学校的教师通常并不十分理解他们所教授的内容。"
    },
    {
      "original": "There are some sterling exceptions, but as a rule people planning to go into teaching rank academically near the bottom of the college population. So the fact that I still thought at age 11 that teachers were infallible shows what a job the system must have done on my brain.",
      "translated": "有一些出类拔萃的例外，但一般来说，打算从事教学的人在学术上排在大学人群的底层。所以，我11岁时仍然认为老师是绝对正确的，这表明教育系统对我大脑的洗脑程度有多深。"
    },
    {
      "original": "SchoolWhat kids get taught in school is a complex mix of lies. The most excusable are those told to simplify ideas to make them easy to learn. The problem is, a lot of propaganda gets slipped into the curriculum in the name of simplification.Public school textbooks represent a compromise between what various powerful groups want kids to be told.",
      "translated": "学校里教给孩子们的内容是一系列复杂的“谎言”组合。最可原谅的是那些为了简化概念、便于学习而编造的“谎言”。问题在于，许多宣传内容也以简化的名义被偷偷加入课程之中。公立学校的教科书代表了各个强势团体希望孩子们接受的内容之间的妥协。"
    },
    {
      "original": "The lies are rarely overt. Usually they consist either of omissions or of over-emphasizing certain topics at the expense of others. The view of history we got in elementary school was a crude hagiography, with at least one representative of each powerful group.The famous scientists I remember were Einstein, Marie Curie, and George Washington Carver.",
      "translated": "谎言很少是明目张胆的。通常，它们要么是隐瞒事实，要么是过分强调某些话题而忽视其他话题。我们在小学所接触到的历史是一幅粗糙的圣人传，至少每个有影响力群体都有一个代表。我记忆中的著名科学家有爱因斯坦、居里夫人和乔治·华盛顿·卡弗。"
    },
    {
      "original": "Einstein was a big deal because his work led to the atom bomb. Marie Curie was involved with X-rays. But I was mystified about Carver. He seemed to have done stuff with peanuts.It's obvious now that he was on the list because he was black (and for that matter that Marie Curie was on it because she was a woman), but as a kid I was confused for years about him.",
      "translated": "爱因斯坦之所以重要，是因为他的工作导致了原子弹的诞生。居里夫人与X射线有关。但卡弗让我困惑不已。他似乎对花生做了些研究。现在很明显，他被列入名单是因为他是黑人（同样，居里夫人被列入名单是因为她是女性），但小时候我对他困惑了多年。"
    },
    {
      "original": "I wonder if it wouldn't have been better just to tell us the truth: that there weren't any famous black scientists. Ranking George Washington Carver with Einstein misled us not only about science, but about the obstacles blacks faced in his time.As subjects got softer, the lies got more frequent.",
      "translated": "我想，不如直接告诉我们真相岂不更好：其实并没有什么著名的黑人科学家。将乔治·华盛顿·卡弗与爱因斯坦相提并论，不仅误导了我们对科学的认识，也误导了我们对那个时代黑人所面临的障碍的理解。随着话题变得越来越不严肃，谎言也变得更加频繁。"
    },
    {
      "original": "By the time you got to politics and recent history, what we were taught was pretty much pure propaganda. For example, we were taught to regard political leaders as saints—especially the recently martyred Kennedy and King.",
      "translated": "当你学到政治和近代历史时，我们所学的几乎完全是宣传。例如，我们被教导将政治领导人视为圣人——尤其是最近被暗杀的肯尼迪和金。"
    },
    {
      "original": "It was astonishing to learn later that they'd both been serial womanizers, and that Kennedy was a speed freak to boot. (By the time King's plagiarism emerged, I'd lost the ability to be surprised by the misdeeds of famous people.)I doubt you could teach kids recent history without teaching them lies, because practically everyone who has anything to say about it has some kind of spin to put on it.",
      "translated": "后来得知他们俩都是惯犯的花花公子，而肯尼迪还是个速度狂，这实在令人震惊。（等到金的抄袭行为曝光时，我已经对名人犯下的错事失去了惊讶的能力。）我怀疑你能否在不教孩子们谎言的情况下教授近代历史，因为几乎每个对此发表意见的人都会以某种方式加以粉饰。"
    },
    {
      "original": "Much recent history consists of spin. It would probably be better just to teach them metafacts like that.Probably the biggest lie told in schools, though, is that the way to succeed is through following \"the rules.\" In fact most such rules are just hacks to manage large groups efficiently.",
      "translated": "近期的许多历史都是宣传。或许最好只是教给他们这类元事实。然而，学校里最大的谎言可能是，成功的途径是通过遵循“规则”。事实上，大多数这样的规则只是管理大群体的有效手段。"
    },
    {
      "original": "PeaceOf all the reasons we lie to kids, the most powerful is probably the same mundane reason they lie to us.Often when we lie to people it's not part of any conscious strategy, but because they'd react violently to the truth.",
      "translated": "和平。在我们对孩子们撒谎的所有原因中，最有力的可能与他们对我们撒谎的原因相同。通常，我们对人撒谎并不是出于任何有意识的策略，而是因为对方会对真相做出激烈的反应。"
    },
    {
      "original": "Kids, almost by definition, lack self-control. They react violently to things—and so they get lied to a lot. [9]A few Thanksgivings ago, a friend of mine found himself in a situation that perfectly illustrates the complex motives we have when we lie to kids.",
      "translated": "孩子几乎可以说是缺乏自制力的。他们对事情反应激烈——因此，他们经常被欺骗。[9]几年前的感恩节，我的一位朋友遇到了一个情况，完美地展示了我们在对孩子们撒谎时所具有的复杂动机。"
    },
    {
      "original": "As the roast turkey appeared on the table, his alarmingly perceptive 5 year old son suddenly asked if the turkey had wanted to die. Foreseeing disaster, my friend and his wife rapidly improvised: yes, the turkey had wanted to die, and in fact had lived its whole life with the aim of being their Thanksgiving dinner.",
      "translated": "当烤火鸡端上桌时，他那惊人敏锐的5岁儿子突然问火鸡是否愿意死去。预见到可能的麻烦，我的朋友和他的妻子迅速即兴回答：是的，火鸡是愿意死去的，事实上，它一生的目标就是为了成为他们的感恩节晚餐。"
    },
    {
      "original": "And that (phew) was the end of that.Whenever we lie to kids to protect them, we're usually also lying to keep the peace.One consequence of this sort of calming lie is that we grow up thinking horrible things are normal.",
      "translated": "而这就（呼）是事情的结局。每当我们为了保护孩子而对他们撒谎时，通常也是为了维持和平。这种为了平息局面的谎言的一个后果是，我们长大后会认为可怕的事情是正常的。"
    },
    {
      "original": "It's hard for us to feel a sense of urgency as adults over something we've literally been trained not to worry about. When I was about 10 I saw a documentary on pollution that put me into a panic. It seemed the planet was being irretrievably ruined.",
      "translated": "作为成年人，我们很难对一些我们被训练得不必担心的事情产生紧迫感。我大约10岁的时候看过一部关于污染的纪录片，当时我非常恐慌。那时候我感觉地球正在无可挽回地遭到破坏。"
    },
    {
      "original": "I went to my mother afterward to ask if this was so. I don't remember what she said, but she made me feel better, so I stopped worrying about it.That was probably the best way to handle a frightened 10 year old.",
      "translated": "之后我去问妈妈是否真的如此。虽然我不记得她具体说了什么，但她的回答让我感到安心，所以我不再为此担心。这可能是处理一个害怕的10岁孩子最好的办法。"
    },
    {
      "original": "But we should understand the price. This sort of lie is one of the main reasons bad things persist: we're all trained to ignore them. DetoxA sprinter in a race almost immediately enters a state called \"oxygen debt.\" His body switches to an emergency source of energy that's faster than regular aerobic respiration.",
      "translated": "但我们应该明白代价。这种谎言是坏事得以持续的主要原因之一：我们都被训练成忽视它们。在比赛中，短跑运动员几乎立刻进入一种被称为“氧债”的状态。他的身体切换到一种比常规有氧呼吸更快的应急能源。"
    },
    {
      "original": "But this process builds up waste products that ultimately require extra oxygen to break down, so at the end of the race he has to stop and pant for a while to recover.We arrive at adulthood with a kind of truth debt.",
      "translated": "但这个过程会产生最终需要额外氧气来分解的废物，因此比赛结束后他不得不停下来喘息一阵以恢复。我们进入成年时带着一种真理的债务。"
    },
    {
      "original": "We were told a lot of lies to get us (and our parents) through our childhood. Some may have been necessary. Some probably weren't. But we all arrive at adulthood with heads full of lies.There's never a point where the adults sit you down and explain all the lies they told you.",
      "translated": "我们从小到大被灌输了无数的谎言，这些谎言让我们和我们的父母度过了童年。有些可能是必要的，有些可能并非如此。但我们都带着满脑子的谎言步入了成年。却从未有过一个时刻，大人们会坐下来向我们解释他们曾经告诉过我们的所有谎言。"
    },
    {
      "original": "They've forgotten most of them. So if you're going to clear these lies out of your head, you're going to have to do it yourself.Few do. Most people go through life with bits of packing material adhering to their minds and never know it.",
      "translated": "他们已经忘记了大多数。所以，如果你想把这些谎言从你的脑海中清除，你得自己去做。很少有人能做到。大多数人一辈子都带着一些思想上的杂物，却从不自知。"
    },
    {
      "original": "You probably never can completely undo the effects of lies you were told as a kid, but it's worth trying. I've found that whenever I've been able to undo a lie I was told, a lot of other things fell into place.Fortunately, once you arrive at adulthood you get a valuable new resource you can use to figure out what lies you were told.",
      "translated": "你可能永远无法完全消除童年时被人灌输的谎言的影响，但努力尝试是值得的。我发现，每当我能够揭穿一个谎言时，很多其他事情就会迎刃而解。幸运的是，一旦你成年，你会获得一种宝贵的资源，可以帮助你弄清楚哪些谎言是你被灌输的。"
    },
    {
      "original": "You're now one of the liars. You get to watch behind the scenes as adults spin the world for the next generation of kids.The first step in clearing your head is to realize how far you are from a neutral observer.",
      "translated": "你现在也是说谎者之一。你可以看到幕后的场景，看到成人为下一代孩子编织这个世界。清除你头脑中的第一步是意识到你离中立观察者有多远。"
    },
    {
      "original": "When I left high school I was, I thought, a complete skeptic. I'd realized high school was crap. I thought I was ready to question everything I knew. But among the many other things I was ignorant of was how much debris there already was in my head.",
      "translated": "当我高中毕业时，我以为自己是一个彻底的怀疑论者。我意识到高中生活糟糕透了。我认为自己已经准备好质疑我所知道的一切。但在我所无知的许多事情中，有一件是：我的脑子里已经充满了多少陈旧观念。"
    },
    {
      "original": "It's not enough to consider your mind a blank slate. You have to consciously erase it. Notes[1] One reason I stuck with such a brutally simple word is that the lies we tell kids are probably not quite as harmless as we think.",
      "translated": "仅仅把你的思维视为一张白纸是不够的，你必须有意识地将其擦除。注[1] 我坚持使用如此简单粗暴的词汇的一个原因是，我们对孩子们说的谎言可能并没有我们想象的那么无害。"
    },
    {
      "original": "If you look at what adults told children in the past, it's shocking how much they lied to them. Like us, they did it with the best intentions. So if we think we're as open as one could reasonably be with children, we're probably fooling ourselves.",
      "translated": "如果你回顾过去大人对孩子们所说的话，会惊讶地发现他们竟然对孩子们说了那么多谎。和我们一样，他们这么做是出于最好的意图。所以，如果我们认为自己对孩子的坦诚程度已经达到了合理的极限，那我们很可能是在自欺欺人。"
    },
    {
      "original": "Odds are people in 100 years will be as shocked at some of the lies we tell as we are at some of the lies people told 100 years ago.I can't predict which these will be, and I don't want to write an essay that will seem dumb in 100 years.",
      "translated": "很可能100年后的人们会对我们现在的一些谎言感到同样震惊，就像我们现在对100年前的一些谎言感到震惊一样。我无法预测这些会是哪些谎言，也不想写一篇100年后看起来很愚蠢的文章。"
    },
    {
      "original": "So instead of using special euphemisms for lies that seem excusable according to present fashions, I'm just going to call all our lies lies.(I have omitted one type: lies told to play games with kids' credulity.",
      "translated": "因此，我不会使用那些根据当前时尚似乎可以原谅的谎言的委婉语，我将直接把我们所有的谎言称为谎言。（我忽略了一种类型：为了跟孩子开玩笑而说的谎言。）"
    },
    {
      "original": "These range from \"make-believe,\" which is not really a lie because it's told with a wink, to the frightening lies told by older siblings. There's not much to say about these: I wouldn't want the first type to go away, and wouldn't expect the second type to.)[2] Calaprice, Alice (ed.), The Quotable Einstein, Princeton University Press, 1996.[3] If you ask parents why kids shouldn't swear, the less educated ones usually reply with some question-begging answer like \"it's inappropriate,\" while the more educated ones come up with elaborate rationalizations.",
      "translated": "这些谎言从小孩子扮家家酒时那种半开玩笑的“假扮”行为，到年长的兄弟姐妹讲的令人害怕的谎言，不一而足。关于这些，其实没有什么好说的：我不希望第一种消失，也不指望第二种会消失。)[2] Calaprice, Alice (编)，《爱因斯坦语录》，普林斯顿大学出版社，1996年。[3] 如果你问家长为什么孩子不应该说脏话，受教育程度较低的家长通常会回答一些类似“这是不合适的”这种不着边际的理由，而受过较好教育的家长则会提出复杂的理由。"
    },
    {
      "original": "In fact the less educated parents seem closer to the truth.[4] As a friend with small children pointed out, it's easy for small children to consider themselves immortal, because time seems to pass so slowly for them.",
      "translated": "事实上，受教育程度较低的父母似乎更接近真相。[4] 一位有小孩的朋友指出，对小孩子来说，他们很容易认为自己是不死的，因为他们觉得时间过得很慢。"
    },
    {
      "original": "To a 3 year old, a day feels like a month might to an adult. So 80 years sounds to him like 2400 years would to us.[5] I realize I'm going to get endless grief for classifying religion as a type of lie.",
      "translated": "对于一个三岁的孩子来说，一天的感觉就像成年人的一个月。所以80年对他来说听起来就像对我们来说的2400年。[5] 我意识到，把宗教归类为一种谎言，我会不断地受到批评。"
    },
    {
      "original": "Usually people skirt that issue with some equivocation implying that lies believed for a sufficiently long time by sufficiently large numbers of people are immune to the usual standards for truth. But because I can't predict which lies future generations will consider inexcusable, I can't safely omit any type we tell.",
      "translated": "通常，人们会用一些模棱两可的说法来回避这个问题，暗示那些被足够多的人相信了足够长时间的谎言可以免于通常的真标准。但由于我无法预测后代会认为哪些谎言是不可原谅的，所以我不能安全地省略我们所说的任何类型的谎言。"
    },
    {
      "original": "Yes, it seems unlikely that religion will be out of fashion in 100 years, but no more unlikely than it would have seemed to someone in 1880 that schoolchildren in 1980 would be taught that masturbation was perfectly normal and not to feel guilty about it.[6] Unfortunately the payload can consist of bad customs as well as good ones.",
      "translated": "是的，宗教在100年后可能不会过时，但这并不比1880年的人认为1980年的学生会被教导自慰是完全正常的、不必对此感到内疚更加不可思议。不幸的是，这些观念既可能包含好的习俗，也可能包含坏的习俗。"
    },
    {
      "original": "For example, there are certain qualities that some groups in America consider \"acting white.\" In fact most of them could as accurately be called \"acting Japanese.\" There's nothing specifically white about such customs.",
      "translated": "例如，美国某些群体认为的一些“装白人”的特质，实际上很多也可以被称为“装日本人”。这些习俗并没有什么特别的白人特征。"
    },
    {
      "original": "They're common to all cultures with long traditions of living in cities. So it is probably a losing bet for a group to consider behaving the opposite way as part of its identity.[7] In this context, \"issues\" basically means \"things we're going to lie to them about.\" That's why there's a special name for these topics.[8] Mayle, Peter, Why Are We Getting a Divorce?, Harmony, 1988.[9] The ironic thing is, this is also the main reason kids lie to adults.",
      "translated": "这些现象普遍存在于所有拥有悠久城市生活传统的文化中。因此，一个群体若将其身份认同建立在与之相反的行为上，很可能是个失败的赌注。[7] 在这种背景下，“问题”基本上指的是“我们将要对他们撒谎的事情”。这就是为什么这些话题有一个专门的名称。[8] 梅尔，彼得，《我们为什么离婚？》，Harmony，1988。[9] 讽刺的是，这也是孩子们对大人撒谎的主要原因。"
    },
    {
      "original": "If you freak out when people tell you alarming things, they won't tell you them. Teenagers don't tell their parents what happened that night they were supposed to be staying at a friend's house for the same reason parents don't tell 5 year olds the truth about the Thanksgiving turkey.",
      "translated": "如果你对别人告诉你令人担忧的事情感到恐慌，他们就不会告诉你了。就像青少年不会告诉父母他们本应在朋友家过夜的那个晚上发生了什么，同样地，父母也不会告诉五岁的孩子关于感恩节火鸡的真相。"
    },
    {
      "original": "They'd freak if they knew. Thanks to Sam Altman, Marc Andreessen, Trevor Blackwell, Patrick Collison, Jessica Livingston, Jackie McDonough, Robert Morris, and David Sloo for reading drafts of this. And since there are some controversial ideas here, I should add that none of them agreed with everything in it.German TranslationFrench TranslationRussian Translation",
      "translated": "如果他们知道了肯定会大吃一惊。感谢Sam Altman、Marc Andreessen、Trevor Blackwell、Patrick Collison、Jessica Livingston、Jackie McDonough、Robert Morris和David Sloo审阅了本文的草稿。由于这里有一些有争议的观点，我应该补充说明，他们中没有人完全同意文中的所有内容。"
    }
  ],
  "translation_completed": "2025-07-28T23:29:50.984163",
  "translation_stats": {
    "total_paragraphs": 106,
    "success_count": 106,
    "success_rate": "100.0%"
  }
}