{
  "title": "How to Do What You Love",
  "title_zh": "[待翻译] How to Do What You Love",
  "url": "https://www.paulgraham.com/love.html",
  "filename": "love.html",
  "date": "2006-01-01",
  "id": 196,
  "content": {
    "success": true,
    "paragraphs": [
      "Want to start a startup? Get funded by Y Combinator. January 2006To do something well you have to like it. That idea is not exactly novel. We've got it down to four words: \"Do what you love.\" But it's not enough just to tell people that.",
      "Doing what you love is complicated.The very idea is foreign to what most of us learn as kids. When I was a kid, it seemed as if work and fun were opposites by definition. Life had two states: some of the time adults were making you do things, and that was called work; the rest of the time you could do what you wanted, and that was called playing.",
      "Occasionally the things adults made you do were fun, just as, occasionally, playing wasn't — for example, if you fell and hurt yourself. But except for these few anomalous cases, work was pretty much defined as not-fun.And it did not seem to be an accident.",
      "School, it was implied, was tedious because it was preparation for grownup work.The world then was divided into two groups, grownups and kids. Grownups, like some kind of cursed race, had to work. Kids didn't, but they did have to go to school, which was a dilute version of work meant to prepare us for the real thing.",
      "Much as we disliked school, the grownups all agreed that grownup work was worse, and that we had it easy.Teachers in particular all seemed to believe implicitly that work was not fun. Which is not surprising: work wasn't fun for most of them.",
      "Why did we have to memorize state capitals instead of playing dodgeball? For the same reason they had to watch over a bunch of kids instead of lying on a beach. You couldn't just do what you wanted.I'm not saying we should let little kids do whatever they want.",
      "They may have to be made to work on certain things. But if we make kids work on dull stuff, it might be wise to tell them that tediousness is not the defining quality of work, and indeed that the reason they have to work on dull stuff now is so they can work on more interesting stuff later.",
      "[1]Once, when I was about 9 or 10, my father told me I could be whatever I wanted when I grew up, so long as I enjoyed it. I remember that precisely because it seemed so anomalous. It was like being told to use dry water.",
      "Whatever I thought he meant, I didn't think he meant work could literally be fun — fun like playing. It took me years to grasp that.JobsBy high school, the prospect of an actual job was on the horizon.",
      "Adults would sometimes come to speak to us about their work, or we would go to see them at work. It was always understood that they enjoyed what they did. In retrospect I think one may have: the private jet pilot.",
      "But I don't think the bank manager really did.The main reason they all acted as if they enjoyed their work was presumably the upper-middle class convention that you're supposed to. It would not merely be bad for your career to say that you despised your job, but a social faux-pas.Why is it conventional to pretend to like what you do?",
      "The first sentence of this essay explains that. If you have to like something to do it well, then the most successful people will all like what they do. That's where the upper-middle class tradition comes from.",
      "Just as houses all over America are full of chairs that are, without the owners even knowing it, nth-degree imitations of chairs designed 250 years ago for French kings, conventional attitudes about work are, without the owners even knowing it, nth-degree imitations of the attitudes of people who've done great things.What a recipe for alienation.",
      "By the time they reach an age to think about what they'd like to do, most kids have been thoroughly misled about the idea of loving one's work. School has trained them to regard work as an unpleasant duty.",
      "Having a job is said to be even more onerous than schoolwork. And yet all the adults claim to like what they do. You can't blame kids for thinking \"I am not like these people; I am not suited to this world.\"Actually they've been told three lies: the stuff they've been taught to regard as work in school is not real work; grownup work is not (necessarily) worse than schoolwork; and many of the adults around them are lying when they say they like what they do.The most dangerous liars can be the kids' own parents.",
      "If you take a boring job to give your family a high standard of living, as so many people do, you risk infecting your kids with the idea that work is boring. [2] Maybe it would be better for kids in this one case if parents were not so unselfish.",
      "A parent who set an example of loving their work might help their kids more than an expensive house. [3]It was not till I was in college that the idea of work finally broke free from the idea of making a living.",
      "Then the important question became not how to make money, but what to work on. Ideally these coincided, but some spectacular boundary cases (like Einstein in the patent office) proved they weren't identical.The definition of work was now to make some original contribution to the world, and in the process not to starve.",
      "But after the habit of so many years my idea of work still included a large component of pain. Work still seemed to require discipline, because only hard problems yielded grand results, and hard problems couldn't literally be fun.",
      "Surely one had to force oneself to work on them.If you think something's supposed to hurt, you're less likely to notice if you're doing it wrong. That about sums up my experience of graduate school.BoundsHow much are you supposed to like what you do?",
      "Unless you know that, you don't know when to stop searching. And if, like most people, you underestimate it, you'll tend to stop searching too early. You'll end up doing something chosen for you by your parents, or the desire to make money, or prestige — or sheer inertia.Here's an upper bound: Do what you love doesn't mean, do what you would like to do most this second.",
      "Even Einstein probably had moments when he wanted to have a cup of coffee, but told himself he ought to finish what he was working on first.It used to perplex me when I read about people who liked what they did so much that there was nothing they'd rather do.",
      "There didn't seem to be any sort of work I liked that much. If I had a choice of (a) spending the next hour working on something or (b) be teleported to Rome and spend the next hour wandering about, was there any sort of work I'd prefer?",
      "Honestly, no.But the fact is, almost anyone would rather, at any given moment, float about in the Carribbean, or have sex, or eat some delicious food, than work on hard problems. The rule about doing what you love assumes a certain length of time.",
      "It doesn't mean, do what will make you happiest this second, but what will make you happiest over some longer period, like a week or a month.Unproductive pleasures pall eventually. After a while you get tired of lying on the beach.",
      "If you want to stay happy, you have to do something.As a lower bound, you have to like your work more than any unproductive pleasure. You have to like what you do enough that the concept of \"spare time\" seems mistaken.",
      "Which is not to say you have to spend all your time working. You can only work so much before you get tired and start to screw up. Then you want to do something else — even something mindless. But you don't regard this time as the prize and the time you spend working as the pain you endure to earn it.I put the lower bound there for practical reasons.",
      "If your work is not your favorite thing to do, you'll have terrible problems with procrastination. You'll have to force yourself to work, and when you resort to that the results are distinctly inferior.To be happy I think you have to be doing something you not only enjoy, but admire.",
      "You have to be able to say, at the end, wow, that's pretty cool. This doesn't mean you have to make something. If you learn how to hang glide, or to speak a foreign language fluently, that will be enough to make you say, for a while at least, wow, that's pretty cool.",
      "What there has to be is a test.So one thing that falls just short of the standard, I think, is reading books. Except for some books in math and the hard sciences, there's no test of how well you've read a book, and that's why merely reading books doesn't quite feel like work.",
      "You have to do something with what you've read to feel productive.I think the best test is one Gino Lee taught me: to try to do things that would make your friends say wow. But it probably wouldn't start to work properly till about age 22, because most people haven't had a big enough sample to pick friends from before then.SirensWhat you should not do, I think, is worry about the opinion of anyone beyond your friends.",
      "You shouldn't worry about prestige. Prestige is the opinion of the rest of the world. When you can ask the opinions of people whose judgement you respect, what does it add to consider the opinions of people you don't even know?",
      "[4]This is easy advice to give. It's hard to follow, especially when you're young. [5] Prestige is like a powerful magnet that warps even your beliefs about what you enjoy. It causes you to work not on what you like, but what you'd like to like.That's what leads people to try to write novels, for example.",
      "They like reading novels. They notice that people who write them win Nobel prizes. What could be more wonderful, they think, than to be a novelist? But liking the idea of being a novelist is not enough; you have to like the actual work of novel-writing if you're going to be good at it; you have to like making up elaborate lies.Prestige is just fossilized inspiration.",
      "If you do anything well enough, you'll make it prestigious. Plenty of things we now consider prestigious were anything but at first. Jazz comes to mind — though almost any established art form would do.",
      "So just do what you like, and let prestige take care of itself.Prestige is especially dangerous to the ambitious. If you want to make ambitious people waste their time on errands, the way to do it is to bait the hook with prestige.",
      "That's the recipe for getting people to give talks, write forewords, serve on committees, be department heads, and so on. It might be a good rule simply to avoid any prestigious task. If it didn't suck, they wouldn't have had to make it prestigious.Similarly, if you admire two kinds of work equally, but one is more prestigious, you should probably choose the other.",
      "Your opinions about what's admirable are always going to be slightly influenced by prestige, so if the two seem equal to you, you probably have more genuine admiration for the less prestigious one.The other big force leading people astray is money.",
      "Money by itself is not that dangerous. When something pays well but is regarded with contempt, like telemarketing, or prostitution, or personal injury litigation, ambitious people aren't tempted by it.",
      "That kind of work ends up being done by people who are \"just trying to make a living.\" (Tip: avoid any field whose practitioners say this.) The danger is when money is combined with prestige, as in, say, corporate law, or medicine.",
      "A comparatively safe and prosperous career with some automatic baseline prestige is dangerously tempting to someone young, who hasn't thought much about what they really like.The test of whether people love what they do is whether they'd do it even if they weren't paid for it — even if they had to work at another job to make a living.",
      "How many corporate lawyers would do their current work if they had to do it for free, in their spare time, and take day jobs as waiters to support themselves?This test is especially helpful in deciding between different kinds of academic work, because fields vary greatly in this respect.",
      "Most good mathematicians would work on math even if there were no jobs as math professors, whereas in the departments at the other end of the spectrum, the availability of teaching jobs is the driver: people would rather be English professors than work in ad agencies, and publishing papers is the way you compete for such jobs.",
      "Math would happen without math departments, but it is the existence of English majors, and therefore jobs teaching them, that calls into being all those thousands of dreary papers about gender and identity in the novels of Conrad.",
      "No one does that kind of thing for fun.The advice of parents will tend to err on the side of money. It seems safe to say there are more undergrads who want to be novelists and whose parents want them to be doctors than who want to be doctors and whose parents want them to be novelists.",
      "The kids think their parents are \"materialistic.\" Not necessarily. All parents tend to be more conservative for their kids than they would for themselves, simply because, as parents, they share risks more than rewards.",
      "If your eight year old son decides to climb a tall tree, or your teenage daughter decides to date the local bad boy, you won't get a share in the excitement, but if your son falls, or your daughter gets pregnant, you'll have to deal with the consequences.DisciplineWith such powerful forces leading us astray, it's not surprising we find it so hard to discover what we like to work on.",
      "Most people are doomed in childhood by accepting the axiom that work = pain. Those who escape this are nearly all lured onto the rocks by prestige or money. How many even discover something they love to work on?",
      "A few hundred thousand, perhaps, out of billions.It's hard to find work you love; it must be, if so few do. So don't underestimate this task. And don't feel bad if you haven't succeeded yet. In fact, if you admit to yourself that you're discontented, you're a step ahead of most people, who are still in denial.",
      "If you're surrounded by colleagues who claim to enjoy work that you find contemptible, odds are they're lying to themselves. Not necessarily, but probably.Although doing great work takes less discipline than people think — because the way to do great work is to find something you like so much that you don't have to force yourself to do it — finding work you love does usually require discipline.",
      "Some people are lucky enough to know what they want to do when they're 12, and just glide along as if they were on railroad tracks. But this seems the exception. More often people who do great things have careers with the trajectory of a ping-pong ball.",
      "They go to school to study A, drop out and get a job doing B, and then become famous for C after taking it up on the side.Sometimes jumping from one sort of work to another is a sign of energy, and sometimes it's a sign of laziness.",
      "Are you dropping out, or boldly carving a new path? You often can't tell yourself. Plenty of people who will later do great things seem to be disappointments early on, when they're trying to find their niche.Is there some test you can use to keep yourself honest?",
      "One is to try to do a good job at whatever you're doing, even if you don't like it. Then at least you'll know you're not using dissatisfaction as an excuse for being lazy. Perhaps more importantly, you'll get into the habit of doing things well.Another test you can use is: always produce.",
      "For example, if you have a day job you don't take seriously because you plan to be a novelist, are you producing? Are you writing pages of fiction, however bad? As long as you're producing, you'll know you're not merely using the hazy vision of the grand novel you plan to write one day as an opiate.",
      "The view of it will be obstructed by the all too palpably flawed one you're actually writing.\"Always produce\" is also a heuristic for finding the work you love. If you subject yourself to that constraint, it will automatically push you away from things you think you're supposed to work on, toward things you actually like.",
      "\"Always produce\" will discover your life's work the way water, with the aid of gravity, finds the hole in your roof.Of course, figuring out what you like to work on doesn't mean you get to work on it.",
      "That's a separate question. And if you're ambitious you have to keep them separate: you have to make a conscious effort to keep your ideas about what you want from being contaminated by what seems possible.",
      "[6]It's painful to keep them apart, because it's painful to observe the gap between them. So most people pre-emptively lower their expectations. For example, if you asked random people on the street if they'd like to be able to draw like Leonardo, you'd find most would say something like \"Oh, I can't draw.\" This is more a statement of intention than fact; it means, I'm not going to try.",
      "Because the fact is, if you took a random person off the street and somehow got them to work as hard as they possibly could at drawing for the next twenty years, they'd get surprisingly far. But it would require a great moral effort; it would mean staring failure in the eye every day for years.",
      "And so to protect themselves people say \"I can't.\"Another related line you often hear is that not everyone can do work they love — that someone has to do the unpleasant jobs. Really? How do you make them?",
      "In the US the only mechanism for forcing people to do unpleasant jobs is the draft, and that hasn't been invoked for over 30 years. All we can do is encourage people to do unpleasant work, with money and prestige.If there's something people still won't do, it seems as if society just has to make do without.",
      "That's what happened with domestic servants. For millennia that was the canonical example of a job \"someone had to do.\" And yet in the mid twentieth century servants practically disappeared in rich countries, and the rich have just had to do without.So while there may be some things someone has to do, there's a good chance anyone saying that about any particular job is mistaken.",
      "Most unpleasant jobs would either get automated or go undone if no one were willing to do them.Two RoutesThere's another sense of \"not everyone can do work they love\" that's all too true, however. One has to make a living, and it's hard to get paid for doing work you love.",
      "There are two routes to that destination: The organic route: as you become more eminent, gradually to increase the parts of your job that you like at the expense of those you don't.The two-job route: to work at things you don't like to get money to work on things you do.",
      "The organic route is more common. It happens naturally to anyone who does good work. A young architect has to take whatever work he can get, but if he does well he'll gradually be in a position to pick and choose among projects.",
      "The disadvantage of this route is that it's slow and uncertain. Even tenure is not real freedom.The two-job route has several variants depending on how long you work for money at a time. At one extreme is the \"day job,\" where you work regular hours at one job to make money, and work on what you love in your spare time.",
      "At the other extreme you work at something till you make enough not to have to work for money again.The two-job route is less common than the organic route, because it requires a deliberate choice. It's also more dangerous.",
      "Life tends to get more expensive as you get older, so it's easy to get sucked into working longer than you expected at the money job. Worse still, anything you work on changes you. If you work too long on tedious stuff, it will rot your brain.",
      "And the best paying jobs are most dangerous, because they require your full attention.The advantage of the two-job route is that it lets you jump over obstacles. The landscape of possible jobs isn't flat; there are walls of varying heights between different kinds of work.",
      "[7] The trick of maximizing the parts of your job that you like can get you from architecture to product design, but not, probably, to music. If you make money doing one thing and then work on another, you have more freedom of choice.Which route should you take?",
      "That depends on how sure you are of what you want to do, how good you are at taking orders, how much risk you can stand, and the odds that anyone will pay (in your lifetime) for what you want to do. If you're sure of the general area you want to work in and it's something people are likely to pay you for, then you should probably take the organic route.",
      "But if you don't know what you want to work on, or don't like to take orders, you may want to take the two-job route, if you can stand the risk.Don't decide too soon. Kids who know early what they want to do seem impressive, as if they got the answer to some math question before the other kids.",
      "They have an answer, certainly, but odds are it's wrong.A friend of mine who is a quite successful doctor complains constantly about her job. When people applying to medical school ask her for advice, she wants to shake them and yell \"Don't do it!\" (But she never does.) How did she get into this fix?",
      "In high school she already wanted to be a doctor. And she is so ambitious and determined that she overcame every obstacle along the way — including, unfortunately, not liking it.Now she has a life chosen for her by a high-school kid.When you're young, you're given the impression that you'll get enough information to make each choice before you need to make it.",
      "But this is certainly not so with work. When you're deciding what to do, you have to operate on ridiculously incomplete information. Even in college you get little idea what various types of work are like.",
      "At best you may have a couple internships, but not all jobs offer internships, and those that do don't teach you much more about the work than being a batboy teaches you about playing baseball.In the design of lives, as in the design of most other things, you get better results if you use flexible media.",
      "So unless you're fairly sure what you want to do, your best bet may be to choose a type of work that could turn into either an organic or two-job career. That was probably part of the reason I chose computers.",
      "You can be a professor, or make a lot of money, or morph it into any number of other kinds of work.It's also wise, early on, to seek jobs that let you do many different things, so you can learn faster what various kinds of work are like.",
      "Conversely, the extreme version of the two-job route is dangerous because it teaches you so little about what you like. If you work hard at being a bond trader for ten years, thinking that you'll quit and write novels when you have enough money, what happens when you quit and then discover that you don't actually like writing novels?Most people would say, I'd take that problem.",
      "Give me a million dollars and I'll figure out what to do. But it's harder than it looks. Constraints give your life shape. Remove them and most people have no idea what to do: look at what happens to those who win lotteries or inherit money.",
      "Much as everyone thinks they want financial security, the happiest people are not those who have it, but those who like what they do. So a plan that promises freedom at the expense of knowing what to do with it may not be as good as it seems.Whichever route you take, expect a struggle.",
      "Finding work you love is very difficult. Most people fail. Even if you succeed, it's rare to be free to work on what you want till your thirties or forties. But if you have the destination in sight you'll be more likely to arrive at it.",
      "If you know you can love work, you're in the home stretch, and if you know what work you love, you're practically there.Notes[1] Currently we do the opposite: when we make kids do boring work, like arithmetic drills, instead of admitting frankly that it's boring, we try to disguise it with superficial decorations.[2] One father told me about a related phenomenon: he found himself concealing from his family how much he liked his work.",
      "When he wanted to go to work on a saturday, he found it easier to say that it was because he \"had to\" for some reason, rather than admitting he preferred to work than stay home with them.[3] Something similar happens with suburbs.",
      "Parents move to suburbs to raise their kids in a safe environment, but suburbs are so dull and artificial that by the time they're fifteen the kids are convinced the whole world is boring.[4] I'm not saying friends should be the only audience for your work.",
      "The more people you can help, the better. But friends should be your compass.[5] Donald Hall said young would-be poets were mistaken to be so obsessed with being published. But you can imagine what it would do for a 24 year old to get a poem published in The New Yorker.",
      "Now to people he meets at parties he's a real poet. Actually he's no better or worse than he was before, but to a clueless audience like that, the approval of an official authority makes all the difference.",
      "So it's a harder problem than Hall realizes. The reason the young care so much about prestige is that the people they want to impress are not very discerning.[6] This is isomorphic to the principle that you should prevent your beliefs about how things are from being contaminated by how you wish they were.",
      "Most people let them mix pretty promiscuously. The continuing popularity of religion is the most visible index of that.[7] A more accurate metaphor would be to say that the graph of jobs is not very well connected.Thanks to Trevor Blackwell, Dan Friedman, Sarah Harlin, Jessica Livingston, Jackie McDonough, Robert Morris, Peter Norvig, David Sloo, and Aaron Swartz for reading drafts of this.Hebrew TranslationJapanese TranslationChinese TranslationRussian TranslationSlovak TranslationItalian TranslationGerman TranslationSpanish TranslationFrench TranslationHungarian TranslationPortuguese TranslationSerbian TranslationGreek TranslationVietnamese Translation"
    ],
    "word_count": 4625,
    "paragraph_count": 90
  },
  "processed_at": "2025-07-26T19:07:48.647442",
  "paragraphs": [
    {
      "original": "Want to start a startup? Get funded by Y Combinator. January 2006To do something well you have to like it. That idea is not exactly novel. We've got it down to four words: \"Do what you love.\" But it's not enough just to tell people that.",
      "translated": "想创业吗？获得Y Combinator的资助。2006年1月\n\n要做得好，就必须喜欢它。这个想法并不新鲜。我们把它简化为四个字：“做你所爱。” 但仅仅告诉人们这一点是不够的。"
    },
    {
      "original": "Doing what you love is complicated.The very idea is foreign to what most of us learn as kids. When I was a kid, it seemed as if work and fun were opposites by definition. Life had two states: some of the time adults were making you do things, and that was called work; the rest of the time you could do what you wanted, and that was called playing.",
      "translated": "做你喜欢的事情是复杂的。这个想法对于我们大多数人来说，从小就是陌生的。当我还是个孩子的时候，工作和玩乐似乎从定义上就是对立的。生活有两种状态：有时成年人强迫你做事情，那被称为工作；其余时间你可以随心所欲，那被称为玩乐。"
    },
    {
      "original": "Occasionally the things adults made you do were fun, just as, occasionally, playing wasn't — for example, if you fell and hurt yourself. But except for these few anomalous cases, work was pretty much defined as not-fun.And it did not seem to be an accident.",
      "translated": "有时候，大人让你做的事情很有趣，就像有时候玩儿也不好玩——比如，如果你摔倒受伤了。但除了这些少数例外情况，工作基本上被定义为不有趣。而且这似乎不是偶然的。"
    },
    {
      "original": "School, it was implied, was tedious because it was preparation for grownup work.The world then was divided into two groups, grownups and kids. Grownups, like some kind of cursed race, had to work. Kids didn't, but they did have to go to school, which was a dilute version of work meant to prepare us for the real thing.",
      "translated": "学校，据说，之所以枯燥是因为它是在为成年工作做准备。当时的世界分为两大群体：成人和孩子。成人，仿佛受了某种诅咒的种族，不得不工作。孩子们则不需要工作，但他们必须上学，而上学就是工作的稀释版，旨在为我们将来真正的工作做准备。"
    },
    {
      "original": "Much as we disliked school, the grownups all agreed that grownup work was worse, and that we had it easy.Teachers in particular all seemed to believe implicitly that work was not fun. Which is not surprising: work wasn't fun for most of them.",
      "translated": "尽管我们不喜欢上学，但大人们都认为成人的工作更糟糕，而我们则轻松得多。尤其是老师们，似乎都坚信工作并不愉快。这也不奇怪：对他们中的大多数人来说，工作确实不愉快。"
    },
    {
      "original": "Why did we have to memorize state capitals instead of playing dodgeball? For the same reason they had to watch over a bunch of kids instead of lying on a beach. You couldn't just do what you wanted.I'm not saying we should let little kids do whatever they want.",
      "translated": "为什么我们要背州首府而不是玩躲避球呢？原因和他们不得不照看一群孩子而不是躺在海滩上一样。你不能随心所欲地做自己想做的事情。我不是说我们应该让小孩子为所欲为。"
    },
    {
      "original": "They may have to be made to work on certain things. But if we make kids work on dull stuff, it might be wise to tell them that tediousness is not the defining quality of work, and indeed that the reason they have to work on dull stuff now is so they can work on more interesting stuff later.",
      "translated": "他们可能需要被要求做一些特定的事情。但是，如果我们让孩子们做一些枯燥的工作，明智的做法是告诉他们，枯燥并不是工作的本质特征，事实上，他们现在需要做这些枯燥的事情，是为了将来能够从事更有意义的工作。"
    },
    {
      "original": "[1]Once, when I was about 9 or 10, my father told me I could be whatever I wanted when I grew up, so long as I enjoyed it. I remember that precisely because it seemed so anomalous. It was like being told to use dry water.",
      "translated": "有一次，我大概九岁或十岁的时候，父亲告诉我，我长大后可以成为任何我想成为的人，只要我喜欢。我之所以记得这么清楚，是因为这听起来太不寻常了。这就像被人告诉要用干水一样。"
    },
    {
      "original": "Whatever I thought he meant, I didn't think he meant work could literally be fun — fun like playing. It took me years to grasp that.JobsBy high school, the prospect of an actual job was on the horizon.",
      "translated": "不论我之前怎么想，我都没想到他指的是工作可以真正像玩一样有趣。这花了我好几年才理解。到了高中，真正的工作前景已经摆在了眼前。"
    },
    {
      "original": "Adults would sometimes come to speak to us about their work, or we would go to see them at work. It was always understood that they enjoyed what they did. In retrospect I think one may have: the private jet pilot.",
      "translated": "大人们有时会来和我们谈论他们的工作，或者我们会去他们工作的地方看看。大家总是觉得他们喜欢自己所做的工作。回想起来，我觉得有一个可能确实如此：私人飞机飞行员。"
    },
    {
      "original": "But I don't think the bank manager really did.The main reason they all acted as if they enjoyed their work was presumably the upper-middle class convention that you're supposed to. It would not merely be bad for your career to say that you despised your job, but a social faux-pas.Why is it conventional to pretend to like what you do?",
      "translated": "但是我认为银行经理实际上并非如此。他们所有人表现得好像很喜欢自己的工作，主要原因大概是因为中上阶层的惯例认为你应该如此。说你厌恶自己的工作不仅对你的职业生涯不利，而且是一种社交失礼。为什么假装喜欢自己的工作会成为一种惯例呢？"
    },
    {
      "original": "The first sentence of this essay explains that. If you have to like something to do it well, then the most successful people will all like what they do. That's where the upper-middle class tradition comes from.",
      "translated": "这篇论文的第一句话解释了这一点。如果你必须喜欢某件事才能做好，那么最成功的人将会喜欢他们所做的事情。这就是中上层阶级传统的由来。"
    },
    {
      "original": "Just as houses all over America are full of chairs that are, without the owners even knowing it, nth-degree imitations of chairs designed 250 years ago for French kings, conventional attitudes about work are, without the owners even knowing it, nth-degree imitations of the attitudes of people who've done great things.What a recipe for alienation.",
      "translated": "正如美国各地的房屋中充满了主人甚至不知情的、几度模仿250年前为法国国王设计的椅子一样，关于工作的传统态度也是在人们不知情的情况下，几度模仿了那些曾经做出伟大事业的人的态度。这真是疏离感的根源。"
    },
    {
      "original": "By the time they reach an age to think about what they'd like to do, most kids have been thoroughly misled about the idea of loving one's work. School has trained them to regard work as an unpleasant duty.",
      "translated": "到孩子们开始考虑自己想做什么的时候，大多数孩子已经被彻底误导了关于热爱工作这一概念。学校让他们把工作视为一种不愉快的义务。"
    },
    {
      "original": "Having a job is said to be even more onerous than schoolwork. And yet all the adults claim to like what they do. You can't blame kids for thinking \"I am not like these people; I am not suited to this world.\"Actually they've been told three lies: the stuff they've been taught to regard as work in school is not real work; grownup work is not (necessarily) worse than schoolwork; and many of the adults around them are lying when they say they like what they do.The most dangerous liars can be the kids' own parents.",
      "translated": "有人说，工作比学校的作业还要繁重。然而，所有成年人都声称自己喜欢自己的工作。你不能责怪孩子们会想：“我不像这些人，我不适合这个世界。”实际上，他们被告知了三个谎言：在学校里被教导认为是工作的那些事情并不是真正的工作；成人的工作并不（必然）比学校的作业更糟糕；而且，他们周围许多成年人说喜欢自己的工作其实是在撒谎。最危险的撒谎者可能是孩子们的父母。"
    },
    {
      "original": "If you take a boring job to give your family a high standard of living, as so many people do, you risk infecting your kids with the idea that work is boring. [2] Maybe it would be better for kids in this one case if parents were not so unselfish.",
      "translated": "如果你为了给家人提供高生活水平而从事一份乏味的工作，就像许多人所做的那样，你可能会无意中将工作无趣的想法传染给你的孩子。[2] 或许在这种情况下，如果父母不那么无私反而对孩子更好。"
    },
    {
      "original": "A parent who set an example of loving their work might help their kids more than an expensive house. [3]It was not till I was in college that the idea of work finally broke free from the idea of making a living.",
      "translated": "一个以热爱工作为榜样的父母可能比一栋昂贵的房子更能帮助他们的孩子。直到上大学时，我才终于将工作的概念从谋生的观念中解脱出来。"
    },
    {
      "original": "Then the important question became not how to make money, but what to work on. Ideally these coincided, but some spectacular boundary cases (like Einstein in the patent office) proved they weren't identical.The definition of work was now to make some original contribution to the world, and in the process not to starve.",
      "translated": "然后，重要的问题不再是如何赚钱，而是该做什么工作。理想情况下，这两者是一致的，但一些显著的边缘案例（如爱因斯坦在专利局）证明它们并不完全相同。现在，工作的定义是为世界做出一些原创性的贡献，并且在这个过程中不让自己饿死。"
    },
    {
      "original": "But after the habit of so many years my idea of work still included a large component of pain. Work still seemed to require discipline, because only hard problems yielded grand results, and hard problems couldn't literally be fun.",
      "translated": "但经过多年习惯的影响，我对于工作的看法仍然包含着大量痛苦的成分。工作似乎仍然需要自律，因为只有解决难题才能取得重大成果，而难题不可能真正有趣。"
    },
    {
      "original": "Surely one had to force oneself to work on them.If you think something's supposed to hurt, you're less likely to notice if you're doing it wrong. That about sums up my experience of graduate school.BoundsHow much are you supposed to like what you do?",
      "translated": "当然，你必须强迫自己去完成这些任务。如果你认为某件事本就应该让人感到痛苦，那么你就不太可能注意到自己是否做得不对。这大概就是我对研究生院生活的总结。界限你到底应该有多喜欢你做的事情？"
    },
    {
      "original": "Unless you know that, you don't know when to stop searching. And if, like most people, you underestimate it, you'll tend to stop searching too early. You'll end up doing something chosen for you by your parents, or the desire to make money, or prestige — or sheer inertia.Here's an upper bound: Do what you love doesn't mean, do what you would like to do most this second.",
      "translated": "除非你知道这一点，否则你不知道何时停止寻找。而如果你像大多数人一样低估了它，你就会过早地停止寻找。最终，你会做父母为你选择的事情，或者出于赚钱、追求声望——或者纯粹是惰性。这里有一个上限：做你喜欢的事情并不意味着去做你此刻最想做的事情。"
    },
    {
      "original": "Even Einstein probably had moments when he wanted to have a cup of coffee, but told himself he ought to finish what he was working on first.It used to perplex me when I read about people who liked what they did so much that there was nothing they'd rather do.",
      "translated": "即使爱因斯坦可能也有时候想喝杯咖啡，但他会告诉自己应该先完成手头的工作。过去当我读到有人如此热爱自己的工作，以至于没有什么事情比工作更想做的时候，我总是感到困惑。"
    },
    {
      "original": "There didn't seem to be any sort of work I liked that much. If I had a choice of (a) spending the next hour working on something or (b) be teleported to Rome and spend the next hour wandering about, was there any sort of work I'd prefer?",
      "translated": "似乎没有什么工作是我特别喜欢的。如果让我选择（a）花接下来的一个小时做某件事，或者（b）被传送到罗马并花一个小时四处逛逛，我是否会更倾向于某种工作？"
    },
    {
      "original": "Honestly, no.But the fact is, almost anyone would rather, at any given moment, float about in the Carribbean, or have sex, or eat some delicious food, than work on hard problems. The rule about doing what you love assumes a certain length of time.",
      "translated": "说实话，不是这样的。但事实是，在任何特定时刻，几乎任何人都宁愿在加勒比海漂浮，或者做爱，或者吃一些美味的食物，也不愿去解决困难的问题。做自己喜欢的事情的规则假设了一定的时间长度。"
    },
    {
      "original": "It doesn't mean, do what will make you happiest this second, but what will make you happiest over some longer period, like a week or a month.Unproductive pleasures pall eventually. After a while you get tired of lying on the beach.",
      "translated": "这并不意味着要做让你此刻最开心的事，而是要做让你在更长一段时间，比如一周或一个月里最开心的事。无生产力的快乐终究会让人厌倦。过一段时间后，你会对躺在沙滩上感到腻烦。"
    },
    {
      "original": "If you want to stay happy, you have to do something.As a lower bound, you have to like your work more than any unproductive pleasure. You have to like what you do enough that the concept of \"spare time\" seems mistaken.",
      "translated": "如果你想保持快乐，就必须做些什么。至少，你必须喜欢你的工作胜过任何不 productive 的快乐。你必须足够喜欢你做的事情，以至于“空闲时间”这个概念显得错误。"
    },
    {
      "original": "Which is not to say you have to spend all your time working. You can only work so much before you get tired and start to screw up. Then you want to do something else — even something mindless. But you don't regard this time as the prize and the time you spend working as the pain you endure to earn it.I put the lower bound there for practical reasons.",
      "translated": "这并不是说你必须把所有时间都花在工作上。工作太多你会感到疲惫，开始出错。那时你就会想做些别的事情——甚至是无需动脑的事情。但你不会把这段时间视为奖励，而把工作的时间视为为了获得奖励所忍受的痛苦。我设定这个下限是出于实际考虑。"
    },
    {
      "original": "If your work is not your favorite thing to do, you'll have terrible problems with procrastination. You'll have to force yourself to work, and when you resort to that the results are distinctly inferior.To be happy I think you have to be doing something you not only enjoy, but admire.",
      "translated": "如果你的工作不是你最喜欢做的事情，你会遇到严重的拖延问题。你将不得不强迫自己去工作，而一旦到了这种地步，结果往往会大打折扣。要想过得开心，我认为你不仅要做自己喜欢的事情，还要做自己敬佩的事情。"
    },
    {
      "original": "You have to be able to say, at the end, wow, that's pretty cool. This doesn't mean you have to make something. If you learn how to hang glide, or to speak a foreign language fluently, that will be enough to make you say, for a while at least, wow, that's pretty cool.",
      "translated": "你必须能够在最后说，哇，这真酷。这并不意味着你必须做出什么东西。如果你学会了滑翔伞，或者流利地说一门外语，这将足以让你在一段时间内至少说，哇，这真酷。"
    },
    {
      "original": "What there has to be is a test.So one thing that falls just short of the standard, I think, is reading books. Except for some books in math and the hard sciences, there's no test of how well you've read a book, and that's why merely reading books doesn't quite feel like work.",
      "translated": "必须有一个测试。所以，有一件事几乎达到了标准，我认为，那就是读书。除了数学和硬科学的某些书籍外，没有测试你读一本书的效果如何，这就是为什么仅仅读书并不完全感觉像工作。"
    },
    {
      "original": "You have to do something with what you've read to feel productive.I think the best test is one Gino Lee taught me: to try to do things that would make your friends say wow. But it probably wouldn't start to work properly till about age 22, because most people haven't had a big enough sample to pick friends from before then.SirensWhat you should not do, I think, is worry about the opinion of anyone beyond your friends.",
      "translated": "你必须对所读的内容有所行动，才能感到有成效。我认为最好的测试方法是吉诺·李教给我的：尝试做一些会让你的朋友说“哇”的事情。但这种方法可能要到大约22岁左右才会真正奏效，因为在此之前，大多数人都没有足够大的人群来选择朋友。此外，我认为你不应该在意超出你朋友范围的任何人的意见。"
    },
    {
      "original": "You shouldn't worry about prestige. Prestige is the opinion of the rest of the world. When you can ask the opinions of people whose judgement you respect, what does it add to consider the opinions of people you don't even know?",
      "translated": "你不应该担心声望。声望是别人对你的看法。当你能够听取那些你尊敬其判断的人的意见时，再去考虑那些你甚至不认识的人的看法，又能增加什么呢？"
    },
    {
      "original": "[4]This is easy advice to give. It's hard to follow, especially when you're young. [5] Prestige is like a powerful magnet that warps even your beliefs about what you enjoy. It causes you to work not on what you like, but what you'd like to like.That's what leads people to try to write novels, for example.",
      "translated": "[4] 这样的建议说起来容易，但做起来难，尤其是在你年轻的时候。[5] 名望就像一块强大的磁铁，甚至会扭曲你对自己兴趣的信念。它让你不是去做你喜欢的事情，而是去做你认为自己应该喜欢的事情。例如，这就是为什么人们会试图写小说。"
    },
    {
      "original": "They like reading novels. They notice that people who write them win Nobel prizes. What could be more wonderful, they think, than to be a novelist? But liking the idea of being a novelist is not enough; you have to like the actual work of novel-writing if you're going to be good at it; you have to like making up elaborate lies.Prestige is just fossilized inspiration.",
      "translated": "他们喜欢读小说。他们注意到写小说的人能获得诺贝尔奖。他们认为，还有什么比成为小说家更美好的呢？但是，喜欢成为小说家的想法是不够的；如果你想要擅长写作，你必须喜欢实际的小说创作工作；你必须喜欢编造复杂的故事。声望只不过是固化的灵感。"
    },
    {
      "original": "If you do anything well enough, you'll make it prestigious. Plenty of things we now consider prestigious were anything but at first. Jazz comes to mind — though almost any established art form would do.",
      "translated": "只要你把某件事做得足够好，你就能让它变得有声望。我们现在认为有声望的许多事情，起初却并非如此。爵士乐就是一个例子——几乎任何一种已确立的艺术形式都可以作为例子。"
    },
    {
      "original": "So just do what you like, and let prestige take care of itself.Prestige is especially dangerous to the ambitious. If you want to make ambitious people waste their time on errands, the way to do it is to bait the hook with prestige.",
      "translated": "所以，只做你喜欢的事，让声望自行其是。声望对有雄心的人来说尤其危险。如果你想让有雄心的人把时间浪费在琐事上，最好的办法就是用声望作为诱饵。"
    },
    {
      "original": "That's the recipe for getting people to give talks, write forewords, serve on committees, be department heads, and so on. It might be a good rule simply to avoid any prestigious task. If it didn't suck, they wouldn't have had to make it prestigious.Similarly, if you admire two kinds of work equally, but one is more prestigious, you should probably choose the other.",
      "translated": "这就是让人们做演讲、写序言、担任委员会成员、当系主任等事情的秘诀。或许一个好规则就是避免任何有声望的任务。如果这些事情本身不糟糕，也就不会被赋予声望。同样地，如果你同样欣赏两种工作，但其中一种更有声望，那你应该选择另一种。"
    },
    {
      "original": "Your opinions about what's admirable are always going to be slightly influenced by prestige, so if the two seem equal to you, you probably have more genuine admiration for the less prestigious one.The other big force leading people astray is money.",
      "translated": "你对什么是值得钦佩的看法总是会受到声望的影响，所以如果两者在你看来似乎相当，那你可能对那个声望较低的有更真诚的钦佩。导致人们偏离正轨的另一个重要因素是金钱。"
    },
    {
      "original": "Money by itself is not that dangerous. When something pays well but is regarded with contempt, like telemarketing, or prostitution, or personal injury litigation, ambitious people aren't tempted by it.",
      "translated": "金钱本身并不那么危险。当某件事报酬丰厚但被人轻视，比如电话营销、卖淫或人身伤害诉讼时，有抱负的人并不会被其诱惑。"
    },
    {
      "original": "That kind of work ends up being done by people who are \"just trying to make a living.\" (Tip: avoid any field whose practitioners say this.) The danger is when money is combined with prestige, as in, say, corporate law, or medicine.",
      "translated": "这种工作最终是由那些“只是想谋生”的人来做的。（提示：避免任何从业者说这种话的领域。）危险在于当金钱与声望结合时，比如在公司法或医学领域。"
    },
    {
      "original": "A comparatively safe and prosperous career with some automatic baseline prestige is dangerously tempting to someone young, who hasn't thought much about what they really like.The test of whether people love what they do is whether they'd do it even if they weren't paid for it — even if they had to work at another job to make a living.",
      "translated": "一个相对安全且繁荣的职业，带有一定的自动基础声望，对于一个年轻人来说是极其诱人的，尤其是当他们还没有认真思考过自己真正喜欢什么的时候。检验人们是否热爱自己所做事情的标准是，即使不为此得到报酬，甚至需要做另一份工作来维持生计，他们是否仍然会去做。"
    },
    {
      "original": "How many corporate lawyers would do their current work if they had to do it for free, in their spare time, and take day jobs as waiters to support themselves?This test is especially helpful in deciding between different kinds of academic work, because fields vary greatly in this respect.",
      "translated": "如果有多少公司律师会愿意在空闲时间无偿地做他们现在的工作，同时为了养活自己而做服务员的白天工作？这种测试对于选择不同类型的学术工作尤其有帮助，因为各个领域在这方面差异很大。"
    },
    {
      "original": "Most good mathematicians would work on math even if there were no jobs as math professors, whereas in the departments at the other end of the spectrum, the availability of teaching jobs is the driver: people would rather be English professors than work in ad agencies, and publishing papers is the way you compete for such jobs.",
      "translated": "大多数优秀的数学家即使没有数学教授的职位也会从事数学研究，而在光谱另一端的系里，教学职位的可获得性是驱动力：人们更愿意成为英语教授而不是在广告公司工作，而发表论文是你争夺这些职位的方式。"
    },
    {
      "original": "Math would happen without math departments, but it is the existence of English majors, and therefore jobs teaching them, that calls into being all those thousands of dreary papers about gender and identity in the novels of Conrad.",
      "translated": "数学即使没有数学系也会存在，但正是英语专业的存在，以及因此而产生的教授这些专业的职位，催生了成千上万篇关于康拉德小说中性别和身份的枯燥论文。"
    },
    {
      "original": "No one does that kind of thing for fun.The advice of parents will tend to err on the side of money. It seems safe to say there are more undergrads who want to be novelists and whose parents want them to be doctors than who want to be doctors and whose parents want them to be novelists.",
      "translated": "没有人会为了好玩而做那种事情。父母的建议往往会偏向于金钱方面。可以说，想要成为小说家的大学生，其父母希望他们成为医生的情况，要比想要成为医生的大学生，其父母希望他们成为小说家的情况多得多。"
    },
    {
      "original": "The kids think their parents are \"materialistic.\" Not necessarily. All parents tend to be more conservative for their kids than they would for themselves, simply because, as parents, they share risks more than rewards.",
      "translated": "孩子们认为他们的父母“物质主义”。这未必正确。所有父母往往对子女比对自己更为保守，仅仅是因为作为父母，他们承担的风险比获得的回报更多。"
    },
    {
      "original": "If your eight year old son decides to climb a tall tree, or your teenage daughter decides to date the local bad boy, you won't get a share in the excitement, but if your son falls, or your daughter gets pregnant, you'll have to deal with the consequences.DisciplineWith such powerful forces leading us astray, it's not surprising we find it so hard to discover what we like to work on.",
      "translated": "如果你八岁的儿子决定爬一棵高树，或者你十几岁的女儿决定和当地的“坏小子”交往，你无法分享他们的刺激，但如果你的儿子摔下来，或者女儿怀孕了，你将不得不面对后果。由于有如此强大的力量引导我们偏离正轨，我们发现自己很难发现真正想从事的工作，这并不令人惊讶。"
    },
    {
      "original": "Most people are doomed in childhood by accepting the axiom that work = pain. Those who escape this are nearly all lured onto the rocks by prestige or money. How many even discover something they love to work on?",
      "translated": "大多数人从小就被灌输了“工作=痛苦”这一公理，从而注定了他们的命运。那些能够摆脱这一命运的人，几乎全都被名望或金钱引向了歧途。有多少人甚至能找到自己热爱的工作呢？"
    },
    {
      "original": "A few hundred thousand, perhaps, out of billions.It's hard to find work you love; it must be, if so few do. So don't underestimate this task. And don't feel bad if you haven't succeeded yet. In fact, if you admit to yourself that you're discontented, you're a step ahead of most people, who are still in denial.",
      "translated": "也许在数十亿人中只有几十万。找到自己热爱的工作很难；如果这么少的人能做到，那确实很难。所以，不要低估这项任务。如果你还没有成功，也不要感到沮丧。事实上，如果你能承认自己不满意，那你已经比大多数仍然处于否认状态的人领先一步了。"
    },
    {
      "original": "If you're surrounded by colleagues who claim to enjoy work that you find contemptible, odds are they're lying to themselves. Not necessarily, but probably.Although doing great work takes less discipline than people think — because the way to do great work is to find something you like so much that you don't have to force yourself to do it — finding work you love does usually require discipline.",
      "translated": "如果你周围的人都声称喜欢那些你认为不屑一顾的工作，他们很可能是在自欺欺人。虽然不一定，但可能性很大。尽管出色的工作所需的自律比人们想象的要少——因为做到出色的关键是找到你如此喜欢的事情，以至于你不必强迫自己去做——但找到你热爱的工作通常确实需要自律。"
    },
    {
      "original": "Some people are lucky enough to know what they want to do when they're 12, and just glide along as if they were on railroad tracks. But this seems the exception. More often people who do great things have careers with the trajectory of a ping-pong ball.",
      "translated": "有些人幸运地在12岁时就知道自己想要做什么，仿佛沿着铁轨滑行般顺畅。但这种情况似乎属于例外。更常见的是，那些成就伟业的人，他们的职业生涯像乒乓球的轨迹一样起伏不定。"
    },
    {
      "original": "They go to school to study A, drop out and get a job doing B, and then become famous for C after taking it up on the side.Sometimes jumping from one sort of work to another is a sign of energy, and sometimes it's a sign of laziness.",
      "translated": "他们上学学的是A，退学后找了一份与B相关的工作，然后在业余时间投身C并因此成名。有时候，从一种工作跳到另一种工作是精力充沛的标志，而有时候则是懒惰的体现。"
    },
    {
      "original": "Are you dropping out, or boldly carving a new path? You often can't tell yourself. Plenty of people who will later do great things seem to be disappointments early on, when they're trying to find their niche.Is there some test you can use to keep yourself honest?",
      "translated": "你是中途放弃，还是勇敢地开辟新路径？你往往难以对自己做出判断。许多后来成就一番事业的人，在早期寻找自己的位置时，似乎都曾让人失望。有没有什么测试可以帮助你保持诚实？"
    },
    {
      "original": "One is to try to do a good job at whatever you're doing, even if you don't like it. Then at least you'll know you're not using dissatisfaction as an excuse for being lazy. Perhaps more importantly, you'll get into the habit of doing things well.Another test you can use is: always produce.",
      "translated": "一是要尽力做好手头的工作，即使你不喜欢。这样至少你不会以不满为借口来偷懒。也许更重要的是，你会养成把事情做好的习惯。另一个你可以使用的检验标准是：始终要产出。"
    },
    {
      "original": "For example, if you have a day job you don't take seriously because you plan to be a novelist, are you producing? Are you writing pages of fiction, however bad? As long as you're producing, you'll know you're not merely using the hazy vision of the grand novel you plan to write one day as an opiate.",
      "translated": "例如，如果你有一份你并不认真对待的日常工作，因为你计划成为一名小说家，你是否在创作？你是否在写小说，即使写得不好？只要你一直在创作，你就知道自己不仅仅是在用那个模糊的宏伟小说计划来麻醉自己。"
    },
    {
      "original": "The view of it will be obstructed by the all too palpably flawed one you're actually writing.\"Always produce\" is also a heuristic for finding the work you love. If you subject yourself to that constraint, it will automatically push you away from things you think you're supposed to work on, toward things you actually like.",
      "translated": "它的观点将被你实际写作的那个显而易见有缺陷的观点所遮挡。“始终创作”也是一种找到你热爱的工作的启发方法。如果你让自己受到这种约束，它会自动将你从你认为应该从事的事情中推开，引导你走向你真正喜欢的事情。"
    },
    {
      "original": "\"Always produce\" will discover your life's work the way water, with the aid of gravity, finds the hole in your roof.Of course, figuring out what you like to work on doesn't mean you get to work on it.",
      "translated": "“持续产出”会像水借助重力找到你屋顶的漏洞一样，发现你生命中的工作。当然，弄清楚你喜欢做什么并不意味着你就能去做。"
    },
    {
      "original": "That's a separate question. And if you're ambitious you have to keep them separate: you have to make a conscious effort to keep your ideas about what you want from being contaminated by what seems possible.",
      "translated": "那是另一个问题。而且，如果你有雄心壮志，就必须将它们区分开来：你必须有意识地努力防止你对目标的设想受到看似可能的事情的污染。"
    },
    {
      "original": "[6]It's painful to keep them apart, because it's painful to observe the gap between them. So most people pre-emptively lower their expectations. For example, if you asked random people on the street if they'd like to be able to draw like Leonardo, you'd find most would say something like \"Oh, I can't draw.\" This is more a statement of intention than fact; it means, I'm not going to try.",
      "translated": "将他们分开是痛苦的，因为看到他们之间的差距是痛苦的。所以大多数人会预先降低期望。例如，如果你随机问街上的人是否希望像达·芬奇那样画画，你会发现大多数人的回答会是：“哦，我不会画画。”这更多是一种意图的表达，而非事实陈述；意思是我不会去尝试。"
    },
    {
      "original": "Because the fact is, if you took a random person off the street and somehow got them to work as hard as they possibly could at drawing for the next twenty years, they'd get surprisingly far. But it would require a great moral effort; it would mean staring failure in the eye every day for years.",
      "translated": "事实上，如果你随意找一个路人，设法让他们在接下来的二十年里尽最大努力画画，他们会取得令人惊讶的成就。但这需要巨大的道德勇气；这意味着要年复一年地每天直面失败。"
    },
    {
      "original": "And so to protect themselves people say \"I can't.\"Another related line you often hear is that not everyone can do work they love — that someone has to do the unpleasant jobs. Really? How do you make them?",
      "translated": "因此，为了保护自己，人们会说“我不能。”另一句你经常能听到的类似的话是，并不是每个人都能做自己喜欢的工作——总得有人去做那些不愉快的工作。真的吗？你怎么让他们去做呢？"
    },
    {
      "original": "In the US the only mechanism for forcing people to do unpleasant jobs is the draft, and that hasn't been invoked for over 30 years. All we can do is encourage people to do unpleasant work, with money and prestige.If there's something people still won't do, it seems as if society just has to make do without.",
      "translated": "在美国，强制人们从事不愉快工作的唯一机制是征兵制，但这一制度已经30多年没有实施了。我们能做的只是通过金钱和声望来鼓励人们从事这些不愉快的工作。如果仍然有工作无人愿意做，社会似乎只能设法应对，缺少这些工作。"
    },
    {
      "original": "That's what happened with domestic servants. For millennia that was the canonical example of a job \"someone had to do.\" And yet in the mid twentieth century servants practically disappeared in rich countries, and the rich have just had to do without.So while there may be some things someone has to do, there's a good chance anyone saying that about any particular job is mistaken.",
      "translated": "这就是家仆的情况。数千年里，家仆的工作一直是“必须有人去做”的典型例子。然而，在20世纪中叶，家仆在富裕国家几乎消失了，富人们只好自己应付。所以，虽然有些事情可能是必须有人去做的，但当有人说某个具体工作必须有人做时，很可能他们是错误的。"
    },
    {
      "original": "Most unpleasant jobs would either get automated or go undone if no one were willing to do them.Two RoutesThere's another sense of \"not everyone can do work they love\" that's all too true, however. One has to make a living, and it's hard to get paid for doing work you love.",
      "translated": "大多数不愉快的工作要么会被自动化，要么如果没有人愿意做就会无人问津。然而，还有一种“并非每个人都能做自己热爱的工作”的情况确实存在。人总得谋生，而靠做自己热爱的工作来赚钱是很难的。"
    },
    {
      "original": "There are two routes to that destination: The organic route: as you become more eminent, gradually to increase the parts of your job that you like at the expense of those you don't.The two-job route: to work at things you don't like to get money to work on things you do.",
      "translated": "到达那个目标有两条路径：自然之路：随着你声望的提高，逐渐增加你喜欢的工作部分，减少你不喜欢的部分。双职路径：从事你不喜欢的工作以赚钱，从而能够从事你喜欢的工作。"
    },
    {
      "original": "The organic route is more common. It happens naturally to anyone who does good work. A young architect has to take whatever work he can get, but if he does well he'll gradually be in a position to pick and choose among projects.",
      "translated": "有机路径更为常见。任何人只要做得好，这种发展就会自然发生。一位年轻的建筑师必须接受任何他能得到的工作，但如果他做得出色，他将逐渐处于可以挑选项目的地位。"
    },
    {
      "original": "The disadvantage of this route is that it's slow and uncertain. Even tenure is not real freedom.The two-job route has several variants depending on how long you work for money at a time. At one extreme is the \"day job,\" where you work regular hours at one job to make money, and work on what you love in your spare time.",
      "translated": "这条路线的缺点在于它既缓慢又不确定。即使获得了终身教职，也并不意味着真正的自由。兼职路线有几种变体，具体取决于你一次为赚钱工作多长时间。其中一个极端是“白天工作”，即你在一份工作中按常规时间工作以赚取收入，而在业余时间从事你热爱的工作。"
    },
    {
      "original": "At the other extreme you work at something till you make enough not to have to work for money again.The two-job route is less common than the organic route, because it requires a deliberate choice. It's also more dangerous.",
      "translated": "在另一个极端，你会一直工作到赚足够的钱，以至于再也不需要用工作来谋生。两条路中，选择两条职业道路的情况比自然发展的情况要少见，因为这需要一个刻意的选择。这也更加危险。"
    },
    {
      "original": "Life tends to get more expensive as you get older, so it's easy to get sucked into working longer than you expected at the money job. Worse still, anything you work on changes you. If you work too long on tedious stuff, it will rot your brain.",
      "translated": "随着年龄的增长，生活往往会变得越来越昂贵，因此很容易在赚钱的工作上工作得比预期更久。更糟糕的是，你所从事的任何工作都会改变你。如果你长时间从事枯燥无味的工作，它会腐蚀你的大脑。"
    },
    {
      "original": "And the best paying jobs are most dangerous, because they require your full attention.The advantage of the two-job route is that it lets you jump over obstacles. The landscape of possible jobs isn't flat; there are walls of varying heights between different kinds of work.",
      "translated": "报酬最高的工作往往是最危险的，因为它们需要你全神贯注。而选择两份工作的优势在于，它能让你跨越障碍。可能的职业道路并不是平坦的；不同种类的工作之间存在着高低不等的障碍。"
    },
    {
      "original": "[7] The trick of maximizing the parts of your job that you like can get you from architecture to product design, but not, probably, to music. If you make money doing one thing and then work on another, you have more freedom of choice.Which route should you take?",
      "translated": "[7] 将你工作中喜欢的部分最大化这一招可以从建筑领域带你进入产品设计，但可能无法带你进入音乐领域。如果你通过做一件事赚钱，然后在另一件事上工作，你将拥有更多的选择自由。你应该选择哪条路呢？"
    },
    {
      "original": "That depends on how sure you are of what you want to do, how good you are at taking orders, how much risk you can stand, and the odds that anyone will pay (in your lifetime) for what you want to do. If you're sure of the general area you want to work in and it's something people are likely to pay you for, then you should probably take the organic route.",
      "translated": "这取决于你对自己想做的事情有多确定，你有多擅长接受指示，你能承受多大的风险，以及在你有生之年有人愿意为你想做的事情付费的可能性有多大。如果你对自己想工作的领域有把握，而且这是一件人们可能会为你付费的事情，那么你大概应该选择自然发展的方式。"
    },
    {
      "original": "But if you don't know what you want to work on, or don't like to take orders, you may want to take the two-job route, if you can stand the risk.Don't decide too soon. Kids who know early what they want to do seem impressive, as if they got the answer to some math question before the other kids.",
      "translated": "但是，如果你不知道自己想做什么，或者不喜欢听从命令，那么如果你能承受风险的话，可以选择同时做两份工作。不要过早决定。那些很早就知道自己想做什么的孩子看起来很了不起，好像他们在其他孩子之前就解出了一道数学题。"
    },
    {
      "original": "They have an answer, certainly, but odds are it's wrong.A friend of mine who is a quite successful doctor complains constantly about her job. When people applying to medical school ask her for advice, she wants to shake them and yell \"Don't do it!\" (But she never does.) How did she get into this fix?",
      "translated": "他们当然有答案，但很可能都是错的。我有一个相当成功的医生朋友，她经常抱怨自己的工作。当有申请医学院的人向她寻求建议时，她真想摇晃他们，大喊“别这么做！”（但她从没这么做过。）她是怎么陷入这种困境的？"
    },
    {
      "original": "In high school she already wanted to be a doctor. And she is so ambitious and determined that she overcame every obstacle along the way — including, unfortunately, not liking it.Now she has a life chosen for her by a high-school kid.When you're young, you're given the impression that you'll get enough information to make each choice before you need to make it.",
      "translated": "高中时她就想要成为一名医生。她雄心勃勃、意志坚定，克服了沿途的一切障碍——不幸的是，这其中也包括她自己并不喜欢这份职业。现在她的生活是由那个高中生选择的。当你年轻时，你会被灌输一种印象，即在你需要做出每个选择之前，你会得到足够的信息。"
    },
    {
      "original": "But this is certainly not so with work. When you're deciding what to do, you have to operate on ridiculously incomplete information. Even in college you get little idea what various types of work are like.",
      "translated": "但工作绝非如此。在决定要做什么时，你必须基于极其不完整的信息来行动。即使在大学里，你也很难了解到各种工作的实际情况。"
    },
    {
      "original": "At best you may have a couple internships, but not all jobs offer internships, and those that do don't teach you much more about the work than being a batboy teaches you about playing baseball.In the design of lives, as in the design of most other things, you get better results if you use flexible media.",
      "translated": "你最多可能有几个实习机会，但并不是所有的工作都提供实习，而那些提供实习的岗位也并不会让你学到太多关于工作的知识，就像当球童并不能教会你如何打棒球一样。在规划人生时，就像在设计大多数其他事物时一样，如果你使用灵活的媒介，你会得到更好的结果。"
    },
    {
      "original": "So unless you're fairly sure what you want to do, your best bet may be to choose a type of work that could turn into either an organic or two-job career. That was probably part of the reason I chose computers.",
      "translated": "所以，除非你对自己的职业方向相当确定，否则最好选择一种既有可能发展为有机职业生涯，也有可能发展为双轨职业生涯的工作类型。这可能也是我选择计算机领域的原因之一。"
    },
    {
      "original": "You can be a professor, or make a lot of money, or morph it into any number of other kinds of work.It's also wise, early on, to seek jobs that let you do many different things, so you can learn faster what various kinds of work are like.",
      "translated": "你可以成为一名教授，或者赚很多钱，或者将其转变为许多其他类型的工作。在早期，寻找那些能让你做许多不同事情的工作也是明智的，这样你就能更快地了解各种工作的特点。"
    },
    {
      "original": "Conversely, the extreme version of the two-job route is dangerous because it teaches you so little about what you like. If you work hard at being a bond trader for ten years, thinking that you'll quit and write novels when you have enough money, what happens when you quit and then discover that you don't actually like writing novels?Most people would say, I'd take that problem.",
      "translated": "相反，两条职业道路中的极端选择是危险的，因为它几乎不教你任何关于自己喜好的东西。如果你努力当了十年的债券交易员，想着等有了足够的钱就辞职去写小说，那么当你辞职后却发现实际上并不喜欢写小说时，该怎么办？大多数人会说，我愿意接受这个问题。"
    },
    {
      "original": "Give me a million dollars and I'll figure out what to do. But it's harder than it looks. Constraints give your life shape. Remove them and most people have no idea what to do: look at what happens to those who win lotteries or inherit money.",
      "translated": "给我一百万美元，我就会想出办法。但这比看起来要难。限制条件赋予生活以形态。去掉这些限制，大多数人就不知道该做什么了：看看那些中了彩票或继承了财产的人就知道了。"
    },
    {
      "original": "Much as everyone thinks they want financial security, the happiest people are not those who have it, but those who like what they do. So a plan that promises freedom at the expense of knowing what to do with it may not be as good as it seems.Whichever route you take, expect a struggle.",
      "translated": "尽管每个人都认为自己想要财务安全，但最幸福的人并不是那些拥有它的人，而是那些喜欢自己所做事情的人。因此，一个以牺牲知道自己如何使用这种自由为代价而承诺自由的计划可能并不像看起来那么好。无论你选择哪条路，都要准备好迎接挑战。"
    },
    {
      "original": "Finding work you love is very difficult. Most people fail. Even if you succeed, it's rare to be free to work on what you want till your thirties or forties. But if you have the destination in sight you'll be more likely to arrive at it.",
      "translated": "找到你热爱的工作非常困难。大多数人无法做到。即使你成功了，也很少有人能在三四十岁之前自由地从事自己想做的事情。但如果你心中有目标，你就更有可能达到它。"
    },
    {
      "original": "If you know you can love work, you're in the home stretch, and if you know what work you love, you're practically there.Notes[1] Currently we do the opposite: when we make kids do boring work, like arithmetic drills, instead of admitting frankly that it's boring, we try to disguise it with superficial decorations.[2] One father told me about a related phenomenon: he found himself concealing from his family how much he liked his work.",
      "translated": "如果你知道自己能够热爱工作，那你已经接近终点了；如果你知道自己热爱什么样的工作，那你几乎已经到达了。注释[1] 然而现在我们却反其道而行之：当我们让孩子做枯燥的工作，比如算术练习时，我们不是坦率地承认这是枯燥的，而是试图用表面的装饰来掩饰这一点。[2] 一位父亲告诉了我一个相关现象：他发现自己对家人隐瞒了自己多么喜欢自己的工作。"
    },
    {
      "original": "When he wanted to go to work on a saturday, he found it easier to say that it was because he \"had to\" for some reason, rather than admitting he preferred to work than stay home with them.[3] Something similar happens with suburbs.",
      "translated": "当他想在周六去上班时，他觉得说因为某种原因“不得不”去，比承认他宁愿工作也不愿和他们待在家更容易。[3] 类似的情况也发生在郊区。"
    },
    {
      "original": "Parents move to suburbs to raise their kids in a safe environment, but suburbs are so dull and artificial that by the time they're fifteen the kids are convinced the whole world is boring.[4] I'm not saying friends should be the only audience for your work.",
      "translated": "父母搬到郊区是为了在安全的环境中抚养孩子，但郊区过于单调和人造，以至于孩子们到了十五岁就认为整个世界都很无聊。[4] 我并不是说朋友应该是你作品的唯一观众。"
    },
    {
      "original": "The more people you can help, the better. But friends should be your compass.[5] Donald Hall said young would-be poets were mistaken to be so obsessed with being published. But you can imagine what it would do for a 24 year old to get a poem published in The New Yorker.",
      "translated": "你能帮助的人越多越好。但朋友应该是你的指南针。[5] 唐纳德·霍尔说，年轻诗人过于痴迷于出版是错误的。但你可以想象，对于一个24岁的年轻人来说，在《纽约客》上发表一首诗会有多大的影响。"
    },
    {
      "original": "Now to people he meets at parties he's a real poet. Actually he's no better or worse than he was before, but to a clueless audience like that, the approval of an official authority makes all the difference.",
      "translated": "现在在聚会上遇到的人们眼中，他真的成了诗人。其实他并没有比以前更好或更差，但是对于这样一个什么都不懂的听众来说，官方权威的认可就显得至关重要了。"
    },
    {
      "original": "So it's a harder problem than Hall realizes. The reason the young care so much about prestige is that the people they want to impress are not very discerning.[6] This is isomorphic to the principle that you should prevent your beliefs about how things are from being contaminated by how you wish they were.",
      "translated": "所以，这比霍尔意识到的要更复杂。年轻人如此看重声望的原因是，他们想要取悦的人并不太有鉴赏力。[6] 这与一个原则同构，即你应该防止你对事物实际状态的看法被你希望它们是的样子所污染。"
    },
    {
      "original": "Most people let them mix pretty promiscuously. The continuing popularity of religion is the most visible index of that.[7] A more accurate metaphor would be to say that the graph of jobs is not very well connected.Thanks to Trevor Blackwell, Dan Friedman, Sarah Harlin, Jessica Livingston, Jackie McDonough, Robert Morris, Peter Norvig, David Sloo, and Aaron Swartz for reading drafts of this.Hebrew TranslationJapanese TranslationChinese TranslationRussian TranslationSlovak TranslationItalian TranslationGerman TranslationSpanish TranslationFrench TranslationHungarian TranslationPortuguese TranslationSerbian TranslationGreek TranslationVietnamese Translation",
      "translated": "大多数人让他们相当随意地混在一起。宗教的持续流行是这一点最明显的指标。[7] 一个更准确的比喻是说，工作图的连接性不是很好。感谢 Trevor Blackwell、Dan Friedman、Sarah Harlin、Jessica Livingston、Jackie McDonough、Robert Morris、Peter Norvig、David Sloo 和 Aaron Swartz 阅读本文的草稿。希伯来语翻译日语翻译中文翻译俄语翻译斯洛伐克语翻译意大利语翻译德语翻译西班牙语翻译法语翻译匈牙利语翻译葡萄牙语翻译塞尔维亚语翻译希腊语翻译越南语翻译"
    }
  ],
  "translation_completed": "2025-07-28T23:33:04.960368",
  "translation_stats": {
    "total_paragraphs": 90,
    "success_count": 90,
    "success_rate": "100.0%"
  }
}