{
  "title": "Mean People Fail",
  "title_zh": "[待翻译] Mean People Fail",
  "url": "https://www.paulgraham.com/mean.html",
  "filename": "mean.html",
  "date": "2014-11-01",
  "id": 123,
  "content": {
    "success": true,
    "paragraphs": [
      "November 2014It struck me recently how few of the most successful people I know are mean. There are exceptions, but remarkably few.Meanness isn't rare. In fact, one of the things the internet has shown us is how mean people can be.",
      "A few decades ago, only famous people and professional writers got to publish their opinions. Now everyone can, and we can all see the long tail of meanness that had previously been hidden.And yet while there are clearly a lot of mean people out there, there are next to none among the most successful people I know.",
      "What's going on here? Are meanness and success inversely correlated?Part of what's going on, of course, is selection bias. I only know people who work in certain fields: startup founders, programmers, professors.",
      "I'm willing to believe that successful people in other fields are mean. Maybe successful hedge fund managers are mean; I don't know enough to say. It seems quite likely that most successful drug lords are mean.",
      "But there are at least big chunks of the world that mean people don't rule, and that territory seems to be growing.My wife and Y Combinator cofounder Jessica is one of those rare people who have x-ray vision for character.",
      "Being married to her is like standing next to an airport baggage scanner. She came to the startup world from investment banking, and she has always been struck both by how consistently successful startup founders turn out to be good people, and how consistently bad people fail as startup founders.Why?",
      "I think there are several reasons. One is that being mean makes you stupid. That's why I hate fights. You never do your best work in a fight, because fights are not sufficiently general. Winning is always a function of the situation and the people involved.",
      "You don't win fights by thinking of big ideas but by thinking of tricks that work in one particular case. And yet fighting is just as much work as thinking about real problems. Which is particularly painful to someone who cares how their brain is used: your brain goes fast but you get nowhere, like a car spinning its wheels.Startups don't win by attacking.",
      "They win by transcending. There are exceptions of course, but usually the way to win is to race ahead, not to stop and fight.Another reason mean founders lose is that they can't get the best people to work for them.",
      "They can hire people who will put up with them because they need a job. But the best people have other options. A mean person can't convince the best people to work for him unless he is super convincing.",
      "And while having the best people helps any organization, it's critical for startups.There is also a complementary force at work: if you want to build great things, it helps to be driven by a spirit of benevolence.",
      "The startup founders who end up richest are not the ones driven by money. The ones driven by money take the big acquisition offer that nearly every successful startup gets en route. [1] The ones who keep going are driven by something else.",
      "They may not say so explicitly, but they're usually trying to improve the world. Which means people with a desire to improve the world have a natural advantage. [2]The exciting thing is that startups are not just one random type of work in which meanness and success are inversely correlated.",
      "This kind of work is the future.For most of history success meant control of scarce resources. One got that by fighting, whether literally in the case of pastoral nomads driving hunter-gatherers into marginal lands, or metaphorically in the case of Gilded Age financiers contending with one another to assemble railroad monopolies.",
      "For most of history, success meant success at zero-sum games. And in most of them meanness was not a handicap but probably an advantage.That is changing. Increasingly the games that matter are not zero-sum.",
      "Increasingly you win not by fighting to get control of a scarce resource, but by having new ideas and building new things. [3]There have long been games where you won by having new ideas. In the third century BC, Archimedes won by doing that.",
      "At least until an invading Roman army killed him. Which illustrates why this change is happening: for new ideas to matter, you need a certain degree of civil order. And not just not being at war. You also need to prevent the sort of economic violence that nineteenth century magnates practiced against one another and communist countries practiced against their citizens.",
      "People need to feel that what they create can't be stolen. [4]That has always been the case for thinkers, which is why this trend began with them. When you think of successful people from history who weren't ruthless, you get mathematicians and writers and artists.",
      "The exciting thing is that their m.o. seems to be spreading. The games played by intellectuals are leaking into the real world, and this is reversing the historical polarity of the relationship between meanness and success.So I'm really glad I stopped to think about this.",
      "Jessica and I have always worked hard to teach our kids not to be mean. We tolerate noise and mess and junk food, but not meanness. And now I have both an additional reason to crack down on it, and an additional argument to use when I do: that being mean makes you fail.",
      "Notes[1] I'm not saying all founders who take big acquisition offers are driven only by money, but rather that those who don't aren't. Plus one can have benevolent motives for being driven by money — for example, to take care of one's family, or to be free to work on projects that improve the world.[2] It's unlikely that every successful startup improves the world.",
      "But their founders, like parents, truly believe they do. Successful founders are in love with their companies. And while this sort of love is as blind as the love people have for one another, it is genuine.[3] Peter Thiel would point out that successful founders still get rich from controlling monopolies, just monopolies they create rather than ones they capture.",
      "And while this is largely true, it means a big change in the sort of person who wins.[4] To be fair, the Romans didn't mean to kill Archimedes. The Roman commander specifically ordered that he be spared.",
      "But he got killed in the chaos anyway.In sufficiently disordered times, even thinking requires control of scarce resources, because living at all is a scarce resource.Thanks to Sam Altman, Ron Conway, Daniel Gackle, Jessica Livingston, Robert Morris, Geoff Ralston, and Fred Wilson for reading drafts of this.Portuguese TranslationJapanese TranslationArabic Translation"
    ],
    "word_count": 1120,
    "paragraph_count": 24
  },
  "processed_at": "2025-07-26T19:05:23.606954",
  "paragraphs": [
    {
      "original": "November 2014It struck me recently how few of the most successful people I know are mean. There are exceptions, but remarkably few.Meanness isn't rare. In fact, one of the things the internet has shown us is how mean people can be.",
      "translated": "2014年11月 最近我突然意识到，我所认识的最成功的人当中，很少有人是刻薄的。当然也有例外，但出奇的少。刻薄并不是罕见的品质。事实上，互联网向我们展示的一点就是人们可以有多么刻薄。"
    },
    {
      "original": "A few decades ago, only famous people and professional writers got to publish their opinions. Now everyone can, and we can all see the long tail of meanness that had previously been hidden.And yet while there are clearly a lot of mean people out there, there are next to none among the most successful people I know.",
      "translated": "几十年前，只有名人和职业作家能够发表他们的观点。现在每个人都可以发表，我们也能看到之前隐藏的那些小人物的恶意。然而，尽管外面显然有很多刻薄的人，但在我认识的最成功的人中，这样的却几乎一个都没有。"
    },
    {
      "original": "What's going on here? Are meanness and success inversely correlated?Part of what's going on, of course, is selection bias. I only know people who work in certain fields: startup founders, programmers, professors.",
      "translated": "这里到底发生了什么？刻薄和成功之间是否呈反比关系？当然，部分原因在于选择偏差。我只认识在某些领域工作的人：初创公司的创始人、程序员、教授。"
    },
    {
      "original": "I'm willing to believe that successful people in other fields are mean. Maybe successful hedge fund managers are mean; I don't know enough to say. It seems quite likely that most successful drug lords are mean.",
      "translated": "我愿意相信其他领域成功的人可能是刻薄的。也许成功的对冲基金经理是刻薄的；我不够了解，无法下定论。大多数成功的毒枭很可能是刻薄的。"
    },
    {
      "original": "But there are at least big chunks of the world that mean people don't rule, and that territory seems to be growing.My wife and Y Combinator cofounder Jessica is one of those rare people who have x-ray vision for character.",
      "translated": "但是，世界上至少有一大部分地方并不是由坏人统治的，而且这样的地区似乎正在扩大。我的妻子、Y Combinator的联合创始人杰西卡就是那些少数能够洞察人性的罕见人物之一。"
    },
    {
      "original": "Being married to her is like standing next to an airport baggage scanner. She came to the startup world from investment banking, and she has always been struck both by how consistently successful startup founders turn out to be good people, and how consistently bad people fail as startup founders.Why?",
      "translated": "和她结婚就像站在机场的行李扫描仪旁边。她从投资银行转到了创业圈，一直对两个现象感到惊讶：一是成功的创业家往往都是好人，二是品行不端的人作为创业者总是失败。为什么呢？"
    },
    {
      "original": "I think there are several reasons. One is that being mean makes you stupid. That's why I hate fights. You never do your best work in a fight, because fights are not sufficiently general. Winning is always a function of the situation and the people involved.",
      "translated": "我认为有几个原因。一个是刻薄会使人变蠢。这就是我讨厌争斗的原因。在争斗中你永远不会做出最好的工作，因为争斗不够普遍。胜利总是取决于具体情况和涉及的人。"
    },
    {
      "original": "You don't win fights by thinking of big ideas but by thinking of tricks that work in one particular case. And yet fighting is just as much work as thinking about real problems. Which is particularly painful to someone who cares how their brain is used: your brain goes fast but you get nowhere, like a car spinning its wheels.Startups don't win by attacking.",
      "translated": "你不会通过想出宏大的点子来赢得战斗，而是通过想出在特定情况下有效的计谋。然而，战斗和思考真正的问题一样需要付出努力。这尤其让那些关心大脑如何被使用的人感到痛苦：你的大脑运转得很快，但你却一无所获，就像汽车在原地空转。创业公司不会通过进攻来获胜。"
    },
    {
      "original": "They win by transcending. There are exceptions of course, but usually the way to win is to race ahead, not to stop and fight.Another reason mean founders lose is that they can't get the best people to work for them.",
      "translated": "他们通过超越而获胜。当然有例外，但通常获胜的方式是领先一步，而不是停下来战斗。另一个原因是，刻薄的创始人无法吸引最优秀的人才为他们工作。"
    },
    {
      "original": "They can hire people who will put up with them because they need a job. But the best people have other options. A mean person can't convince the best people to work for him unless he is super convincing.",
      "translated": "他们可以雇佣那些因为需要工作而愿意忍受他们的人。但是，最优秀的人有其他选择。一个刻薄的人除非极具说服力，否则无法说服最优秀的人为他工作。"
    },
    {
      "original": "And while having the best people helps any organization, it's critical for startups.There is also a complementary force at work: if you want to build great things, it helps to be driven by a spirit of benevolence.",
      "translated": "而虽然拥有一流的人才对任何组织都有帮助，但对初创企业来说尤为关键。此外，还有一种相辅相成的力量在起作用：如果你想创造伟大的事物，那么怀有一颗乐于助人的心会大有裨益。"
    },
    {
      "original": "The startup founders who end up richest are not the ones driven by money. The ones driven by money take the big acquisition offer that nearly every successful startup gets en route. [1] The ones who keep going are driven by something else.",
      "translated": "最终成为最富有的初创企业创始人并不是那些被金钱驱使的人。那些被金钱驱使的人会接受几乎每家成功初创企业在发展过程中都会收到的大额收购要约。[1] 而那些继续前行的人则被其他东西所驱动。"
    },
    {
      "original": "They may not say so explicitly, but they're usually trying to improve the world. Which means people with a desire to improve the world have a natural advantage. [2]The exciting thing is that startups are not just one random type of work in which meanness and success are inversely correlated.",
      "translated": "他们可能不会明确说出来，但他们通常是在努力改善世界。这意味着，有志于改善世界的人具有天然的优势。令人兴奋的是，创业公司不仅仅是一种随机的工作类型，在这种类型中，刻薄与成功是成反比的。"
    },
    {
      "original": "This kind of work is the future.For most of history success meant control of scarce resources. One got that by fighting, whether literally in the case of pastoral nomads driving hunter-gatherers into marginal lands, or metaphorically in the case of Gilded Age financiers contending with one another to assemble railroad monopolies.",
      "translated": "这种工作代表着未来。在大部分历史中，成功意味着对稀缺资源的控制。无论是以游牧民族将狩猎采集者驱赶到边缘地带的实际战斗形式，还是以镀金时代金融家们相互竞争以组建铁路垄断的比喻形式，人们都是通过斗争来获得这种控制权。"
    },
    {
      "original": "For most of history, success meant success at zero-sum games. And in most of them meanness was not a handicap but probably an advantage.That is changing. Increasingly the games that matter are not zero-sum.",
      "translated": "在大部分历史中，成功意味着在零和游戏中获胜。而在大多数这样的游戏中，刻薄不是障碍，反而可能是一种优势。这种情况正在改变。如今，真正重要的游戏越来越多地不再是零和游戏。"
    },
    {
      "original": "Increasingly you win not by fighting to get control of a scarce resource, but by having new ideas and building new things. [3]There have long been games where you won by having new ideas. In the third century BC, Archimedes won by doing that.",
      "translated": "越来越多的情况下，你不是通过争夺稀缺资源来获胜，而是通过产生新想法和创造新事物来赢得胜利。[3]长期以来，有些领域中你通过提出新想法而获胜。公元前3世纪，阿基米德就是这样获胜的。"
    },
    {
      "original": "At least until an invading Roman army killed him. Which illustrates why this change is happening: for new ideas to matter, you need a certain degree of civil order. And not just not being at war. You also need to prevent the sort of economic violence that nineteenth century magnates practiced against one another and communist countries practiced against their citizens.",
      "translated": "至少直到一支入侵的罗马军队杀死了他。这说明了这种变化发生的原因：为了让新思想产生影响，你需要一定程度的文明秩序。而这不仅仅是指不处于战争状态。你还需要防止19世纪的大亨们彼此之间以及共产主义国家对公民实施的那种经济暴力。"
    },
    {
      "original": "People need to feel that what they create can't be stolen. [4]That has always been the case for thinkers, which is why this trend began with them. When you think of successful people from history who weren't ruthless, you get mathematicians and writers and artists.",
      "translated": "人们需要感到他们创造的东西不会被窃取。[4]这对于思想家来说一直很重要，这也是这一趋势从他们开始的原因。当你想到历史上那些并非无情却成功的人时，你会想到数学家、作家和艺术家。"
    },
    {
      "original": "The exciting thing is that their m.o. seems to be spreading. The games played by intellectuals are leaking into the real world, and this is reversing the historical polarity of the relationship between meanness and success.So I'm really glad I stopped to think about this.",
      "translated": "令人兴奋的是，他们的行事方式似乎正在蔓延。知识分子的游戏正在渗透到现实世界中，这正在逆转刻薄与成功之间历史上的关系。因此，我很高兴我停下来思考了这个问题。"
    },
    {
      "original": "Jessica and I have always worked hard to teach our kids not to be mean. We tolerate noise and mess and junk food, but not meanness. And now I have both an additional reason to crack down on it, and an additional argument to use when I do: that being mean makes you fail.",
      "translated": "杰西卡和我一直以来都努力教导孩子们不要刻薄。我们可以容忍噪音、杂乱和垃圾食品，但绝不容忍刻薄。现在，我有了额外的理由来严加管教，也有了一个新的论据可以使用：刻薄会让你失败。"
    },
    {
      "original": "Notes[1] I'm not saying all founders who take big acquisition offers are driven only by money, but rather that those who don't aren't. Plus one can have benevolent motives for being driven by money — for example, to take care of one's family, or to be free to work on projects that improve the world.[2] It's unlikely that every successful startup improves the world.",
      "translated": "注释[1] 我并不是说所有接受大额收购要约的创始人都是唯利是图，而是说那些不接受的并不是。另外，一个人出于金钱驱动也可以有善意的动机——比如，照顾家庭，或者获得自由去从事改善世界的项目。[2] 并不是每一个成功的创业公司都能改善世界。"
    },
    {
      "original": "But their founders, like parents, truly believe they do. Successful founders are in love with their companies. And while this sort of love is as blind as the love people have for one another, it is genuine.[3] Peter Thiel would point out that successful founders still get rich from controlling monopolies, just monopolies they create rather than ones they capture.",
      "translated": "但他们的创始人，就像父母一样，确实相信他们是这样做的。成功的创始人对自己公司充满热爱。虽然这种爱与人们彼此之间的爱一样盲目，但它是真诚的。[3] 彼得·蒂尔会指出，成功的创始人仍然可以通过控制垄断来致富，只不过这些垄断是他们自己创造的，而不是捕获的。"
    },
    {
      "original": "And while this is largely true, it means a big change in the sort of person who wins.[4] To be fair, the Romans didn't mean to kill Archimedes. The Roman commander specifically ordered that he be spared.",
      "translated": "尽管这在很大程度上是正确的，但这意味着获胜者的类型将发生巨大变化。公平地说，罗马人并没有打算杀死阿基米德。罗马指挥官特别下令要放过他。"
    },
    {
      "original": "But he got killed in the chaos anyway.In sufficiently disordered times, even thinking requires control of scarce resources, because living at all is a scarce resource.Thanks to Sam Altman, Ron Conway, Daniel Gackle, Jessica Livingston, Robert Morris, Geoff Ralston, and Fred Wilson for reading drafts of this.Portuguese TranslationJapanese TranslationArabic Translation",
      "translated": "但他还是在混乱中丧生了。在极度无序的时代，就连思考也需要控制稀缺资源，因为生存本身也是一种稀缺资源。感谢萨姆·阿尔特曼、罗恩·康威、丹尼尔·加克尔、杰西卡·利文斯顿、罗伯特·莫里斯、杰夫·拉尔斯特和弗雷德·威尔逊阅读本文的草稿。葡萄牙语译文日语译文阿拉伯语译文"
    }
  ],
  "translation_completed": "2025-07-28T14:31:24.971614",
  "translation_stats": {
    "total_paragraphs": 24,
    "success_count": 24,
    "success_rate": "100.0%"
  }
}