{
  "title": "Why Nerds are Unpopular",
  "title_zh": "[待翻译] Why Nerds are Unpopular",
  "url": "https://www.paulgraham.com/nerds.html",
  "filename": "nerds.html",
  "date": "2003-02-01",
  "id": 221,
  "content": {
    "success": true,
    "paragraphs": [
      "February 2003When we were in junior high school, my friend Rich and I made a map of the school lunch tables according to popularity. This was easy to do, because kids only ate lunch with others of about the same popularity.",
      "We graded them from A to E. A tables were full of football players and cheerleaders and so on. E tables contained the kids with mild cases of Down's Syndrome, what in the language of the time we called \"retards.\"We sat at a D table, as low as you could get without looking physically different.",
      "We were not being especially candid to grade ourselves as D. It would have taken a deliberate lie to say otherwise. Everyone in the school knew exactly how popular everyone else was, including us.My stock gradually rose during high school.",
      "Puberty finally arrived; I became a decent soccer player; I started a scandalous underground newspaper. So I've seen a good part of the popularity landscape.I know a lot of people who were nerds in school, and they all tell the same story: there is a strong correlation between being smart and being a nerd, and an even stronger inverse correlation between being a nerd and being popular.",
      "Being smart seems to make you unpopular.Why? To someone in school now, that may seem an odd question to ask. The mere fact is so overwhelming that it may seem strange to imagine that it could be any other way.",
      "But it could. Being smart doesn't make you an outcast in elementary school. Nor does it harm you in the real world. Nor, as far as I can tell, is the problem so bad in most other countries. But in a typical American secondary school, being smart is likely to make your life difficult.",
      "Why? The key to this mystery is to rephrase the question slightly. Why don't smart kids make themselves popular? If they're so smart, why don't they figure out how popularity works and beat the system, just as they do for standardized tests?One argument says that this would be impossible, that the smart kids are unpopular because the other kids envy them for being smart, and nothing they could do could make them popular.",
      "I wish. If the other kids in junior high school envied me, they did a great job of concealing it. And in any case, if being smart were really an enviable quality, the girls would have broken ranks. The guys that guys envy, girls like.In the schools I went to, being smart just didn't matter much.",
      "Kids didn't admire it or despise it. All other things being equal, they would have preferred to be on the smart side of average rather than the dumb side, but intelligence counted far less than, say, physical appearance, charisma, or athletic ability.So if intelligence in itself is not a factor in popularity, why are smart kids so consistently unpopular?",
      "The answer, I think, is that they don't really want to be popular.If someone had told me that at the time, I would have laughed at him. Being unpopular in school makes kids miserable, some of them so miserable that they commit suicide.",
      "Telling me that I didn't want to be popular would have seemed like telling someone dying of thirst in a desert that he didn't want a glass of water. Of course I wanted to be popular.But in fact I didn't, not enough.",
      "There was something else I wanted more: to be smart. Not simply to do well in school, though that counted for something, but to design beautiful rockets, or to write well, or to understand how to program computers.",
      "In general, to make great things.At the time I never tried to separate my wants and weigh them against one another. If I had, I would have seen that being smart was more important. If someone had offered me the chance to be the most popular kid in school, but only at the price of being of average intelligence (humor me here), I wouldn't have taken it.Much as they suffer from their unpopularity, I don't think many nerds would.",
      "To them the thought of average intelligence is unbearable. But most kids would take that deal. For half of them, it would be a step up. Even for someone in the eightieth percentile (assuming, as everyone seemed to then, that intelligence is a scalar), who wouldn't drop thirty points in exchange for being loved and admired by everyone?And that, I think, is the root of the problem.",
      "Nerds serve two masters. They want to be popular, certainly, but they want even more to be smart. And popularity is not something you can do in your spare time, not in the fiercely competitive environment of an American secondary school.",
      "Alberti, arguably the archetype of the Renaissance Man, writes that \"no art, however minor, demands less than total dedication if you want to excel in it.\" I wonder if anyone in the world works harder at anything than American school kids work at popularity.",
      "Navy SEALs and neurosurgery residents seem slackers by comparison. They occasionally take vacations; some even have hobbies. An American teenager may work at being popular every waking hour, 365 days a year.I don't mean to suggest they do this consciously.",
      "Some of them truly are little Machiavellis, but what I really mean here is that teenagers are always on duty as conformists.For example, teenage kids pay a great deal of attention to clothes. They don't consciously dress to be popular.",
      "They dress to look good. But to who? To the other kids. Other kids' opinions become their definition of right, not just for clothes, but for almost everything they do, right down to the way they walk.",
      "And so every effort they make to do things \"right\" is also, consciously or not, an effort to be more popular.Nerds don't realize this. They don't realize that it takes work to be popular. In general, people outside some very demanding field don't realize the extent to which success depends on constant (though often unconscious) effort.",
      "For example, most people seem to consider the ability to draw as some kind of innate quality, like being tall. In fact, most people who \"can draw\" like drawing, and have spent many hours doing it; that's why they're good at it.",
      "Likewise, popular isn't just something you are or you aren't, but something you make yourself.The main reason nerds are unpopular is that they have other things to think about. Their attention is drawn to books or the natural world, not fashions and parties.",
      "They're like someone trying to play soccer while balancing a glass of water on his head. Other players who can focus their whole attention on the game beat them effortlessly, and wonder why they seem so incapable.Even if nerds cared as much as other kids about popularity, being popular would be more work for them.",
      "The popular kids learned to be popular, and to want to be popular, the same way the nerds learned to be smart, and to want to be smart: from their parents. While the nerds were being trained to get the right answers, the popular kids were being trained to please.",
      "So far I've been finessing the relationship between smart and nerd, using them as if they were interchangeable. In fact it's only the context that makes them so. A nerd is someone who isn't socially adept enough.",
      "But \"enough\" depends on where you are. In a typical American school, standards for coolness are so high (or at least, so specific) that you don't have to be especially awkward to look awkward by comparison.Few smart kids can spare the attention that popularity requires.",
      "Unless they also happen to be good-looking, natural athletes, or siblings of popular kids, they'll tend to become nerds. And that's why smart people's lives are worst between, say, the ages of eleven and seventeen.",
      "Life at that age revolves far more around popularity than before or after.Before that, kids' lives are dominated by their parents, not by other kids. Kids do care what their peers think in elementary school, but this isn't their whole life, as it later becomes.Around the age of eleven, though, kids seem to start treating their family as a day job.",
      "They create a new world among themselves, and standing in this world is what matters, not standing in their family. Indeed, being in trouble in their family can win them points in the world they care about.The problem is, the world these kids create for themselves is at first a very crude one.",
      "If you leave a bunch of eleven-year-olds to their own devices, what you get is Lord of the Flies. Like a lot of American kids, I read this book in school. Presumably it was not a coincidence. Presumably someone wanted to point out to us that we were savages, and that we had made ourselves a cruel and stupid world.",
      "This was too subtle for me. While the book seemed entirely believable, I didn't get the additional message. I wish they had just told us outright that we were savages and our world was stupid. Nerds would find their unpopularity more bearable if it merely caused them to be ignored.",
      "Unfortunately, to be unpopular in school is to be actively persecuted.Why? Once again, anyone currently in school might think this a strange question to ask. How could things be any other way? But they could be.",
      "Adults don't normally persecute nerds. Why do teenage kids do it?Partly because teenagers are still half children, and many children are just intrinsically cruel. Some torture nerds for the same reason they pull the legs off spiders.",
      "Before you develop a conscience, torture is amusing.Another reason kids persecute nerds is to make themselves feel better. When you tread water, you lift yourself up by pushing water down. Likewise, in any social hierarchy, people unsure of their own position will try to emphasize it by maltreating those they think rank below.",
      "I've read that this is why poor whites in the United States are the group most hostile to blacks.But I think the main reason other kids persecute nerds is that it's part of the mechanism of popularity.",
      "Popularity is only partially about individual attractiveness. It's much more about alliances. To become more popular, you need to be constantly doing things that bring you close to other popular people, and nothing brings people closer than a common enemy.Like a politician who wants to distract voters from bad times at home, you can create an enemy if there isn't a real one.",
      "By singling out and persecuting a nerd, a group of kids from higher in the hierarchy create bonds between themselves. Attacking an outsider makes them all insiders. This is why the worst cases of bullying happen with groups.",
      "Ask any nerd: you get much worse treatment from a group of kids than from any individual bully, however sadistic.If it's any consolation to the nerds, it's nothing personal. The group of kids who band together to pick on you are doing the same thing, and for the same reason, as a bunch of guys who get together to go hunting.",
      "They don't actually hate you. They just need something to chase.Because they're at the bottom of the scale, nerds are a safe target for the entire school. If I remember correctly, the most popular kids don't persecute nerds; they don't need to stoop to such things.",
      "Most of the persecution comes from kids lower down, the nervous middle classes.The trouble is, there are a lot of them. The distribution of popularity is not a pyramid, but tapers at the bottom like a pear.",
      "The least popular group is quite small. (I believe we were the only D table in our cafeteria map.) So there are more people who want to pick on nerds than there are nerds.As well as gaining points by distancing oneself from unpopular kids, one loses points by being close to them.",
      "A woman I know says that in high school she liked nerds, but was afraid to be seen talking to them because the other girls would make fun of her. Unpopularity is a communicable disease; kids too nice to pick on nerds will still ostracize them in self-defense.It's no wonder, then, that smart kids tend to be unhappy in middle school and high school.",
      "Their other interests leave them little attention to spare for popularity, and since popularity resembles a zero-sum game, this in turn makes them targets for the whole school. And the strange thing is, this nightmare scenario happens without any conscious malice, merely because of the shape of the situation.",
      "For me the worst stretch was junior high, when kid culture was new and harsh, and the specialization that would later gradually separate the smarter kids had barely begun. Nearly everyone I've talked to agrees: the nadir is somewhere between eleven and fourteen.In our school it was eighth grade, which was ages twelve and thirteen for me.",
      "There was a brief sensation that year when one of our teachers overheard a group of girls waiting for the school bus, and was so shocked that the next day she devoted the whole class to an eloquent plea not to be so cruel to one another.It didn't have any noticeable effect.",
      "What struck me at the time was that she was surprised. You mean she doesn't know the kind of things they say to one another? You mean this isn't normal?It's important to realize that, no, the adults don't know what the kids are doing to one another.",
      "They know, in the abstract, that kids are monstrously cruel to one another, just as we know in the abstract that people get tortured in poorer countries. But, like us, they don't like to dwell on this depressing fact, and they don't see evidence of specific abuses unless they go looking for it.Public school teachers are in much the same position as prison wardens.",
      "Wardens' main concern is to keep the prisoners on the premises. They also need to keep them fed, and as far as possible prevent them from killing one another. Beyond that, they want to have as little to do with the prisoners as possible, so they leave them to create whatever social organization they want.",
      "From what I've read, the society that the prisoners create is warped, savage, and pervasive, and it is no fun to be at the bottom of it.In outline, it was the same at the schools I went to. The most important thing was to stay on the premises.",
      "While there, the authorities fed you, prevented overt violence, and made some effort to teach you something. But beyond that they didn't want to have too much to do with the kids. Like prison wardens, the teachers mostly left us to ourselves.",
      "And, like prisoners, the culture we created was barbaric. Why is the real world more hospitable to nerds? It might seem that the answer is simply that it's populated by adults, who are too mature to pick on one another.",
      "But I don't think this is true. Adults in prison certainly pick on one another. And so, apparently, do society wives; in some parts of Manhattan, life for women sounds like a continuation of high school, with all the same petty intrigues.I think the important thing about the real world is not that it's populated by adults, but that it's very large, and the things you do have real effects.",
      "That's what school, prison, and ladies-who-lunch all lack. The inhabitants of all those worlds are trapped in little bubbles where nothing they do can have more than a local effect. Naturally these societies degenerate into savagery.",
      "They have no function for their form to follow.When the things you do have real effects, it's no longer enough just to be pleasing. It starts to be important to get the right answers, and that's where nerds show to advantage.",
      "Bill Gates will of course come to mind. Though notoriously lacking in social skills, he gets the right answers, at least as measured in revenue.The other thing that's different about the real world is that it's much larger.",
      "In a large enough pool, even the smallest minorities can achieve a critical mass if they clump together. Out in the real world, nerds collect in certain places and form their own societies where intelligence is the most important thing.",
      "Sometimes the current even starts to flow in the other direction: sometimes, particularly in university math and science departments, nerds deliberately exaggerate their awkwardness in order to seem smarter.",
      "John Nash so admired Norbert Wiener that he adopted his habit of touching the wall as he walked down a corridor. As a thirteen-year-old kid, I didn't have much more experience of the world than what I saw immediately around me.",
      "The warped little world we lived in was, I thought, the world. The world seemed cruel and boring, and I'm not sure which was worse.Because I didn't fit into this world, I thought that something must be wrong with me.",
      "I didn't realize that the reason we nerds didn't fit in was that in some ways we were a step ahead. We were already thinking about the kind of things that matter in the real world, instead of spending all our time playing an exacting but mostly pointless game like the others.We were a bit like an adult would be if he were thrust back into middle school.",
      "He wouldn't know the right clothes to wear, the right music to like, the right slang to use. He'd seem to the kids a complete alien. The thing is, he'd know enough not to care what they thought. We had no such confidence.A lot of people seem to think it's good for smart kids to be thrown together with \"normal\" kids at this stage of their lives.",
      "Perhaps. But in at least some cases the reason the nerds don't fit in really is that everyone else is crazy. I remember sitting in the audience at a \"pep rally\" at my high school, watching as the cheerleaders threw an effigy of an opposing player into the audience to be torn to pieces.",
      "I felt like an explorer witnessing some bizarre tribal ritual. If I could go back and give my thirteen year old self some advice, the main thing I'd tell him would be to stick his head up and look around.",
      "I didn't really grasp it at the time, but the whole world we lived in was as fake as a Twinkie. Not just school, but the entire town. Why do people move to suburbia? To have kids! So no wonder it seemed boring and sterile.",
      "The whole place was a giant nursery, an artificial town created explicitly for the purpose of breeding children.Where I grew up, it felt as if there was nowhere to go, and nothing to do. This was no accident.",
      "Suburbs are deliberately designed to exclude the outside world, because it contains things that could endanger children.And as for the schools, they were just holding pens within this fake world. Officially the purpose of schools is to teach kids.",
      "In fact their primary purpose is to keep kids locked up in one place for a big chunk of the day so adults can get things done. And I have no problem with this: in a specialized industrial society, it would be a disaster to have kids running around loose.What bothers me is not that the kids are kept in prisons, but that (a) they aren't told about it, and (b) the prisons are run mostly by the inmates.",
      "Kids are sent off to spend six years memorizing meaningless facts in a world ruled by a caste of giants who run after an oblong brown ball, as if this were the most natural thing in the world. And if they balk at this surreal cocktail, they're called misfits.",
      "Life in this twisted world is stressful for the kids. And not just for the nerds. Like any war, it's damaging even to the winners.Adults can't avoid seeing that teenage kids are tormented. So why don't they do something about it?",
      "Because they blame it on puberty. The reason kids are so unhappy, adults tell themselves, is that monstrous new chemicals, hormones, are now coursing through their bloodstream and messing up everything.",
      "There's nothing wrong with the system; it's just inevitable that kids will be miserable at that age.This idea is so pervasive that even the kids believe it, which probably doesn't help. Someone who thinks his feet naturally hurt is not going to stop to consider the possibility that he is wearing the wrong size shoes.I'm suspicious of this theory that thirteen-year-old kids are intrinsically messed up.",
      "If it's physiological, it should be universal. Are Mongol nomads all nihilists at thirteen? I've read a lot of history, and I have not seen a single reference to this supposedly universal fact before the twentieth century.",
      "Teenage apprentices in the Renaissance seem to have been cheerful and eager. They got in fights and played tricks on one another of course (Michelangelo had his nose broken by a bully), but they weren't crazy.As far as I can tell, the concept of the hormone-crazed teenager is coeval with suburbia.",
      "I don't think this is a coincidence. I think teenagers are driven crazy by the life they're made to lead. Teenage apprentices in the Renaissance were working dogs. Teenagers now are neurotic lapdogs.",
      "Their craziness is the craziness of the idle everywhere. When I was in school, suicide was a constant topic among the smarter kids. No one I knew did it, but several planned to, and some may have tried.",
      "Mostly this was just a pose. Like other teenagers, we loved the dramatic, and suicide seemed very dramatic. But partly it was because our lives were at times genuinely miserable.Bullying was only part of the problem.",
      "Another problem, and possibly an even worse one, was that we never had anything real to work on. Humans like to work; in most of the world, your work is your identity. And all the work we did was pointless, or seemed so at the time.At best it was practice for real work we might do far in the future, so far that we didn't even know at the time what we were practicing for.",
      "More often it was just an arbitrary series of hoops to jump through, words without content designed mainly for testability. (The three main causes of the Civil War were.... Test: List the three main causes of the Civil War.)And there was no way to opt out.",
      "The adults had agreed among themselves that this was to be the route to college. The only way to escape this empty life was to submit to it. Teenage kids used to have a more active role in society. In pre-industrial times, they were all apprentices of one sort or another, whether in shops or on farms or even on warships.",
      "They weren't left to create their own societies. They were junior members of adult societies.Teenagers seem to have respected adults more then, because the adults were the visible experts in the skills they were trying to learn.",
      "Now most kids have little idea what their parents do in their distant offices, and see no connection (indeed, there is precious little) between schoolwork and the work they'll do as adults.And if teenagers respected adults more, adults also had more use for teenagers.",
      "After a couple years' training, an apprentice could be a real help. Even the newest apprentice could be made to carry messages or sweep the workshop.Now adults have no immediate use for teenagers. They would be in the way in an office.",
      "So they drop them off at school on their way to work, much as they might drop the dog off at a kennel if they were going away for the weekend.What happened? We're up against a hard one here. The cause of this problem is the same as the cause of so many present ills: specialization.",
      "As jobs become more specialized, we have to train longer for them. Kids in pre-industrial times started working at about 14 at the latest; kids on farms, where most people lived, began far earlier. Now kids who go to college don't start working full-time till 21 or 22.",
      "With some degrees, like MDs and PhDs, you may not finish your training till 30.Teenagers now are useless, except as cheap labor in industries like fast food, which evolved to exploit precisely this fact.",
      "In almost any other kind of work, they'd be a net loss. But they're also too young to be left unsupervised. Someone has to watch over them, and the most efficient way to do this is to collect them together in one place.",
      "Then a few adults can watch all of them.If you stop there, what you're describing is literally a prison, albeit a part-time one. The problem is, many schools practically do stop there. The stated purpose of schools is to educate the kids.",
      "But there is no external pressure to do this well. And so most schools do such a bad job of teaching that the kids don't really take it seriously-- not even the smart kids. Much of the time we were all, students and teachers both, just going through the motions.In my high school French class we were supposed to read Hugo's Les Miserables.",
      "I don't think any of us knew French well enough to make our way through this enormous book. Like the rest of the class, I just skimmed the Cliff's Notes. When we were given a test on the book, I noticed that the questions sounded odd.",
      "They were full of long words that our teacher wouldn't have used. Where had these questions come from? From the Cliff's Notes, it turned out. The teacher was using them too. We were all just pretending.There are certainly great public school teachers.",
      "The energy and imagination of my fourth grade teacher, Mr. Mihalko, made that year something his students still talk about, thirty years later. But teachers like him were individuals swimming upstream.",
      "They couldn't fix the system. In almost any group of people you'll find hierarchy. When groups of adults form in the real world, it's generally for some common purpose, and the leaders end up being those who are best at it.",
      "The problem with most schools is, they have no purpose. But hierarchy there must be. And so the kids make one out of nothing.We have a phrase to describe what happens when rankings have to be created without any meaningful criteria.",
      "We say that the situation degenerates into a popularity contest. And that's exactly what happens in most American schools. Instead of depending on some real test, one's rank depends mostly on one's ability to increase one's rank.",
      "It's like the court of Louis XIV. There is no external opponent, so the kids become one another's opponents.When there is some real external test of skill, it isn't painful to be at the bottom of the hierarchy.",
      "A rookie on a football team doesn't resent the skill of the veteran; he hopes to be like him one day and is happy to have the chance to learn from him. The veteran may in turn feel a sense of noblesse oblige.",
      "And most importantly, their status depends on how well they do against opponents, not on whether they can push the other down.Court hierarchies are another thing entirely. This type of society debases anyone who enters it.",
      "There is neither admiration at the bottom, nor noblesse oblige at the top. It's kill or be killed.This is the sort of society that gets created in American secondary schools. And it happens because these schools have no real purpose beyond keeping the kids all in one place for a certain number of hours each day.",
      "What I didn't realize at the time, and in fact didn't realize till very recently, is that the twin horrors of school life, the cruelty and the boredom, both have the same cause. The mediocrity of American public schools has worse consequences than just making kids unhappy for six years.",
      "It breeds a rebelliousness that actively drives kids away from the things they're supposed to be learning.Like many nerds, probably, it was years after high school before I could bring myself to read anything we'd been assigned then.",
      "And I lost more than books. I mistrusted words like \"character\" and \"integrity\" because they had been so debased by adults. As they were used then, these words all seemed to mean the same thing: obedience.",
      "The kids who got praised for these qualities tended to be at best dull-witted prize bulls, and at worst facile schmoozers. If that was what character and integrity were, I wanted no part of them.The word I most misunderstood was \"tact.\" As used by adults, it seemed to mean keeping your mouth shut.",
      "I assumed it was derived from the same root as \"tacit\" and \"taciturn,\" and that it literally meant being quiet. I vowed that I would never be tactful; they were never going to shut me up. In fact, it's derived from the same root as \"tactile,\" and what it means is to have a deft touch.",
      "Tactful is the opposite of clumsy. I don't think I learned this until college.Nerds aren't the only losers in the popularity rat race. Nerds are unpopular because they're distracted. There are other kids who deliberately opt out because they're so disgusted with the whole process.Teenage kids, even rebels, don't like to be alone, so when kids opt out of the system, they tend to do it as a group.",
      "At the schools I went to, the focus of rebellion was drug use, specifically marijuana. The kids in this tribe wore black concert t-shirts and were called \"freaks.\"Freaks and nerds were allies, and there was a good deal of overlap between them.",
      "Freaks were on the whole smarter than other kids, though never studying (or at least never appearing to) was an important tribal value. I was more in the nerd camp, but I was friends with a lot of freaks.They used drugs, at least at first, for the social bonds they created.",
      "It was something to do together, and because the drugs were illegal, it was a shared badge of rebellion.I'm not claiming that bad schools are the whole reason kids get into trouble with drugs. After a while, drugs have their own momentum.",
      "No doubt some of the freaks ultimately used drugs to escape from other problems-- trouble at home, for example. But, in my school at least, the reason most kids started using drugs was rebellion. Fourteen-year-olds didn't start smoking pot because they'd heard it would help them forget their problems.",
      "They started because they wanted to join a different tribe.Misrule breeds rebellion; this is not a new idea. And yet the authorities still for the most part act as if drugs were themselves the cause of the problem.",
      "The real problem is the emptiness of school life. We won't see solutions till adults realize that. The adults who may realize it first are the ones who were themselves nerds in school. Do you want your kids to be as unhappy in eighth grade as you were?",
      "I wouldn't. Well, then, is there anything we can do to fix things? Almost certainly. There is nothing inevitable about the current system. It has come about mostly by default.Adults, though, are busy.",
      "Showing up for school plays is one thing. Taking on the educational bureaucracy is another. Perhaps a few will have the energy to try to change things. I suspect the hardest part is realizing that you can.Nerds still in school should not hold their breath.",
      "Maybe one day a heavily armed force of adults will show up in helicopters to rescue you, but they probably won't be coming this month. Any immediate improvement in nerds' lives is probably going to have to come from the nerds themselves.Merely understanding the situation they're in should make it less painful.",
      "Nerds aren't losers. They're just playing a different game, and a game much closer to the one played in the real world. Adults know this. It's hard to find successful adults now who don't claim to have been nerds in high school.It's important for nerds to realize, too, that school is not life.",
      "School is a strange, artificial thing, half sterile and half feral. It's all-encompassing, like life, but it isn't the real thing. It's only temporary, and if you look, you can see beyond it even while you're still in it.If life seems awful to kids, it's neither because hormones are turning you all into monsters (as your parents believe), nor because life actually is awful (as you believe).",
      "It's because the adults, who no longer have any economic use for you, have abandoned you to spend years cooped up together with nothing real to do. Any society of that type is awful to live in. You don't have to look any further to explain why teenage kids are unhappy.I've said some harsh things in this essay, but really the thesis is an optimistic one-- that several problems we take for granted are in fact not insoluble after all.",
      "Teenage kids are not inherently unhappy monsters. That should be encouraging news to kids and adults both. Thanks to Sarah Harlin, Trevor Blackwell, Robert Morris, Eric Raymond, and Jackie Weicker for reading drafts of this essay, and Maria Daniels for scanning photos.Re: Why Nerds are UnpopularGateway High School, 1981Japanese TranslationFrench TranslationMy War With BrianButtonsPortuguese TranslationSpanish Translation"
    ],
    "word_count": 5628,
    "paragraph_count": 117
  },
  "processed_at": "2025-07-26T19:08:44.076586",
  "paragraphs": [
    {
      "original": "February 2003When we were in junior high school, my friend Rich and I made a map of the school lunch tables according to popularity. This was easy to do, because kids only ate lunch with others of about the same popularity.",
      "translated": "2003年2月，当我和朋友里奇还在上初中时，我们根据受欢迎程度绘制了一张学校午餐桌的分布图。这很容易做到，因为孩子们通常只和受欢迎程度差不多的人一起吃午餐。"
    },
    {
      "original": "We graded them from A to E. A tables were full of football players and cheerleaders and so on. E tables contained the kids with mild cases of Down's Syndrome, what in the language of the time we called \"retards.\"We sat at a D table, as low as you could get without looking physically different.",
      "translated": "我们将他们从A到E进行了分级。A级的桌子上坐满了足球运动员和啦啦队队员等。E级的桌子上则坐着那些患有轻度唐氏综合征的孩子，按照当时的说法，我们称之为“智障”。我们坐在D级的桌子上，已经算是最低的了，除非外表上看起来与常人不同。"
    },
    {
      "original": "We were not being especially candid to grade ourselves as D. It would have taken a deliberate lie to say otherwise. Everyone in the school knew exactly how popular everyone else was, including us.My stock gradually rose during high school.",
      "translated": "我们给自己打D并不是特别坦诚。说不是这样就是故意撒谎了。学校里的每个人都清楚地知道其他人的受欢迎程度，包括我们自己。我的地位在高中期间逐渐上升。"
    },
    {
      "original": "Puberty finally arrived; I became a decent soccer player; I started a scandalous underground newspaper. So I've seen a good part of the popularity landscape.I know a lot of people who were nerds in school, and they all tell the same story: there is a strong correlation between being smart and being a nerd, and an even stronger inverse correlation between being a nerd and being popular.",
      "translated": "青春期终于到来；我成为了一个不错的足球运动员；我还创办了一份颇受争议的地下报纸。所以我见识过不少关于受欢迎程度的情况。我认识许多在学校时是书呆子的人，他们讲述的故事都差不多：聪明与书呆子之间有着很强的关联，而书呆子与受欢迎之间则有着更强烈的负相关。"
    },
    {
      "original": "Being smart seems to make you unpopular.Why? To someone in school now, that may seem an odd question to ask. The mere fact is so overwhelming that it may seem strange to imagine that it could be any other way.",
      "translated": "聪明似乎会让你不受欢迎。为什么？对于现在在校的人来说，这可能是一个奇怪的问题。这个事实如此明显，以至于想象会有其他情况似乎很奇怪。"
    },
    {
      "original": "But it could. Being smart doesn't make you an outcast in elementary school. Nor does it harm you in the real world. Nor, as far as I can tell, is the problem so bad in most other countries. But in a typical American secondary school, being smart is likely to make your life difficult.",
      "translated": "但情况本不必如此。聪明并不会让你在小学成为异类。也不会在现实世界中对你造成伤害。据我所知，在大多数其他国家，这个问题也没有那么严重。但在典型的美国中学里，聪明很可能会让你的生活变得困难。"
    },
    {
      "original": "Why? The key to this mystery is to rephrase the question slightly. Why don't smart kids make themselves popular? If they're so smart, why don't they figure out how popularity works and beat the system, just as they do for standardized tests?One argument says that this would be impossible, that the smart kids are unpopular because the other kids envy them for being smart, and nothing they could do could make them popular.",
      "translated": "为什么？解开这个谜题的关键在于稍微调整一下问题的表述。为什么聪明的孩子不能让自己受欢迎？如果他们真的那么聪明，为什么不能弄清楚受欢迎的机制，然后像应对标准化测试一样，击败这个系统？有一种观点认为这是不可能的，认为聪明的孩子之所以不受欢迎是因为其他孩子嫉妒他们的聪明才智，无论他们怎么做都无法改变这一点。"
    },
    {
      "original": "I wish. If the other kids in junior high school envied me, they did a great job of concealing it. And in any case, if being smart were really an enviable quality, the girls would have broken ranks. The guys that guys envy, girls like.In the schools I went to, being smart just didn't matter much.",
      "translated": "我希望是这样。如果初中时的其他孩子羡慕我，他们也确实做得很好，把这种情绪隐藏了起来。而且，如果聪明真的是令人羡慕的品质，女孩子们的态度早就不同了。男生们羡慕的那些男生，才是女生们喜欢的。在我上学的那些学校里，聪明其实并没有多大意义。"
    },
    {
      "original": "Kids didn't admire it or despise it. All other things being equal, they would have preferred to be on the smart side of average rather than the dumb side, but intelligence counted far less than, say, physical appearance, charisma, or athletic ability.So if intelligence in itself is not a factor in popularity, why are smart kids so consistently unpopular?",
      "translated": "孩子们既不崇拜它，也不鄙视它。在其他条件相同的情况下，他们宁愿选择比平均水平聪明一些，而不是愚蠢一些，但智力的重要性远不如外貌、魅力或运动能力。因此，如果智力本身并不是受欢迎的因素，为什么聪明的孩子总是如此不受欢迎呢？"
    },
    {
      "original": "The answer, I think, is that they don't really want to be popular.If someone had told me that at the time, I would have laughed at him. Being unpopular in school makes kids miserable, some of them so miserable that they commit suicide.",
      "translated": "我认为答案是他们其实并不想受欢迎。如果有人当时告诉我这一点，我一定会嘲笑他。在学校不受欢迎会让孩子们痛苦，有些孩子甚至因此自杀。"
    },
    {
      "original": "Telling me that I didn't want to be popular would have seemed like telling someone dying of thirst in a desert that he didn't want a glass of water. Of course I wanted to be popular.But in fact I didn't, not enough.",
      "translated": "告诉我我不想要受欢迎，这就像告诉一个在沙漠中渴死的人他不想要一杯水一样。当然，我是想要受欢迎的。但事实上，我并没有那么渴望。"
    },
    {
      "original": "There was something else I wanted more: to be smart. Not simply to do well in school, though that counted for something, but to design beautiful rockets, or to write well, or to understand how to program computers.",
      "translated": "我还渴望另一件事：变得聪明。不仅仅是在学校表现优异，尽管这也很重要，而是设计出漂亮的火箭，或是写得一手好文章，或是懂得如何编程。"
    },
    {
      "original": "In general, to make great things.At the time I never tried to separate my wants and weigh them against one another. If I had, I would have seen that being smart was more important. If someone had offered me the chance to be the most popular kid in school, but only at the price of being of average intelligence (humor me here), I wouldn't have taken it.Much as they suffer from their unpopularity, I don't think many nerds would.",
      "translated": "总的来说，要做伟大的事情。当时我从未尝试过将我的欲望分开，并将它们相互权衡。如果我这么做了，就会发现聪明更为重要。如果有人给我一个成为学校最受欢迎的孩子的机会，但代价是只能拥有平庸的智力（这里请允许我开个玩笑），我是不会接受的。尽管他们在不受欢迎中饱受煎熬，但我认为许多书呆子也不会接受。"
    },
    {
      "original": "To them the thought of average intelligence is unbearable. But most kids would take that deal. For half of them, it would be a step up. Even for someone in the eightieth percentile (assuming, as everyone seemed to then, that intelligence is a scalar), who wouldn't drop thirty points in exchange for being loved and admired by everyone?And that, I think, is the root of the problem.",
      "translated": "对他们来说，平庸的智力是无法忍受的。但大多数孩子会选择接受这种状态。对其中一半的孩子来说，这将是一种提升。即使是那些处于第八十个百分位的人（假设智力是一个可量化的数值），又有谁不愿意为了被所有人爱戴和崇拜而降低三十点智商呢？而我认为，这才是问题的根源。"
    },
    {
      "original": "Nerds serve two masters. They want to be popular, certainly, but they want even more to be smart. And popularity is not something you can do in your spare time, not in the fiercely competitive environment of an American secondary school.",
      "translated": "书呆子侍奉两个主人。他们当然想要受欢迎，但他们更希望变得聪明。而受欢迎并不是你可以在业余时间做到的事情，尤其是在美国中学这种竞争激烈的环境中。"
    },
    {
      "original": "Alberti, arguably the archetype of the Renaissance Man, writes that \"no art, however minor, demands less than total dedication if you want to excel in it.\" I wonder if anyone in the world works harder at anything than American school kids work at popularity.",
      "translated": "阿尔伯蒂，可以说是文艺复兴人的原型，写道：“无论多么微不足道的艺术，如果你想在其中出类拔萃，都需要全身心的投入。” 我想知道，世界上是否有人比美国的学生在追求受欢迎程度上更加努力。"
    },
    {
      "original": "Navy SEALs and neurosurgery residents seem slackers by comparison. They occasionally take vacations; some even have hobbies. An American teenager may work at being popular every waking hour, 365 days a year.I don't mean to suggest they do this consciously.",
      "translated": "海军海豹突击队队员和神经外科住院医生相比之下似乎都是懒人。他们偶尔会休假；有些人甚至还有爱好。而美国的青少年可能会在一年365天的每一醒着的小时里，努力让自己变得受欢迎。我并不是想暗示他们是有意识地这样做。"
    },
    {
      "original": "Some of them truly are little Machiavellis, but what I really mean here is that teenagers are always on duty as conformists.For example, teenage kids pay a great deal of attention to clothes. They don't consciously dress to be popular.",
      "translated": "有些人确实像小马基雅维利，但我真正想说的是，青少年总是作为从众者的角色在行动。例如，青少年非常注重衣着。他们并不是有意识地为了受欢迎而打扮。"
    },
    {
      "original": "They dress to look good. But to who? To the other kids. Other kids' opinions become their definition of right, not just for clothes, but for almost everything they do, right down to the way they walk.",
      "translated": "他们打扮得漂漂亮亮。但为了谁？为了其他孩子。其他孩子的看法成了他们正确与否的标准，不仅限于衣着，几乎涵盖了他们所做的每一件事，甚至包括他们的走路方式。"
    },
    {
      "original": "And so every effort they make to do things \"right\" is also, consciously or not, an effort to be more popular.Nerds don't realize this. They don't realize that it takes work to be popular. In general, people outside some very demanding field don't realize the extent to which success depends on constant (though often unconscious) effort.",
      "translated": "因此，他们每做出一次努力去做“正确”的事情，也都是在有意或无意地努力变得更加受欢迎。书呆子们没有意识到这一点。他们没有意识到受欢迎是需要努力的。一般来说，那些不在某个非常要求高的领域内的人，不会意识到成功在多大程度上取决于持续的（尽管往往是无意识的）努力。"
    },
    {
      "original": "For example, most people seem to consider the ability to draw as some kind of innate quality, like being tall. In fact, most people who \"can draw\" like drawing, and have spent many hours doing it; that's why they're good at it.",
      "translated": "例如，大多数人似乎认为绘画能力是一种与生俱来的品质，就像身高一样。实际上，大多数“会画画”的人之所以擅长绘画，是因为他们喜欢画画，并且花费了大量时间来练习。"
    },
    {
      "original": "Likewise, popular isn't just something you are or you aren't, but something you make yourself.The main reason nerds are unpopular is that they have other things to think about. Their attention is drawn to books or the natural world, not fashions and parties.",
      "translated": "同样，受欢迎与否并不是你天生具备或不具备的，而是你可以自己创造的。书呆子不受欢迎的主要原因在于他们有其他的事情需要思考。他们的注意力被吸引到了书籍或自然世界，而不是时尚和派对。"
    },
    {
      "original": "They're like someone trying to play soccer while balancing a glass of water on his head. Other players who can focus their whole attention on the game beat them effortlessly, and wonder why they seem so incapable.Even if nerds cared as much as other kids about popularity, being popular would be more work for them.",
      "translated": "他们就像尝试在头顶上端着一杯水踢足球的人。其他能够全神贯注于比赛的球员轻而易举地击败了他们，并且不明白为什么这些人看起来如此无能。即使书呆子像其他孩子一样在乎受欢迎的程度，对他们来说，变得受欢迎也需要更多的努力。"
    },
    {
      "original": "The popular kids learned to be popular, and to want to be popular, the same way the nerds learned to be smart, and to want to be smart: from their parents. While the nerds were being trained to get the right answers, the popular kids were being trained to please.",
      "translated": "受欢迎的孩子们学会了如何受欢迎，以及渴望受欢迎，这与书呆子们学会如何聪明以及渴望聪明的方式一样：从他们的父母那里。当书呆子们被训练去寻找正确答案时，受欢迎的孩子们则被训练去讨人喜欢。"
    },
    {
      "original": "So far I've been finessing the relationship between smart and nerd, using them as if they were interchangeable. In fact it's only the context that makes them so. A nerd is someone who isn't socially adept enough.",
      "translated": "到目前为止，我一直巧妙地处理着“聪明”和“书呆子”之间的关系，仿佛它们可以互换使用。事实上，这只是因为语境才使它们如此。书呆子是指社交能力不够强的人。"
    },
    {
      "original": "But \"enough\" depends on where you are. In a typical American school, standards for coolness are so high (or at least, so specific) that you don't have to be especially awkward to look awkward by comparison.Few smart kids can spare the attention that popularity requires.",
      "translated": "但是，“足够”取决于你所处的环境。在美国典型的学校里，酷的标准如此之高（或者至少是非常具体），以至于你不必特别笨拙就会显得很不自在。很少有聪明的孩子能够投入流行所需要的注意力。"
    },
    {
      "original": "Unless they also happen to be good-looking, natural athletes, or siblings of popular kids, they'll tend to become nerds. And that's why smart people's lives are worst between, say, the ages of eleven and seventeen.",
      "translated": "除非他们长得好看、是天生的运动员，或是受欢迎孩子的兄弟姐妹，否则他们往往会成为书呆子。这就是为什么聪明人在十一岁到十七岁之间的生活最糟糕的原因。"
    },
    {
      "original": "Life at that age revolves far more around popularity than before or after.Before that, kids' lives are dominated by their parents, not by other kids. Kids do care what their peers think in elementary school, but this isn't their whole life, as it later becomes.Around the age of eleven, though, kids seem to start treating their family as a day job.",
      "translated": "在那个年龄，生活更多地围绕着受欢迎程度展开，这比之前或之后都更为明显。在此之前，孩子们的生活主要由父母主导，而不是其他孩子。孩子们在小学时确实会在乎同龄人的看法，但这并不是他们的全部生活，后来则会变成这样。然而，大约在十一岁左右，孩子们似乎开始将家庭视为一种“日常工作”。"
    },
    {
      "original": "They create a new world among themselves, and standing in this world is what matters, not standing in their family. Indeed, being in trouble in their family can win them points in the world they care about.The problem is, the world these kids create for themselves is at first a very crude one.",
      "translated": "他们在这个小圈子里创造了一个新的世界，而在这个世界中立足才是重要的，而不是在家庭中立足。事实上，在家庭中遇到麻烦反而能让他们在所在乎的世界中获得加分。问题在于，这些孩子最初为自己创造的世界是非常粗糙的。"
    },
    {
      "original": "If you leave a bunch of eleven-year-olds to their own devices, what you get is Lord of the Flies. Like a lot of American kids, I read this book in school. Presumably it was not a coincidence. Presumably someone wanted to point out to us that we were savages, and that we had made ourselves a cruel and stupid world.",
      "translated": "如果你让一群十一岁大的孩子自生自灭，结果就会像《蝇王》里的情景一样。和很多美国孩子一样，我在学校读过这本书。这显然不是巧合。显然，有人想指出我们是野蛮人，而我们自己创造了一个残忍和愚蠢的世界。"
    },
    {
      "original": "This was too subtle for me. While the book seemed entirely believable, I didn't get the additional message. I wish they had just told us outright that we were savages and our world was stupid. Nerds would find their unpopularity more bearable if it merely caused them to be ignored.",
      "translated": "这对我来说太晦涩了。虽然这本书看起来完全可信，但我没有领会到额外的信息。我希望他们直接告诉我们我们是野蛮人，我们的世界是愚蠢的。如果书中的书呆子们仅仅因此被忽视，他们可能会觉得自己的不受欢迎更容易忍受。"
    },
    {
      "original": "Unfortunately, to be unpopular in school is to be actively persecuted.Why? Once again, anyone currently in school might think this a strange question to ask. How could things be any other way? But they could be.",
      "translated": "不幸的是，在学校不受欢迎就意味着会受到积极的排挤。为什么？任何目前还在上学的人可能会觉得这个问题很奇怪。事情还能有其他样子吗？但其实是可以的。"
    },
    {
      "original": "Adults don't normally persecute nerds. Why do teenage kids do it?Partly because teenagers are still half children, and many children are just intrinsically cruel. Some torture nerds for the same reason they pull the legs off spiders.",
      "translated": "成年人通常不会欺负书呆子。为什么青少年会这样做？部分原因在于青少年还半是孩子，而许多孩子天性就是残忍的。有些人折磨书呆子的原因和他们扯下蜘蛛的腿一样。"
    },
    {
      "original": "Before you develop a conscience, torture is amusing.Another reason kids persecute nerds is to make themselves feel better. When you tread water, you lift yourself up by pushing water down. Likewise, in any social hierarchy, people unsure of their own position will try to emphasize it by maltreating those they think rank below.",
      "translated": "在你形成良知之前，折磨他人会觉得很有趣。孩子们欺负书呆子的另一个原因是让自己感觉更好。当你在水中踩水时，你是通过把水向下推来提升自己的。同样，在任何社会等级中，对自己的地位不自信的人会试图通过虐待他们认为地位低于自己的人来强调自己的地位。"
    },
    {
      "original": "I've read that this is why poor whites in the United States are the group most hostile to blacks.But I think the main reason other kids persecute nerds is that it's part of the mechanism of popularity.",
      "translated": "我读到过，这就是为什么美国的贫穷白人是对黑人最敌对的群体。但我认为其他孩子欺负书呆子的主要原因是，这是受欢迎机制的一部分。"
    },
    {
      "original": "Popularity is only partially about individual attractiveness. It's much more about alliances. To become more popular, you need to be constantly doing things that bring you close to other popular people, and nothing brings people closer than a common enemy.Like a politician who wants to distract voters from bad times at home, you can create an enemy if there isn't a real one.",
      "translated": "受欢迎不仅仅与个人魅力有关，更多的是关于联盟。要想变得更受欢迎，你需要不断做些能让你接近其他受欢迎人士的事情，而没有什么比共同的敌人更能拉近人们之间的距离了。就像一位想要转移选民对国内困境注意力的政治家一样，如果没有真正的敌人，你可以创造一个。"
    },
    {
      "original": "By singling out and persecuting a nerd, a group of kids from higher in the hierarchy create bonds between themselves. Attacking an outsider makes them all insiders. This is why the worst cases of bullying happen with groups.",
      "translated": "通过孤立和欺凌一个书呆子，一群处于较高地位的孩子们在彼此之间建立了联系。攻击局外人使他们全部变成了局内人。这就是为什么最严重的欺凌事件往往发生在群体中。"
    },
    {
      "original": "Ask any nerd: you get much worse treatment from a group of kids than from any individual bully, however sadistic.If it's any consolation to the nerds, it's nothing personal. The group of kids who band together to pick on you are doing the same thing, and for the same reason, as a bunch of guys who get together to go hunting.",
      "translated": "问问任何一个书呆子：比起任何一个施虐狂式的个体恶霸，一群孩子的欺负会更糟糕。如果这对书呆子有什么安慰的话，那就是这并不是针对个人的。那些联合起来欺负你的一群孩子，所做的和一群聚在一起去打猎的家伙是一样的，原因也相同。"
    },
    {
      "original": "They don't actually hate you. They just need something to chase.Because they're at the bottom of the scale, nerds are a safe target for the entire school. If I remember correctly, the most popular kids don't persecute nerds; they don't need to stoop to such things.",
      "translated": "他们实际上并不恨你。他们只是需要一个追逐的目标。因为书呆子处于社会层级的最底层，所以成了全校安全的攻击对象。如果我没记错的话，最受欢迎的孩子们不会欺负书呆子；他们不必屈尊去做这种事。"
    },
    {
      "original": "Most of the persecution comes from kids lower down, the nervous middle classes.The trouble is, there are a lot of them. The distribution of popularity is not a pyramid, but tapers at the bottom like a pear.",
      "translated": "大部分的欺凌来自地位较低的孩子，那些紧张的中产阶级。问题在于，这样的人有很多。受欢迎程度的分布不是金字塔形，而是在底部逐渐变细，像梨形一样。"
    },
    {
      "original": "The least popular group is quite small. (I believe we were the only D table in our cafeteria map.) So there are more people who want to pick on nerds than there are nerds.As well as gaining points by distancing oneself from unpopular kids, one loses points by being close to them.",
      "translated": "最不受欢迎的那个群体非常小。（我相信我们是食堂地图上唯一的D桌。）所以，想欺负书呆子的人比书呆子本身还要多。除了通过远离不受欢迎的孩子来获得积分外，如果与他们关系密切还会失去积分。"
    },
    {
      "original": "A woman I know says that in high school she liked nerds, but was afraid to be seen talking to them because the other girls would make fun of her. Unpopularity is a communicable disease; kids too nice to pick on nerds will still ostracize them in self-defense.It's no wonder, then, that smart kids tend to be unhappy in middle school and high school.",
      "translated": "我认识的一位女士说，她在高中时喜欢书呆子，但害怕被其他女孩看到和他们说话，因为她们会取笑她。不受欢迎是一种会传染的“疾病”；那些本性善良、不会欺负书呆子的孩子，为了自保也会排斥他们。因此，聪明的孩子在初中和高中时往往不快乐，也就不足为奇了。"
    },
    {
      "original": "Their other interests leave them little attention to spare for popularity, and since popularity resembles a zero-sum game, this in turn makes them targets for the whole school. And the strange thing is, this nightmare scenario happens without any conscious malice, merely because of the shape of the situation.",
      "translated": "他们的其他兴趣使他们无暇顾及 popularity，而 popularity 本身又像是一个零和游戏，这反过来使他们成为全校的目标。奇怪的是，这种噩梦般的情景并非出于任何人的恶意，而仅仅是因为形势使然。"
    },
    {
      "original": "For me the worst stretch was junior high, when kid culture was new and harsh, and the specialization that would later gradually separate the smarter kids had barely begun. Nearly everyone I've talked to agrees: the nadir is somewhere between eleven and fourteen.In our school it was eighth grade, which was ages twelve and thirteen for me.",
      "translated": "对我来说，最艰难的时期是初中，那时的校园文化既新又残酷，而后来逐渐将更聪明的孩子们区分开来的专业化进程才刚刚开始。我几乎和每个人交流过，大家的看法一致： lowest point 大约在十一到十四岁之间。在我们学校，那是八年级的时候，对我来说是十二岁和十三岁。"
    },
    {
      "original": "There was a brief sensation that year when one of our teachers overheard a group of girls waiting for the school bus, and was so shocked that the next day she devoted the whole class to an eloquent plea not to be so cruel to one another.It didn't have any noticeable effect.",
      "translated": "那年发生了一件引起轰动的小事，一位老师无意中听到一群等校车的女孩的对话，感到非常震惊，以至于第二天她用整节课的时间进行了慷慨陈词，呼吁同学们不要彼此如此残忍。但这似乎没有什么明显的效果。"
    },
    {
      "original": "What struck me at the time was that she was surprised. You mean she doesn't know the kind of things they say to one another? You mean this isn't normal?It's important to realize that, no, the adults don't know what the kids are doing to one another.",
      "translated": "当时让我感到惊讶的是她居然感到意外。你的意思是说她不知道他们彼此之间会说些什么吗？你的意思是这并不正常？重要的是要意识到，大人并不知道孩子们彼此之间都在做些什么。"
    },
    {
      "original": "They know, in the abstract, that kids are monstrously cruel to one another, just as we know in the abstract that people get tortured in poorer countries. But, like us, they don't like to dwell on this depressing fact, and they don't see evidence of specific abuses unless they go looking for it.Public school teachers are in much the same position as prison wardens.",
      "translated": "他们抽象地知道，孩子们彼此之间会极其残忍，就像我们知道在较贫穷的国家里人们会遭受酷刑。但是，和我们一样，他们不喜欢去关注这一令人沮丧的事实，除非主动去寻找，否则他们不会注意到具体的虐待行为。公立学校的教师与监狱看守的情况大致相同。"
    },
    {
      "original": "Wardens' main concern is to keep the prisoners on the premises. They also need to keep them fed, and as far as possible prevent them from killing one another. Beyond that, they want to have as little to do with the prisoners as possible, so they leave them to create whatever social organization they want.",
      "translated": "狱长的主要关切是确保囚犯留在监狱内。他们还需要确保囚犯有饭吃，并尽可能防止他们互相残杀。除此之外，他们希望与囚犯的互动越少越好，因此任由囚犯自行建立他们想要的任何社会结构。"
    },
    {
      "original": "From what I've read, the society that the prisoners create is warped, savage, and pervasive, and it is no fun to be at the bottom of it.In outline, it was the same at the schools I went to. The most important thing was to stay on the premises.",
      "translated": "从我读到的内容来看，囚犯们创建的社会是扭曲的、野蛮的且无所不在的，处在最底层绝不是什么乐事。大致轮廓上，我上学时的情况也差不多。最重要的是要留在校园里。"
    },
    {
      "original": "While there, the authorities fed you, prevented overt violence, and made some effort to teach you something. But beyond that they didn't want to have too much to do with the kids. Like prison wardens, the teachers mostly left us to ourselves.",
      "translated": "在那里，当局负责提供食物，防止明显的暴力行为，并做出一些努力教你一些东西。但除此之外，他们并不想过多地与孩子打交道。像监狱看守一样，老师们大部分时间都让我们自生自灭。"
    },
    {
      "original": "And, like prisoners, the culture we created was barbaric. Why is the real world more hospitable to nerds? It might seem that the answer is simply that it's populated by adults, who are too mature to pick on one another.",
      "translated": "而且，就像囚犯一样，我们创造的文化是野蛮的。为什么现实世界对书呆子更友好？可能看起来答案很简单，那就是现实世界里住着成年人，他们已经成熟到不会互相欺负。"
    },
    {
      "original": "But I don't think this is true. Adults in prison certainly pick on one another. And so, apparently, do society wives; in some parts of Manhattan, life for women sounds like a continuation of high school, with all the same petty intrigues.I think the important thing about the real world is not that it's populated by adults, but that it's very large, and the things you do have real effects.",
      "translated": "但我认为这并不正确。监狱中的成年犯人确实会互相欺负。显然，社交圈中的贵妇人也是如此；在曼哈顿的某些地区，女性的生活听起来像是高中的延续，充满了同样的微不足道的阴谋。我认为现实世界的重要之处不在于它是由成年人组成的，而在于它非常广大，你所做的事会产生真实的影响。"
    },
    {
      "original": "That's what school, prison, and ladies-who-lunch all lack. The inhabitants of all those worlds are trapped in little bubbles where nothing they do can have more than a local effect. Naturally these societies degenerate into savagery.",
      "translated": "这就是学校、监狱和贵妇下午茶所缺乏的。这些世界中的居民被困在小圈子里，他们的行为影响范围极其有限。自然而然，这些社会退化为野蛮状态。"
    },
    {
      "original": "They have no function for their form to follow.When the things you do have real effects, it's no longer enough just to be pleasing. It starts to be important to get the right answers, and that's where nerds show to advantage.",
      "translated": "它们的形式并没有功能可以遵循。当你做的事情产生实际影响时，仅仅令人愉悦就不再足够了。开始变得重要的是找到正确的答案，而这正是书呆子们展现优势的地方。"
    },
    {
      "original": "Bill Gates will of course come to mind. Though notoriously lacking in social skills, he gets the right answers, at least as measured in revenue.The other thing that's different about the real world is that it's much larger.",
      "translated": "当然会想到比尔·盖茨。尽管他在社交方面出了名的不擅长，但他确实能做出正确的决策，至少从收入上来看是这样。现实世界的另一个不同之处是它要大得多。"
    },
    {
      "original": "In a large enough pool, even the smallest minorities can achieve a critical mass if they clump together. Out in the real world, nerds collect in certain places and form their own societies where intelligence is the most important thing.",
      "translated": "在一个足够大的群体中，即使是最小的少数群体，如果他们聚集在一起，也能达到临界数量。在现实世界中，书呆子会聚集在某些地方，形成他们自己的社会，在这些社会中，智力是最重要的事情。"
    },
    {
      "original": "Sometimes the current even starts to flow in the other direction: sometimes, particularly in university math and science departments, nerds deliberately exaggerate their awkwardness in order to seem smarter.",
      "translated": "有时，这种趋势甚至会反向发展：在大学的数学和科学系里，书呆子们有时会故意夸大自己的不善交际，以显得更加聪明。"
    },
    {
      "original": "John Nash so admired Norbert Wiener that he adopted his habit of touching the wall as he walked down a corridor. As a thirteen-year-old kid, I didn't have much more experience of the world than what I saw immediately around me.",
      "translated": "约翰·纳什非常仰慕诺伯特·维纳，以至于他模仿维纳在走廊里行走时摸墙的习惯。我十三岁的时候，对世界的了解还仅限于周围所见。"
    },
    {
      "original": "The warped little world we lived in was, I thought, the world. The world seemed cruel and boring, and I'm not sure which was worse.Because I didn't fit into this world, I thought that something must be wrong with me.",
      "translated": "我们生活的那个扭曲的小世界，我以为就是整个世界。这个世界显得既残酷又无聊，我分不清哪一点更糟。因为我无法融入这个世界，所以我认为一定是自己出了问题。"
    },
    {
      "original": "I didn't realize that the reason we nerds didn't fit in was that in some ways we were a step ahead. We were already thinking about the kind of things that matter in the real world, instead of spending all our time playing an exacting but mostly pointless game like the others.We were a bit like an adult would be if he were thrust back into middle school.",
      "translated": "我之前没有意识到，我们这些书呆子不合群的原因是，在某些方面我们领先了一步。我们已经在思考那些在现实世界中真正重要的事情，而不是像其他人那样，把所有时间都花在一场虽然严苛但大多无意义的游戏中。我们有点像一个成年人突然被送回了中学时代。"
    },
    {
      "original": "He wouldn't know the right clothes to wear, the right music to like, the right slang to use. He'd seem to the kids a complete alien. The thing is, he'd know enough not to care what they thought. We had no such confidence.A lot of people seem to think it's good for smart kids to be thrown together with \"normal\" kids at this stage of their lives.",
      "translated": "他不会知道该穿什么样的衣服，该喜欢什么样的音乐，该用什么样的俚语。在孩子们看来，他会显得完全格格不入。问题是，他有足够的自信不去在乎他们的看法。而我们却没有这样的自信。很多人似乎认为，在这个年龄段，把聪明的孩子和“普通”孩子放在一起是件好事。"
    },
    {
      "original": "Perhaps. But in at least some cases the reason the nerds don't fit in really is that everyone else is crazy. I remember sitting in the audience at a \"pep rally\" at my high school, watching as the cheerleaders threw an effigy of an opposing player into the audience to be torn to pieces.",
      "translated": "也许。但在某些情况下，书呆子不合群的原因确实是因为其他人都不正常。我还记得坐在高中的一次“加油大会”上，看着啦啦队队员将一个对手球员的假人扔进人群中，任由他们将其撕成碎片。"
    },
    {
      "original": "I felt like an explorer witnessing some bizarre tribal ritual. If I could go back and give my thirteen year old self some advice, the main thing I'd tell him would be to stick his head up and look around.",
      "translated": "我感觉自己像一个探险家，见证了一场奇异的部落仪式。如果可以回到过去，给十三岁的自己一些建议，我最想告诉他的是抬起头来，环顾四周。"
    },
    {
      "original": "I didn't really grasp it at the time, but the whole world we lived in was as fake as a Twinkie. Not just school, but the entire town. Why do people move to suburbia? To have kids! So no wonder it seemed boring and sterile.",
      "translated": "当时我并没有真正理解，但我们所生活的整个世界就像一个假得不能再假的甜心蛋糕。不仅是学校，整个小镇都是这样。人们为什么搬到郊区？为了生孩子！所以难怪那里显得如此无聊和缺乏生气。"
    },
    {
      "original": "The whole place was a giant nursery, an artificial town created explicitly for the purpose of breeding children.Where I grew up, it felt as if there was nowhere to go, and nothing to do. This was no accident.",
      "translated": "整个地方就像一个巨大的托儿所，一个专门为生育儿童而刻意创建的人工城镇。我成长的地方，感觉无处可去，无所事事。这并非偶然。"
    },
    {
      "original": "Suburbs are deliberately designed to exclude the outside world, because it contains things that could endanger children.And as for the schools, they were just holding pens within this fake world. Officially the purpose of schools is to teach kids.",
      "translated": "郊区是有意设计来排除外界的，因为外界存在可能危及儿童的事物。至于学校，它们在这个虚假的世界里只不过是临时关押场所。官方上，学校的目的是教育孩子。"
    },
    {
      "original": "In fact their primary purpose is to keep kids locked up in one place for a big chunk of the day so adults can get things done. And I have no problem with this: in a specialized industrial society, it would be a disaster to have kids running around loose.What bothers me is not that the kids are kept in prisons, but that (a) they aren't told about it, and (b) the prisons are run mostly by the inmates.",
      "translated": "事实上，他们的主要目的是让孩子在一天中的大部分时间里待在一个地方，这样成人才能有时间做自己的事情。对于这一点，我没有任何异议：在专业化的工业社会中，让孩子四处乱跑将会是一场灾难。真正让我感到不安的并不是孩子们被关在“监狱”里，而是（a）他们没有被告知这一点，以及（b）这些“监狱”主要由囚犯来管理。"
    },
    {
      "original": "Kids are sent off to spend six years memorizing meaningless facts in a world ruled by a caste of giants who run after an oblong brown ball, as if this were the most natural thing in the world. And if they balk at this surreal cocktail, they're called misfits.",
      "translated": "孩子们被送去度过六年的时间，记忆那些毫无意义的事实，生活在一个由追逐橄榄棕色球的巨人阶层统治的世界里，仿佛这是世界上最自然的事情。如果他们对这种荒诞的组合表示抗拒，就会被称作不合群的人。"
    },
    {
      "original": "Life in this twisted world is stressful for the kids. And not just for the nerds. Like any war, it's damaging even to the winners.Adults can't avoid seeing that teenage kids are tormented. So why don't they do something about it?",
      "translated": "在这个扭曲的世界里，孩子们的生活压力很大。而不仅仅是书呆子。就像任何一场战争，即使对胜利者也会造成伤害。大人们不可能不看到青少年们的痛苦。那么，他们为什么没有采取行动呢？"
    },
    {
      "original": "Because they blame it on puberty. The reason kids are so unhappy, adults tell themselves, is that monstrous new chemicals, hormones, are now coursing through their bloodstream and messing up everything.",
      "translated": "因为他们把这归咎于青春期。成年人告诉自己，孩子们之所以如此不快乐，是因为一种新的、可怕的化学物质——激素——现在正在他们的血液中流动，扰乱了一切。"
    },
    {
      "original": "There's nothing wrong with the system; it's just inevitable that kids will be miserable at that age.This idea is so pervasive that even the kids believe it, which probably doesn't help. Someone who thinks his feet naturally hurt is not going to stop to consider the possibility that he is wearing the wrong size shoes.I'm suspicious of this theory that thirteen-year-old kids are intrinsically messed up.",
      "translated": "系统本身没有问题；只是孩子们在那个年纪感到痛苦是在所难免的。这种观点如此普遍，以至于孩子们自己也相信这一点，这可能并没有什么帮助。一个认为自己的脚天生就疼的人，是不会停下来考虑自己可能穿了不合脚的鞋。我对这种认为十三岁的孩子本质上就有问题的理论持怀疑态度。"
    },
    {
      "original": "If it's physiological, it should be universal. Are Mongol nomads all nihilists at thirteen? I've read a lot of history, and I have not seen a single reference to this supposedly universal fact before the twentieth century.",
      "translated": "如果是生理性的，那么应该是普遍的。十三岁的蒙古游牧民族都是虚无主义者吗？我读过很多历史，之前从未在二十世纪之前的任何文献中看到过关于这一所谓普遍事实的任何提及。"
    },
    {
      "original": "Teenage apprentices in the Renaissance seem to have been cheerful and eager. They got in fights and played tricks on one another of course (Michelangelo had his nose broken by a bully), but they weren't crazy.As far as I can tell, the concept of the hormone-crazed teenager is coeval with suburbia.",
      "translated": "文艺复兴时期的青少年学徒似乎既快乐又热情。他们当然会打架和互相捉弄（米开朗基罗的鼻子就被一个恶霸打坏了），但他们并不疯狂。据我所知，疯狂荷尔蒙驱动的青少年这一概念是与郊区文化同时出现的。"
    },
    {
      "original": "I don't think this is a coincidence. I think teenagers are driven crazy by the life they're made to lead. Teenage apprentices in the Renaissance were working dogs. Teenagers now are neurotic lapdogs.",
      "translated": "我不认为这是巧合。我认为青少年之所以发疯是因为被强迫过着的生活。文艺复兴时期的青少年学徒是工作犬。现在的青少年则是神经质的宠物狗。"
    },
    {
      "original": "Their craziness is the craziness of the idle everywhere. When I was in school, suicide was a constant topic among the smarter kids. No one I knew did it, but several planned to, and some may have tried.",
      "translated": "他们的疯狂是无所事事者的普遍疯狂。我上学时，自杀是那些聪明孩子中经常讨论的话题。我认识的人中没有人真的这样做，但有几个计划过，有些人可能尝试过。"
    },
    {
      "original": "Mostly this was just a pose. Like other teenagers, we loved the dramatic, and suicide seemed very dramatic. But partly it was because our lives were at times genuinely miserable.Bullying was only part of the problem.",
      "translated": "这多半只是一种姿态。像其他青少年一样，我们喜欢戏剧性，而自杀似乎非常戏剧化。但部分原因也在于，我们的生活有时确实很悲惨。欺凌只是问题的一部分。"
    },
    {
      "original": "Another problem, and possibly an even worse one, was that we never had anything real to work on. Humans like to work; in most of the world, your work is your identity. And all the work we did was pointless, or seemed so at the time.At best it was practice for real work we might do far in the future, so far that we didn't even know at the time what we were practicing for.",
      "translated": "另一个问题，可能更加严重的是，我们从来没有真正有意义的工作可做。人类喜欢工作；在世界上的大多数地方，你的工作就是你的身份。而我们所做的一切工作都是毫无意义的，或者至少在当时看来是这样。即使最好的情况，那也不过是为将来可能做的真正工作做准备，而那个未来是如此遥远，以至于我们当时甚至不知道自己在为什幺做准备。"
    },
    {
      "original": "More often it was just an arbitrary series of hoops to jump through, words without content designed mainly for testability. (The three main causes of the Civil War were.... Test: List the three main causes of the Civil War.)And there was no way to opt out.",
      "translated": "更多的时候，这只是一个随意设置的 hoops 要你去跳，一些没有实际意义的词语，主要设计目的是为了测试。（美国内战的三个主要原因……测试题目：列出美国内战的三个主要原因。）而且，你无法选择退出。"
    },
    {
      "original": "The adults had agreed among themselves that this was to be the route to college. The only way to escape this empty life was to submit to it. Teenage kids used to have a more active role in society. In pre-industrial times, they were all apprentices of one sort or another, whether in shops or on farms or even on warships.",
      "translated": "成年人之间已经达成一致，认为这是通往大学的唯一道路。要摆脱这种空虚的生活，唯一的方法就是屈从于它。青少年在过去的社会中曾扮演过更加积极的角色。在工业革命前，无论是商店、农场，甚至战舰上，他们都是某种形式的学徒。"
    },
    {
      "original": "They weren't left to create their own societies. They were junior members of adult societies.Teenagers seem to have respected adults more then, because the adults were the visible experts in the skills they were trying to learn.",
      "translated": "他们并没有被留下自己创建社会。他们只是成人社会中的初级成员。青少年那时似乎更加尊敬成年人，因为成年人是他们试图学习的技能的明显专家。"
    },
    {
      "original": "Now most kids have little idea what their parents do in their distant offices, and see no connection (indeed, there is precious little) between schoolwork and the work they'll do as adults.And if teenagers respected adults more, adults also had more use for teenagers.",
      "translated": "现在大多数孩子对自己父母在遥远的办公室里做些什么几乎一无所知，也看不出学业与他们将来作为成年人将要从事的工作之间有何关联（实际上，这种关联确实很少）。如果青少年能更加尊重成年人，成年人也会更需要青少年。"
    },
    {
      "original": "After a couple years' training, an apprentice could be a real help. Even the newest apprentice could be made to carry messages or sweep the workshop.Now adults have no immediate use for teenagers. They would be in the way in an office.",
      "translated": "经过几年的训练，学徒就能真正派上用场。即使是新来的学徒也能被派去传递消息或打扫工作间。现在成年人对青少年没有立竿见影的用途。他们在办公室里只会碍手碍脚。"
    },
    {
      "original": "So they drop them off at school on their way to work, much as they might drop the dog off at a kennel if they were going away for the weekend.What happened? We're up against a hard one here. The cause of this problem is the same as the cause of so many present ills: specialization.",
      "translated": "所以他们送孩子上学，就像他们周末外出时把狗送到寄养所一样。发生了什么？我们遇到了一个棘手的问题。这个问题的原因和当今许多问题的原因相同：专业化。"
    },
    {
      "original": "As jobs become more specialized, we have to train longer for them. Kids in pre-industrial times started working at about 14 at the latest; kids on farms, where most people lived, began far earlier. Now kids who go to college don't start working full-time till 21 or 22.",
      "translated": "随着工作的专业化程度提高，我们必须接受更长时间的培训。在前工业时代，孩子们最迟在14岁左右就开始工作；而在大多数人都居住的农场上，孩子们开始工作的年龄还要更早。如今，上大学的孩子要到21或22岁才开始全职工作。"
    },
    {
      "original": "With some degrees, like MDs and PhDs, you may not finish your training till 30.Teenagers now are useless, except as cheap labor in industries like fast food, which evolved to exploit precisely this fact.",
      "translated": "有些学位，比如医学博士（MD）和哲学博士（PhD），可能要到30岁才能完成学业。现在的青少年除了在快餐业等利用廉价劳动力的行业中工作外，几乎没有其他用处。"
    },
    {
      "original": "In almost any other kind of work, they'd be a net loss. But they're also too young to be left unsupervised. Someone has to watch over them, and the most efficient way to do this is to collect them together in one place.",
      "translated": "在几乎所有其他类型的工作中，他们都会造成净损失。但他们也太年轻，不能无人看管。必须有人照看他们，而最有效的方法是把他们集中到一个地方。"
    },
    {
      "original": "Then a few adults can watch all of them.If you stop there, what you're describing is literally a prison, albeit a part-time one. The problem is, many schools practically do stop there. The stated purpose of schools is to educate the kids.",
      "translated": "然后几个成年人就可以看管所有孩子。如果你就此打住，你描述的实际上就是一个监狱，尽管是兼职的。问题在于，许多学校几乎就是在这里止步。学校的名义目的是教育孩子。"
    },
    {
      "original": "But there is no external pressure to do this well. And so most schools do such a bad job of teaching that the kids don't really take it seriously-- not even the smart kids. Much of the time we were all, students and teachers both, just going through the motions.In my high school French class we were supposed to read Hugo's Les Miserables.",
      "translated": "但并没有外界的压力要求做好这一点。因此，大多数学校的教学效果很差，以至于孩子们并没有真正认真对待学习——即使是最聪明的孩子也不例外。很多时候，无论是学生还是老师，都只是在敷衍了事。在我上高中的法语课上，我们本应该阅读雨果的《悲惨世界》。"
    },
    {
      "original": "I don't think any of us knew French well enough to make our way through this enormous book. Like the rest of the class, I just skimmed the Cliff's Notes. When we were given a test on the book, I noticed that the questions sounded odd.",
      "translated": "我认为我们当中没有人能很好地掌握法语，以至于能够读懂这本书。像班上的其他人一样，我只是浏览了《克里夫笔记》。当给我们出的书的测试题时，我注意到题目听起来有些奇怪。"
    },
    {
      "original": "They were full of long words that our teacher wouldn't have used. Where had these questions come from? From the Cliff's Notes, it turned out. The teacher was using them too. We were all just pretending.There are certainly great public school teachers.",
      "translated": "这些问题里充满了老师不会使用的长难词。这些题目是从哪里来的？结果是从克利夫笔记里来的。老师也在用它们。我们都在装样子。当然，也有非常优秀的公立学校老师。"
    },
    {
      "original": "The energy and imagination of my fourth grade teacher, Mr. Mihalko, made that year something his students still talk about, thirty years later. But teachers like him were individuals swimming upstream.",
      "translated": "我四年级的老师米哈科先生的活力和想象力使得那一年成为了他的学生至今仍会谈论的事情，即使已经过去三十年。但像他这样的老师却是逆流而上的个体。"
    },
    {
      "original": "They couldn't fix the system. In almost any group of people you'll find hierarchy. When groups of adults form in the real world, it's generally for some common purpose, and the leaders end up being those who are best at it.",
      "translated": "他们无法修复这个系统。在几乎任何人群体中，你都会发现有层级结构。当成年人在现实世界中形成群体时，通常是为了某个共同的目的，而领导者最终往往是那些在这方面最擅长的人。"
    },
    {
      "original": "The problem with most schools is, they have no purpose. But hierarchy there must be. And so the kids make one out of nothing.We have a phrase to describe what happens when rankings have to be created without any meaningful criteria.",
      "translated": "大多数学校的问题在于，它们没有明确的目标。但层级是必须存在的。于是孩子们就会凭空创造出一个来。我们有一个短语来形容在没有有意义的标准时创建排名的情况。"
    },
    {
      "original": "We say that the situation degenerates into a popularity contest. And that's exactly what happens in most American schools. Instead of depending on some real test, one's rank depends mostly on one's ability to increase one's rank.",
      "translated": "我们说这种情况退化成了一场人气竞赛。而这正是大多数美国学校发生的情况。学生的排名不再依赖于某些实际的测试，而是主要取决于他们提升自己排名的能力。"
    },
    {
      "original": "It's like the court of Louis XIV. There is no external opponent, so the kids become one another's opponents.When there is some real external test of skill, it isn't painful to be at the bottom of the hierarchy.",
      "translated": "这就像路易十四的宫廷。没有外部对手，所以孩子们就成了彼此的对手。当有真正的外部技能测试时，处于等级底层并不会让人感到痛苦。"
    },
    {
      "original": "A rookie on a football team doesn't resent the skill of the veteran; he hopes to be like him one day and is happy to have the chance to learn from him. The veteran may in turn feel a sense of noblesse oblige.",
      "translated": "足球队的新手不会嫉妒老将的技巧；他希望有朝一日能像老将一样，并且很高兴有机会向他学习。老将则可能感到一种贵族义务。"
    },
    {
      "original": "And most importantly, their status depends on how well they do against opponents, not on whether they can push the other down.Court hierarchies are another thing entirely. This type of society debases anyone who enters it.",
      "translated": "最重要的是，他们的地位取决于与对手较量的表现，而不是能否将对方压倒。法庭等级制度则是另一回事。这种社会会贬低任何进入其中的人。"
    },
    {
      "original": "There is neither admiration at the bottom, nor noblesse oblige at the top. It's kill or be killed.This is the sort of society that gets created in American secondary schools. And it happens because these schools have no real purpose beyond keeping the kids all in one place for a certain number of hours each day.",
      "translated": "这里既没有底层的钦佩，也没有上层的贵族义务。要么杀人，要么被杀。这种社会就是在美国的中学里形成的。这种情况发生是因为这些学校除了每天把孩子们集中在一起特定的几个小时之外，没有其他真正的目的。"
    },
    {
      "original": "What I didn't realize at the time, and in fact didn't realize till very recently, is that the twin horrors of school life, the cruelty and the boredom, both have the same cause. The mediocrity of American public schools has worse consequences than just making kids unhappy for six years.",
      "translated": "我当时并没有意识到，事实上直到最近才意识到，学校生活的两大噩梦——残忍和无聊，其实有着相同的根源。美国公立学校的平庸不仅会让孩子们在六年的时间里感到不快乐，其后果远比这严重得多。"
    },
    {
      "original": "It breeds a rebelliousness that actively drives kids away from the things they're supposed to be learning.Like many nerds, probably, it was years after high school before I could bring myself to read anything we'd been assigned then.",
      "translated": "它培养了一种叛逆心理，积极地把孩子们从他们应该学习的东西中推开。像许多书呆子一样，可能是在高中毕业后许多年，我才能让自己去阅读当时被分配的任何东西。"
    },
    {
      "original": "And I lost more than books. I mistrusted words like \"character\" and \"integrity\" because they had been so debased by adults. As they were used then, these words all seemed to mean the same thing: obedience.",
      "translated": "而且，我失去的不仅仅是书。我开始不信任像“品格”和“正直”这样的词，因为它们被成年人用得太过贬低。在那时的使用中，这些词似乎都意味着同一个意思：顺从。"
    },
    {
      "original": "The kids who got praised for these qualities tended to be at best dull-witted prize bulls, and at worst facile schmoozers. If that was what character and integrity were, I wanted no part of them.The word I most misunderstood was \"tact.\" As used by adults, it seemed to mean keeping your mouth shut.",
      "translated": "那些因为这些品质而受到赞扬的孩子，最好的也不过是些头脑简单的大奖公牛，最坏的则是油腔滑调的交际花。如果这就是品格和正直，我一点也不想沾边。我最误解的一个词就是“ tact”。在大人们口中，这个词似乎意味着闭口不言。"
    },
    {
      "original": "I assumed it was derived from the same root as \"tacit\" and \"taciturn,\" and that it literally meant being quiet. I vowed that I would never be tactful; they were never going to shut me up. In fact, it's derived from the same root as \"tactile,\" and what it means is to have a deft touch.",
      "translated": "我以为它和“tacit”（心照不宣）和“taciturn”（寡言）出自同一个词根，意思是保持沉默。我发誓我永远不会圆滑处事；他们永远别想让我闭嘴。事实上，它和“tactile”（触觉的）出自同一个词根，意思是拥有巧妙的处理方式。"
    },
    {
      "original": "Tactful is the opposite of clumsy. I don't think I learned this until college.Nerds aren't the only losers in the popularity rat race. Nerds are unpopular because they're distracted. There are other kids who deliberately opt out because they're so disgusted with the whole process.Teenage kids, even rebels, don't like to be alone, so when kids opt out of the system, they tend to do it as a group.",
      "translated": "机敏是笨拙的反义词。我想我直到上大学才明白这一点。书呆子并不是人气竞赛中唯一的失败者。书呆子不受欢迎是因为他们分心了。还有一些孩子因为对整个过程感到厌恶而故意退出。青少年，即使是叛逆者，也不喜欢孤独，所以当孩子们退出这个体系时，他们往往会结成团体。"
    },
    {
      "original": "At the schools I went to, the focus of rebellion was drug use, specifically marijuana. The kids in this tribe wore black concert t-shirts and were called \"freaks.\"Freaks and nerds were allies, and there was a good deal of overlap between them.",
      "translated": "在我上学的时候，叛逆的主要表现是使用毒品，特别是大麻。这个群体的孩子们穿着黑色的演唱会T恤，被称为“怪人”。怪人和书呆子是盟友，他们之间有很多交集。"
    },
    {
      "original": "Freaks were on the whole smarter than other kids, though never studying (or at least never appearing to) was an important tribal value. I was more in the nerd camp, but I was friends with a lot of freaks.They used drugs, at least at first, for the social bonds they created.",
      "translated": "怪人们总体上比其他孩子更聪明，尽管从不学习（或者至少从不在人前学习）是他们部落的重要价值观。我更倾向于书呆子阵营，但我和很多怪人是朋友。他们起初使用毒品，至少部分原因是毒品能帮助建立社交联系。"
    },
    {
      "original": "It was something to do together, and because the drugs were illegal, it was a shared badge of rebellion.I'm not claiming that bad schools are the whole reason kids get into trouble with drugs. After a while, drugs have their own momentum.",
      "translated": "这是一件可以一起做的事情，因为毒品是非法的，所以它成了一种共同的叛逆标志。我并不认为糟糕的学校是孩子们涉毒的全部原因。一段时间后，毒品本身就会产生自己的动力。"
    },
    {
      "original": "No doubt some of the freaks ultimately used drugs to escape from other problems-- trouble at home, for example. But, in my school at least, the reason most kids started using drugs was rebellion. Fourteen-year-olds didn't start smoking pot because they'd heard it would help them forget their problems.",
      "translated": "毫无疑问，一些怪胎最终使用毒品来逃避其他问题——比如家庭问题。但是，至少在我所在的学校，大多数孩子开始使用毒品的原因是叛逆。14岁的孩子开始吸大麻并不是因为他们听说这能帮助他们忘记问题。"
    },
    {
      "original": "They started because they wanted to join a different tribe.Misrule breeds rebellion; this is not a new idea. And yet the authorities still for the most part act as if drugs were themselves the cause of the problem.",
      "translated": "他们开始这么做是因为想加入另一个部落。暴政滋生叛乱；这并非什么新观点。然而，当局大多仍表现得好像毒品本身就是问题的根源。"
    },
    {
      "original": "The real problem is the emptiness of school life. We won't see solutions till adults realize that. The adults who may realize it first are the ones who were themselves nerds in school. Do you want your kids to be as unhappy in eighth grade as you were?",
      "translated": "真正的问题在于学校生活的空虚。直到成人们意识到这一点，我们才能看到解决办法。最先意识到这一点的成年人可能是那些在学校时曾是书呆子的人。你想让你的孩子在八年级时和你一样不快乐吗？"
    },
    {
      "original": "I wouldn't. Well, then, is there anything we can do to fix things? Almost certainly. There is nothing inevitable about the current system. It has come about mostly by default.Adults, though, are busy.",
      "translated": "我不会。那么，我们能做些什么来改变现状吗？几乎肯定可以。当前的体系并非不可改变。它主要是由于疏忽而形成的。然而，成人们都很忙。"
    },
    {
      "original": "Showing up for school plays is one thing. Taking on the educational bureaucracy is another. Perhaps a few will have the energy to try to change things. I suspect the hardest part is realizing that you can.Nerds still in school should not hold their breath.",
      "translated": "出席学校的戏剧表演是一回事，挑战教育官僚体系则是另一回事。也许会有少数人有精力去尝试改变现状。我怀疑最困难的部分是意识到你能够做到。还在上学的书呆子们恐怕不能对此抱有太大的期望。"
    },
    {
      "original": "Maybe one day a heavily armed force of adults will show up in helicopters to rescue you, but they probably won't be coming this month. Any immediate improvement in nerds' lives is probably going to have to come from the nerds themselves.Merely understanding the situation they're in should make it less painful.",
      "translated": "也许有一天，一队全副武装的成年人会乘直升机来救你，但这个月他们大概不会来。任何对书呆子生活的立即改善，大概都得靠书呆子自己。仅仅理解他们所处的状况，就应该能减轻一些痛苦。"
    },
    {
      "original": "Nerds aren't losers. They're just playing a different game, and a game much closer to the one played in the real world. Adults know this. It's hard to find successful adults now who don't claim to have been nerds in high school.It's important for nerds to realize, too, that school is not life.",
      "translated": "书呆子并不是失败者。他们只是在玩一个不同的游戏，而且这个游戏更接近现实世界中的游戏。成年人都明白这一点。现在很难找到成功的成年人不声称自己在高中时是书呆子。书呆子也需要意识到，学校并不是生活的全部。"
    },
    {
      "original": "School is a strange, artificial thing, half sterile and half feral. It's all-encompassing, like life, but it isn't the real thing. It's only temporary, and if you look, you can see beyond it even while you're still in it.If life seems awful to kids, it's neither because hormones are turning you all into monsters (as your parents believe), nor because life actually is awful (as you believe).",
      "translated": "学校是一种奇怪而人为的事物，一半是无菌的，一半是野生的。它包罗万象，像生活一样，但又不是真实的生活。它只是暂时的，如果你仔细看，即使你仍然身处其中，也能看到它的边界。如果生活对孩子们来说显得糟糕，那既不是因为荷尔蒙把你们都变成了怪物（像你们的父母所认为的那样），也不是因为生活本身真的糟糕（像你们所认为的那样）。"
    },
    {
      "original": "It's because the adults, who no longer have any economic use for you, have abandoned you to spend years cooped up together with nothing real to do. Any society of that type is awful to live in. You don't have to look any further to explain why teenage kids are unhappy.I've said some harsh things in this essay, but really the thesis is an optimistic one-- that several problems we take for granted are in fact not insoluble after all.",
      "translated": "这是因为成年人，那些已经不再需要你为他们创造经济价值的人，把你抛弃了，让你多年被关在一起，无所事事。任何这样的社会都是糟糕的居住环境。你不必再寻找其他原因来解释为什么青少年不快乐。我在本文中说了一些尖锐的话，但其实论点是乐观的——我们习以为常的几个问题实际上并非无解。"
    },
    {
      "original": "Teenage kids are not inherently unhappy monsters. That should be encouraging news to kids and adults both. Thanks to Sarah Harlin, Trevor Blackwell, Robert Morris, Eric Raymond, and Jackie Weicker for reading drafts of this essay, and Maria Daniels for scanning photos.Re: Why Nerds are UnpopularGateway High School, 1981Japanese TranslationFrench TranslationMy War With BrianButtonsPortuguese TranslationSpanish Translation",
      "translated": "青少年并不是天生的不快乐的怪物。这对青少年和成年人都应该是令人鼓舞的消息。感谢 Sarah Harlin、Trevor Blackwell、Robert Morris、Eric Raymond 和 Jackie Weicker 阅读本文的草稿，以及 Maria Daniels 扫描照片。关于：为什么书呆子不受欢迎Gateway 高中，1981年日语翻译法语翻译我与 Brian 的战争Buttons葡萄牙语翻译西班牙语翻译"
    }
  ],
  "translation_completed": "2025-07-29T11:35:58.449191",
  "translation_stats": {
    "total_paragraphs": 117,
    "success_count": 117,
    "success_rate": "100.0%"
  }
}