{
  "title": "A Project of One's Own",
  "title_zh": "[待翻译] A Project of One's Own",
  "url": "https://www.paulgraham.com/own.html",
  "filename": "own.html",
  "date": "2020-09-21",
  "id": 86,
  "content": {
    "success": true,
    "paragraphs": [
      "June 2021A few days ago, on the way home from school, my nine year old son told me he couldn't wait to get home to write more of the story he was working on. This made me as happy as anything I've heard him say — not just because he was excited about his story, but because he'd discovered this way of working.",
      "Working on a project of your own is as different from ordinary work as skating is from walking. It's more fun, but also much more productive.What proportion of great work has been done by people who were skating in this sense?",
      "If not all of it, certainly a lot.There is something special about working on a project of your own. I wouldn't say exactly that you're happier. A better word would be excited, or engaged. You're happy when things are going well, but often they aren't.",
      "When I'm writing an essay, most of the time I'm worried and puzzled: worried that the essay will turn out badly, and puzzled because I'm groping for some idea that I can't see clearly enough. Will I be able to pin it down with words?",
      "In the end I usually can, if I take long enough, but I'm never sure; the first few attempts often fail.You have moments of happiness when things work out, but they don't last long, because then you're on to the next problem.",
      "So why do it at all? Because to the kind of people who like working this way, nothing else feels as right. You feel as if you're an animal in its natural habitat, doing what you were meant to do — not always happy, maybe, but awake and alive.Many kids experience the excitement of working on projects of their own.",
      "The hard part is making this converge with the work you do as an adult. And our customs make it harder. We treat \"playing\" and \"hobbies\" as qualitatively different from \"work\". It's not clear to a kid building a treehouse that there's a direct (though long) route from that to architecture or engineering.",
      "And instead of pointing out the route, we conceal it, by implicitly treating the stuff kids do as different from real work. [1]Instead of telling kids that their treehouses could be on the path to the work they do as adults, we tell them the path goes through school.",
      "And unfortunately schoolwork tends to be very different from working on projects of one's own. It's usually neither a project, nor one's own. So as school gets more serious, working on projects of one's own is something that survives, if at all, as a thin thread off to the side.It's a bit sad to think of all the high school kids turning their backs on building treehouses and sitting in class dutifully learning about Darwin or Newton to pass some exam, when the work that made Darwin and Newton famous was actually closer in spirit to building treehouses than studying for exams.If I had to choose between my kids getting good grades and working on ambitious projects of their own, I'd pick the projects.",
      "And not because I'm an indulgent parent, but because I've been on the other end and I know which has more predictive value. When I was picking startups for Y Combinator, I didn't care about applicants' grades.",
      "But if they'd worked on projects of their own, I wanted to hear all about those. [2]It may be inevitable that school is the way it is. I'm not saying we have to redesign it (though I'm not saying we don't), just that we should understand what it does to our attitudes to work — that it steers us toward the dutiful plodding kind of work, often using competition as bait, and away from skating.There are occasionally times when schoolwork becomes a project of one's own.",
      "Whenever I had to write a paper, that would become a project of my own — except in English classes, ironically, because the things one has to write in English classes are so bogus. And when I got to college and started taking CS classes, the programs I had to write became projects of my own.",
      "Whenever I was writing or programming, I was usually skating, and that has been true ever since.So where exactly is the edge of projects of one's own? That's an interesting question, partly because the answer is so complicated, and partly because there's so much at stake.",
      "There turn out to be two senses in which work can be one's own: 1) that you're doing it voluntarily, rather than merely because someone told you to, and 2) that you're doing it by yourself.The edge of the former is quite sharp.",
      "People who care a lot about their work are usually very sensitive to the difference between pulling, and being pushed, and work tends to fall into one category or the other. But the test isn't simply whether you're told to do something.",
      "You can choose to do something you're told to do. Indeed, you can own it far more thoroughly than the person who told you to do it.For example, math homework is for most people something they're told to do.",
      "But for my father, who was a mathematician, it wasn't. Most of us think of the problems in a math book as a way to test or develop our knowledge of the material explained in each section. But to my father the problems were the part that mattered, and the text was merely a sort of annotation.",
      "Whenever he got a new math book it was to him like being given a puzzle: here was a new set of problems to solve, and he'd immediately set about solving all of them.The other sense of a project being one's own — working on it by oneself — has a much softer edge.",
      "It shades gradually into collaboration. And interestingly, it shades into collaboration in two different ways. One way to collaborate is to share a single project. For example, when two mathematicians collaborate on a proof that takes shape in the course of a conversation between them.",
      "The other way is when multiple people work on separate projects of their own that fit together like a jigsaw puzzle. For example, when one person writes the text of a book and another does the graphic design.",
      "[3]These two paths into collaboration can of course be combined. But under the right conditions, the excitement of working on a project of one's own can be preserved for quite a while before disintegrating into the turbulent flow of work in a large organization.",
      "Indeed, the history of successful organizations is partly the history of techniques for preserving that excitement. [4]The team that made the original Macintosh were a great example of this phenomenon.",
      "People like Burrell Smith and Andy Hertzfeld and Bill Atkinson and Susan Kare were not just following orders. They were not tennis balls hit by Steve Jobs, but rockets let loose by Steve Jobs. There was a lot of collaboration between them, but they all seem to have individually felt the excitement of working on a project of one's own.In Andy Hertzfeld's book on the Macintosh, he describes how they'd come back into the office after dinner and work late into the night.",
      "People who've never experienced the thrill of working on a project they're excited about can't distinguish this kind of working long hours from the kind that happens in sweatshops and boiler rooms, but they're at opposite ends of the spectrum.",
      "That's why it's a mistake to insist dogmatically on \"work/life balance.\" Indeed, the mere expression \"work/life\" embodies a mistake: it assumes work and life are distinct. For those to whom the word \"work\" automatically implies the dutiful plodding kind, they are.",
      "But for the skaters, the relationship between work and life would be better represented by a dash than a slash. I wouldn't want to work on anything that I didn't want to take over my life.Of course, it's easier to achieve this level of motivation when you're making something like the Macintosh.",
      "It's easy for something new to feel like a project of your own. That's one of the reasons for the tendency programmers have to rewrite things that don't need rewriting, and to write their own versions of things that already exist.",
      "This sometimes alarms managers, and measured by total number of characters typed, it's rarely the optimal solution. But it's not always driven simply by arrogance or cluelessness. Writing code from scratch is also much more rewarding — so much more rewarding that a good programmer can end up net ahead, despite the shocking waste of characters.",
      "Indeed, it may be one of the advantages of capitalism that it encourages such rewriting. A company that needs software to do something can't use the software already written to do it at another company, and thus has to write their own, which often turns out better.",
      "[5]The natural alignment between skating and solving new problems is one of the reasons the payoffs from startups are so high. Not only is the market price of unsolved problems higher, you also get a discount on productivity when you work on them.",
      "In fact, you get a double increase in productivity: when you're doing a clean-sheet design, it's easier to recruit skaters, and they get to spend all their time skating.Steve Jobs knew a thing or two about skaters from having watched Steve Wozniak.",
      "If you can find the right people, you only have to tell them what to do at the highest level. They'll handle the details. Indeed, they insist on it. For a project to feel like your own, you must have sufficient autonomy.",
      "You can't be working to order, or slowed down by bureaucracy.One way to ensure autonomy is not to have a boss at all. There are two ways to do that: to be the boss yourself, and to work on projects outside of work.",
      "Though they're at opposite ends of the scale financially, startups and open source projects have a lot in common, including the fact that they're often run by skaters. And indeed, there's a wormhole from one end of the scale to the other: one of the best ways to discover startup ideas is to work on a project just for fun.If your projects are the kind that make money, it's easy to work on them.",
      "It's harder when they're not. And the hardest part, usually, is morale. That's where adults have it harder than kids. Kids just plunge in and build their treehouse without worrying about whether they're wasting their time, or how it compares to other treehouses.",
      "And frankly we could learn a lot from kids here. The high standards most grownups have for \"real\" work do not always serve us well.The most important phase in a project of one's own is at the beginning: when you go from thinking it might be cool to do x to actually doing x.",
      "And at that point high standards are not merely useless but positively harmful. There are a few people who start too many new projects, but far more, I suspect, who are deterred by fear of failure from starting projects that would have succeeded if they had.But if we couldn't benefit as kids from the knowledge that our treehouses were on the path to grownup projects, we can at least benefit as grownups from knowing that our projects are on a path that stretches back to treehouses.",
      "Remember that careless confidence you had as a kid when starting something new? That would be a powerful thing to recapture.If it's harder as adults to retain that kind of confidence, we at least tend to be more aware of what we're doing.",
      "Kids bounce, or are herded, from one kind of work to the next, barely realizing what's happening to them. Whereas we know more about different types of work and have more control over which we do. Ideally we can have the best of both worlds: to be deliberate in choosing to work on projects of our own, and carelessly confident in starting new ones.",
      "Notes[1] \"Hobby\" is a curious word. Now it means work that isn't real work — work that one is not to be judged by — but originally it just meant an obsession in a fairly general sense (even a political opinion, for example) that one metaphorically rode as a child rides a hobby-horse.",
      "It's hard to say if its recent, narrower meaning is a change for the better or the worse. For sure there are lots of false positives — lots of projects that end up being important but are dismissed initially as mere hobbies.",
      "But on the other hand, the concept provides valuable cover for projects in the early, ugly duckling phase.[2] Tiger parents, as parents so often do, are fighting the last war. Grades mattered more in the old days when the route to success was to acquire credentials while ascending some predefined ladder.",
      "But it's just as well that their tactics are focused on grades. How awful it would be if they invaded the territory of projects, and thereby gave their kids a distaste for this kind of work by forcing them to do it.",
      "Grades are already a grim, fake world, and aren't harmed much by parental interference, but working on one's own projects is a more delicate, private thing that could be damaged very easily.[3] The complicated, gradual edge between working on one's own projects and collaborating with others is one reason there is so much disagreement about the idea of the \"lone genius.\" In practice people collaborate (or not) in all kinds of different ways, but the idea of the lone genius is definitely not a myth.",
      "There's a core of truth to it that goes with a certain way of working.[4] Collaboration is powerful too. The optimal organization would combine collaboration and ownership in such a way as to do the least damage to each.",
      "Interestingly, companies and university departments approach this ideal from opposite directions: companies insist on collaboration, and occasionally also manage both to recruit skaters and allow them to skate, and university departments insist on the ability to do independent research (which is by custom treated as skating, whether it is or not), and the people they hire collaborate as much as they choose.[5] If a company could design its software in such a way that the best newly arrived programmers always got a clean sheet, it could have a kind of eternal youth.",
      "That might not be impossible. If you had a software backbone defining a game with sufficiently clear rules, individual programmers could write their own players. Thanks to Trevor Blackwell, Paul Buchheit, Andy Hertzfeld, Jessica Livingston, and Peter Norvig for reading drafts of this."
    ],
    "word_count": 2480,
    "paragraph_count": 47
  },
  "processed_at": "2025-07-26T19:04:10.995906",
  "paragraphs": [
    {
      "original": "June 2021A few days ago, on the way home from school, my nine year old son told me he couldn't wait to get home to write more of the story he was working on. This made me as happy as anything I've heard him say — not just because he was excited about his story, but because he'd discovered this way of working.",
      "translated": "2021年6月，前几天，我九岁的儿子在从学校回家的路上告诉我，他迫不及待地想回家继续写他正在创作的故事。这让我感到无比高兴——不仅因为他对他的故事感到兴奋，还因为他发现了这种工作方式。"
    },
    {
      "original": "Working on a project of your own is as different from ordinary work as skating is from walking. It's more fun, but also much more productive.What proportion of great work has been done by people who were skating in this sense?",
      "translated": "自己做项目与普通工作之间的区别就像滑冰与走路一样。这不仅更有趣，而且生产效率也高得多。从这个意义上说，有多少杰出的工作是由那些“滑冰”的人完成的呢？"
    },
    {
      "original": "If not all of it, certainly a lot.There is something special about working on a project of your own. I wouldn't say exactly that you're happier. A better word would be excited, or engaged. You're happy when things are going well, but often they aren't.",
      "translated": "即使不是全部，也肯定有很多。自己动手做一个项目，总有些特别之处。我不会说你一定会更快乐。一个更好的词或许是“兴奋”或“投入”。当事情进展顺利时，你会感到快乐，但很多时候并非如此。"
    },
    {
      "original": "When I'm writing an essay, most of the time I'm worried and puzzled: worried that the essay will turn out badly, and puzzled because I'm groping for some idea that I can't see clearly enough. Will I be able to pin it down with words?",
      "translated": "当我写论文时，大多数时候我感到担忧和困惑：担心论文会写得不好，困惑于我在摸索一个看不清楚的想法。我能否用语言准确地表达出来？"
    },
    {
      "original": "In the end I usually can, if I take long enough, but I'm never sure; the first few attempts often fail.You have moments of happiness when things work out, but they don't last long, because then you're on to the next problem.",
      "translated": "最后我通常都能做到，只要我花足够长的时间，但我从不确信；最初的几次尝试往往失败。当事情进展顺利时，你会感到幸福的时刻，但这种感觉不会持续太久，因为接着你就得面对下一个问题。"
    },
    {
      "original": "So why do it at all? Because to the kind of people who like working this way, nothing else feels as right. You feel as if you're an animal in its natural habitat, doing what you were meant to do — not always happy, maybe, but awake and alive.Many kids experience the excitement of working on projects of their own.",
      "translated": "那么，为什么还要这样做呢？因为对于喜欢这样工作的人来说，其他方式都无法让他们感觉如此正确。你会觉得自己就像处在自然栖息地的动物，正在做自己应该做的事情——也许并不总是快乐，但确是充满活力和清醒的。许多孩子在从事自己项目的时侯都会体验到这种兴奋感。"
    },
    {
      "original": "The hard part is making this converge with the work you do as an adult. And our customs make it harder. We treat \"playing\" and \"hobbies\" as qualitatively different from \"work\". It's not clear to a kid building a treehouse that there's a direct (though long) route from that to architecture or engineering.",
      "translated": "难点在于将这些与你成年后的工作结合起来。而我们的习惯让这变得更加困难。我们将“玩耍”和“爱好”视为与“工作”在性质上完全不同。对于一个正在搭建树屋的孩子来说，从那里直接通向建筑学或工程学的道路（尽管漫长）并不明显。"
    },
    {
      "original": "And instead of pointing out the route, we conceal it, by implicitly treating the stuff kids do as different from real work. [1]Instead of telling kids that their treehouses could be on the path to the work they do as adults, we tell them the path goes through school.",
      "translated": "我们不是指出这条路线，而是通过隐含地将孩子们做的事情与真正的工作区分开来将其掩盖。[1]我们没有告诉孩子们他们的树屋可能是通往成年后工作道路上的一环，而是告诉他们这条道路要经过学校。"
    },
    {
      "original": "And unfortunately schoolwork tends to be very different from working on projects of one's own. It's usually neither a project, nor one's own. So as school gets more serious, working on projects of one's own is something that survives, if at all, as a thin thread off to the side.It's a bit sad to think of all the high school kids turning their backs on building treehouses and sitting in class dutifully learning about Darwin or Newton to pass some exam, when the work that made Darwin and Newton famous was actually closer in spirit to building treehouses than studying for exams.If I had to choose between my kids getting good grades and working on ambitious projects of their own, I'd pick the projects.",
      "translated": "不幸的是，学校的作业往往与自己动手做项目大相径庭。它通常既不是项目，也不是自己的。因此，随着学业的日益加重，自己动手做项目这种事情，如果还能存在的话，也只能作为一条细线在旁边勉强维持。想到所有那些高中的孩子们，放弃了建造树屋，坐在教室里乖乖地学习达尔文或牛顿的知识，只是为了通过考试，这真是令人有些伤感。实际上，使达尔文和牛顿成名的工作，在精神上更接近于建造树屋，而不是为了考试而学习。如果我必须在孩子们取得好成绩和自己动手做有雄心的项目之间做出选择，我会选择项目。"
    },
    {
      "original": "And not because I'm an indulgent parent, but because I've been on the other end and I know which has more predictive value. When I was picking startups for Y Combinator, I didn't care about applicants' grades.",
      "translated": "并不是因为我是一个溺爱的家长，而是因为我曾经站在另一边，知道什么更有预测价值。当我在为Y Combinator挑选初创企业时，我不关心申请者的成绩。"
    },
    {
      "original": "But if they'd worked on projects of their own, I wanted to hear all about those. [2]It may be inevitable that school is the way it is. I'm not saying we have to redesign it (though I'm not saying we don't), just that we should understand what it does to our attitudes to work — that it steers us toward the dutiful plodding kind of work, often using competition as bait, and away from skating.There are occasionally times when schoolwork becomes a project of one's own.",
      "translated": "但如果他们自己做过项目，我想听听所有的细节。[2]学校的样子可能是不可避免的。我不是说我们必须重新设计它（虽然我也没有说不），只是说我们应该理解它对我们的工作态度有什么影响——它引导我们去做那种尽职尽责、循规蹈矩的工作，经常用竞争作为诱饵，而远离了随性自在的态度。偶尔，学校作业会变成个人的项目。"
    },
    {
      "original": "Whenever I had to write a paper, that would become a project of my own — except in English classes, ironically, because the things one has to write in English classes are so bogus. And when I got to college and started taking CS classes, the programs I had to write became projects of my own.",
      "translated": "每当我需要写论文时，那就会成为我自己的一个项目——讽刺的是，在英语课上除外，因为英语课上需要写的东西太不真实了。而当我上了大学，开始上计算机科学课程时，我需要编写的程序也就变成了我自己的项目。"
    },
    {
      "original": "Whenever I was writing or programming, I was usually skating, and that has been true ever since.So where exactly is the edge of projects of one's own? That's an interesting question, partly because the answer is so complicated, and partly because there's so much at stake.",
      "translated": "每当我写作或编程时，通常都在滑冰，从那时起一直如此。那么，个人项目的边界究竟在哪里呢？这是一个有趣的问题，部分原因是答案非常复杂，部分原因是这个问题涉及的利害关系太多了。"
    },
    {
      "original": "There turn out to be two senses in which work can be one's own: 1) that you're doing it voluntarily, rather than merely because someone told you to, and 2) that you're doing it by yourself.The edge of the former is quite sharp.",
      "translated": "工作可以是自己的，这一点实际上有两个含义：1) 你是自愿去做，而不是仅仅因为有人吩咐你去做；2) 你是独立完成的。前者的界限相当明确。"
    },
    {
      "original": "People who care a lot about their work are usually very sensitive to the difference between pulling, and being pushed, and work tends to fall into one category or the other. But the test isn't simply whether you're told to do something.",
      "translated": "非常在意工作的人通常对“主动做”和“被动推”之间的区别非常敏感，而工作往往归属于其中的一种。但衡量标准并不仅仅是你是否被吩咐去做某件事。"
    },
    {
      "original": "You can choose to do something you're told to do. Indeed, you can own it far more thoroughly than the person who told you to do it.For example, math homework is for most people something they're told to do.",
      "translated": "你可以选择去做别人让你做的事。事实上，你可以比那个告诉你去做的人更加彻底地拥有这件事。例如，数学作业对大多数人来说是别人让他们去做的事情。"
    },
    {
      "original": "But for my father, who was a mathematician, it wasn't. Most of us think of the problems in a math book as a way to test or develop our knowledge of the material explained in each section. But to my father the problems were the part that mattered, and the text was merely a sort of annotation.",
      "translated": "但对于我的父亲，一位数学家来说，情况并非如此。我们大多数人认为数学书中的习题是用来测试或发展我们对每个部分所解释材料的理解。但对我父亲来说，习题才是关键部分，而文本只是注解而已。"
    },
    {
      "original": "Whenever he got a new math book it was to him like being given a puzzle: here was a new set of problems to solve, and he'd immediately set about solving all of them.The other sense of a project being one's own — working on it by oneself — has a much softer edge.",
      "translated": "每当他得到一本新的数学书时，这对他来说就像得到了一个谜题：这里有一系列新的问题需要解决，他会立即着手解决所有问题。另一种项目属于个人的感觉——独自工作——则带有更柔和的边缘。"
    },
    {
      "original": "It shades gradually into collaboration. And interestingly, it shades into collaboration in two different ways. One way to collaborate is to share a single project. For example, when two mathematicians collaborate on a proof that takes shape in the course of a conversation between them.",
      "translated": "它逐渐过渡到合作。有趣的是，这种过渡以两种不同的方式发生。一种合作方式是共享一个项目。例如，当两位数学家通过他们之间的对话共同塑造一个证明时。"
    },
    {
      "original": "The other way is when multiple people work on separate projects of their own that fit together like a jigsaw puzzle. For example, when one person writes the text of a book and another does the graphic design.",
      "translated": "另一种方式是多个人各自从事不同的项目，这些项目像拼图一样拼接在一起。例如，一个人编写书籍的文字内容，另一个人则负责图形设计。"
    },
    {
      "original": "[3]These two paths into collaboration can of course be combined. But under the right conditions, the excitement of working on a project of one's own can be preserved for quite a while before disintegrating into the turbulent flow of work in a large organization.",
      "translated": "这两条合作的路径当然可以结合。但在适当的条件下，从事自己项目的激动心情可以在相当长的一段时间内得以保持，不会过早地被大型组织中纷繁复杂的工作流程所侵蚀。"
    },
    {
      "original": "Indeed, the history of successful organizations is partly the history of techniques for preserving that excitement. [4]The team that made the original Macintosh were a great example of this phenomenon.",
      "translated": "确实，成功组织的历史在某种程度上就是保存这种热情的技术史。[4]制造第一台麦金塔电脑的团队就是这种现象的一个典型例子。"
    },
    {
      "original": "People like Burrell Smith and Andy Hertzfeld and Bill Atkinson and Susan Kare were not just following orders. They were not tennis balls hit by Steve Jobs, but rockets let loose by Steve Jobs. There was a lot of collaboration between them, but they all seem to have individually felt the excitement of working on a project of one's own.In Andy Hertzfeld's book on the Macintosh, he describes how they'd come back into the office after dinner and work late into the night.",
      "translated": "布雷尔·史密斯、安迪·赫茨菲尔德、比尔·阿特金森和苏珊·卡雷并不是简单地听从命令。他们不是被史蒂夫·乔布斯击中的网球，而是被史蒂夫·乔布斯释放的火箭。他们之间有很多合作，但每个人似乎都感受到了独自工作在一个项目上的兴奋。在安迪·赫茨菲尔德关于麦金塔的书中，他描述了他们如何在晚餐后回到办公室，工作到深夜。"
    },
    {
      "original": "People who've never experienced the thrill of working on a project they're excited about can't distinguish this kind of working long hours from the kind that happens in sweatshops and boiler rooms, but they're at opposite ends of the spectrum.",
      "translated": "从未体验过投身于自己热衷项目的人，无法将这种长时间工作与血汗工厂和高压销售室里的长时间工作区分开来，但它们实际上处于光谱的两端。"
    },
    {
      "original": "That's why it's a mistake to insist dogmatically on \"work/life balance.\" Indeed, the mere expression \"work/life\" embodies a mistake: it assumes work and life are distinct. For those to whom the word \"work\" automatically implies the dutiful plodding kind, they are.",
      "translated": "这就是为什么坚持“工作/生活平衡”是一种错误。事实上，“工作/生活”这个表达本身就包含了一个错误：它假设工作和生活是分开的。对于那些一提到“工作”就自动想到循规蹈矩、按部就班的人来说，它们确实是分开的。"
    },
    {
      "original": "But for the skaters, the relationship between work and life would be better represented by a dash than a slash. I wouldn't want to work on anything that I didn't want to take over my life.Of course, it's easier to achieve this level of motivation when you're making something like the Macintosh.",
      "translated": "但对于滑板运动员来说，工作与生活之间的关系用破折号表示比用斜杠更合适。我不愿意去做任何不能占据我生活的项目。当然，当你在制作像麦金塔这样的产品时，达到这种程度的动力要容易得多。"
    },
    {
      "original": "It's easy for something new to feel like a project of your own. That's one of the reasons for the tendency programmers have to rewrite things that don't need rewriting, and to write their own versions of things that already exist.",
      "translated": "新事物很容易让人感觉像是自己的项目。这就是程序员倾向于重写不需要重写的东西，以及编写已有版本的原因之一。"
    },
    {
      "original": "This sometimes alarms managers, and measured by total number of characters typed, it's rarely the optimal solution. But it's not always driven simply by arrogance or cluelessness. Writing code from scratch is also much more rewarding — so much more rewarding that a good programmer can end up net ahead, despite the shocking waste of characters.",
      "translated": "这有时会让管理者感到担忧，而且从输入的总字符数来看，这很少是最优解。但这种情况并不总是由傲慢或无知驱动的。从头开始编写代码也更具成就感——这种成就感如此之高，以至于优秀的程序员最终可能会净收益，尽管字符的浪费令人震惊。"
    },
    {
      "original": "Indeed, it may be one of the advantages of capitalism that it encourages such rewriting. A company that needs software to do something can't use the software already written to do it at another company, and thus has to write their own, which often turns out better.",
      "translated": "确实，资本主义的一个优点可能就在于它鼓励这种重写。一家公司如果需要软件来完成某项任务，无法使用其他公司已有的软件来完成同样的任务，因此不得不自己编写，而这往往会产生更好的结果。"
    },
    {
      "original": "[5]The natural alignment between skating and solving new problems is one of the reasons the payoffs from startups are so high. Not only is the market price of unsolved problems higher, you also get a discount on productivity when you work on them.",
      "translated": "滑冰与解决新问题之间的天然契合是初创企业回报如此之高的原因之一。不仅未解决的问题在市场上的价值更高，当你致力于解决这些问题时，你的生产力也会得到提升。"
    },
    {
      "original": "In fact, you get a double increase in productivity: when you're doing a clean-sheet design, it's easier to recruit skaters, and they get to spend all their time skating.Steve Jobs knew a thing or two about skaters from having watched Steve Wozniak.",
      "translated": "事实上，你可以获得生产力的双重提升：在进行全新设计时，更容易招募到程序员，而且他们可以把所有时间都用来编程。史蒂夫·乔布斯从观察史蒂夫·沃兹尼亚克的过程中，对程序员有了不少了解。"
    },
    {
      "original": "If you can find the right people, you only have to tell them what to do at the highest level. They'll handle the details. Indeed, they insist on it. For a project to feel like your own, you must have sufficient autonomy.",
      "translated": "如果你能找到合适的人，你只需要在最高层次上告诉他们该做什么。他们会处理细节。事实上，他们坚持这样做。为了让一个项目感觉像是你自己的，你必须拥有足够的自主权。"
    },
    {
      "original": "You can't be working to order, or slowed down by bureaucracy.One way to ensure autonomy is not to have a boss at all. There are two ways to do that: to be the boss yourself, and to work on projects outside of work.",
      "translated": "你不能为了命令而工作，也不能被官僚主义所拖累。确保自主的一种方法是根本不要有老板。要做到这一点有两种方式：自己当老板，或是在工作之外的项目上工作。"
    },
    {
      "original": "Though they're at opposite ends of the scale financially, startups and open source projects have a lot in common, including the fact that they're often run by skaters. And indeed, there's a wormhole from one end of the scale to the other: one of the best ways to discover startup ideas is to work on a project just for fun.If your projects are the kind that make money, it's easy to work on them.",
      "translated": "尽管在财务状况上处于天平的两端，初创企业和开源项目有许多共同点，包括它们通常由滑板爱好者运营。事实上，从一端到另一端存在一个虫洞：发现初创企业想法的最佳途径之一就是出于兴趣进行一个项目。如果你的项目是那种能赚钱的，那么从事这些项目就变得很容易。"
    },
    {
      "original": "It's harder when they're not. And the hardest part, usually, is morale. That's where adults have it harder than kids. Kids just plunge in and build their treehouse without worrying about whether they're wasting their time, or how it compares to other treehouses.",
      "translated": "当情况并非如此时，事情就变得更难了。而最困难的部分，通常是士气。在这方面，成年人比孩子更难。孩子们会直接投入进去，建造他们的树屋，而不会担心是否在浪费时间，或者它与其他树屋相比如何。"
    },
    {
      "original": "And frankly we could learn a lot from kids here. The high standards most grownups have for \"real\" work do not always serve us well.The most important phase in a project of one's own is at the beginning: when you go from thinking it might be cool to do x to actually doing x.",
      "translated": "坦率地说，我们能从孩子身上学到很多。成年人对“真正”的工作设定的高标准并不总是对我们有利。在自己的项目中，最重要的阶段是在开始时：从认为做某件事很酷到真正去做这件事。"
    },
    {
      "original": "And at that point high standards are not merely useless but positively harmful. There are a few people who start too many new projects, but far more, I suspect, who are deterred by fear of failure from starting projects that would have succeeded if they had.But if we couldn't benefit as kids from the knowledge that our treehouses were on the path to grownup projects, we can at least benefit as grownups from knowing that our projects are on a path that stretches back to treehouses.",
      "translated": "在那种情况下，高标准不仅无用，而且有害。确实有些人启动了太多新项目，但我认为，更多的人是由于害怕失败而不敢启动本可能成功的项目。如果我们小时候不能从知道我们的树屋是通往成人项目的道路上受益，那么至少作为成年人，我们可以从知道我们的项目是沿着通往树屋的道路延续下来的这一事实中受益。"
    },
    {
      "original": "Remember that careless confidence you had as a kid when starting something new? That would be a powerful thing to recapture.If it's harder as adults to retain that kind of confidence, we at least tend to be more aware of what we're doing.",
      "translated": "还记得你小时候开始新事物时那种漫不经心的自信吗？重新找回这种自信将是一件非常强大的事情。如果成年后要保持这种自信变得更加困难，至少我们更加清楚自己在做什么。"
    },
    {
      "original": "Kids bounce, or are herded, from one kind of work to the next, barely realizing what's happening to them. Whereas we know more about different types of work and have more control over which we do. Ideally we can have the best of both worlds: to be deliberate in choosing to work on projects of our own, and carelessly confident in starting new ones.",
      "translated": "孩子们从一种工作跳到另一种工作，或被驱赶着这样做，几乎没意识到自己身上发生了什么。而我们对不同种类的工作了解得更多，也对选择做什么工作有更多的控制权。理想情况下，我们可以兼得两者之长：有意识地选择自己想做的项目，同时在开始新项目时表现出漫不经心的自信。"
    },
    {
      "original": "Notes[1] \"Hobby\" is a curious word. Now it means work that isn't real work — work that one is not to be judged by — but originally it just meant an obsession in a fairly general sense (even a political opinion, for example) that one metaphorically rode as a child rides a hobby-horse.",
      "translated": "注释[1] “爱好”是一个有趣的词。现在它指的是一种并非真正的工作——一种不以成败论英雄的工作——但最初它只是泛指一种近乎痴迷的兴趣（例如，甚至是一种政治观点），人们像孩子骑木马那样“骑”着这种兴趣。"
    },
    {
      "original": "It's hard to say if its recent, narrower meaning is a change for the better or the worse. For sure there are lots of false positives — lots of projects that end up being important but are dismissed initially as mere hobbies.",
      "translated": "很难说它最近的狭义化是好是坏。可以肯定的是，有很多误判——很多最终变得重要的项目最初却被当作 mere hobbies 而被轻视。"
    },
    {
      "original": "But on the other hand, the concept provides valuable cover for projects in the early, ugly duckling phase.[2] Tiger parents, as parents so often do, are fighting the last war. Grades mattered more in the old days when the route to success was to acquire credentials while ascending some predefined ladder.",
      "translated": "但另一方面，这一概念为项目在早期的“丑小鸭”阶段提供了宝贵的保护伞。虎爸虎妈，就像家长们常常做的那样，是在打上一场战争。在过去的日子里，成绩更为重要，因为成功的路径是获取文凭并沿着某个预设的阶梯攀升。"
    },
    {
      "original": "But it's just as well that their tactics are focused on grades. How awful it would be if they invaded the territory of projects, and thereby gave their kids a distaste for this kind of work by forcing them to do it.",
      "translated": "但他们的策略集中在成绩上也未尝不是一件好事。如果他们侵入项目领域，强迫孩子去做，从而让孩子对这种工作产生厌恶，那该有多糟糕。"
    },
    {
      "original": "Grades are already a grim, fake world, and aren't harmed much by parental interference, but working on one's own projects is a more delicate, private thing that could be damaged very easily.[3] The complicated, gradual edge between working on one's own projects and collaborating with others is one reason there is so much disagreement about the idea of the \"lone genius.\" In practice people collaborate (or not) in all kinds of different ways, but the idea of the lone genius is definitely not a myth.",
      "translated": "成绩已经是一个阴暗、虚假的世界，家长的干预并不会对其造成太大伤害，但个人项目则更加脆弱、私密，很容易受到破坏。[3] 个人项目与他人合作之间的复杂、渐进的边界，是关于“孤独天才”这一概念存在诸多争议的原因之一。实际上，人们以各种不同的方式合作（或不合作），但“孤独天才”的概念绝非虚构。"
    },
    {
      "original": "There's a core of truth to it that goes with a certain way of working.[4] Collaboration is powerful too. The optimal organization would combine collaboration and ownership in such a way as to do the least damage to each.",
      "translated": "其中蕴含着一个与某种工作方式相契合的核心真理。[4] 合作同样具有强大的力量。最理想的组织会将合作与所有权结合起来，以最大限度地减少对双方的损害。"
    },
    {
      "original": "Interestingly, companies and university departments approach this ideal from opposite directions: companies insist on collaboration, and occasionally also manage both to recruit skaters and allow them to skate, and university departments insist on the ability to do independent research (which is by custom treated as skating, whether it is or not), and the people they hire collaborate as much as they choose.[5] If a company could design its software in such a way that the best newly arrived programmers always got a clean sheet, it could have a kind of eternal youth.",
      "translated": "有趣的是，公司和大学院系从相反的方向接近这一理想：公司坚持合作，并且偶尔还能既招聘到滑板高手又允许他们滑板；而大学院系则坚持独立研究的能力（按照惯例，无论是否真的是滑板，都被视为滑板），他们聘用的人则根据自己的选择进行尽可能多的合作。如果一家公司能够设计其软件，使得最优秀的新人程序员总能获得一张干净的画布，那么这家公司就能拥有某种形式的永葆青春。"
    },
    {
      "original": "That might not be impossible. If you had a software backbone defining a game with sufficiently clear rules, individual programmers could write their own players. Thanks to Trevor Blackwell, Paul Buchheit, Andy Hertzfeld, Jessica Livingston, and Peter Norvig for reading drafts of this.",
      "translated": "这也许并非不可能。如果有一个定义了游戏规则的软件框架，各个程序员就可以编写他们自己的玩家程序。感谢特雷弗·布莱克威尔、保罗·布赫海特、安迪·赫茨菲尔德、杰西卡·利文斯顿和彼得·诺维格审阅本文的草稿。"
    }
  ],
  "translation_completed": "2025-07-28T15:32:58.488139",
  "translation_stats": {
    "total_paragraphs": 47,
    "success_count": 47,
    "success_rate": "100.0%"
  }
}