{
  "title": "How to Make Pittsburgh a Startup Hub",
  "title_zh": "[待翻译] How to Make Pittsburgh a Startup Hub",
  "url": "https://www.paulgraham.com/pgh.html",
  "filename": "pgh.html",
  "date": "2016-04-01",
  "id": 114,
  "content": {
    "success": true,
    "paragraphs": [
      "April 2016(This is a talk I gave at an event called Opt412 in Pittsburgh. Much of it will apply to other towns. But not all, because as I say in the talk, Pittsburgh has some important advantages over most would-be startup hubs.)What would it take to make Pittsburgh into a startup hub, like Silicon Valley?",
      "I understand Pittsburgh pretty well, because I grew up here, in Monroeville. And I understand Silicon Valley pretty well because that's where I live now. Could you get that kind of startup ecosystem going here?When I agreed to speak here, I didn't think I'd be able to give a very optimistic talk.",
      "I thought I'd be talking about what Pittsburgh could do to become a startup hub, very much in the subjunctive. Instead I'm going to talk about what Pittsburgh can do.What changed my mind was an article I read in, of all places, the New York Times food section.",
      "The title was \"Pittsburgh's Youth-Driven Food Boom.\" To most people that might not even sound interesting, let alone something related to startups. But it was electrifying to me to read that title. I don't think I could pick a more promising one if I tried.",
      "And when I read the article I got even more excited. It said \"people ages 25 to 29 now make up 7.6 percent of all residents, up from 7 percent about a decade ago.\" Wow, I thought, Pittsburgh could be the next Portland.",
      "It could become the cool place all the people in their twenties want to go live.When I got here a couple days ago, I could feel the difference. I lived here from 1968 to 1984. I didn't realize it at the time, but during that whole period the city was in free fall.",
      "On top of the flight to the suburbs that happened everywhere, the steel and nuclear businesses were both dying. Boy are things different now. It's not just that downtown seems a lot more prosperous. There is an energy here that was not here when I was a kid.When I was a kid, this was a place young people left.",
      "Now it's a place that attracts them.What does that have to do with startups? Startups are made of people, and the average age of the people in a typical startup is right in that 25 to 29 bracket.I've seen how powerful it is for a city to have those people.",
      "Five years ago they shifted the center of gravity of Silicon Valley from the peninsula to San Francisco. Google and Facebook are on the peninsula, but the next generation of big winners are all in SF.",
      "The reason the center of gravity shifted was the talent war, for programmers especially. Most 25 to 29 year olds want to live in the city, not down in the boring suburbs. So whether they like it or not, founders know they have to be in the city.",
      "I know multiple founders who would have preferred to live down in the Valley proper, but who made themselves move to SF because they knew otherwise they'd lose the talent war.So being a magnet for people in their twenties is a very promising thing to be.",
      "It's hard to imagine a place becoming a startup hub without also being that. When I read that statistic about the increasing percentage of 25 to 29 year olds, I had exactly the same feeling of excitement I get when I see a startup's graphs start to creep upward off the x axis.Nationally the percentage of 25 to 29 year olds is 6.8%.",
      "That means you're .8% ahead. The population is 306,000, so we're talking about a surplus of about 2500 people. That's the population of a small town, and that's just the surplus. So you have a toehold.",
      "Now you just have to expand it.And though \"youth-driven food boom\" may sound frivolous, it is anything but. Restaurants and cafes are a big part of the personality of a city. Imagine walking down a street in Paris.",
      "What are you walking past? Little restaurants and cafes. Imagine driving through some depressing random exurb. What are you driving past? Starbucks and McDonalds and Pizza Hut. As Gertrude Stein said, there is no there there.",
      "You could be anywhere.These independent restaurants and cafes are not just feeding people. They're making there be a there here.So here is my first concrete recommendation for turning Pittsburgh into the next Silicon Valley: do everything you can to encourage this youth-driven food boom.",
      "What could the city do? Treat the people starting these little restaurants and cafes as your users, and go ask them what they want. I can guess at least one thing they might want: a fast permit process.",
      "San Francisco has left you a huge amount of room to beat them in that department.I know restaurants aren't the prime mover though. The prime mover, as the Times article said, is cheap housing. That's a big advantage.",
      "But that phrase \"cheap housing\" is a bit misleading. There are plenty of places that are cheaper. What's special about Pittsburgh is not that it's cheap, but that it's a cheap place you'd actually want to live.Part of that is the buildings themselves.",
      "I realized a long time ago, back when I was a poor twenty-something myself, that the best deals were places that had once been rich, and then became poor. If a place has always been rich, it's nice but too expensive.",
      "If a place has always been poor, it's cheap but grim. But if a place was once rich and then got poor, you can find palaces for cheap. And that's what's bringing people here. When Pittsburgh was rich, a hundred years ago, the people who lived here built big solid buildings.",
      "Not always in the best taste, but definitely solid. So here is another piece of advice for becoming a startup hub: don't destroy the buildings that are bringing people here. When cities are on the way back up, like Pittsburgh is now, developers race to tear down the old buildings.",
      "Don't let that happen. Focus on historic preservation. Big real estate development projects are not what's bringing the twenty-somethings here. They're the opposite of the new restaurants and cafes; they subtract personality from the city.The empirical evidence suggests you cannot be too strict about historic preservation.",
      "The tougher cities are about it, the better they seem to do.But the appeal of Pittsburgh is not just the buildings themselves. It's the neighborhoods they're in. Like San Francisco and New York, Pittsburgh is fortunate in being a pre-car city.",
      "It's not too spread out. Because those 25 to 29 year olds do not like driving. They prefer walking, or bicycling, or taking public transport. If you've been to San Francisco recently you can't help noticing the huge number of bicyclists.",
      "And this is not just a fad that the twenty-somethings have adopted. In this respect they have discovered a better way to live. The beards will go, but not the bikes. Cities where you can get around without driving are just better period.",
      "So I would suggest you do everything you can to capitalize on this. As with historic preservation, it seems impossible to go too far.Why not make Pittsburgh the most bicycle and pedestrian friendly city in the country?",
      "See if you can go so far that you make San Francisco seem backward by comparison. If you do, it's very unlikely you'll regret it. The city will seem like a paradise to the young people you want to attract.",
      "If they do leave to get jobs elsewhere, it will be with regret at leaving behind such a place. And what's the downside? Can you imagine a headline \"City ruined by becoming too bicycle-friendly?\" It just doesn't happen.So suppose cool old neighborhoods and cool little restaurants make this the next Portland.",
      "Will that be enough? It will put you in a way better position than Portland itself, because Pittsburgh has something Portland lacks: a first-rate research university. CMU plus little cafes means you have more than hipsters drinking lattes.",
      "It means you have hipsters drinking lattes while talking about distributed systems. Now you're getting really close to San Francisco.In fact you're better off than San Francisco in one way, because CMU is downtown, but Stanford and Berkeley are out in the suburbs.What can CMU do to help Pittsburgh become a startup hub?",
      "Be an even better research university. CMU is one of the best universities in the world, but imagine what things would be like if it were the very best, and everyone knew it. There are a lot of ambitious people who must go to the best place, wherever it is.",
      "If CMU were it, they would all come here. There would be kids in Kazakhstan dreaming of one day living in Pittsburgh.Being that kind of talent magnet is the most important contribution universities can make toward making their city a startup hub.",
      "In fact it is practically the only contribution they can make.But wait, shouldn't universities be setting up programs with words like \"innovation\" and \"entrepreneurship\" in their names? No, they should not.",
      "These kind of things almost always turn out to be disappointments. They're pursuing the wrong targets. The way to get innovation is not to aim for innovation but to aim for something more specific, like better batteries or better 3D printing.",
      "And the way to learn about entrepreneurship is to do it, which you can't in school.I know it may disappoint some administrators to hear that the best thing a university can do to encourage startups is to be a great university.",
      "It's like telling people who want to lose weight that the way to do it is to eat less.But if you want to know where startups come from, look at the empirical evidence. Look at the histories of the most successful startups, and you'll find they grow organically out of a couple of founders building something that starts as an interesting side project.",
      "Universities are great at bringing together founders, but beyond that the best thing they can do is get out of the way. For example, by not claiming ownership of \"intellectual property\" that students and faculty develop, and by having liberal rules about deferred admission and leaves of absence.In fact, one of the most effective things a university could do to encourage startups is an elaborate form of getting out of the way invented by Harvard.",
      "Harvard used to have exams for the fall semester after Christmas. At the beginning of January they had something called \"Reading Period\" when you were supposed to be studying for exams. And Microsoft and Facebook have something in common that few people realize: they were both started during Reading Period.",
      "It's the perfect situation for producing the sort of side projects that turn into startups. The students are all on campus, but they don't have to do anything because they're supposed to be studying for exams.Harvard may have closed this window, because a few years ago they moved exams before Christmas and shortened reading period from 11 days to 7.",
      "But if a university really wanted to help its students start startups, the empirical evidence, weighted by market cap, suggests the best thing they can do is literally nothing.The culture of Pittsburgh is another of its strengths.",
      "It seems like a city has to be socially liberal to be a startup hub, and it's pretty clear why. A city has to tolerate strangeness to be a home for startups, because startups are so strange. And you can't choose to allow just the forms of strangeness that will turn into big startups, because they're all intermingled.",
      "You have to tolerate all strangeness.That immediately rules out big chunks of the US. I'm optimistic it doesn't rule out Pittsburgh. One of the things I remember from growing up here, though I didn't realize at the time that there was anything unusual about it, is how well people got along.",
      "I'm still not sure why. Maybe one reason was that everyone felt like an immigrant. When I was a kid in Monroeville, people didn't call themselves American. They called themselves Italian or Serbian or Ukranian.",
      "Just imagine what it must have been like here a hundred years ago, when people were pouring in from twenty different countries. Tolerance was the only option.What I remember about the culture of Pittsburgh is that it was both tolerant and pragmatic.",
      "That's how I'd describe the culture of Silicon Valley too. And it's not a coincidence, because Pittsburgh was the Silicon Valley of its time. This was a city where people built new things. And while the things people build have changed, the spirit you need to do that kind of work is the same.So although an influx of latte-swilling hipsters may be annoying in some ways, I would go out of my way to encourage them.",
      "And more generally to tolerate strangeness, even unto the degree wacko Californians do. For Pittsburgh that is a conservative choice: it's a return to the city's roots.Unfortunately I saved the toughest part for last.",
      "There is one more thing you need to be a startup hub, and Pittsburgh hasn't got it: investors. Silicon Valley has a big investor community because it's had 50 years to grow one. New York has a big investor community because it's full of people who like money a lot and are quick to notice new ways to get it.",
      "But Pittsburgh has neither of these. And the cheap housing that draws other people here has no effect on investors.If an investor community grows up here, it will happen the same way it did in Silicon Valley: slowly and organically.",
      "So I would not bet on having a big investor community in the short term. But fortunately there are three trends that make that less necessary than it used to be. One is that startups are increasingly cheap to start, so you just don't need as much outside money as you used to.",
      "The second is that thanks to things like Kickstarter, a startup can get to revenue faster. You can put something on Kickstarter from anywhere. The third is programs like Y Combinator. A startup from anywhere in the world can go to YC for 3 months, pick up funding, and then return home if they want.My advice is to make Pittsburgh a great place for startups, and gradually more of them will stick.",
      "Some of those will succeed; some of their founders will become investors; and still more startups will stick.This is not a fast path to becoming a startup hub. But it is at least a path, which is something few other cities have.",
      "And it's not as if you have to make painful sacrifices in the meantime. Think about what I've suggested you should do. Encourage local restaurants, save old buildings, take advantage of density, make CMU the best, promote tolerance.",
      "These are the things that make Pittsburgh good to live in now. All I'm saying is that you should do even more of them.And that's an encouraging thought. If Pittsburgh's path to becoming a startup hub is to be even more itself, then it has a good chance of succeeding.",
      "In fact it probably has the best chance of any city its size. It will take some effort, and a lot of time, but if any city can do it, Pittsburgh can.Thanks to Charlie Cheever and Jessica Livingston for reading drafts of this, and to Meg Cheever for organizing Opt412 and inviting me to speak."
    ],
    "word_count": 2599,
    "paragraph_count": 55
  },
  "processed_at": "2025-07-26T19:05:05.848955",
  "paragraphs": [
    {
      "original": "April 2016(This is a talk I gave at an event called Opt412 in Pittsburgh. Much of it will apply to other towns. But not all, because as I say in the talk, Pittsburgh has some important advantages over most would-be startup hubs.)What would it take to make Pittsburgh into a startup hub, like Silicon Valley?",
      "translated": "2016年4月（这是我在匹兹堡一个名为Opt412的活动上发表的演讲。其中很多内容适用于其他城市。但并非全部，因为正如我在演讲中所说，匹兹堡相对于大多数希望成为创业中心的城市具有一些重要的优势。）要将匹兹堡变成像硅谷那样的创业中心，需要做些什么？"
    },
    {
      "original": "I understand Pittsburgh pretty well, because I grew up here, in Monroeville. And I understand Silicon Valley pretty well because that's where I live now. Could you get that kind of startup ecosystem going here?When I agreed to speak here, I didn't think I'd be able to give a very optimistic talk.",
      "translated": "我非常了解匹兹堡，因为我在这里的门罗维尔长大。我也很了解硅谷，因为那里是我现在居住的地方。这里能否建立起那样的创业生态系统呢？当同意在这里发言时，我并不认为自己能够给出一个非常乐观的演讲。"
    },
    {
      "original": "I thought I'd be talking about what Pittsburgh could do to become a startup hub, very much in the subjunctive. Instead I'm going to talk about what Pittsburgh can do.What changed my mind was an article I read in, of all places, the New York Times food section.",
      "translated": "我以为我会谈论匹兹堡如何成为一个创业中心，用很多假设性的语气。然而，我将要谈论的是匹兹堡可以做些什么。改变我想法的是一篇我在《纽约时报》美食版看到的文章。"
    },
    {
      "original": "The title was \"Pittsburgh's Youth-Driven Food Boom.\" To most people that might not even sound interesting, let alone something related to startups. But it was electrifying to me to read that title. I don't think I could pick a more promising one if I tried.",
      "translated": "标题是“匹兹堡青年引领的食品繁荣”。对大多数人来说，这可能听起来甚至不太有趣，更不用说与创业有关了。但读到这个标题时，我感到非常振奋。即使我刻意去选，也未必能挑出一个更有前景的。"
    },
    {
      "original": "And when I read the article I got even more excited. It said \"people ages 25 to 29 now make up 7.6 percent of all residents, up from 7 percent about a decade ago.\" Wow, I thought, Pittsburgh could be the next Portland.",
      "translated": "当我读到这篇文章时，我更加兴奋了。文章中提到：“25至29岁的居民现在占总人口的7.6%，比十年前的7%有所增加。”哇，我想，匹兹堡可能会成为下一个波特兰。"
    },
    {
      "original": "It could become the cool place all the people in their twenties want to go live.When I got here a couple days ago, I could feel the difference. I lived here from 1968 to 1984. I didn't realize it at the time, but during that whole period the city was in free fall.",
      "translated": "它有可能成为所有二十多岁的人都想来居住的酷炫之地。几天前我来到这里时，能感觉到这里的不同。我从1968年到1984年住在这里。当时并没有意识到，但整个期间这座城市一直在走下坡路。"
    },
    {
      "original": "On top of the flight to the suburbs that happened everywhere, the steel and nuclear businesses were both dying. Boy are things different now. It's not just that downtown seems a lot more prosperous. There is an energy here that was not here when I was a kid.When I was a kid, this was a place young people left.",
      "translated": "除了郊区化浪潮无处不在之外，钢铁和核能行业也都走向衰落。现在情况可大不一样了。不仅市中心显得更加繁荣，这里还有一种在我小时候未曾有过的活力。在我小时候，这里是一个年轻人离开的地方。"
    },
    {
      "original": "Now it's a place that attracts them.What does that have to do with startups? Startups are made of people, and the average age of the people in a typical startup is right in that 25 to 29 bracket.I've seen how powerful it is for a city to have those people.",
      "translated": "现在这个地方吸引他们。这与初创企业有什么关系？初创企业是由人组成的，而典型初创企业的平均年龄正好在25到29岁之间。我见证了拥有这些人的城市有多么强大。"
    },
    {
      "original": "Five years ago they shifted the center of gravity of Silicon Valley from the peninsula to San Francisco. Google and Facebook are on the peninsula, but the next generation of big winners are all in SF.",
      "translated": "五年前，他们将硅谷的重心从半岛转移到了旧金山。谷歌和脸书位于半岛，但下一代的大赢家都在旧金山。"
    },
    {
      "original": "The reason the center of gravity shifted was the talent war, for programmers especially. Most 25 to 29 year olds want to live in the city, not down in the boring suburbs. So whether they like it or not, founders know they have to be in the city.",
      "translated": "重心转移的原因是人才争夺战，特别是对程序员而言。大多数25到29岁的年轻人希望住在城市，而不是无聊的郊区。因此，无论他们是否愿意，创始人们都知道必须在城市里。"
    },
    {
      "original": "I know multiple founders who would have preferred to live down in the Valley proper, but who made themselves move to SF because they knew otherwise they'd lose the talent war.So being a magnet for people in their twenties is a very promising thing to be.",
      "translated": "我知道多位创始人本来更愿意住在硅谷的核心区域，但为了不输掉人才争夺战，他们还是选择了搬到旧金山。所以，能够吸引二十多岁的年轻人是一个非常有潜力的优势。"
    },
    {
      "original": "It's hard to imagine a place becoming a startup hub without also being that. When I read that statistic about the increasing percentage of 25 to 29 year olds, I had exactly the same feeling of excitement I get when I see a startup's graphs start to creep upward off the x axis.Nationally the percentage of 25 to 29 year olds is 6.8%.",
      "translated": "很难想象一个地方在不具备这些条件的情况下成为创业中心。当我看到关于25到29岁人口比例上升的统计数据时，我感到的兴奋就像看到一家创业公司的图表开始从x轴上缓慢上升一样。全国范围内，25到29岁人口的比例为6.8%。"
    },
    {
      "original": "That means you're .8% ahead. The population is 306,000, so we're talking about a surplus of about 2500 people. That's the population of a small town, and that's just the surplus. So you have a toehold.",
      "translated": "这意味着你领先了0.8%。人口总数是306,000，所以这里说的是大约2500人的优势。这相当于一个小城镇的人口，而这仅仅是优势部分。所以你已经站稳了脚跟。"
    },
    {
      "original": "Now you just have to expand it.And though \"youth-driven food boom\" may sound frivolous, it is anything but. Restaurants and cafes are a big part of the personality of a city. Imagine walking down a street in Paris.",
      "translated": "现在你只需要将其扩展。虽然“由年轻人推动的食品热潮”听起来可能有些轻浮，但实际上绝非如此。餐馆和咖啡馆是城市性格的重要组成部分。想象一下走在巴黎的街头。"
    },
    {
      "original": "What are you walking past? Little restaurants and cafes. Imagine driving through some depressing random exurb. What are you driving past? Starbucks and McDonalds and Pizza Hut. As Gertrude Stein said, there is no there there.",
      "translated": "你正在走过什么？小餐馆和咖啡馆。想象一下，你开车穿过某个令人沮丧的郊外地区。你正在经过什么？星巴克、麦当劳和必胜客。正如格特鲁德·斯坦所说，那里什么都没有。"
    },
    {
      "original": "You could be anywhere.These independent restaurants and cafes are not just feeding people. They're making there be a there here.So here is my first concrete recommendation for turning Pittsburgh into the next Silicon Valley: do everything you can to encourage this youth-driven food boom.",
      "translated": "你可能身处任何地方。这些独立的餐馆和咖啡馆不仅仅是在为人们提供食物，它们还在为这里注入灵魂。因此，这是我第一条具体的建议，将匹兹堡打造成下一个硅谷：尽一切可能鼓励这场由年轻人推动的美食繁荣。"
    },
    {
      "original": "What could the city do? Treat the people starting these little restaurants and cafes as your users, and go ask them what they want. I can guess at least one thing they might want: a fast permit process.",
      "translated": "城市可以做些什么？把开设这些小餐馆和咖啡馆的人当作你的用户，去问他们想要什么。我可以猜到他们可能至少会想要一件事：一个快速的许可流程。"
    },
    {
      "original": "San Francisco has left you a huge amount of room to beat them in that department.I know restaurants aren't the prime mover though. The prime mover, as the Times article said, is cheap housing. That's a big advantage.",
      "translated": "旧金山在这一方面给了你很大的超越空间。我知道餐馆并不是主要驱动力，但正如《纽约时报》的文章所说，主要驱动力是廉价住房。这是一个很大的优势。"
    },
    {
      "original": "But that phrase \"cheap housing\" is a bit misleading. There are plenty of places that are cheaper. What's special about Pittsburgh is not that it's cheap, but that it's a cheap place you'd actually want to live.Part of that is the buildings themselves.",
      "translated": "但“廉价住房”这个说法有点误导人。有很多地方的房价更便宜。匹兹堡的特别之处不在于它便宜，而在于它是一个你真正愿意居住的便宜地方。这一点部分体现在建筑本身。"
    },
    {
      "original": "I realized a long time ago, back when I was a poor twenty-something myself, that the best deals were places that had once been rich, and then became poor. If a place has always been rich, it's nice but too expensive.",
      "translated": "我很久以前就意识到，当我还是一个贫穷的二十多岁年轻人时，最好的交易是在那些曾经富裕而后变穷的地方。如果一个地方一直都很富裕，虽然很好，但价格太贵。"
    },
    {
      "original": "If a place has always been poor, it's cheap but grim. But if a place was once rich and then got poor, you can find palaces for cheap. And that's what's bringing people here. When Pittsburgh was rich, a hundred years ago, the people who lived here built big solid buildings.",
      "translated": "如果一个地方一直都很贫穷，那么它虽然便宜但显得阴郁。但如果一个地方曾经富裕后来变穷了，你就可以用便宜的价格买到宫殿。这正是吸引人们来这里的原因。当匹兹堡在一百年前富裕时，住在这里的人们建造了大量坚固的大楼。"
    },
    {
      "original": "Not always in the best taste, but definitely solid. So here is another piece of advice for becoming a startup hub: don't destroy the buildings that are bringing people here. When cities are on the way back up, like Pittsburgh is now, developers race to tear down the old buildings.",
      "translated": "虽然不总是最上乘，但确实很坚实。所以这里有一条关于如何成为创业中心的建议：不要拆除那些吸引人们前来的大楼。当城市开始复兴，比如现在的匹兹堡，开发商就会竞相拆除旧建筑。"
    },
    {
      "original": "Don't let that happen. Focus on historic preservation. Big real estate development projects are not what's bringing the twenty-somethings here. They're the opposite of the new restaurants and cafes; they subtract personality from the city.The empirical evidence suggests you cannot be too strict about historic preservation.",
      "translated": "不要让这种情况发生。关注历史保护。大型房地产开发项目并不是吸引那些二十多岁年轻人的原因。它们与新餐厅和咖啡馆相反；它们使城市失去特色。实证证据表明，你对历史保护的要求不可能过于严格。"
    },
    {
      "original": "The tougher cities are about it, the better they seem to do.But the appeal of Pittsburgh is not just the buildings themselves. It's the neighborhoods they're in. Like San Francisco and New York, Pittsburgh is fortunate in being a pre-car city.",
      "translated": "城市对待这个问题越严肃，似乎表现得就越好。但匹兹堡的吸引力不仅仅在于那些建筑本身，还在于这些建筑所在的社区。和旧金山、纽约一样，匹兹堡幸运地成为了一个汽车时代之前的都市。"
    },
    {
      "original": "It's not too spread out. Because those 25 to 29 year olds do not like driving. They prefer walking, or bicycling, or taking public transport. If you've been to San Francisco recently you can't help noticing the huge number of bicyclists.",
      "translated": "它并不太分散。因为那些25到29岁的人不喜欢开车。他们更喜欢步行、骑自行车或乘坐公共交通。如果你最近去过旧金山，你一定会注意到骑自行车的人非常多。"
    },
    {
      "original": "And this is not just a fad that the twenty-somethings have adopted. In this respect they have discovered a better way to live. The beards will go, but not the bikes. Cities where you can get around without driving are just better period.",
      "translated": "这不仅是一种二十几岁年轻人所接受的时尚。在这方面，他们发现了一种更好的生活方式。胡须可能会消失，但自行车不会。无需开车就能四处走动的城市，总体来说就是更好。"
    },
    {
      "original": "So I would suggest you do everything you can to capitalize on this. As with historic preservation, it seems impossible to go too far.Why not make Pittsburgh the most bicycle and pedestrian friendly city in the country?",
      "translated": "所以我建议你尽一切可能充分利用这一点。就像历史保护一样，似乎做得再多也不为过。为什么不把匹兹堡打造成全国最友好的自行车和行人城市呢？"
    },
    {
      "original": "See if you can go so far that you make San Francisco seem backward by comparison. If you do, it's very unlikely you'll regret it. The city will seem like a paradise to the young people you want to attract.",
      "translated": "看看你能否做到让旧金山相比之下显得落后。如果你做到了，你很可能不会后悔。这座城市对于你想要吸引的年轻人们来说，将会像是一个天堂。"
    },
    {
      "original": "If they do leave to get jobs elsewhere, it will be with regret at leaving behind such a place. And what's the downside? Can you imagine a headline \"City ruined by becoming too bicycle-friendly?\" It just doesn't happen.So suppose cool old neighborhoods and cool little restaurants make this the next Portland.",
      "translated": "如果他们真的离开去其他地方工作，也会因为离开这样一个地方而感到遗憾。那有什么负面影响呢？你能想象到这样的头条吗：“城市因过于自行车友好而毁了？”这种事情是不会发生的。所以假设那些酷炫的老街区和小餐馆让这里成为下一个波特兰。"
    },
    {
      "original": "Will that be enough? It will put you in a way better position than Portland itself, because Pittsburgh has something Portland lacks: a first-rate research university. CMU plus little cafes means you have more than hipsters drinking lattes.",
      "translated": "这足够了吗？这会让你的处境比波特兰好得多，因为匹兹堡拥有波特兰所缺乏的东西：一所一流的研究型大学。卡内基梅隆大学加上小咖啡馆意味着你拥有的不仅仅是喝拿铁的文艺青年。"
    },
    {
      "original": "It means you have hipsters drinking lattes while talking about distributed systems. Now you're getting really close to San Francisco.In fact you're better off than San Francisco in one way, because CMU is downtown, but Stanford and Berkeley are out in the suburbs.What can CMU do to help Pittsburgh become a startup hub?",
      "translated": "这意味着你有那些文艺青年一边喝拿铁一边谈论分布式系统。现在你离旧金山真的不远了。事实上，你在某一方面比旧金山更有优势，因为卡内基梅隆大学位于市中心，而斯坦福和伯克利则位于郊区。卡内基梅隆大学能做些什么来帮助匹兹堡成为一个创业中心？"
    },
    {
      "original": "Be an even better research university. CMU is one of the best universities in the world, but imagine what things would be like if it were the very best, and everyone knew it. There are a lot of ambitious people who must go to the best place, wherever it is.",
      "translated": "成为更优秀的研究型大学。卡内基梅隆大学是世界上最好的大学之一，但想象一下，如果它成为绝对顶尖的大学，而且所有人都知道这一点，会是怎样一番景象。有很多有志之士都会选择前往最佳之地，无论它在哪里。"
    },
    {
      "original": "If CMU were it, they would all come here. There would be kids in Kazakhstan dreaming of one day living in Pittsburgh.Being that kind of talent magnet is the most important contribution universities can make toward making their city a startup hub.",
      "translated": "如果卡内基梅隆大学是这样的存在，所有人都会来这里。在哈萨克斯坦的孩子们也会梦想有一天能生活在匹兹堡。成为这样的人才磁石是大学为将城市打造成创业中心所能做出的最重要贡献。"
    },
    {
      "original": "In fact it is practically the only contribution they can make.But wait, shouldn't universities be setting up programs with words like \"innovation\" and \"entrepreneurship\" in their names? No, they should not.",
      "translated": "事实上，这几乎是他们唯一能做出的贡献。但是等一下，大学难道不应该设立一些名称中带有“创新”和“创业”字样的项目吗？不，他们不应该。"
    },
    {
      "original": "These kind of things almost always turn out to be disappointments. They're pursuing the wrong targets. The way to get innovation is not to aim for innovation but to aim for something more specific, like better batteries or better 3D printing.",
      "translated": "这类事情几乎总是以失望告终。他们追求的是错误的目标。获得创新的方法不是直接瞄准创新，而是要瞄准更具体的目标，比如更好的电池或更好的3D打印技术。"
    },
    {
      "original": "And the way to learn about entrepreneurship is to do it, which you can't in school.I know it may disappoint some administrators to hear that the best thing a university can do to encourage startups is to be a great university.",
      "translated": "了解创业的途径是去实践，而这是在学校里无法做到的。我知道这可能会让一些管理者感到失望，但最好的大学能为鼓励创业所做的就是成为一所优秀的大学。"
    },
    {
      "original": "It's like telling people who want to lose weight that the way to do it is to eat less.But if you want to know where startups come from, look at the empirical evidence. Look at the histories of the most successful startups, and you'll find they grow organically out of a couple of founders building something that starts as an interesting side project.",
      "translated": "这就像是告诉那些想要减肥的人，方法是少吃。但如果你想了解创业公司的来源，就要看看实证证据。看看最成功的创业公司的历史，你会发现它们都是从几位创始人着手一个有趣的副业项目开始，然后自然而然地发展壮大的。"
    },
    {
      "original": "Universities are great at bringing together founders, but beyond that the best thing they can do is get out of the way. For example, by not claiming ownership of \"intellectual property\" that students and faculty develop, and by having liberal rules about deferred admission and leaves of absence.In fact, one of the most effective things a university could do to encourage startups is an elaborate form of getting out of the way invented by Harvard.",
      "translated": "大学擅长将创始人聚集在一起，但除此之外，它们能做的最好的事情就是不要妨碍他们。例如，大学不应声称拥有学生和教职员工开发的“知识产权”，并且应有关于延期入学和休学的宽松规定。实际上，大学为了鼓励创业能做的最有效的事情之一，就是哈佛大学发明的一种复杂的放手形式。"
    },
    {
      "original": "Harvard used to have exams for the fall semester after Christmas. At the beginning of January they had something called \"Reading Period\" when you were supposed to be studying for exams. And Microsoft and Facebook have something in common that few people realize: they were both started during Reading Period.",
      "translated": "哈佛大学过去常常在圣诞节后为秋季学期举行考试。一月初，他们有一个被称为“阅读周”的时期，学生应该在这段时间里为考试做准备。而微软和Facebook有一个鲜为人知的共同点：它们都是在阅读周期间创立的。"
    },
    {
      "original": "It's the perfect situation for producing the sort of side projects that turn into startups. The students are all on campus, but they don't have to do anything because they're supposed to be studying for exams.Harvard may have closed this window, because a few years ago they moved exams before Christmas and shortened reading period from 11 days to 7.",
      "translated": "这是产生那些可能发展成初创企业的副业项目的完美环境。学生们都在校园里，但他们不必做任何事情，因为他们本应为考试而学习。哈佛可能已经关闭了这个窗口，因为几年前他们将考试时间安排在圣诞节前，并将复习期从11天缩短到7天。"
    },
    {
      "original": "But if a university really wanted to help its students start startups, the empirical evidence, weighted by market cap, suggests the best thing they can do is literally nothing.The culture of Pittsburgh is another of its strengths.",
      "translated": "但如果一所大学真的想帮助学生创业，根据市场价值加权的实证证据表明，他们能做的最好的事情就是什么都不做。匹兹堡的文化是其另一大优势。"
    },
    {
      "original": "It seems like a city has to be socially liberal to be a startup hub, and it's pretty clear why. A city has to tolerate strangeness to be a home for startups, because startups are so strange. And you can't choose to allow just the forms of strangeness that will turn into big startups, because they're all intermingled.",
      "translated": "一个城市似乎必须在社会上具有自由开放的态度，才能成为创业中心，这背后的原因相当明显。一个城市必须能够容忍异类，才能成为初创企业的沃土，因为初创企业本身就很另类。你无法只选择那些可能会发展成大企业的另类形式，因为这些另类是相互交织在一起的。"
    },
    {
      "original": "You have to tolerate all strangeness.That immediately rules out big chunks of the US. I'm optimistic it doesn't rule out Pittsburgh. One of the things I remember from growing up here, though I didn't realize at the time that there was anything unusual about it, is how well people got along.",
      "translated": "你必须容忍所有的古怪行为。这立刻排除了美国的大部分地区。我乐观地认为这并不排除匹兹堡。虽然我当时并没有意识到有什么不寻常，但我记得在这里长大时，人们相处得非常好。"
    },
    {
      "original": "I'm still not sure why. Maybe one reason was that everyone felt like an immigrant. When I was a kid in Monroeville, people didn't call themselves American. They called themselves Italian or Serbian or Ukranian.",
      "translated": "我仍然不确定原因。也许其中一个原因是每个人都觉得自己像移民。我小时候在门罗维尔，人们并不称自己为美国人。他们称自己为意大利人、塞尔维亚人或乌克兰人。"
    },
    {
      "original": "Just imagine what it must have been like here a hundred years ago, when people were pouring in from twenty different countries. Tolerance was the only option.What I remember about the culture of Pittsburgh is that it was both tolerant and pragmatic.",
      "translated": "想象一下一百年前这里的情景，当时人们从二十多个国家蜂拥而至。宽容是唯一的选择。关于匹兹堡的文化，我记忆中最深刻的是它的宽容与务实。"
    },
    {
      "original": "That's how I'd describe the culture of Silicon Valley too. And it's not a coincidence, because Pittsburgh was the Silicon Valley of its time. This was a city where people built new things. And while the things people build have changed, the spirit you need to do that kind of work is the same.So although an influx of latte-swilling hipsters may be annoying in some ways, I would go out of my way to encourage them.",
      "translated": "我也会这样描述硅谷的文化。这并非巧合，因为匹兹堡曾经是那个时代的硅谷。这是一个人们建造新事物的城市。尽管人们建造的事物已经改变，但从事这类工作所需的精神是一样的。所以，尽管涌入的拿铁咖啡爱好者和潮人可能在某些方面令人烦躁，我仍会竭尽全力鼓励他们。"
    },
    {
      "original": "And more generally to tolerate strangeness, even unto the degree wacko Californians do. For Pittsburgh that is a conservative choice: it's a return to the city's roots.Unfortunately I saved the toughest part for last.",
      "translated": "更广泛地说，就是要容忍怪异，甚至达到加州人那种程度。对于匹兹堡来说，这是一个保守的选择：它是一种回归城市根源的做法。不幸的是，我把最难的部分留到了最后。"
    },
    {
      "original": "There is one more thing you need to be a startup hub, and Pittsburgh hasn't got it: investors. Silicon Valley has a big investor community because it's had 50 years to grow one. New York has a big investor community because it's full of people who like money a lot and are quick to notice new ways to get it.",
      "translated": "成为一个创业中心，还需要一个条件，而匹兹堡尚未具备：投资者。硅谷拥有庞大的投资者群体，因为它用了50年的时间来培养。纽约也有庞大的投资者群体，因为它聚集了大量对金钱非常热衷且善于发现新的赚钱途径的人。"
    },
    {
      "original": "But Pittsburgh has neither of these. And the cheap housing that draws other people here has no effect on investors.If an investor community grows up here, it will happen the same way it did in Silicon Valley: slowly and organically.",
      "translated": "但匹兹堡没有这些优势。而且，这里吸引其他人的廉价住房对投资者没有影响。如果这里能形成投资者社区，那也将像硅谷那样：缓慢而自然地发展。"
    },
    {
      "original": "So I would not bet on having a big investor community in the short term. But fortunately there are three trends that make that less necessary than it used to be. One is that startups are increasingly cheap to start, so you just don't need as much outside money as you used to.",
      "translated": "因此，我不认为短期内会有一个庞大的投资者社群。但幸运的是，有三个趋势使得这一点比过去不那么必要了。一是创业公司的启动成本越来越低，所以你不需要像以前那样多的外部资金。"
    },
    {
      "original": "The second is that thanks to things like Kickstarter, a startup can get to revenue faster. You can put something on Kickstarter from anywhere. The third is programs like Y Combinator. A startup from anywhere in the world can go to YC for 3 months, pick up funding, and then return home if they want.My advice is to make Pittsburgh a great place for startups, and gradually more of them will stick.",
      "translated": "第二，得益于像Kickstarter这样的平台，初创公司可以更快地获得收入。你可以在任何地方将项目放到Kickstarter上。第三，像Y Combinator这样的项目。来自世界各地的初创公司可以到YC进行为期3个月的培训，获得资金支持，然后如果他们愿意，可以回到自己的家乡。我的建议是让匹兹堡成为一个适合初创公司的好地方，这样逐渐会有更多的公司留下来。"
    },
    {
      "original": "Some of those will succeed; some of their founders will become investors; and still more startups will stick.This is not a fast path to becoming a startup hub. But it is at least a path, which is something few other cities have.",
      "translated": "其中一些将会成功；一些创始人会成为投资者；更多的初创企业将会生存下来。这并不是成为创业中心的快速途径。但至少是一条途径，而这是其他大多数城市所不具备的。"
    },
    {
      "original": "And it's not as if you have to make painful sacrifices in the meantime. Think about what I've suggested you should do. Encourage local restaurants, save old buildings, take advantage of density, make CMU the best, promote tolerance.",
      "translated": "并且你不必在此期间做出痛苦的牺牲。想想我建议你做的事情。鼓励当地餐馆，保护旧建筑，利用高密度，让卡内基梅隆大学成为最好的，促进宽容。"
    },
    {
      "original": "These are the things that make Pittsburgh good to live in now. All I'm saying is that you should do even more of them.And that's an encouraging thought. If Pittsburgh's path to becoming a startup hub is to be even more itself, then it has a good chance of succeeding.",
      "translated": "这些是让匹兹堡现在成为宜居城市的原因。我只是在说你应该做得更多。这是一个令人鼓舞的想法。如果匹兹堡成为创业中心的路径是更加坚持自己的特色，那么它就有很大的成功机会。"
    },
    {
      "original": "In fact it probably has the best chance of any city its size. It will take some effort, and a lot of time, but if any city can do it, Pittsburgh can.Thanks to Charlie Cheever and Jessica Livingston for reading drafts of this, and to Meg Cheever for organizing Opt412 and inviting me to speak.",
      "translated": "事实上，它可能在同规模的城市中拥有最好的机会。这将需要一些努力，以及大量的时间，但如果有一座城市能够做到，那一定是匹兹堡。感谢 Charlie Cheever 和 Jessica Livingston 阅读本文的草稿，感谢 Meg Cheever 组织了 Opt412 并邀请我演讲。"
    }
  ],
  "translation_completed": "2025-07-28T15:47:41.878075",
  "translation_stats": {
    "total_paragraphs": 55,
    "success_count": 55,
    "success_rate": "100.0%"
  }
}