{
  "title": "The Fatal Pinch",
  "title_zh": "[待翻译] The Fatal Pinch",
  "url": "https://www.paulgraham.com/pinch.html",
  "filename": "pinch.html",
  "date": "2021-03-11",
  "id": 38,
  "content": {
    "success": true,
    "paragraphs": [
      "December 2014Many startups go through a point a few months before they die where although they have a significant amount of money in the bank, they're also losing a lot each month, and revenue growth is either nonexistent or mediocre.",
      "The company has, say, 6 months of runway. Or to put it more brutally, 6 months before they're out of business. They expect to avoid that by raising more from investors. [1]That last sentence is the fatal one.There may be nothing founders are so prone to delude themselves about as how interested investors will be in giving them additional funding.",
      "It's hard to convince investors the first time too, but founders expect that. What bites them the second time is a confluence of three forces: The company is spending more now than it did the first time it raised money.",
      "Investors have much higher standards for companies that have already raised money. The company is now starting to read as a failure. The first time it raised money, it was neither a success nor a failure; it was too early to ask.",
      "Now it's possible to ask that question, and the default answer is failure, because at this point that is the default outcome. I'm going to call the situation I described in the first paragraph \"the fatal pinch.\" I try to resist coining phrases, but making up a name for this situation may snap founders into realizing when they're in it.One of the things that makes the fatal pinch so dangerous is that it's self-reinforcing.",
      "Founders overestimate their chances of raising more money, and so are slack about reaching profitability, which further decreases their chances of raising money.Now that you know about the fatal pinch, how do you avoid it?",
      "Y Combinator tells founders who raise money to act as if it's the last they'll ever get. Because the self-reinforcing nature of this situation works the other way too: the less you need further investment, the easier it is to get.What do you do if you're already in the fatal pinch?",
      "The first step is to re-evaluate the probability of raising more money. I will now, by an amazing feat of clairvoyance, do this for you: the probability is zero. [2]Three options remain: you can shut down the company, you can increase how much you make, and you can decrease how much you spend.You should shut down the company if you're certain it will fail no matter what you do.",
      "Then at least you can give back the money you have left, and save yourself however many months you would have spent riding it down.Companies rarely have to fail though. What I'm really doing here is giving you the option of admitting you've already given up.If you don't want to shut down the company, that leaves increasing revenues and decreasing expenses.",
      "In most startups, expenses = people, and decreasing expenses = firing people. [3] Deciding to fire people is usually hard, but there's one case in which it shouldn't be: when there are people you already know you should fire but you're in denial about it.",
      "If so, now's the time.If that makes you profitable, or will enable you to make it to profitability on the money you have left, you've avoided the immediate danger.Otherwise you have three options: you either have to fire good people, get some or all of the employees to take less salary for a while, or increase revenues.Getting people to take less salary is a weak solution that will only work when the problem isn't too bad.",
      "If your current trajectory won't quite get you to profitability but you can get over the threshold by cutting salaries a little, you might be able to make the case to everyone for doing it. Otherwise you're probably just postponing the problem, and that will be obvious to the people whose salaries you're proposing to cut.",
      "[4]Which leaves two options, firing good people and making more money. While trying to balance them, keep in mind the eventual goal: to be a successful product company in the sense of having a single thing lots of people use.You should lean more toward firing people if the source of your trouble is overhiring.",
      "If you went out and hired 15 people before you even knew what you were building, you've created a broken company. You need to figure out what you're building, and it will probably be easier to do that with a handful of people than 15.",
      "Plus those 15 people might not even be the ones you need for whatever you end up building. So the solution may be to shrink and then figure out what direction to grow in. After all, you're not doing those 15 people any favors if you fly the company into ground with them aboard.",
      "They'll all lose their jobs eventually, along with all the time they expended on this doomed company.Whereas if you only have a handful of people, it may be better to focus on trying to make more money.",
      "It may seem facile to suggest a startup make more money, as if that could be done for the asking. Usually a startup is already trying as hard as it can to sell whatever it sells. What I'm suggesting here is not so much to try harder to make money but to try to make money in a different way.",
      "For example, if you have only one person selling while the rest are writing code, consider having everyone work on selling. What good will more code do you when you're out of business? If you have to write code to close a certain deal, go ahead; that follows from everyone working on selling.",
      "But only work on whatever will get you the most revenue the soonest.Another way to make money differently is to sell different things, and in particular to do more consultingish work. I say consultingish because there is a long slippery slope from making products to pure consulting, and you don't have to go far down it before you start to offer something really attractive to customers.",
      "Although your product may not be very appealing yet, if you're a startup your programmers will often be way better than the ones your customers have. Or you may have expertise in some new field they don't understand.",
      "So if you change your sales conversations just a little from \"do you want to buy our product?\" to \"what do you need that you'd pay a lot for?\" you may find it's suddenly a lot easier to extract money from customers.Be ruthlessly mercenary when you start doing this, though.",
      "You're trying to save your company from death here, so make customers pay a lot, quickly. And to the extent you can, try to avoid the worst pitfalls of consulting. The ideal thing might be if you built a precisely defined derivative version of your product for the customer, and it was otherwise a straight product sale.",
      "You keep the IP and no billing by the hour.In the best case, this consultingish work may not be just something you do to survive, but may turn out to be the thing-that-doesn't-scale that defines your company.",
      "Don't expect it to be, but as you dive into individual users' needs, keep your eyes open for narrow openings that have wide vistas beyond.There is usually so much demand for custom work that unless you're really incompetent there has to be some point down the slope of consulting at which you can survive.",
      "But I didn't use the term slippery slope by accident; customers' insatiable demand for custom work will always be pushing you toward the bottom. So while you'll probably survive, the problem now becomes to survive with the least damage and distraction.The good news is, plenty of successful startups have passed through near-death experiences and gone on to flourish.",
      "You just have to realize in time that you're near death. And if you're in the fatal pinch, you are. Notes[1] There are a handful of companies that can't reasonably expect to make money for the first year or two, because what they're building takes so long.",
      "For these companies substitute \"progress\" for \"revenue growth.\" You're not one of these companies unless your initial investors agreed in advance that you were. And frankly even these companies wish they weren't, because the illiquidity of \"progress\" puts them at the mercy of investors.[2] There's a variant of the fatal pinch where your existing investors help you along by promising to invest more.",
      "Or rather, where you read them as promising to invest more, while they think they're just mentioning the possibility. The way to solve this problem, if you have 8 months of runway or less, is to try to get the money right now.",
      "Then you'll either get the money, in which case (immediate) problem solved, or at least prevent your investors from helping you to remain in denial about your fundraising prospects.[3] Obviously, if you have significant expenses other than salaries that you can eliminate, do it now.[4] Unless of course the source of the problem is that you're paying yourselves high salaries.",
      "If by cutting the founders' salaries to the minimum you need, you can make it to profitability, you should. But it's a bad sign if you needed to read this to realize that. Thanks to Sam Altman, Paul Buchheit, Jessica Livingston, and Geoff Ralston for reading drafts of this.Arabic Translation"
    ],
    "word_count": 1575,
    "paragraph_count": 30
  },
  "processed_at": "2025-07-26T19:02:37.012986",
  "paragraphs": [
    {
      "original": "December 2014Many startups go through a point a few months before they die where although they have a significant amount of money in the bank, they're also losing a lot each month, and revenue growth is either nonexistent or mediocre.",
      "translated": "2014年12月 许多初创公司在接近倒闭的几个月前，尽管银行里还有相当数量的资金，但每个月的亏损也很严重，收入增长要么不存在，要么平平。"
    },
    {
      "original": "The company has, say, 6 months of runway. Or to put it more brutally, 6 months before they're out of business. They expect to avoid that by raising more from investors. [1]That last sentence is the fatal one.There may be nothing founders are so prone to delude themselves about as how interested investors will be in giving them additional funding.",
      "translated": "这家公司有，比如说，6个月的缓冲期。或者说得更直接些，6个月后他们将无法继续经营。他们希望通过从投资者那里筹集更多资金来避免这种情况。[1]最后一句话是致命的。创始人可能在这一点上最容易自我欺骗，即投资者对给予他们更多资金的兴趣程度。"
    },
    {
      "original": "It's hard to convince investors the first time too, but founders expect that. What bites them the second time is a confluence of three forces: The company is spending more now than it did the first time it raised money.",
      "translated": "首次说服投资者确实很难，但创始人对此有心理准备。第二次让他们头痛的是三股力量的交汇：公司现在的支出比第一次融资时更多。"
    },
    {
      "original": "Investors have much higher standards for companies that have already raised money. The company is now starting to read as a failure. The first time it raised money, it was neither a success nor a failure; it was too early to ask.",
      "translated": "投资者对已经融资的公司有着更高的标准。现在，这家公司开始被视为失败。第一次融资时，它既不是成功也不是失败；那时还太早，难以定论。"
    },
    {
      "original": "Now it's possible to ask that question, and the default answer is failure, because at this point that is the default outcome. I'm going to call the situation I described in the first paragraph \"the fatal pinch.\" I try to resist coining phrases, but making up a name for this situation may snap founders into realizing when they're in it.One of the things that makes the fatal pinch so dangerous is that it's self-reinforcing.",
      "translated": "现在可以提出这个问题了，而默认的答案是失败，因为在这一点上，失败是默认的结果。我将第一段中描述的情况称为“致命的紧缩”。我尽量避免创造术语，但为这种情况起个名字可能有助于创始人们意识到自己正身处其中。使“致命的紧缩”尤为危险的一点是，它是自我强化的。"
    },
    {
      "original": "Founders overestimate their chances of raising more money, and so are slack about reaching profitability, which further decreases their chances of raising money.Now that you know about the fatal pinch, how do you avoid it?",
      "translated": "创始人往往高估了自己筹集更多资金的可能性，因此在实现盈利方面不够努力，这进一步降低了他们筹集资金的几率。现在你了解了这个致命的困境，该如何避免呢？"
    },
    {
      "original": "Y Combinator tells founders who raise money to act as if it's the last they'll ever get. Because the self-reinforcing nature of this situation works the other way too: the less you need further investment, the easier it is to get.What do you do if you're already in the fatal pinch?",
      "translated": "Y Combinator 建议筹集到资金的创始人要表现得好像这是他们最后一次能获得资金一样。因为这种情况的自我强化性质也有相反的效果：你越不需要进一步的投资，就越容易获得投资。那如果你已经陷入了致命的困境该怎么办？"
    },
    {
      "original": "The first step is to re-evaluate the probability of raising more money. I will now, by an amazing feat of clairvoyance, do this for you: the probability is zero. [2]Three options remain: you can shut down the company, you can increase how much you make, and you can decrease how much you spend.You should shut down the company if you're certain it will fail no matter what you do.",
      "translated": "第一步是重新评估筹集更多资金的可能性。现在，我将凭借神奇的直觉为您完成这项任务：可能性为零。[2]剩下三种选择：您可以关闭公司，可以增加收入，或者减少开支。如果您确定无论采取什么措施公司都会失败，那么应该关闭公司。"
    },
    {
      "original": "Then at least you can give back the money you have left, and save yourself however many months you would have spent riding it down.Companies rarely have to fail though. What I'm really doing here is giving you the option of admitting you've already given up.If you don't want to shut down the company, that leaves increasing revenues and decreasing expenses.",
      "translated": "那么至少你可以退还剩下的钱，节省下本来要用几个月时间去消耗它的成本。公司很少真的需要失败。我在这里实际上是给你一个承认你已经放弃的选择。如果你不想关闭公司，那就只剩下增加收入和减少开支这两条路了。"
    },
    {
      "original": "In most startups, expenses = people, and decreasing expenses = firing people. [3] Deciding to fire people is usually hard, but there's one case in which it shouldn't be: when there are people you already know you should fire but you're in denial about it.",
      "translated": "在大多数初创公司中，开支等于人力成本，减少开支等于裁员。[3] 做出裁员的决定通常很难，但有一种情况除外：当你已经知道应该解雇某些人，但却对此视而不见时。"
    },
    {
      "original": "If so, now's the time.If that makes you profitable, or will enable you to make it to profitability on the money you have left, you've avoided the immediate danger.Otherwise you have three options: you either have to fire good people, get some or all of the employees to take less salary for a while, or increase revenues.Getting people to take less salary is a weak solution that will only work when the problem isn't too bad.",
      "translated": "如果是这样，现在就是时候了。如果这样做能使你盈利，或者能使你在剩余的资金下达到盈利状态，你就避免了眼前的危险。否则，你有三个选择：要么解雇优秀员工，要么让部分或全部员工暂时接受较低的薪酬，要么增加收入。让人们接受较低的薪酬是一个效果有限的解决方案，只能在问题不太严重时奏效。"
    },
    {
      "original": "If your current trajectory won't quite get you to profitability but you can get over the threshold by cutting salaries a little, you might be able to make the case to everyone for doing it. Otherwise you're probably just postponing the problem, and that will be obvious to the people whose salaries you're proposing to cut.",
      "translated": "如果你目前的轨迹还不能完全实现盈利，但通过小幅削减工资可以越过这个门槛，你或许能够向所有人说明这样做是合理的。否则，你可能只是在推迟问题，而这一点对于你提议削减工资的员工来说是显而易见的。"
    },
    {
      "original": "[4]Which leaves two options, firing good people and making more money. While trying to balance them, keep in mind the eventual goal: to be a successful product company in the sense of having a single thing lots of people use.You should lean more toward firing people if the source of your trouble is overhiring.",
      "translated": "这剩下两个选择：解雇优秀员工和赚更多钱。在试图平衡这两者时，请记住最终目标：成为一个成功的产品公司，即拥有一款被大量用户使用的产品。如果问题的根源在于过度招聘，你应该更倾向于解雇员工。"
    },
    {
      "original": "If you went out and hired 15 people before you even knew what you were building, you've created a broken company. You need to figure out what you're building, and it will probably be easier to do that with a handful of people than 15.",
      "translated": "如果你在还不知道自己要构建什么之前就雇佣了15个人，那你已经创建了一个有问题的公司。你需要弄清楚自己要构建什么，而与15个人相比，可能与少数几个人一起做这件事会更容易。"
    },
    {
      "original": "Plus those 15 people might not even be the ones you need for whatever you end up building. So the solution may be to shrink and then figure out what direction to grow in. After all, you're not doing those 15 people any favors if you fly the company into ground with them aboard.",
      "translated": "另外，那15个人可能根本不是你最终建设团队所需要的。因此，解决方案可能是先缩减规模，然后确定发展方向。毕竟，如果你带着这15个人把公司搞垮了，对他们也没有任何好处。"
    },
    {
      "original": "They'll all lose their jobs eventually, along with all the time they expended on this doomed company.Whereas if you only have a handful of people, it may be better to focus on trying to make more money.",
      "translated": "他们最终都会失去工作，以及在这家注定失败的公司上花费的所有时间。而如果你只有少数几个人，可能更好的做法是专注于赚更多的钱。"
    },
    {
      "original": "It may seem facile to suggest a startup make more money, as if that could be done for the asking. Usually a startup is already trying as hard as it can to sell whatever it sells. What I'm suggesting here is not so much to try harder to make money but to try to make money in a different way.",
      "translated": "建议一家初创公司多赚钱，这听起来可能很简单，好像只要提出要求就能做到一样。通常情况下，一家初创公司已经在尽其所能地销售其产品或服务。我在这里建议的，并不是要更努力地赚钱，而是尝试以不同的方式来赚钱。"
    },
    {
      "original": "For example, if you have only one person selling while the rest are writing code, consider having everyone work on selling. What good will more code do you when you're out of business? If you have to write code to close a certain deal, go ahead; that follows from everyone working on selling.",
      "translated": "例如，如果你只有一个人在销售，而其他人都在编写代码，那么可以考虑让每个人都参与销售工作。当公司面临倒闭时，再多的代码有什么用呢？如果必须编写代码来促成某笔交易，那就去做吧；这符合每个人都参与销售的原则。"
    },
    {
      "original": "But only work on whatever will get you the most revenue the soonest.Another way to make money differently is to sell different things, and in particular to do more consultingish work. I say consultingish because there is a long slippery slope from making products to pure consulting, and you don't have to go far down it before you start to offer something really attractive to customers.",
      "translated": "但只做那些能最快带来最多收入的事情。另一种不同的赚钱方式是销售不同的东西，特别是做更多咨询类的工作。我说咨询类是因为从制作产品到纯粹的咨询之间有一条很长的渐变路径，你不必走得太远就能开始提供对客户真正有吸引力的东西。"
    },
    {
      "original": "Although your product may not be very appealing yet, if you're a startup your programmers will often be way better than the ones your customers have. Or you may have expertise in some new field they don't understand.",
      "translated": "虽然你的产品可能还不是非常吸引人，但如果你是一家初创公司，你的程序员通常会比客户的程序员更优秀。或者你可能在某个他们不理解的新领域拥有专长。"
    },
    {
      "original": "So if you change your sales conversations just a little from \"do you want to buy our product?\" to \"what do you need that you'd pay a lot for?\" you may find it's suddenly a lot easier to extract money from customers.Be ruthlessly mercenary when you start doing this, though.",
      "translated": "因此，如果你将销售对话的内容稍作调整，从“您想购买我们的产品吗？”变为“您需要什么，您愿意为之支付高价？”你可能会发现，从客户那里获取资金突然变得容易得多。不过，在开始这样做时，务必要无情地追求利益。"
    },
    {
      "original": "You're trying to save your company from death here, so make customers pay a lot, quickly. And to the extent you can, try to avoid the worst pitfalls of consulting. The ideal thing might be if you built a precisely defined derivative version of your product for the customer, and it was otherwise a straight product sale.",
      "translated": "你正试图拯救公司于水火之中，所以要让客户尽快支付高额费用。同时，尽量避免咨询业务中最糟糕的陷阱。理想的情况是，你为客户提供一个精确定义的衍生产品版本，除此之外，这仍然是一笔直接的产品销售。"
    },
    {
      "original": "You keep the IP and no billing by the hour.In the best case, this consultingish work may not be just something you do to survive, but may turn out to be the thing-that-doesn't-scale that defines your company.",
      "translated": "你保留IP，而且不需要按小时计费。在最好的情况下，这种咨询性的工作不仅仅是你为了生存而做的事情，反而可能成为那件无法规模化但却定义你公司的业务。"
    },
    {
      "original": "Don't expect it to be, but as you dive into individual users' needs, keep your eyes open for narrow openings that have wide vistas beyond.There is usually so much demand for custom work that unless you're really incompetent there has to be some point down the slope of consulting at which you can survive.",
      "translated": "不要抱有期望，但在深入研究个别用户的需求时，要留意那些看似狭窄但实际上通向广阔视野的入口。通常对定制工作的需求如此之大，除非你实在无能，否则总能在咨询业务的某个层次上找到生存的空间。"
    },
    {
      "original": "But I didn't use the term slippery slope by accident; customers' insatiable demand for custom work will always be pushing you toward the bottom. So while you'll probably survive, the problem now becomes to survive with the least damage and distraction.The good news is, plenty of successful startups have passed through near-death experiences and gone on to flourish.",
      "translated": "但我并非无意使用“滑坡”一词；客户对定制工作无止境的需求总是会把你推向底部。所以，虽然你可能能够生存下来，但现在的问题是如何以最少的损害和干扰生存。好消息是，许多成功的初创公司都经历过濒临死亡的时刻，之后仍能蓬勃发展。"
    },
    {
      "original": "You just have to realize in time that you're near death. And if you're in the fatal pinch, you are. Notes[1] There are a handful of companies that can't reasonably expect to make money for the first year or two, because what they're building takes so long.",
      "translated": "你必须及时意识到自己濒临死亡。如果你正处于致命的困境中，那你确实如此。注[1] 有些公司由于所开发的项目需要很长时间，因此在头一两年内无法合理地期望盈利。"
    },
    {
      "original": "For these companies substitute \"progress\" for \"revenue growth.\" You're not one of these companies unless your initial investors agreed in advance that you were. And frankly even these companies wish they weren't, because the illiquidity of \"progress\" puts them at the mercy of investors.[2] There's a variant of the fatal pinch where your existing investors help you along by promising to invest more.",
      "translated": "对于这些公司，用“进展”来替代“收入增长”。除非你的初始投资者事先同意你属于这类公司，否则你并不属于这类公司。坦率地说，即使是这些公司也希望自己不是，因为“进展”的非流动性使他们受制于投资者。[2] 有一种致命的困境变体，即你的现有投资者通过承诺追加投资来帮助你。"
    },
    {
      "original": "Or rather, where you read them as promising to invest more, while they think they're just mentioning the possibility. The way to solve this problem, if you have 8 months of runway or less, is to try to get the money right now.",
      "translated": "或者说，你在读到他们承诺会增加投资时，而他们可能只是在提到这种可能性。如果你的运营资金只够维持8个月或更少，解决这个问题的方法是尽量现在就拿到这笔钱。"
    },
    {
      "original": "Then you'll either get the money, in which case (immediate) problem solved, or at least prevent your investors from helping you to remain in denial about your fundraising prospects.[3] Obviously, if you have significant expenses other than salaries that you can eliminate, do it now.[4] Unless of course the source of the problem is that you're paying yourselves high salaries.",
      "translated": "然后，你要么拿到钱，这样（立刻）问题就解决了，或者至少可以阻止你的投资者继续对你筹集资金的前景抱有不切实际的幻想。[3] 显然，如果你有除工资以外的其他可以削减的重大开支，现在就去做。[4] 当然，除非问题是你们给自己开了高薪。"
    },
    {
      "original": "If by cutting the founders' salaries to the minimum you need, you can make it to profitability, you should. But it's a bad sign if you needed to read this to realize that. Thanks to Sam Altman, Paul Buchheit, Jessica Livingston, and Geoff Ralston for reading drafts of this.Arabic Translation",
      "translated": "如果通过将创始人的薪资削减到最低必要水平，可以使公司实现盈利，那么你应该这样做。但如果你需要读到这段话才意识到这一点，那是一个不好的信号。感谢 Sam Altman、Paul Buchheit、Jessica Livingston 和 Geoff Ralston 阅读本文的草稿。"
    }
  ],
  "translation_completed": "2025-07-28T14:50:23.256890",
  "translation_stats": {
    "total_paragraphs": 30,
    "success_count": 30,
    "success_rate": "100.0%"
  }
}