{
  "title": "Good and Bad Procrastination",
  "title_zh": "[待翻译] Good and Bad Procrastination",
  "url": "https://www.paulgraham.com/procrastination.html",
  "filename": "procrastination.html",
  "date": "2021-05-01",
  "id": 22,
  "content": {
    "success": true,
    "paragraphs": [
      "December 2005The most impressive people I know are all terrible procrastinators. So could it be that procrastination isn't always bad?Most people who write about procrastination write about how to cure it.",
      "But this is, strictly speaking, impossible. There are an infinite number of things you could be doing. No matter what you work on, you're not working on everything else. So the question is not how to avoid procrastination, but how to procrastinate well.There are three variants of procrastination, depending on what you do instead of working on something: you could work on (a) nothing, (b) something less important, or (c) something more important.",
      "That last type, I'd argue, is good procrastination.That's the \"absent-minded professor,\" who forgets to shave, or eat, or even perhaps look where he's going while he's thinking about some interesting question.",
      "His mind is absent from the everyday world because it's hard at work in another.That's the sense in which the most impressive people I know are all procrastinators. They're type-C procrastinators: they put off working on small stuff to work on big stuff.What's \"small stuff?\" Roughly, work that has zero chance of being mentioned in your obituary.",
      "It's hard to say at the time what will turn out to be your best work (will it be your magnum opus on Sumerian temple architecture, or the detective thriller you wrote under a pseudonym?), but there's a whole class of tasks you can safely rule out: shaving, doing your laundry, cleaning the house, writing thank-you notes—anything that might be called an errand.Good procrastination is avoiding errands to do real work.Good in a sense, at least.",
      "The people who want you to do the errands won't think it's good. But you probably have to annoy them if you want to get anything done. The mildest seeming people, if they want to do real work, all have a certain degree of ruthlessness when it comes to avoiding errands.Some errands, like replying to letters, go away if you ignore them (perhaps taking friends with them).",
      "Others, like mowing the lawn, or filing tax returns, only get worse if you put them off. In principle it shouldn't work to put off the second kind of errand. You're going to have to do whatever it is eventually.",
      "Why not (as past-due notices are always saying) do it now?The reason it pays to put off even those errands is that real work needs two things errands don't: big chunks of time, and the right mood. If you get inspired by some project, it can be a net win to blow off everything you were supposed to do for the next few days to work on it.",
      "Yes, those errands may cost you more time when you finally get around to them. But if you get a lot done during those few days, you will be net more productive.In fact, it may not be a difference in degree, but a difference in kind.",
      "There may be types of work that can only be done in long, uninterrupted stretches, when inspiration hits, rather than dutifully in scheduled little slices. Empirically it seems to be so. When I think of the people I know who've done great things, I don't imagine them dutifully crossing items off to-do lists.",
      "I imagine them sneaking off to work on some new idea.Conversely, forcing someone to perform errands synchronously is bound to limit their productivity. The cost of an interruption is not just the time it takes, but that it breaks the time on either side in half.",
      "You probably only have to interrupt someone a couple times a day before they're unable to work on hard problems at all.I've wondered a lot about why startups are most productive at the very beginning, when they're just a couple guys in an apartment.",
      "The main reason may be that there's no one to interrupt them yet. In theory it's good when the founders finally get enough money to hire people to do some of the work for them. But it may be better to be overworked than interrupted.",
      "Once you dilute a startup with ordinary office workers—with type-B procrastinators—the whole company starts to resonate at their frequency. They're interrupt-driven, and soon you are too.Errands are so effective at killing great projects that a lot of people use them for that purpose.",
      "Someone who has decided to write a novel, for example, will suddenly find that the house needs cleaning. People who fail to write novels don't do it by sitting in front of a blank page for days without writing anything.",
      "They do it by feeding the cat, going out to buy something they need for their apartment, meeting a friend for coffee, checking email. \"I don't have time to work,\" they say. And they don't; they've made sure of that.(There's also a variant where one has no place to work.",
      "The cure is to visit the places where famous people worked, and see how unsuitable they were.)I've used both these excuses at one time or another. I've learned a lot of tricks for making myself work over the last 20 years, but even now I don't win consistently.",
      "Some days I get real work done. Other days are eaten up by errands. And I know it's usually my fault: I let errands eat up the day, to avoid facing some hard problem.The most dangerous form of procrastination is unacknowledged type-B procrastination, because it doesn't feel like procrastination.",
      "You're \"getting things done.\" Just the wrong things.Any advice about procrastination that concentrates on crossing things off your to-do list is not only incomplete, but positively misleading, if it doesn't consider the possibility that the to-do list is itself a form of type-B procrastination.",
      "In fact, possibility is too weak a word. Nearly everyone's is. Unless you're working on the biggest things you could be working on, you're type-B procrastinating, no matter how much you're getting done.In his famous essay You and Your Research (which I recommend to anyone ambitious, no matter what they're working on), Richard Hamming suggests that you ask yourself three questions: What are the most important problems in your field?",
      "Are you working on one of them? Why not? Hamming was at Bell Labs when he started asking such questions. In principle anyone there ought to have been able to work on the most important problems in their field.",
      "Perhaps not everyone can make an equally dramatic mark on the world; I don't know; but whatever your capacities, there are projects that stretch them. So Hamming's exercise can be generalized to: What's the best thing you could be working on, and why aren't you?",
      "Most people will shy away from this question. I shy away from it myself; I see it there on the page and quickly move on to the next sentence. Hamming used to go around actually asking people this, and it didn't make him popular.",
      "But it's a question anyone ambitious should face.The trouble is, you may end up hooking a very big fish with this bait. To do good work, you need to do more than find good projects. Once you've found them, you have to get yourself to work on them, and that can be hard.",
      "The bigger the problem, the harder it is to get yourself to work on it.Of course, the main reason people find it difficult to work on a particular problem is that they don't enjoy it. When you're young, especially, you often find yourself working on stuff you don't really like-- because it seems impressive, for example, or because you've been assigned to work on it.",
      "Most grad students are stuck working on big problems they don't really like, and grad school is thus synonymous with procrastination.But even when you like what you're working on, it's easier to get yourself to work on small problems than big ones.",
      "Why? Why is it so hard to work on big problems? One reason is that you may not get any reward in the forseeable future. If you work on something you can finish in a day or two, you can expect to have a nice feeling of accomplishment fairly soon.",
      "If the reward is indefinitely far in the future, it seems less real.Another reason people don't work on big projects is, ironically, fear of wasting time. What if they fail? Then all the time they spent on it will be wasted.",
      "(In fact it probably won't be, because work on hard projects almost always leads somewhere.)But the trouble with big problems can't be just that they promise no immediate reward and might cause you to waste a lot of time.",
      "If that were all, they'd be no worse than going to visit your in-laws. There's more to it than that. Big problems are terrifying. There's an almost physical pain in facing them. It's like having a vacuum cleaner hooked up to your imagination.",
      "All your initial ideas get sucked out immediately, and you don't have any more, and yet the vacuum cleaner is still sucking.You can't look a big problem too directly in the eye. You have to approach it somewhat obliquely.",
      "But you have to adjust the angle just right: you have to be facing the big problem directly enough that you catch some of the excitement radiating from it, but not so much that it paralyzes you. You can tighten the angle once you get going, just as a sailboat can sail closer to the wind once it gets underway.If you want to work on big things, you seem to have to trick yourself into doing it.",
      "You have to work on small things that could grow into big things, or work on successively larger things, or split the moral load with collaborators. It's not a sign of weakness to depend on such tricks.",
      "The very best work has been done this way.When I talk to people who've managed to make themselves work on big things, I find that all blow off errands, and all feel guilty about it. I don't think they should feel guilty.",
      "There's more to do than anyone could. So someone doing the best work they can is inevitably going to leave a lot of errands undone. It seems a mistake to feel bad about that.I think the way to \"solve\" the problem of procrastination is to let delight pull you instead of making a to-do list push you.",
      "Work on an ambitious project you really enjoy, and sail as close to the wind as you can, and you'll leave the right things undone.Thanks to Trevor Blackwell, Jessica Livingston, and Robert Morris for reading drafts of this.Romanian TranslationRussian TranslationHebrew TranslationGerman TranslationPortuguese TranslationItalian TranslationJapanese TranslationSpanish Translation"
    ],
    "word_count": 1780,
    "paragraph_count": 36
  },
  "processed_at": "2025-07-26T19:02:06.146611",
  "paragraphs": [
    {
      "original": "December 2005The most impressive people I know are all terrible procrastinators. So could it be that procrastination isn't always bad?Most people who write about procrastination write about how to cure it.",
      "translated": "2005年12月 我认识的最令人印象深刻的人都是严重的拖延症患者。那么，拖延真的总是坏事吗？大多数撰写关于拖延文章的人都是在讨论如何治愈它。"
    },
    {
      "original": "But this is, strictly speaking, impossible. There are an infinite number of things you could be doing. No matter what you work on, you're not working on everything else. So the question is not how to avoid procrastination, but how to procrastinate well.There are three variants of procrastination, depending on what you do instead of working on something: you could work on (a) nothing, (b) something less important, or (c) something more important.",
      "translated": "但严格来说，这是不可能的。你可以做的事情是无限的。无论你做什么工作，你都没有做其他所有的事情。所以问题不在于如何避免拖延，而在于如何明智地拖延。拖延有三种变体，取决于你没有做某项工作时在做什么：你可以（a）什么都不做，（b）做一些不那么重要的事情，或者（c）做一些更重要的事情。"
    },
    {
      "original": "That last type, I'd argue, is good procrastination.That's the \"absent-minded professor,\" who forgets to shave, or eat, or even perhaps look where he's going while he's thinking about some interesting question.",
      "translated": "最后一种类型，我认为是好的拖延。这就是所谓的“心不在焉的教授”，他可能会忘记刮胡子、吃饭，甚至在思考某个有趣的问题时，忘记了看自己要去哪里。"
    },
    {
      "original": "His mind is absent from the everyday world because it's hard at work in another.That's the sense in which the most impressive people I know are all procrastinators. They're type-C procrastinators: they put off working on small stuff to work on big stuff.What's \"small stuff?\" Roughly, work that has zero chance of being mentioned in your obituary.",
      "translated": "他的心思不在日常世界，因为它正埋头于另一个世界中忙碌。这是我所认识的最出色的人都是拖延症患者的意义所在。他们是C型拖延症患者：他们会推迟处理琐事，以便专注于大事。什么是“琐事”？大致来说，就是那些在你讣告中完全没有机会被提及的工作。"
    },
    {
      "original": "It's hard to say at the time what will turn out to be your best work (will it be your magnum opus on Sumerian temple architecture, or the detective thriller you wrote under a pseudonym?), but there's a whole class of tasks you can safely rule out: shaving, doing your laundry, cleaning the house, writing thank-you notes—anything that might be called an errand.Good procrastination is avoiding errands to do real work.Good in a sense, at least.",
      "translated": "很难说在当时什么会成为你最好的作品（会是你关于苏美尔神庙建筑的巨著，还是你用笔名写的侦探惊悚小说？），但有一类任务你可以安全地排除在外：刮胡子、洗衣服、打扫房子、写感谢信——任何可以称为杂务的事情。好的拖延是避免杂务去做真正的工作。至少在某种意义上是好的。"
    },
    {
      "original": "The people who want you to do the errands won't think it's good. But you probably have to annoy them if you want to get anything done. The mildest seeming people, if they want to do real work, all have a certain degree of ruthlessness when it comes to avoiding errands.Some errands, like replying to letters, go away if you ignore them (perhaps taking friends with them).",
      "translated": "那些希望你跑腿的人不会觉得这是好事。但如果你想做成任何事情，可能就得让他们不高兴。即便是最温和的人，如果他们想做真正的工作，在避免跑腿这件事上也都表现出某种程度的无情。有些跑腿的活，比如回信，如果你置之不理，它们就会自行消失（也许还会带走一些朋友）。"
    },
    {
      "original": "Others, like mowing the lawn, or filing tax returns, only get worse if you put them off. In principle it shouldn't work to put off the second kind of errand. You're going to have to do whatever it is eventually.",
      "translated": "像修剪草坪或报税这样的事情，如果你拖延的话，只会变得更加糟糕。从原则上讲，推迟这类差事是行不通的。你最终还是得去做这些事情。"
    },
    {
      "original": "Why not (as past-due notices are always saying) do it now?The reason it pays to put off even those errands is that real work needs two things errands don't: big chunks of time, and the right mood. If you get inspired by some project, it can be a net win to blow off everything you were supposed to do for the next few days to work on it.",
      "translated": "为什么不像催款通知上说的那样，现在就去做呢？推迟那些杂事的原因是，真正的工作需要两样东西，而杂事不需要：大块的时间和恰当的心情。如果你对某个项目产生了灵感，放弃接下来几天本应做的事情去专心做这个项目，整体上来说可能是值得的。"
    },
    {
      "original": "Yes, those errands may cost you more time when you finally get around to them. But if you get a lot done during those few days, you will be net more productive.In fact, it may not be a difference in degree, but a difference in kind.",
      "translated": "是的，当你最终着手处理这些杂事时，可能会花费更多的时间。但是，如果你在那几天里完成了许多任务，你的整体生产率将会更高。事实上，这可能不仅仅是程度上的差异，而是性质上的不同。"
    },
    {
      "original": "There may be types of work that can only be done in long, uninterrupted stretches, when inspiration hits, rather than dutifully in scheduled little slices. Empirically it seems to be so. When I think of the people I know who've done great things, I don't imagine them dutifully crossing items off to-do lists.",
      "translated": "有些工作可能只有在灵感涌现时，才能长时间不间断地进行，而不是按部就班地分段完成。从经验来看，确实如此。当我想到我认识的那些做出了杰出成就的人时，我不会想象他们机械地划掉待办事项清单上的项目。"
    },
    {
      "original": "I imagine them sneaking off to work on some new idea.Conversely, forcing someone to perform errands synchronously is bound to limit their productivity. The cost of an interruption is not just the time it takes, but that it breaks the time on either side in half.",
      "translated": "我想象他们偷偷地去研究一些新点子。相反，强制某人同步执行琐事必然会限制他们的生产力。中断的成本不仅仅是所花费的时间，还在于它将两边的时间都分割成了两半。"
    },
    {
      "original": "You probably only have to interrupt someone a couple times a day before they're unable to work on hard problems at all.I've wondered a lot about why startups are most productive at the very beginning, when they're just a couple guys in an apartment.",
      "translated": "你大概每天只需打断某人几次，他们就完全无法解决复杂的问题了。我经常思考为什么初创公司在刚开始时，当他们只是在公寓里的几个人时，生产力最高。"
    },
    {
      "original": "The main reason may be that there's no one to interrupt them yet. In theory it's good when the founders finally get enough money to hire people to do some of the work for them. But it may be better to be overworked than interrupted.",
      "translated": "主要原因可能是还没有人来打扰他们。理论上，创始人最终获得足够的资金来聘请人员帮助他们完成一些工作是件好事。但也许，过度工作总比被打扰要好。"
    },
    {
      "original": "Once you dilute a startup with ordinary office workers—with type-B procrastinators—the whole company starts to resonate at their frequency. They're interrupt-driven, and soon you are too.Errands are so effective at killing great projects that a lot of people use them for that purpose.",
      "translated": "一旦你用普通的上班族——那些B型拖延者——稀释了一家初创公司，整个公司就开始以他们的频率共振。他们受中断驱动，很快你也一样。琐事在扼杀伟大项目方面非常有效，以至于很多人用它们来达到这个目的。"
    },
    {
      "original": "Someone who has decided to write a novel, for example, will suddenly find that the house needs cleaning. People who fail to write novels don't do it by sitting in front of a blank page for days without writing anything.",
      "translated": "比如，决定要写小说的人，会突然发现房子需要打扫了。那些未能完成小说写作的人，并不是坐在空白的页面前一连几天什么都不写。"
    },
    {
      "original": "They do it by feeding the cat, going out to buy something they need for their apartment, meeting a friend for coffee, checking email. \"I don't have time to work,\" they say. And they don't; they've made sure of that.(There's also a variant where one has no place to work.",
      "translated": "他们通过给猫喂食、外出购买公寓所需的东西、与朋友见面喝咖啡、查看电子邮件等方式来实现这一点。“我没有时间工作，”他们说。而他们确实没有时间；他们已经确保了这一点。（还有一种变体是，某人没有地方可以工作。）"
    },
    {
      "original": "The cure is to visit the places where famous people worked, and see how unsuitable they were.)I've used both these excuses at one time or another. I've learned a lot of tricks for making myself work over the last 20 years, but even now I don't win consistently.",
      "translated": "解决办法是去参观名人工作过的地方，看看那些地方有多么不适合他们。我曾经用过这两种借口。在过去的20年里，我学到了很多让自己投入工作的技巧，但即便如此，我仍然不能每次都成功。"
    },
    {
      "original": "Some days I get real work done. Other days are eaten up by errands. And I know it's usually my fault: I let errands eat up the day, to avoid facing some hard problem.The most dangerous form of procrastination is unacknowledged type-B procrastination, because it doesn't feel like procrastination.",
      "translated": "有些日子我能完成真正的工作。而有些日子则被琐事占据。我知道这通常是我的错：我让琐事占据了整天，以逃避面对某个棘手的问题。最危险的拖延形式是没有被认识到的B型拖延，因为它并不让人觉得是在拖延。"
    },
    {
      "original": "You're \"getting things done.\" Just the wrong things.Any advice about procrastination that concentrates on crossing things off your to-do list is not only incomplete, but positively misleading, if it doesn't consider the possibility that the to-do list is itself a form of type-B procrastination.",
      "translated": "你“在做事”。只是做错了事。任何关于拖延的建议，如果只关注从待办事项列表中划掉任务，而不考虑这个列表本身可能是B型拖延的一种形式，那么这种建议不仅是不完整的，甚至是误导性的。"
    },
    {
      "original": "In fact, possibility is too weak a word. Nearly everyone's is. Unless you're working on the biggest things you could be working on, you're type-B procrastinating, no matter how much you're getting done.In his famous essay You and Your Research (which I recommend to anyone ambitious, no matter what they're working on), Richard Hamming suggests that you ask yourself three questions: What are the most important problems in your field?",
      "translated": "事实上，“可能性”这个词太弱了。几乎每个人的都是如此。除非你正在处理你能处理的最重要的事情，否则无论你完成了多少工作，你都在进行B型拖延。在著名的文章《你和你的研究》中（我推荐给任何有雄心的人，无论他们正在做什么），理查德·汉明建议你问自己三个问题：你所在领域最重要的问题是什么？"
    },
    {
      "original": "Are you working on one of them? Why not? Hamming was at Bell Labs when he started asking such questions. In principle anyone there ought to have been able to work on the most important problems in their field.",
      "translated": "你正在研究其中的一个吗？为什么不在研究呢？汉明在贝尔实验室工作时开始提出这样的问题。原则上，那里任何人都应该能够研究他们领域内最重要的问题。"
    },
    {
      "original": "Perhaps not everyone can make an equally dramatic mark on the world; I don't know; but whatever your capacities, there are projects that stretch them. So Hamming's exercise can be generalized to: What's the best thing you could be working on, and why aren't you?",
      "translated": "也许并不是每个人都能对世界产生同样显著的影响；我不知道；但无论你的能力如何，总有一些项目能够挑战它们。因此，汉明的这个练习可以概括为：你能做的最好的事情是什么，为什么你没有去做？"
    },
    {
      "original": "Most people will shy away from this question. I shy away from it myself; I see it there on the page and quickly move on to the next sentence. Hamming used to go around actually asking people this, and it didn't make him popular.",
      "translated": "大多数人会回避这个问题。我自己也会避开；看到它出现在页面上，我会迅速跳到下一句话。汉明过去常四处问人这个问题，这可没让他受欢迎。"
    },
    {
      "original": "But it's a question anyone ambitious should face.The trouble is, you may end up hooking a very big fish with this bait. To do good work, you need to do more than find good projects. Once you've found them, you have to get yourself to work on them, and that can be hard.",
      "translated": "但这是每一个有抱负的人都应该面对的问题。问题是，你可能会用这种诱饵钓到一条大鱼。要做好工作，你需要做的不仅仅是找到好的项目。一旦找到了它们，你还必须让自己去完成这些项目，而这可能是困难的。"
    },
    {
      "original": "The bigger the problem, the harder it is to get yourself to work on it.Of course, the main reason people find it difficult to work on a particular problem is that they don't enjoy it. When you're young, especially, you often find yourself working on stuff you don't really like-- because it seems impressive, for example, or because you've been assigned to work on it.",
      "translated": "问题越大，就越难让自己去解决它。当然，人们觉得难以解决某个问题的主要原因是他们不喜欢它。当你年轻的时候，尤其经常发现自己在做那些你实际上并不喜欢的事情——比如因为这些事情看起来很了不起，或者因为你被分配去做这些事情。"
    },
    {
      "original": "Most grad students are stuck working on big problems they don't really like, and grad school is thus synonymous with procrastination.But even when you like what you're working on, it's easier to get yourself to work on small problems than big ones.",
      "translated": "大多数研究生都不得不从事他们并不真正喜欢的大问题研究，因此研究生院几乎成了拖延的代名词。但即使你喜欢自己的研究课题，与大问题相比，也更容易让自己投入到小问题的研究中。"
    },
    {
      "original": "Why? Why is it so hard to work on big problems? One reason is that you may not get any reward in the forseeable future. If you work on something you can finish in a day or two, you can expect to have a nice feeling of accomplishment fairly soon.",
      "translated": "为什么？为什么解决大问题如此困难？一个原因是，在可预见的未来，你可能不会得到任何回报。如果你从事的是可以在一两天内完成的工作，你可以期待很快就会有一种成就感。"
    },
    {
      "original": "If the reward is indefinitely far in the future, it seems less real.Another reason people don't work on big projects is, ironically, fear of wasting time. What if they fail? Then all the time they spent on it will be wasted.",
      "translated": "如果回报遥不可及，似乎就显得不那么真实。另一个人们不愿投身大型项目的原因，颇具讽刺意味的是，害怕浪费时间。万一失败了呢？那么他们在上面花费的所有时间都将白费。"
    },
    {
      "original": "(In fact it probably won't be, because work on hard projects almost always leads somewhere.)But the trouble with big problems can't be just that they promise no immediate reward and might cause you to waste a lot of time.",
      "translated": "（事实上可能不会，因为致力于难题几乎总会有收获。）但大问题的麻烦不仅仅在于它们没有立竿见影的回报，还可能让你浪费大量时间。"
    },
    {
      "original": "If that were all, they'd be no worse than going to visit your in-laws. There's more to it than that. Big problems are terrifying. There's an almost physical pain in facing them. It's like having a vacuum cleaner hooked up to your imagination.",
      "translated": "如果仅此而已，那他们并不会比去拜访岳父母更糟糕。但这不仅仅是这样。大问题令人恐惧。面对它们时几乎会感到一种生理上的疼痛。这就像有一台吸尘器连接到了你的想象力上。"
    },
    {
      "original": "All your initial ideas get sucked out immediately, and you don't have any more, and yet the vacuum cleaner is still sucking.You can't look a big problem too directly in the eye. You have to approach it somewhat obliquely.",
      "translated": "你所有的初步想法立刻就被吸走了，你已经没有更多的想法了，但吸尘器还在继续吸。你不能直视一个大问题，你必须从侧面去接近它。"
    },
    {
      "original": "But you have to adjust the angle just right: you have to be facing the big problem directly enough that you catch some of the excitement radiating from it, but not so much that it paralyzes you. You can tighten the angle once you get going, just as a sailboat can sail closer to the wind once it gets underway.If you want to work on big things, you seem to have to trick yourself into doing it.",
      "translated": "但你必须把角度调整得恰到好处：你要足够直接地面对大问题，以便能捕捉到从中散发出来的部分激情，但又不能过于直接，以免被其压垮。一旦开始行动，你可以调整角度，就像帆船起航后可以更接近风向一样。如果你想研究大的课题，似乎必须得用一些方法说服自己去这样做。"
    },
    {
      "original": "You have to work on small things that could grow into big things, or work on successively larger things, or split the moral load with collaborators. It's not a sign of weakness to depend on such tricks.",
      "translated": "你必须从小事情做起，这些事情可能会发展成大事，或者逐渐处理越来越大的事情，或者与合作者分担道德负担。依赖这样的策略并不表示软弱。"
    },
    {
      "original": "The very best work has been done this way.When I talk to people who've managed to make themselves work on big things, I find that all blow off errands, and all feel guilty about it. I don't think they should feel guilty.",
      "translated": "最出色的工作就是这样完成的。当我与那些成功专注于大事的人交谈时，我发现他们都把琐事抛在脑后，而且对此都感到内疚。我认为他们不应该有这种内疚感。"
    },
    {
      "original": "There's more to do than anyone could. So someone doing the best work they can is inevitably going to leave a lot of errands undone. It seems a mistake to feel bad about that.I think the way to \"solve\" the problem of procrastination is to let delight pull you instead of making a to-do list push you.",
      "translated": "有太多的事情要做，任何人都无法全部完成。所以，一个人即便尽全力工作，也难免会有很多事情做不完。对于这一点感到内疚似乎是错误的。我认为解决拖延问题的方法是让愉悦感引导你，而不是被待办事项清单推着走。"
    },
    {
      "original": "Work on an ambitious project you really enjoy, and sail as close to the wind as you can, and you'll leave the right things undone.Thanks to Trevor Blackwell, Jessica Livingston, and Robert Morris for reading drafts of this.Romanian TranslationRussian TranslationHebrew TranslationGerman TranslationPortuguese TranslationItalian TranslationJapanese TranslationSpanish Translation",
      "translated": "从事一个你真正热爱的雄心勃勃的项目，尽可能接近极限地努力，这样你就会把正确的事情搁置。感谢特雷弗·布莱克威尔、杰西卡·利文斯顿和罗伯特·莫里斯阅读本文的草稿。罗马尼亚语翻译俄语翻译希伯来语翻译德语翻译葡萄牙语翻译意大利语翻译日语翻译西班牙语翻译"
    }
  ],
  "translation_completed": "2025-07-28T15:03:44.660145",
  "translation_stats": {
    "total_paragraphs": 36,
    "success_count": 36,
    "success_rate": "100.0%"
  }
}