{
  "title": "Ramen Profitable",
  "title_zh": "[待翻译] Ramen Profitable",
  "url": "https://www.paulgraham.com/ramenprofitable.html",
  "filename": "ramenprofitable.html",
  "date": "2021-02-08",
  "id": 46,
  "content": {
    "success": true,
    "paragraphs": [
      "Want to start a startup? Get funded by Y Combinator. July 2009Now that the term \"ramen profitable\" has become widespread, I ought to explain precisely what the idea entails.Ramen profitable means a startup makes just enough to pay the founders' living expenses.",
      "This is a different form of profitability than startups have traditionally aimed for. Traditional profitability means a big bet is finally paying off, whereas the main importance of ramen profitability is that it buys you time.",
      "[1]In the past, a startup would usually become profitable only after raising and spending quite a lot of money. A company making computer hardware might not become profitable for 5 years, during which they spent $50 million.",
      "But when they did they might have revenues of $50 million a year. This kind of profitability means the startup has succeeded.Ramen profitability is the other extreme: a startup that becomes profitable after 2 months, even though its revenues are only $3000 a month, because the only employees are a couple 25 year old founders who can live on practically nothing.",
      "Revenues of $3000 a month do not mean the company has succeeded. But it does share something with the one that's profitable in the traditional way: they don't need to raise money to survive.Ramen profitability is an unfamiliar idea to most people because it only recently became feasible.",
      "It's still not feasible for a lot of startups; it would not be for most biotech startups, for example; but it is for many software startups because they're now so cheap. For many, the only real cost is the founders' living expenses.The main significance of this type of profitability is that you're no longer at the mercy of investors.",
      "If you're still losing money, then eventually you'll either have to raise more or shut down. Once you're ramen profitable this painful choice goes away. You can still raise money, but you don't have to do it now.* * *The most obvious advantage of not needing money is that you can get better terms.",
      "If investors know you need money, they'll sometimes take advantage of you. Some may even deliberately stall, because they know that as you run out of money you'll become increasingly pliable.But there are also three less obvious advantages of ramen profitability.",
      "One is that it makes you more attractive to investors. If you're already profitable, on however small a scale, it shows that (a) you can get at least someone to pay you, (b) you're serious about building things people want, and (c) you're disciplined enough to keep expenses low.This is reassuring to investors, because you've addressed three of their biggest worries.",
      "It's common for them to fund companies that have smart founders and a big market, and yet still fail. When these companies fail, it's usually because (a) people wouldn't pay for what they made, e.g. because it was too hard to sell to them, or the market wasn't ready yet, (b) the founders solved the wrong problem, instead of paying attention to what users needed, or (c) the company spent too much and burned through their funding before they started to make money.",
      "If you're ramen profitable, you're already avoiding these mistakes.Another advantage of ramen profitability is that it's good for morale. A company tends to feel rather theoretical when you first start it.",
      "It's legally a company, but you feel like you're lying when you call it one. When people start to pay you significant amounts, the company starts to feel real. And your own living expenses are the milestone you feel most, because at that point the future flips state.",
      "Now survival is the default, instead of dying.A morale boost on that scale is very valuable in a startup, because the moral weight of running a startup is what makes it hard. Startups are still very rare.",
      "Why don't more people do it? The financial risk? Plenty of 25 year olds save nothing anyway. The long hours? Plenty of people work just as long hours in regular jobs. What keeps people from starting startups is the fear of having so much responsibility.",
      "And this is not an irrational fear: it really is hard to bear. Anything that takes some of that weight off you will greatly increase your chances of surviving.A startup that reaches ramen profitability may be more likely to succeed than not.",
      "Which is pretty exciting, considering the bimodal distribution of outcomes in startups: you either fail or make a lot of money.The fourth advantage of ramen profitability is the least obvious but may be the most important.",
      "If you don't need to raise money, you don't have to interrupt working on the company to do it.Raising money is terribly distracting. You're lucky if your productivity is a third of what it was before.",
      "And it can last for months.I didn't understand (or rather, remember) precisely why raising money was so distracting till earlier this year. I'd noticed that startups we funded would usually grind to a halt when they switched to raising money, but I didn't remember exactly why till YC raised money itself.",
      "We had a comparatively easy time of it; the first people I asked said yes; but it took months to work out the details, and during that time I got hardly any real work done. Why? Because I thought about it all the time.At any given time there tends to be one problem that's the most urgent for a startup.",
      "This is what you think about as you fall asleep at night and when you take a shower in the morning. And when you start raising money, that becomes the problem you think about. You only take one shower in the morning, and if you're thinking about investors during it, then you're not thinking about the product.Whereas if you can choose when you raise money, you can pick a time when you're not in the middle of something else, and you can probably also insist that the round close fast.",
      "You may even be able to avoid having the round occupy your thoughts, if you don't care whether it closes.* * *Ramen profitable means no more than the definition implies. It does not, for example, imply that you're \"bootstrapping\" the startup—that you're never going to take money from investors.",
      "Empirically that doesn't seem to work very well. Few startups succeed without taking investment. Maybe as startups get cheaper it will become more common. On the other hand, the money is there, waiting to be invested.",
      "If startups need it less, they'll be able to get it on better terms, which will make them more inclined to take it. That will tend to produce an equilibrium. [2]Another thing ramen profitability doesn't imply is Joe Kraus's idea that you should put your business model in beta when you put your product in beta.",
      "He believes you should get people to pay you from the beginning. I think that's too constraining. Facebook didn't, and they've done better than most startups. Making money right away was not only unnecessary for them, but probably would have been harmful.",
      "I do think Joe's rule could be useful for many startups, though. When founders seem unfocused, I sometimes suggest they try to get customers to pay them for something, in the hope that this constraint will prod them into action.The difference between Joe's idea and ramen profitability is that a ramen profitable company doesn't have to be making money the way it ultimately will.",
      "It just has to be making money. The most famous example is Google, which initially made money by licensing search to sites like Yahoo.Is there a downside to ramen profitability? Probably the biggest danger is that it might turn you into a consulting firm.",
      "Startups have to be product companies, in the sense of making a single thing that everyone uses. The defining quality of startups is that they grow fast, and consulting just can't scale the way a product can.",
      "[3] But it's pretty easy to make $3000 a month consulting; in fact, that would be a low rate for contract programming. So there could be a temptation to slide into consulting, and telling yourselves you're a ramen profitable startup, when in fact you're not a startup at all.It's ok to do a little consulting-type work at first.",
      "Startups usually have to do something weird at first. But remember that ramen profitability is not the destination. A startup's destination is to grow really big; ramen profitability is a trick for not dying en route.Notes[1] The \"ramen\" in \"ramen profitable\" refers to instant ramen, which is just about the cheapest food available.Please do not take the term literally.",
      "Living on instant ramen would be very unhealthy. Rice and beans are a better source of food. Start by investing in a rice cooker, if you don't have one.Rice and Beans for 2n olive oil or butter n yellow onions other fresh vegetables; experiment 3n cloves garlic n 12-oz cans white, kidney, or black beans n cubes Knorr beef or vegetable bouillon n teaspoons freshly ground black pepper 3n teaspoons ground cumin n cups dry rice, preferably brown Put rice in rice cooker.",
      "Add water as specified on rice package. (Default: 2 cups water per cup of rice.) Turn on rice cooker and forget about it.Chop onions and other vegetables and fry in oil, over fairly low heat, till onions are glassy.",
      "Put in chopped garlic, pepper, cumin, and a little more fat, and stir. Keep heat low. Cook another 2 or 3 minutes, then add beans (don't drain the beans), and stir. Throw in the bouillon cube(s), cover, and cook on lowish heat for at least 10 minutes more.",
      "Stir vigilantly to avoid sticking.If you want to save money, buy beans in giant cans from discount stores. Spices are also much cheaper when bought in bulk. If there's an Indian grocery store near you, they'll have big bags of cumin for the same price as the little jars in supermarkets.[2] There's a good chance that a shift in power from investors to founders would actually increase the size of the venture business.",
      "I think investors currently err too far on the side of being harsh to founders. If they were forced to stop, the whole venture business would work better, and you might see something like the increase in trade you always see when restrictive laws are removed.Investors are one of the biggest sources of pain for founders; if they stopped causing so much pain, it would be better to be a founder; and if it were better to be a founder, more people would do it.[3] It's conceivable that a startup could grow big by transforming consulting into a form that would scale.",
      "But if they did that they'd really be a product company.Thanks to Jessica Livingston for reading drafts of this.Japanese Translation"
    ],
    "word_count": 1808,
    "paragraph_count": 35
  },
  "processed_at": "2025-07-26T19:02:53.442631",
  "paragraphs": [
    {
      "original": "Want to start a startup? Get funded by Y Combinator. July 2009Now that the term \"ramen profitable\" has become widespread, I ought to explain precisely what the idea entails.Ramen profitable means a startup makes just enough to pay the founders' living expenses.",
      "translated": "想创业吗？获得Y Combinator的投资吧。2009年7月现在“拉面盈利”这个词已经广为人知，我应该详细解释一下这个概念的具体含义。“拉面盈利”指的是初创公司刚好能够赚取足够支付创始人生活费用的收入。"
    },
    {
      "original": "This is a different form of profitability than startups have traditionally aimed for. Traditional profitability means a big bet is finally paying off, whereas the main importance of ramen profitability is that it buys you time.",
      "translated": "这与初创公司传统上追求的盈利能力不同。传统意义上的盈利能力意味着一次大的投资终于得到了回报，而拉面盈利能力的主要意义在于它为你争取了时间。"
    },
    {
      "original": "[1]In the past, a startup would usually become profitable only after raising and spending quite a lot of money. A company making computer hardware might not become profitable for 5 years, during which they spent $50 million.",
      "translated": "在过去，一家初创公司通常只有在筹集和花费了相当多的资金后才能实现盈利。一家制造计算机硬件的公司可能需要5年时间才能实现盈利，在这期间他们可能会花费5000万美元。"
    },
    {
      "original": "But when they did they might have revenues of $50 million a year. This kind of profitability means the startup has succeeded.Ramen profitability is the other extreme: a startup that becomes profitable after 2 months, even though its revenues are only $3000 a month, because the only employees are a couple 25 year old founders who can live on practically nothing.",
      "translated": "但如果成功了，他们的年收入可能会达到5000万美元。这种盈利能力意味着这家初创公司已经成功了。而拉面盈利能力则是另一个极端：一家初创公司在两个月后就开始盈利，尽管其月收入只有3000美元，但因为唯一的员工是两位25岁的创始人，他们几乎可以靠很少的开销生活。"
    },
    {
      "original": "Revenues of $3000 a month do not mean the company has succeeded. But it does share something with the one that's profitable in the traditional way: they don't need to raise money to survive.Ramen profitability is an unfamiliar idea to most people because it only recently became feasible.",
      "translated": "每月3000美元的收入并不意味着公司已经成功。但它与传统意义上的盈利公司有一个共同点：它们不需要筹集资金来维持生存。拉面盈利对大多数人来说是一个陌生的概念，因为它只是最近才变得可行。"
    },
    {
      "original": "It's still not feasible for a lot of startups; it would not be for most biotech startups, for example; but it is for many software startups because they're now so cheap. For many, the only real cost is the founders' living expenses.The main significance of this type of profitability is that you're no longer at the mercy of investors.",
      "translated": "这仍然对许多初创公司来说不太可行；对于大多数生物技术初创公司来说尤其如此；但对于许多软件初创公司来说却可行，因为它们现在成本非常低。对许多人来说，唯一真正的成本就是创始人的生活费用。这种盈利能力的主要意义在于，你不再受投资者的摆布。"
    },
    {
      "original": "If you're still losing money, then eventually you'll either have to raise more or shut down. Once you're ramen profitable this painful choice goes away. You can still raise money, but you don't have to do it now.* * *The most obvious advantage of not needing money is that you can get better terms.",
      "translated": "如果你还在亏损，那么最终你将不得不筹集更多资金或关闭公司。一旦实现拉面盈利，这个痛苦的选择就会消失。你仍然可以筹集资金，但你现在不必这样做。* * *不需要资金的最明显优势是你可以获得更好的条件。"
    },
    {
      "original": "If investors know you need money, they'll sometimes take advantage of you. Some may even deliberately stall, because they know that as you run out of money you'll become increasingly pliable.But there are also three less obvious advantages of ramen profitability.",
      "translated": "如果投资者知道你需要资金，他们有时会利用你。有些人甚至会故意拖延，因为他们知道随着你的资金逐渐耗尽，你会变得越来越容易屈服。但拉面盈利还有三个不太明显的优势。"
    },
    {
      "original": "One is that it makes you more attractive to investors. If you're already profitable, on however small a scale, it shows that (a) you can get at least someone to pay you, (b) you're serious about building things people want, and (c) you're disciplined enough to keep expenses low.This is reassuring to investors, because you've addressed three of their biggest worries.",
      "translated": "一是它使你对投资者更具吸引力。如果你已经盈利，无论规模多小，这表明：(a) 你至少能让某个人为你付费，(b) 你认真致力于开发人们需要的产品，(c) 你足够自律以控制开支。这对投资者来说是令人放心的，因为你已经解决了他们最大的三个担忧。"
    },
    {
      "original": "It's common for them to fund companies that have smart founders and a big market, and yet still fail. When these companies fail, it's usually because (a) people wouldn't pay for what they made, e.g. because it was too hard to sell to them, or the market wasn't ready yet, (b) the founders solved the wrong problem, instead of paying attention to what users needed, or (c) the company spent too much and burned through their funding before they started to make money.",
      "translated": "为那些拥有聪明创始人和广阔市场的企业提供资金是常见的，但即便如此，这些企业仍然可能失败。当这些企业失败时，通常是因为（a）人们不愿意为他们生产的产品付费，例如，因为销售难度太大，或者市场尚未准备好；（b）创始人解决了错误的问题，而不是关注用户的需求；或（c）公司在开始盈利之前花费过多，耗尽了资金。"
    },
    {
      "original": "If you're ramen profitable, you're already avoiding these mistakes.Another advantage of ramen profitability is that it's good for morale. A company tends to feel rather theoretical when you first start it.",
      "translated": "如果你已经实现拉面盈利，那么你已经避免了这些错误。拉面盈利的另一个优势是它对士气有好处。当你刚开始创业时，公司往往给人一种很理论化的感觉。"
    },
    {
      "original": "It's legally a company, but you feel like you're lying when you call it one. When people start to pay you significant amounts, the company starts to feel real. And your own living expenses are the milestone you feel most, because at that point the future flips state.",
      "translated": "从法律上讲，它是一家公司，但你称呼它为公司时却感觉像是在撒谎。当人们开始支付给你大笔款项时，这家公司才开始显得真实起来。而你自己生活费用的覆盖，是你感受最深的一个里程碑，因为从那一刻起，未来发生了质的转变。"
    },
    {
      "original": "Now survival is the default, instead of dying.A morale boost on that scale is very valuable in a startup, because the moral weight of running a startup is what makes it hard. Startups are still very rare.",
      "translated": "现在生存成了常态，而不是消亡。这种规模的士气提升对于创业公司来说非常宝贵，因为运营一家创业公司的心理压力正是其困难所在。创业公司仍然非常罕见。"
    },
    {
      "original": "Why don't more people do it? The financial risk? Plenty of 25 year olds save nothing anyway. The long hours? Plenty of people work just as long hours in regular jobs. What keeps people from starting startups is the fear of having so much responsibility.",
      "translated": "为什么没有更多的人去做？是因为经济风险吗？很多25岁的年轻人本来就没有储蓄。是因为工作时间长吗？很多人在普通工作中也工作同样长的时间。阻碍人们创办初创企业的是害怕承担太多的责任。"
    },
    {
      "original": "And this is not an irrational fear: it really is hard to bear. Anything that takes some of that weight off you will greatly increase your chances of surviving.A startup that reaches ramen profitability may be more likely to succeed than not.",
      "translated": "这并不是一种非理性的恐惧：确实很难承受。任何能够减轻你负担的事情都会大大增加你生存的几率。一家达到拉面盈利水平的初创公司可能比不达到的更有可能成功。"
    },
    {
      "original": "Which is pretty exciting, considering the bimodal distribution of outcomes in startups: you either fail or make a lot of money.The fourth advantage of ramen profitability is the least obvious but may be the most important.",
      "translated": "这非常令人兴奋，考虑到初创企业的结果呈现出双峰分布：要么失败，要么赚大钱。拉面盈利性的第四个优势虽然最不明显，但可能是最重要的。"
    },
    {
      "original": "If you don't need to raise money, you don't have to interrupt working on the company to do it.Raising money is terribly distracting. You're lucky if your productivity is a third of what it was before.",
      "translated": "如果你不需要筹集资金，就不用中断公司的运营去做这件事。筹集资金极其分散注意力。如果你的生产力还能保持在之前的三分之一，就已经很幸运了。"
    },
    {
      "original": "And it can last for months.I didn't understand (or rather, remember) precisely why raising money was so distracting till earlier this year. I'd noticed that startups we funded would usually grind to a halt when they switched to raising money, but I didn't remember exactly why till YC raised money itself.",
      "translated": "这可能会持续数月。直到今年早些时候，我才明白（或者说，记起）为什么筹资会如此分散注意力。我注意到，我们资助的创业公司在转向筹资时通常会陷入停滞，但直到YC自己筹资时，我才确切地记起其中的原因。"
    },
    {
      "original": "We had a comparatively easy time of it; the first people I asked said yes; but it took months to work out the details, and during that time I got hardly any real work done. Why? Because I thought about it all the time.At any given time there tends to be one problem that's the most urgent for a startup.",
      "translated": "我们相对轻松了一些；我问的第一批人就答应了；但花了几个月才敲定细节，在这段时间里，我几乎没有完成任何实质性的工作。为什么？因为我一直在想这件事。在任何时候，对于一家初创公司来说，总有一个问题是最紧迫的。"
    },
    {
      "original": "This is what you think about as you fall asleep at night and when you take a shower in the morning. And when you start raising money, that becomes the problem you think about. You only take one shower in the morning, and if you're thinking about investors during it, then you're not thinking about the product.Whereas if you can choose when you raise money, you can pick a time when you're not in the middle of something else, and you can probably also insist that the round close fast.",
      "translated": "这是你在夜晚入睡前和早晨淋浴时思考的问题。而当你开始筹集资金时，这就会成为你思考的问题。你早上只洗一次澡，如果你在这时思考的是投资者，那么你就不会去思考产品。而如果你可以选择筹集资金的时机，你可以选择一个你没有忙于其他事情的时间，并且你可能还能要求这轮融资快速完成。"
    },
    {
      "original": "You may even be able to avoid having the round occupy your thoughts, if you don't care whether it closes.* * *Ramen profitable means no more than the definition implies. It does not, for example, imply that you're \"bootstrapping\" the startup—that you're never going to take money from investors.",
      "translated": "你甚至可以避免让这轮融资占据你的思绪，如果你不在意它是否能够完成。* * *“拉面盈利”这个概念的含义仅限于字面意思。例如，它并不意味着你将“自力更生”地运营这家初创公司——即你永远不会从投资者那里拿钱。"
    },
    {
      "original": "Empirically that doesn't seem to work very well. Few startups succeed without taking investment. Maybe as startups get cheaper it will become more common. On the other hand, the money is there, waiting to be invested.",
      "translated": "实际上，这似乎效果不佳。很少有创业公司在不接受投资的情况下取得成功。也许随着创业成本的降低，这种情况会变得更加普遍。另一方面，资金已经存在，等待被投资。"
    },
    {
      "original": "If startups need it less, they'll be able to get it on better terms, which will make them more inclined to take it. That will tend to produce an equilibrium. [2]Another thing ramen profitability doesn't imply is Joe Kraus's idea that you should put your business model in beta when you put your product in beta.",
      "translated": "如果初创公司需要的资金减少，他们就能在更优惠的条件下获得资金，这将使他们更愿意接受资金。这将倾向于产生一种平衡状态。拉面盈利性并不意味着乔·克劳斯的观点，即当你把产品投入测试阶段时，也应该把商业模式投入测试阶段。"
    },
    {
      "original": "He believes you should get people to pay you from the beginning. I think that's too constraining. Facebook didn't, and they've done better than most startups. Making money right away was not only unnecessary for them, but probably would have been harmful.",
      "translated": "他认为你应该从一开始就让人们为你付费。我觉得这太局限了。Facebook 就没有这样做，而他们的表现比大多数初创公司都要好。对于 Facebook 来说，一开始就赚钱不仅没有必要，可能还会产生负面影响。"
    },
    {
      "original": "I do think Joe's rule could be useful for many startups, though. When founders seem unfocused, I sometimes suggest they try to get customers to pay them for something, in the hope that this constraint will prod them into action.The difference between Joe's idea and ramen profitability is that a ramen profitable company doesn't have to be making money the way it ultimately will.",
      "translated": "我认为乔的规则对许多初创公司来说确实有用。当创始人显得缺乏专注时，我有时会建议他们尝试让客户为某项服务付费，希望这种约束能促使他们采取行动。乔的想法与拉面盈利的区别在于，一家拉面盈利的公司并不一定要以最终实现盈利的方式来赚钱。"
    },
    {
      "original": "It just has to be making money. The most famous example is Google, which initially made money by licensing search to sites like Yahoo.Is there a downside to ramen profitability? Probably the biggest danger is that it might turn you into a consulting firm.",
      "translated": "它必须盈利。最著名的例子是谷歌，最初通过向雅虎等网站授权搜索技术来赚钱。拉面盈利模式有缺点吗？最大的风险可能是它可能会使你变成一家咨询公司。"
    },
    {
      "original": "Startups have to be product companies, in the sense of making a single thing that everyone uses. The defining quality of startups is that they grow fast, and consulting just can't scale the way a product can.",
      "translated": "初创公司必须是产品公司，也就是说要开发一个所有人都能使用的产品。初创公司的本质特征是快速增长，而咨询服务的扩展速度远不及产品。"
    },
    {
      "original": "[3] But it's pretty easy to make $3000 a month consulting; in fact, that would be a low rate for contract programming. So there could be a temptation to slide into consulting, and telling yourselves you're a ramen profitable startup, when in fact you're not a startup at all.It's ok to do a little consulting-type work at first.",
      "translated": "但每月赚3000美元的咨询费其实并不难；实际上，对于合同编程来说，这已经算是很低的费率了。因此，可能会有一种诱惑，让你滑向咨询工作，而自欺欺人地认为自己是一个能自负盈亏的初创公司，事实上你根本就不是初创公司。起初做一点咨询类型的工作是可以的。"
    },
    {
      "original": "Startups usually have to do something weird at first. But remember that ramen profitability is not the destination. A startup's destination is to grow really big; ramen profitability is a trick for not dying en route.Notes[1] The \"ramen\" in \"ramen profitable\" refers to instant ramen, which is just about the cheapest food available.Please do not take the term literally.",
      "translated": "初创公司通常一开始要做一些奇怪的事情。但请记住，拉面盈利并不是最终目标。初创公司的目标是变得非常大；拉面盈利只是一个防止途中夭折的技巧。注[1] “拉面盈利”中的“拉面”指的是方便面，几乎是市面上最便宜的食物。请不要将这个术语字面理解。"
    },
    {
      "original": "Living on instant ramen would be very unhealthy. Rice and beans are a better source of food. Start by investing in a rice cooker, if you don't have one.Rice and Beans for 2n olive oil or butter n yellow onions other fresh vegetables; experiment 3n cloves garlic n 12-oz cans white, kidney, or black beans n cubes Knorr beef or vegetable bouillon n teaspoons freshly ground black pepper 3n teaspoons ground cumin n cups dry rice, preferably brown Put rice in rice cooker.",
      "translated": "长期靠吃即食拉面生活会非常不健康。米饭和豆类是更好的食物来源。如果你还没有电饭煲，建议先投资买一个。以下是可供两人食用的米饭和豆类食谱：\n\n橄榄油或黄油\n1个黄洋葱\n其他新鲜蔬菜；可自由搭配\n3瓣大蒜\n1罐（12盎司）白豆、红豆或黑豆\n1块Knorr牛肉或蔬菜高汤块\n3茶匙现磨黑胡椒\n3茶匙孜然粉\n3杯干米，最好选用糙米\n\n将米放入电饭煲中。"
    },
    {
      "original": "Add water as specified on rice package. (Default: 2 cups water per cup of rice.) Turn on rice cooker and forget about it.Chop onions and other vegetables and fry in oil, over fairly low heat, till onions are glassy.",
      "translated": "根据大米包装上的说明加水。（默认：每杯大米加2杯水。）打开电饭煲，然后就不用管了。将洋葱和其他蔬菜切好，在油中用小火炒至洋葱透明。"
    },
    {
      "original": "Put in chopped garlic, pepper, cumin, and a little more fat, and stir. Keep heat low. Cook another 2 or 3 minutes, then add beans (don't drain the beans), and stir. Throw in the bouillon cube(s), cover, and cook on lowish heat for at least 10 minutes more.",
      "translated": "放入切碎的大蒜、胡椒、孜然和少许油脂，搅拌。保持小火。再煮2到3分钟，然后加入豆子（不要沥干豆子），搅拌。放入高汤块，盖上盖子，用小火至少再煮10分钟。"
    },
    {
      "original": "Stir vigilantly to avoid sticking.If you want to save money, buy beans in giant cans from discount stores. Spices are also much cheaper when bought in bulk. If there's an Indian grocery store near you, they'll have big bags of cumin for the same price as the little jars in supermarkets.[2] There's a good chance that a shift in power from investors to founders would actually increase the size of the venture business.",
      "translated": "要不断搅拌以避免粘锅。如果你想省钱，可以从折扣店购买大罐装的豆子。香料也是一样，批量购买会便宜得多。如果你附近有印度杂货店，他们出售的孜然大袋装价格会和超市里的小瓶装一样。[2] 有很大可能，权力从投资者向创始人转移实际上会增加风投业务的规模。"
    },
    {
      "original": "I think investors currently err too far on the side of being harsh to founders. If they were forced to stop, the whole venture business would work better, and you might see something like the increase in trade you always see when restrictive laws are removed.Investors are one of the biggest sources of pain for founders; if they stopped causing so much pain, it would be better to be a founder; and if it were better to be a founder, more people would do it.[3] It's conceivable that a startup could grow big by transforming consulting into a form that would scale.",
      "translated": "我认为投资者目前对创始人过于苛刻。如果他们能够停止这种行为，整个风险投资行业将会运作得更好，你可能会看到类似在取消限制性法律后贸易量增加的情况。投资者是创始人最大的痛苦来源之一；如果他们不再造成如此多的痛苦，成为创始人将会更好；而如果成为创始人更好，更多的人会选择这条路。[3] 有一家创业公司通过将咨询服务转化为可扩展的形式而变得壮大，这是可以想象的。"
    },
    {
      "original": "But if they did that they'd really be a product company.Thanks to Jessica Livingston for reading drafts of this.Japanese Translation",
      "translated": "但如果他们这样做，他们就真的会变成一家产品公司。感谢杰西卡·利文斯顿阅读本文的草稿。日文翻译"
    }
  ],
  "translation_completed": "2025-07-28T15:02:27.227981",
  "translation_stats": {
    "total_paragraphs": 35,
    "success_count": 35,
    "success_rate": "100.0%"
  }
}