{
  "title": "The Refragmentation",
  "title_zh": "[待翻译] The Refragmentation",
  "url": "https://www.paulgraham.com/re.html",
  "filename": "re.html",
  "date": "2016-01-01",
  "id": 115,
  "content": {
    "success": true,
    "paragraphs": [
      "January 2016One advantage of being old is that you can see change happen in your lifetime. A lot of the change I've seen is fragmentation. US politics is much more polarized than it used to be. Culturally we have ever less common ground.",
      "The creative class flocks to a handful of happy cities, abandoning the rest. And increasing economic inequality means the spread between rich and poor is growing too. I'd like to propose a hypothesis: that all these trends are instances of the same phenomenon.",
      "And moreover, that the cause is not some force that's pulling us apart, but rather the erosion of forces that had been pushing us together.Worse still, for those who worry about these trends, the forces that were pushing us together were an anomaly, a one-time combination of circumstances that's unlikely to be repeated — and indeed, that we would not want to repeat.The two forces were war (above all World War II), and the rise of large corporations.The effects of World War II were both economic and social.",
      "Economically, it decreased variation in income. Like all modern armed forces, America's were socialist economically. From each according to his ability, to each according to his need. More or less. Higher ranking members of the military got more (as higher ranking members of socialist societies always do), but what they got was fixed according to their rank.",
      "And the flattening effect wasn't limited to those under arms, because the US economy was conscripted too. Between 1942 and 1945 all wages were set by the National War Labor Board. Like the military, they defaulted to flatness.",
      "And this national standardization of wages was so pervasive that its effects could still be seen years after the war ended. [1]Business owners weren't supposed to be making money either. FDR said \"not a single war millionaire\" would be permitted.",
      "To ensure that, any increase in a company's profits over prewar levels was taxed at 85%. And when what was left after corporate taxes reached individuals, it was taxed again at a marginal rate of 93%.",
      "[2]Socially too the war tended to decrease variation. Over 16 million men and women from all sorts of different backgrounds were brought together in a way of life that was literally uniform. Service rates for men born in the early 1920s approached 80%.",
      "And working toward a common goal, often under stress, brought them still closer together.Though strictly speaking World War II lasted less than 4 years for the US, its effects lasted longer. Wars make central governments more powerful, and World War II was an extreme case of this.",
      "In the US, as in all the other Allied countries, the federal government was slow to give up the new powers it had acquired. Indeed, in some respects the war didn't end in 1945; the enemy just switched to the Soviet Union.",
      "In tax rates, federal power, defense spending, conscription, and nationalism, the decades after the war looked more like wartime than prewar peacetime. [3] And the social effects lasted too. The kid pulled into the army from behind a mule team in West Virginia didn't simply go back to the farm afterward.",
      "Something else was waiting for him, something that looked a lot like the army.If total war was the big political story of the 20th century, the big economic story was the rise of a new kind of company.",
      "And this too tended to produce both social and economic cohesion. [4]The 20th century was the century of the big, national corporation. General Electric, General Foods, General Motors. Developments in finance, communications, transportation, and manufacturing enabled a new type of company whose goal was above all scale.",
      "Version 1 of this world was low-res: a Duplo world of a few giant companies dominating each big market. [5]The late 19th and early 20th centuries had been a time of consolidation, led especially by J.",
      "P. Morgan. Thousands of companies run by their founders were merged into a couple hundred giant ones run by professional managers. Economies of scale ruled the day. It seemed to people at the time that this was the final state of things.",
      "John D. Rockefeller said in 1880 The day of combination is here to stay. Individualism has gone, never to return. He turned out to be mistaken, but he seemed right for the next hundred years.The consolidation that began in the late 19th century continued for most of the 20th.",
      "By the end of World War II, as Michael Lind writes, \"the major sectors of the economy were either organized as government-backed cartels or dominated by a few oligopolistic corporations.\"For consumers this new world meant the same choices everywhere, but only a few of them.",
      "When I grew up there were only 2 or 3 of most things, and since they were all aiming at the middle of the market there wasn't much to differentiate them.One of the most important instances of this phenomenon was in TV.",
      "Here there were 3 choices: NBC, CBS, and ABC. Plus public TV for eggheads and communists. The programs that the 3 networks offered were indistinguishable. In fact, here there was a triple pressure toward the center.",
      "If one show did try something daring, local affiliates in conservative markets would make them stop. Plus since TVs were expensive, whole families watched the same shows together, so they had to be suitable for everyone.And not only did everyone get the same thing, they got it at the same time.",
      "It's difficult to imagine now, but every night tens of millions of families would sit down together in front of their TV set watching the same show, at the same time, as their next door neighbors. What happens now with the Super Bowl used to happen every night.",
      "We were literally in sync. [6]In a way mid-century TV culture was good. The view it gave of the world was like you'd find in a children's book, and it probably had something of the effect that (parents hope) children's books have in making people behave better.",
      "But, like children's books, TV was also misleading. Dangerously misleading, for adults. In his autobiography, Robert MacNeil talks of seeing gruesome images that had just come in from Vietnam and thinking, we can't show these to families while they're having dinner.I know how pervasive the common culture was, because I tried to opt out of it, and it was practically impossible to find alternatives.",
      "When I was 13 I realized, more from internal evidence than any outside source, that the ideas we were being fed on TV were crap, and I stopped watching it. [7] But it wasn't just TV. It seemed like everything around me was crap.",
      "The politicians all saying the same things, the consumer brands making almost identical products with different labels stuck on to indicate how prestigious they were meant to be, the balloon-frame houses with fake \"colonial\" skins, the cars with several feet of gratuitous metal on each end that started to fall apart after a couple years, the \"red delicious\" apples that were red but only nominally apples.",
      "And in retrospect, it was crap. [8]But when I went looking for alternatives to fill this void, I found practically nothing. There was no Internet then. The only place to look was in the chain bookstore in our local shopping mall.",
      "[9] There I found a copy of The Atlantic. I wish I could say it became a gateway into a wider world, but in fact I found it boring and incomprehensible. Like a kid tasting whisky for the first time and pretending to like it, I preserved that magazine as carefully as if it had been a book.",
      "I'm sure I still have it somewhere. But though it was evidence that there was, somewhere, a world that wasn't red delicious, I didn't find it till college.It wasn't just as consumers that the big companies made us similar.",
      "They did as employers too. Within companies there were powerful forces pushing people toward a single model of how to look and act. IBM was particularly notorious for this, but they were only a little more extreme than other big companies.",
      "And the models of how to look and act varied little between companies. Meaning everyone within this world was expected to seem more or less the same. And not just those in the corporate world, but also everyone who aspired to it — which in the middle of the 20th century meant most people who weren't already in it.",
      "For most of the 20th century, working-class people tried hard to look middle class. You can see it in old photos. Few adults aspired to look dangerous in 1950.But the rise of national corporations didn't just compress us culturally.",
      "It compressed us economically too, and on both ends.Along with giant national corporations, we got giant national labor unions. And in the mid 20th century the corporations cut deals with the unions where they paid over market price for labor.",
      "Partly because the unions were monopolies. [10] Partly because, as components of oligopolies themselves, the corporations knew they could safely pass the cost on to their customers, because their competitors would have to as well.",
      "And partly because in mid-century most of the giant companies were still focused on finding new ways to milk economies of scale. Just as startups rightly pay AWS a premium over the cost of running their own servers so they can focus on growth, many of the big national corporations were willing to pay a premium for labor.",
      "[11]As well as pushing incomes up from the bottom, by overpaying unions, the big companies of the 20th century also pushed incomes down at the top, by underpaying their top management. Economist J. K.",
      "Galbraith wrote in 1967 that \"There are few corporations in which it would be suggested that executive salaries are at a maximum.\" [12]To some extent this was an illusion. Much of the de facto pay of executives never showed up on their income tax returns, because it took the form of perks.",
      "The higher the rate of income tax, the more pressure there was to pay employees upstream of it. (In the UK, where taxes were even higher than in the US, companies would even pay their kids' private school tuitions.) One of the most valuable things the big companies of the mid 20th century gave their employees was job security, and this too didn't show up in tax returns or income statistics.",
      "So the nature of employment in these organizations tended to yield falsely low numbers about economic inequality. But even accounting for that, the big companies paid their best people less than market price.",
      "There was no market; the expectation was that you'd work for the same company for decades if not your whole career. [13]Your work was so illiquid there was little chance of getting market price. But that same illiquidity also encouraged you not to seek it.",
      "If the company promised to employ you till you retired and give you a pension afterward, you didn't want to extract as much from it this year as you could. You needed to take care of the company so it could take care of you.",
      "Especially when you'd been working with the same group of people for decades. If you tried to squeeze the company for more money, you were squeezing the organization that was going to take care of them.",
      "Plus if you didn't put the company first you wouldn't be promoted, and if you couldn't switch ladders, promotion on this one was the only way up. [14]To someone who'd spent several formative years in the armed forces, this situation didn't seem as strange as it does to us now.",
      "From their point of view, as big company executives, they were high-ranking officers. They got paid a lot more than privates. They got to have expense account lunches at the best restaurants and fly around on the company's Gulfstreams.",
      "It probably didn't occur to most of them to ask if they were being paid market price.The ultimate way to get market price is to work for yourself, by starting your own company. That seems obvious to any ambitious person now.",
      "But in the mid 20th century it was an alien concept. Not because starting one's own company seemed too ambitious, but because it didn't seem ambitious enough. Even as late as the 1970s, when I grew up, the ambitious plan was to get lots of education at prestigious institutions, and then join some other prestigious institution and work one's way up the hierarchy.",
      "Your prestige was the prestige of the institution you belonged to. People did start their own businesses of course, but educated people rarely did, because in those days there was practically zero concept of starting what we now call a startup: a business that starts small and grows big.",
      "That was much harder to do in the mid 20th century. Starting one's own business meant starting a business that would start small and stay small. Which in those days of big companies often meant scurrying around trying to avoid being trampled by elephants.",
      "It was more prestigious to be one of the executive class riding the elephant.By the 1970s, no one stopped to wonder where the big prestigious companies had come from in the first place. It seemed like they'd always been there, like the chemical elements.",
      "And indeed, there was a double wall between ambitious kids in the 20th century and the origins of the big companies. Many of the big companies were roll-ups that didn't have clear founders. And when they did, the founders didn't seem like us.",
      "Nearly all of them had been uneducated, in the sense of not having been to college. They were what Shakespeare called rude mechanicals. College trained one to be a member of the professional classes.",
      "Its graduates didn't expect to do the sort of grubby menial work that Andrew Carnegie or Henry Ford started out doing. [15]And in the 20th century there were more and more college graduates. They increased from about 2% of the population in 1900 to about 25% in 2000.",
      "In the middle of the century our two big forces intersect, in the form of the GI Bill, which sent 2.2 million World War II veterans to college. Few thought of it in these terms, but the result of making college the canonical path for the ambitious was a world in which it was socially acceptable to work for Henry Ford, but not to be Henry Ford.",
      "[16]I remember this world well. I came of age just as it was starting to break up. In my childhood it was still dominant. Not quite so dominant as it had been. We could see from old TV shows and yearbooks and the way adults acted that people in the 1950s and 60s had been even more conformist than us.",
      "The mid-century model was already starting to get old. But that was not how we saw it at the time. We would at most have said that one could be a bit more daring in 1975 than 1965. And indeed, things hadn't changed much yet.But change was coming soon.",
      "And when the Duplo economy started to disintegrate, it disintegrated in several different ways at once. Vertically integrated companies literally dis-integrated because it was more efficient to. Incumbents faced new competitors as (a) markets went global and (b) technical innovation started to trump economies of scale, turning size from an asset into a liability.",
      "Smaller companies were increasingly able to survive as formerly narrow channels to consumers broadened. Markets themselves started to change faster, as whole new categories of products appeared. And last but not least, the federal government, which had previously smiled upon J.",
      "P. Morgan's world as the natural state of things, began to realize it wasn't the last word after all.What J. P. Morgan was to the horizontal axis, Henry Ford was to the vertical. He wanted to do everything himself.",
      "The giant plant he built at River Rouge between 1917 and 1928 literally took in iron ore at one end and sent cars out the other. 100,000 people worked there. At the time it seemed the future. But that is not how car companies operate today.",
      "Now much of the design and manufacturing happens in a long supply chain, whose products the car companies ultimately assemble and sell. The reason car companies operate this way is that it works better.",
      "Each company in the supply chain focuses on what they know best. And they each have to do it well or they can be swapped out for another supplier.Why didn't Henry Ford realize that networks of cooperating companies work better than a single big company?",
      "One reason is that supplier networks take a while to evolve. In 1917, doing everything himself seemed to Ford the only way to get the scale he needed. And the second reason is that if you want to solve a problem using a network of cooperating companies, you have to be able to coordinate their efforts, and you can do that much better with computers.",
      "Computers reduce the transaction costs that Coase argued are the raison d'etre of corporations. That is a fundamental change.In the early 20th century, big companies were synonymous with efficiency. In the late 20th century they were synonymous with inefficiency.",
      "To some extent this was because the companies themselves had become sclerotic. But it was also because our standards were higher.It wasn't just within existing industries that change occurred. The industries themselves changed.",
      "It became possible to make lots of new things, and sometimes the existing companies weren't the ones who did it best.Microcomputers are a classic example. The market was pioneered by upstarts like Apple.",
      "When it got big enough, IBM decided it was worth paying attention to. At the time IBM completely dominated the computer industry. They assumed that all they had to do, now that this market was ripe, was to reach out and pick it.",
      "Most people at the time would have agreed with them. But what happened next illustrated how much more complicated the world had become. IBM did launch a microcomputer. Though quite successful, it did not crush Apple.",
      "But even more importantly, IBM itself ended up being supplanted by a supplier coming in from the side — from software, which didn't even seem to be the same business. IBM's big mistake was to accept a non-exclusive license for DOS.",
      "It must have seemed a safe move at the time. No other computer manufacturer had ever been able to outsell them. What difference did it make if other manufacturers could offer DOS too? The result of that miscalculation was an explosion of inexpensive PC clones.",
      "Microsoft now owned the PC standard, and the customer. And the microcomputer business ended up being Apple vs Microsoft.Basically, Apple bumped IBM and then Microsoft stole its wallet. That sort of thing did not happen to big companies in mid-century.",
      "But it was going to happen increasingly often in the future.Change happened mostly by itself in the computer business. In other industries, legal obstacles had to be removed first. Many of the mid-century oligopolies had been anointed by the federal government with policies (and in wartime, large orders) that kept out competitors.",
      "This didn't seem as dubious to government officials at the time as it sounds to us. They felt a two-party system ensured sufficient competition in politics. It ought to work for business too.Gradually the government realized that anti-competitive policies were doing more harm than good, and during the Carter administration it started to remove them.",
      "The word used for this process was misleadingly narrow: deregulation. What was really happening was de-oligopolization. It happened to one industry after another. Two of the most visible to consumers were air travel and long-distance phone service, which both became dramatically cheaper after deregulation.Deregulation also contributed to the wave of hostile takeovers in the 1980s.",
      "In the old days the only limit on the inefficiency of companies, short of actual bankruptcy, was the inefficiency of their competitors. Now companies had to face absolute rather than relative standards.",
      "Any public company that didn't generate sufficient returns on its assets risked having its management replaced with one that would. Often the new managers did this by breaking companies up into components that were more valuable separately.",
      "[17]Version 1 of the national economy consisted of a few big blocks whose relationships were negotiated in back rooms by a handful of executives, politicians, regulators, and labor leaders. Version 2 was higher resolution: there were more companies, of more different sizes, making more different things, and their relationships changed faster.",
      "In this world there were still plenty of back room negotiations, but more was left to market forces. Which further accelerated the fragmentation.It's a little misleading to talk of versions when describing a gradual process, but not as misleading as it might seem.",
      "There was a lot of change in a few decades, and what we ended up with was qualitatively different. The companies in the S&P 500 in 1958 had been there an average of 61 years. By 2012 that number was 18 years.",
      "[18]The breakup of the Duplo economy happened simultaneously with the spread of computing power. To what extent were computers a precondition? It would take a book to answer that. Obviously the spread of computing power was a precondition for the rise of startups.",
      "I suspect it was for most of what happened in finance too. But was it a precondition for globalization or the LBO wave? I don't know, but I wouldn't discount the possibility. It may be that the refragmentation was driven by computers in the way the industrial revolution was driven by steam engines.",
      "Whether or not computers were a precondition, they have certainly accelerated it.The new fluidity of companies changed people's relationships with their employers. Why climb a corporate ladder that might be yanked out from under you?",
      "Ambitious people started to think of a career less as climbing a single ladder than as a series of jobs that might be at different companies. More movement (or even potential movement) between companies introduced more competition in salaries.",
      "Plus as companies became smaller it became easier to estimate how much an employee contributed to the company's revenue. Both changes drove salaries toward market price. And since people vary dramatically in productivity, paying market price meant salaries started to diverge.By no coincidence it was in the early 1980s that the term \"yuppie\" was coined.",
      "That word is not much used now, because the phenomenon it describes is so taken for granted, but at the time it was a label for something novel. Yuppies were young professionals who made lots of money.",
      "To someone in their twenties today, this wouldn't seem worth naming. Why wouldn't young professionals make lots of money? But until the 1980s, being underpaid early in your career was part of what it meant to be a professional.",
      "Young professionals were paying their dues, working their way up the ladder. The rewards would come later. What was novel about yuppies was that they wanted market price for the work they were doing now.The first yuppies did not work for startups.",
      "That was still in the future. Nor did they work for big companies. They were professionals working in fields like law, finance, and consulting. But their example rapidly inspired their peers. Once they saw that new BMW 325i, they wanted one too.Underpaying people at the beginning of their career only works if everyone does it.",
      "Once some employer breaks ranks, everyone else has to, or they can't get good people. And once started this process spreads through the whole economy, because at the beginnings of people's careers they can easily switch not merely employers but industries.But not all young professionals benefitted.",
      "You had to produce to get paid a lot. It was no coincidence that the first yuppies worked in fields where it was easy to measure that.More generally, an idea was returning whose name sounds old-fashioned precisely because it was so rare for so long: that you could make your fortune.",
      "As in the past there were multiple ways to do it. Some made their fortunes by creating wealth, and others by playing zero-sum games. But once it became possible to make one's fortune, the ambitious had to decide whether or not to.",
      "A physicist who chose physics over Wall Street in 1990 was making a sacrifice that a physicist in 1960 didn't have to think about.The idea even flowed back into big companies. CEOs of big companies make more now than they used to, and I think much of the reason is prestige.",
      "In 1960, corporate CEOs had immense prestige. They were the winners of the only economic game in town. But if they made as little now as they did then, in real dollar terms, they'd seem like small fry compared to professional athletes and whiz kids making millions from startups and hedge funds.",
      "They don't like that idea, so now they try to get as much as they can, which is more than they had been getting. [19]Meanwhile a similar fragmentation was happening at the other end of the economic scale.",
      "As big companies' oligopolies became less secure, they were less able to pass costs on to customers and thus less willing to overpay for labor. And as the Duplo world of a few big blocks fragmented into many companies of different sizes — some of them overseas — it became harder for unions to enforce their monopolies.",
      "As a result workers' wages also tended toward market price. Which (inevitably, if unions had been doing their job) tended to be lower. Perhaps dramatically so, if automation had decreased the need for some kind of work.And just as the mid-century model induced social as well as economic cohesion, its breakup brought social as well as economic fragmentation.",
      "People started to dress and act differently. Those who would later be called the \"creative class\" became more mobile. People who didn't care much for religion felt less pressure to go to church for appearances' sake, while those who liked it a lot opted for increasingly colorful forms.",
      "Some switched from meat loaf to tofu, and others to Hot Pockets. Some switched from driving Ford sedans to driving small imported cars, and others to driving SUVs. Kids who went to private schools or wished they did started to dress \"preppy,\" and kids who wanted to seem rebellious made a conscious effort to look disreputable.",
      "In a hundred ways people spread apart. [20]Almost four decades later, fragmentation is still increasing. Has it been net good or bad? I don't know; the question may be unanswerable. Not entirely bad though.",
      "We take for granted the forms of fragmentation we like, and worry only about the ones we don't. But as someone who caught the tail end of mid-century conformism, I can tell you it was no utopia. [21]My goal here is not to say whether fragmentation has been good or bad, just to explain why it's happening.",
      "With the centripetal forces of total war and 20th century oligopoly mostly gone, what will happen next? And more specifically, is it possible to reverse some of the fragmentation we've seen?If it is, it will have to happen piecemeal.",
      "You can't reproduce mid-century cohesion the way it was originally produced. It would be insane to go to war just to induce more national unity. And once you understand the degree to which the economic history of the 20th century was a low-res version 1, it's clear you can't reproduce that either.20th century cohesion was something that happened at least in a sense naturally.",
      "The war was due mostly to external forces, and the Duplo economy was an evolutionary phase. If you want cohesion now, you'd have to induce it deliberately. And it's not obvious how. I suspect the best we'll be able to do is address the symptoms of fragmentation.",
      "But that may be enough.The form of fragmentation people worry most about lately is economic inequality, and if you want to eliminate that you're up against a truly formidable headwind that has been in operation since the stone age.",
      "Technology.Technology is a lever. It magnifies work. And the lever not only grows increasingly long, but the rate at which it grows is itself increasing.Which in turn means the variation in the amount of wealth people can create has not only been increasing, but accelerating.",
      "The unusual conditions that prevailed in the mid 20th century masked this underlying trend. The ambitious had little choice but to join large organizations that made them march in step with lots of other people — literally in the case of the armed forces, figuratively in the case of big corporations.",
      "Even if the big corporations had wanted to pay people proportionate to their value, they couldn't have figured out how. But that constraint has gone now. Ever since it started to erode in the 1970s, we've seen the underlying forces at work again.",
      "[22]Not everyone who gets rich now does it by creating wealth, certainly. But a significant number do, and the Baumol Effect means all their peers get dragged along too. [23] And as long as it's possible to get rich by creating wealth, the default tendency will be for economic inequality to increase.",
      "Even if you eliminate all the other ways to get rich. You can mitigate this with subsidies at the bottom and taxes at the top, but unless taxes are high enough to discourage people from creating wealth, you're always going to be fighting a losing battle against increasing variation in productivity.",
      "[24]That form of fragmentation, like the others, is here to stay. Or rather, back to stay. Nothing is forever, but the tendency toward fragmentation should be more forever than most things, precisely because it's not due to any particular cause.",
      "It's simply a reversion to the mean. When Rockefeller said individualism was gone, he was right for a hundred years. It's back now, and that's likely to be true for longer.I worry that if we don't acknowledge this, we're headed for trouble.",
      "If we think 20th century cohesion disappeared because of few policy tweaks, we'll be deluded into thinking we can get it back (minus the bad parts, somehow) with a few countertweaks. And then we'll waste our time trying to eliminate fragmentation, when we'd be better off thinking about how to mitigate its consequences.",
      "Notes[1] Lester Thurow, writing in 1975, said the wage differentials prevailing at the end of World War II had become so embedded that they \"were regarded as 'just' even after the egalitarian pressures of World War II had disappeared.",
      "Basically, the same differentials exist to this day, thirty years later.\" But Goldin and Margo think market forces in the postwar period also helped preserve the wartime compression of wages — specifically increased demand for unskilled workers, and oversupply of educated ones.(Oddly enough, the American custom of having employers pay for health insurance derives from efforts by businesses to circumvent NWLB wage controls in order to attract workers.)[2] As always, tax rates don't tell the whole story.",
      "There were lots of exemptions, especially for individuals. And in World War II the tax codes were so new that the government had little acquired immunity to tax avoidance. If the rich paid high taxes during the war it was more because they wanted to than because they had to.After the war, federal tax receipts as a percentage of GDP were about the same as they are now.",
      "In fact, for the entire period since the war, tax receipts have stayed close to 18% of GDP, despite dramatic changes in tax rates. The lowest point occurred when marginal income tax rates were highest: 14.1% in 1950.",
      "Looking at the data, it's hard to avoid the conclusion that tax rates have had little effect on what people actually paid.[3] Though in fact the decade preceding the war had been a time of unprecedented federal power, in response to the Depression.",
      "Which is not entirely a coincidence, because the Depression was one of the causes of the war. In many ways the New Deal was a sort of dress rehearsal for the measures the federal government took during wartime.",
      "The wartime versions were much more drastic and more pervasive though. As Anthony Badger wrote, \"for many Americans the decisive change in their experiences came not with the New Deal but with World War II.\"[4] I don't know enough about the origins of the world wars to say, but it's not inconceivable they were connected to the rise of big corporations.",
      "If that were the case, 20th century cohesion would have a single cause.[5] More precisely, there was a bimodal economy consisting, in Galbraith's words, of \"the world of the technically dynamic, massively capitalized and highly organized corporations on the one hand and the hundreds of thousands of small and traditional proprietors on the other.\" Money, prestige, and power were concentrated in the former, and there was near zero crossover.[6] I wonder how much of the decline in families eating together was due to the decline in families watching TV together afterward.[7] I know when this happened because it was the season Dallas premiered.",
      "Everyone else was talking about what was happening on Dallas, and I had no idea what they meant.[8] I didn't realize it till I started doing research for this essay, but the meretriciousness of the products I grew up with is a well-known byproduct of oligopoly.",
      "When companies can't compete on price, they compete on tailfins.[9] Monroeville Mall was at the time of its completion in 1969 the largest in the country. In the late 1970s the movie Dawn of the Dead was shot there.",
      "Apparently the mall was not just the location of the movie, but its inspiration; the crowds of shoppers drifting through this huge mall reminded George Romero of zombies. My first job was scooping ice cream in the Baskin-Robbins.[10] Labor unions were exempted from antitrust laws by the Clayton Antitrust Act in 1914 on the grounds that a person's work is not \"a commodity or article of commerce.\" I wonder if that means service companies are also exempt.[11] The relationships between unions and unionized companies can even be symbiotic, because unions will exert political pressure to protect their hosts.",
      "According to Michael Lind, when politicians tried to attack the A&P supermarket chain because it was putting local grocery stores out of business, \"A&P successfully defended itself by allowing the unionization of its workforce in 1938, thereby gaining organized labor as a constituency.\" I've seen this phenomenon myself: hotel unions are responsible for more of the political pressure against Airbnb than hotel companies.[12] Galbraith was clearly puzzled that corporate executives would work so hard to make money for other people (the shareholders) instead of themselves.",
      "He devoted much of The New Industrial State to trying to figure this out.His theory was that professionalism had replaced money as a motive, and that modern corporate executives were, like (good) scientists, motivated less by financial rewards than by the desire to do good work and thereby earn the respect of their peers.",
      "There is something in this, though I think lack of movement between companies combined with self-interest explains much of observed behavior.[13] Galbraith (p. 94) says a 1952 study of the 800 highest paid executives at 300 big corporations found that three quarters of them had been with their company for more than 20 years.[14] It seems likely that in the first third of the 20th century executive salaries were low partly because companies then were more dependent on banks, who would have disapproved if executives got too much.",
      "This was certainly true in the beginning. The first big company CEOs were J. P. Morgan's hired hands.Companies didn't start to finance themselves with retained earnings till the 1920s. Till then they had to pay out their earnings in dividends, and so depended on banks for capital for expansion.",
      "Bankers continued to sit on corporate boards till the Glass-Steagall act in 1933.By mid-century big companies funded 3/4 of their growth from earnings. But the early years of bank dependence, reinforced by the financial controls of World War II, must have had a big effect on social conventions about executive salaries.",
      "So it may be that the lack of movement between companies was as much the effect of low salaries as the cause.Incidentally, the switch in the 1920s to financing growth with retained earnings was one cause of the 1929 crash.",
      "The banks now had to find someone else to lend to, so they made more margin loans.[15] Even now it's hard to get them to. One of the things I find hardest to get into the heads of would-be startup founders is how important it is to do certain kinds of menial work early in the life of a company.",
      "Doing things that don't scale is to how Henry Ford got started as a high-fiber diet is to the traditional peasant's diet: they had no choice but to do the right thing, while we have to make a conscious effort.[16] Founders weren't celebrated in the press when I was a kid.",
      "\"Our founder\" meant a photograph of a severe-looking man with a walrus mustache and a wing collar who had died decades ago. The thing to be when I was a kid was an executive. If you weren't around then it's hard to grasp the cachet that term had.",
      "The fancy version of everything was called the \"executive\" model.[17] The wave of hostile takeovers in the 1980s was enabled by a combination of circumstances: court decisions striking down state anti-takeover laws, starting with the Supreme Court's 1982 decision in Edgar v.",
      "MITE Corp.; the Reagan administration's comparatively sympathetic attitude toward takeovers; the Depository Institutions Act of 1982, which allowed banks and savings and loans to buy corporate bonds; a new SEC rule issued in 1982 (rule 415) that made it possible to bring corporate bonds to market faster; the creation of the junk bond business by Michael Milken; a vogue for conglomerates in the preceding period that caused many companies to be combined that never should have been; a decade of inflation that left many public companies trading below the value of their assets; and not least, the increasing complacency of managements.[18] Foster, Richard.",
      "\"Creative Destruction Whips through Corporate America.\" Innosight, February 2012.[19] CEOs of big companies may be overpaid. I don't know enough about big companies to say. But it is certainly not impossible for a CEO to make 200x as much difference to a company's revenues as the average employee.",
      "Look at what Steve Jobs did for Apple when he came back as CEO. It would have been a good deal for the board to give him 95% of the company. Apple's market cap the day Steve came back in July 1997 was 1.73 billion.",
      "5% of Apple now (January 2016) would be worth about 30 billion. And it would not be if Steve hadn't come back; Apple probably wouldn't even exist anymore.Merely including Steve in the sample might be enough to answer the question of whether public company CEOs in the aggregate are overpaid.",
      "And that is not as facile a trick as it might seem, because the broader your holdings, the more the aggregate is what you care about.[20] The late 1960s were famous for social upheaval. But that was more rebellion (which can happen in any era if people are provoked sufficiently) than fragmentation.",
      "You're not seeing fragmentation unless you see people breaking off to both left and right.[21] Globally the trend has been in the other direction. While the US is becoming more fragmented, the world as a whole is becoming less fragmented, and mostly in good ways.[22] There were a handful of ways to make a fortune in the mid 20th century.",
      "The main one was drilling for oil, which was open to newcomers because it was not something big companies could dominate through economies of scale. How did individuals accumulate large fortunes in an era of such high taxes?",
      "Giant tax loopholes defended by two of the most powerful men in Congress, Sam Rayburn and Lyndon Johnson.But becoming a Texas oilman was not in 1950 something one could aspire to the way starting a startup or going to work on Wall Street were in 2000, because (a) there was a strong local component and (b) success depended so much on luck.[23] The Baumol Effect induced by startups is very visible in Silicon Valley.",
      "Google will pay people millions of dollars a year to keep them from leaving to start or join startups.[24] I'm not claiming variation in productivity is the only cause of economic inequality in the US.",
      "But it's a significant cause, and it will become as big a cause as it needs to, in the sense that if you ban other ways to get rich, people who want to get rich will use this route instead.Thanks to Sam Altman, Trevor Blackwell, Paul Buchheit, Patrick Collison, Ron Conway, Chris Dixon, Benedict Evans, Richard Florida, Ben Horowitz, Jessica Livingston, Robert Morris, Tim O'Reilly, Geoff Ralston, Max Roser, Alexia Tsotsis, and Qasar Younis for reading drafts of this.",
      "Max also told me about several valuable sources.BibliographyAllen, Frederick Lewis. The Big Change. Harper, 1952.Averitt, Robert. The Dual Economy. Norton, 1968.Badger, Anthony. The New Deal. Hill and Wang, 1989.Bainbridge, John.",
      "The Super-Americans. Doubleday, 1961.Beatty, Jack. Collossus. Broadway, 2001.Brinkley, Douglas. Wheels for the World. Viking, 2003.Brownleee, W. Elliot. Federal Taxation in America. Cambridge, 1996.Chandler, Alfred.",
      "The Visible Hand. Harvard, 1977.Chernow, Ron. The House of Morgan. Simon & Schuster, 1990.Chernow, Ron. Titan: The Life of John D. Rockefeller. Random House, 1998.Galbraith, John. The New Industrial State.",
      "Houghton Mifflin, 1967.Goldin, Claudia and Robert A. Margo. \"The Great Compression: The Wage Structure in the United States at Mid-Century.\" NBER Working Paper 3817, 1991.Gordon, John. An Empire of Wealth.",
      "HarperCollins, 2004.Klein, Maury. The Genesis of Industrial America, 1870-1920. Cambridge, 2007.Lind, Michael. Land of Promise. HarperCollins, 2012.Mickelthwaite, John, and Adrian Wooldridge. The Company.",
      "Modern Library, 2003.Nasaw, David. Andrew Carnegie. Penguin, 2006.Sobel, Robert. The Age of Giant Corporations. Praeger, 1993.Thurow, Lester. Generating Inequality: Mechanisms of Distribution. Basic Books, 1975.Witte, John.",
      "The Politics and Development of the Federal Income Tax. Wisconsin, 1985.Related:Too Many Elite American Men Are Obsessed With Work and Wealth"
    ],
    "word_count": 7081,
    "paragraph_count": 148
  },
  "processed_at": "2025-07-26T19:05:07.765768",
  "paragraphs": [
    {
      "original": "January 2016One advantage of being old is that you can see change happen in your lifetime. A lot of the change I've seen is fragmentation. US politics is much more polarized than it used to be. Culturally we have ever less common ground.",
      "translated": "2016年1月\n\n变老的一个好处是，你可以在有生之年目睹变化的发生。我所见证的许多变化都是碎片化的。美国政治比过去更加两极分化。在文化上，我们越来越少有共同点。"
    },
    {
      "original": "The creative class flocks to a handful of happy cities, abandoning the rest. And increasing economic inequality means the spread between rich and poor is growing too. I'd like to propose a hypothesis: that all these trends are instances of the same phenomenon.",
      "translated": "创意阶层纷纷涌向少数几个充满活力的城市，而放弃了其他地方。随着经济不平等的加剧，贫富差距也在不断扩大。我想提出一个假设：所有这些趋势都是同一现象的不同表现。"
    },
    {
      "original": "And moreover, that the cause is not some force that's pulling us apart, but rather the erosion of forces that had been pushing us together.Worse still, for those who worry about these trends, the forces that were pushing us together were an anomaly, a one-time combination of circumstances that's unlikely to be repeated — and indeed, that we would not want to repeat.The two forces were war (above all World War II), and the rise of large corporations.The effects of World War II were both economic and social.",
      "translated": "而且，问题的根源并不是某种将我们分开的力量，而是那些曾经将我们聚在一起的力量在逐渐消逝。更糟糕的是，对于那些担心这些趋势的人来说，那些将我们聚在一起的力量是一种异常现象，是不太可能再次出现的一次性情况组合——事实上，我们也不希望这种情况重演。这两种力量分别是战争（尤其是第二次世界大战）和大型企业的崛起。第二次世界大战的影响既包括经济方面，也包括社会方面。"
    },
    {
      "original": "Economically, it decreased variation in income. Like all modern armed forces, America's were socialist economically. From each according to his ability, to each according to his need. More or less. Higher ranking members of the military got more (as higher ranking members of socialist societies always do), but what they got was fixed according to their rank.",
      "translated": "在经济上，它减少了收入的差异。像所有现代武装力量一样，美国的军队在经济上是社会主义的。各尽所能，按需分配。或多或少。军衔较高的成员得到的更多（正如社会主义社会中军衔较高的人总是如此），但他们所得是根据其军衔固定下来的。"
    },
    {
      "original": "And the flattening effect wasn't limited to those under arms, because the US economy was conscripted too. Between 1942 and 1945 all wages were set by the National War Labor Board. Like the military, they defaulted to flatness.",
      "translated": "而这种拉平效应并不仅限于军队中的人员，因为美国经济也被动员起来了。1942年至1945年间，所有工资都由国家战时劳工委员会设定。和军队一样，他们也倾向于平等。"
    },
    {
      "original": "And this national standardization of wages was so pervasive that its effects could still be seen years after the war ended. [1]Business owners weren't supposed to be making money either. FDR said \"not a single war millionaire\" would be permitted.",
      "translated": "这种全国范围的工资标准化影响深远，以至于战争结束后多年仍能见到其影响。[1]企业主也不被允许获利。罗斯福说，“不允许出现任何一个因战争而发家的百万富翁”。"
    },
    {
      "original": "To ensure that, any increase in a company's profits over prewar levels was taxed at 85%. And when what was left after corporate taxes reached individuals, it was taxed again at a marginal rate of 93%.",
      "translated": "为确保这一点，公司利润超过战前水平的部分被按85%的税率征税。而当公司税后剩余部分分配给个人时，又以93%的边际税率再次征税。"
    },
    {
      "original": "[2]Socially too the war tended to decrease variation. Over 16 million men and women from all sorts of different backgrounds were brought together in a way of life that was literally uniform. Service rates for men born in the early 1920s approached 80%.",
      "translated": "从社会角度来看，这场战争也倾向于减少差异。超过1600万来自各种不同背景的男女被以一种字面上来说是统一的方式聚集在一起。出生于20世纪20年代初的男性参军率接近80%。"
    },
    {
      "original": "And working toward a common goal, often under stress, brought them still closer together.Though strictly speaking World War II lasted less than 4 years for the US, its effects lasted longer. Wars make central governments more powerful, and World War II was an extreme case of this.",
      "translated": "为了共同的目标而工作，常常在压力之下，使他们更加紧密地团结在一起。尽管严格来说，美国参与第二次世界大战的时间不到4年，但其影响却更为持久。战争使中央政府的权力增强，而第二次世界大战在这方面是一个极端的例子。"
    },
    {
      "original": "In the US, as in all the other Allied countries, the federal government was slow to give up the new powers it had acquired. Indeed, in some respects the war didn't end in 1945; the enemy just switched to the Soviet Union.",
      "translated": "在美国，如同所有其他盟国一样，联邦政府迟迟不愿放弃其在战争中获得的新权力。事实上，在某些方面，战争在1945年并未结束；敌人只是换成了苏联。"
    },
    {
      "original": "In tax rates, federal power, defense spending, conscription, and nationalism, the decades after the war looked more like wartime than prewar peacetime. [3] And the social effects lasted too. The kid pulled into the army from behind a mule team in West Virginia didn't simply go back to the farm afterward.",
      "translated": "在税率、联邦权力、国防开支、征兵和民族主义方面，战后的几十年更像战时而不是战前的和平时期。[3] 社会效应也同样持久。从西弗吉尼亚的骡队中被征召入伍的年轻人，战后并没有简单地回到农场。"
    },
    {
      "original": "Something else was waiting for him, something that looked a lot like the army.If total war was the big political story of the 20th century, the big economic story was the rise of a new kind of company.",
      "translated": "还有其他事情在等着他，看起来很像军队。如果说20世纪最大的政治故事是全面战争，那么最大的经济故事就是一种新型公司的崛起。"
    },
    {
      "original": "And this too tended to produce both social and economic cohesion. [4]The 20th century was the century of the big, national corporation. General Electric, General Foods, General Motors. Developments in finance, communications, transportation, and manufacturing enabled a new type of company whose goal was above all scale.",
      "translated": "而这也有助于形成社会和经济的凝聚力。20世纪是大型国家公司的世纪。通用电气、通用食品、通用汽车。金融、通信、交通和制造业的发展使得一种新型公司得以出现，这些公司的首要目标是追求规模。"
    },
    {
      "original": "Version 1 of this world was low-res: a Duplo world of a few giant companies dominating each big market. [5]The late 19th and early 20th centuries had been a time of consolidation, led especially by J.",
      "translated": "这个世界版本1的分辨率很低：一个由几家巨型企业主导每个大市场的乐高大颗粒世界。19世纪末和20世纪初是整合的时代，尤其由J.领导。"
    },
    {
      "original": "P. Morgan. Thousands of companies run by their founders were merged into a couple hundred giant ones run by professional managers. Economies of scale ruled the day. It seemed to people at the time that this was the final state of things.",
      "translated": "P. 摩根。成千上万由创始人经营的公司被合并成由职业经理人管理的几百家大型企业。规模经济成为当时的主导。当时的人们认为，这将是最终的状态。"
    },
    {
      "original": "John D. Rockefeller said in 1880 The day of combination is here to stay. Individualism has gone, never to return. He turned out to be mistaken, but he seemed right for the next hundred years.The consolidation that began in the late 19th century continued for most of the 20th.",
      "translated": "约翰·D·洛克菲勒在1880年说：“联合的时代已经到来，个人主义已经消逝，永不复返。”他最终被证明是错的，但在接下来的一百年里，他似乎是对的。始于19世纪末的合并趋势在20世纪的大部分时间里持续存在。"
    },
    {
      "original": "By the end of World War II, as Michael Lind writes, \"the major sectors of the economy were either organized as government-backed cartels or dominated by a few oligopolistic corporations.\"For consumers this new world meant the same choices everywhere, but only a few of them.",
      "translated": "到第二次世界大战结束时，正如迈克尔·林德所写，“经济的主要部门要么被组织成政府支持的卡特尔，要么由少数几家寡头垄断公司主导。”对消费者来说，这个新世界意味着到处都是相同的选择，但选择却很少。"
    },
    {
      "original": "When I grew up there were only 2 or 3 of most things, and since they were all aiming at the middle of the market there wasn't much to differentiate them.One of the most important instances of this phenomenon was in TV.",
      "translated": "当我长大的时候，大多数东西都只有两三种，而且它们都瞄准了市场中间，所以彼此之间没有什么区别。这种现象的一个重要例子就是电视。"
    },
    {
      "original": "Here there were 3 choices: NBC, CBS, and ABC. Plus public TV for eggheads and communists. The programs that the 3 networks offered were indistinguishable. In fact, here there was a triple pressure toward the center.",
      "translated": "这里有三个选择：NBC、CBS 和 ABC。还有公共电视台，供知识分子和共产党人观看。这三家电视台提供的节目几乎没有什么区别。事实上，这里存在着一种向中间靠拢的三重压力。"
    },
    {
      "original": "If one show did try something daring, local affiliates in conservative markets would make them stop. Plus since TVs were expensive, whole families watched the same shows together, so they had to be suitable for everyone.And not only did everyone get the same thing, they got it at the same time.",
      "translated": "如果有某个节目尝试了一些大胆的内容，保守市场的当地附属电视台会让他们停止。此外，由于电视价格昂贵，全家人都会一起观看同一个节目，因此这些节目必须适合所有人。而且，不仅每个人看到的内容相同，他们还在同一时间观看。"
    },
    {
      "original": "It's difficult to imagine now, but every night tens of millions of families would sit down together in front of their TV set watching the same show, at the same time, as their next door neighbors. What happens now with the Super Bowl used to happen every night.",
      "translated": "现在很难想象，但曾经每晚有数千万家庭会聚在一起，坐在电视机前观看同一档节目，而且和他们的邻居们同时观看。现在只有在超级碗时才会出现的场景，曾经每晚都在发生。"
    },
    {
      "original": "We were literally in sync. [6]In a way mid-century TV culture was good. The view it gave of the world was like you'd find in a children's book, and it probably had something of the effect that (parents hope) children's books have in making people behave better.",
      "translated": "我们简直同步了。[6]从某种意义上说，上世纪中叶的电视文化是好的。它所展现的世界就像儿童书籍中描绘的一样，或许在某种程度上（就像父母希望的那样）让人们的举止更加得体。"
    },
    {
      "original": "But, like children's books, TV was also misleading. Dangerously misleading, for adults. In his autobiography, Robert MacNeil talks of seeing gruesome images that had just come in from Vietnam and thinking, we can't show these to families while they're having dinner.I know how pervasive the common culture was, because I tried to opt out of it, and it was practically impossible to find alternatives.",
      "translated": "但是，像儿童书籍一样，电视也具有误导性。对成人来说，这种误导是危险的。在其自传中，罗伯特·麦克尼尔谈到他看到刚从越南传来的惨烈画面时，心想，我们不能在人们吃晚餐时把这些画面播给家庭观众看。我知道这种共同文化是多么普遍，因为我曾试图摆脱它，却发现几乎不可能找到替代品。"
    },
    {
      "original": "When I was 13 I realized, more from internal evidence than any outside source, that the ideas we were being fed on TV were crap, and I stopped watching it. [7] But it wasn't just TV. It seemed like everything around me was crap.",
      "translated": "13岁那年，我意识到，更多的是从内在证据而非任何外部来源，我们从电视上接收到的那些观念都是垃圾，于是我不再看电视了。[7] 但不仅仅是电视。我周围的一切似乎都是垃圾。"
    },
    {
      "original": "The politicians all saying the same things, the consumer brands making almost identical products with different labels stuck on to indicate how prestigious they were meant to be, the balloon-frame houses with fake \"colonial\" skins, the cars with several feet of gratuitous metal on each end that started to fall apart after a couple years, the \"red delicious\" apples that were red but only nominally apples.",
      "translated": "政客们都在说同样的话，消费品牌生产几乎相同的产品，只是贴上不同的标签来标榜其尊严，用虚假的“殖民地”风格外皮装饰的木框架房屋，车头车尾多出几英尺多余的金属却在几年后开始解体，那些“红 Delicious”苹果虽红，却只是名义上的苹果。"
    },
    {
      "original": "And in retrospect, it was crap. [8]But when I went looking for alternatives to fill this void, I found practically nothing. There was no Internet then. The only place to look was in the chain bookstore in our local shopping mall.",
      "translated": "事后看来，那东西根本就是垃圾。[8]但当我试图寻找替代品来填补这一空白时，几乎一无所获。那时还没有互联网。唯一可以查阅的地方是当地购物中心里的连锁书店。"
    },
    {
      "original": "[9] There I found a copy of The Atlantic. I wish I could say it became a gateway into a wider world, but in fact I found it boring and incomprehensible. Like a kid tasting whisky for the first time and pretending to like it, I preserved that magazine as carefully as if it had been a book.",
      "translated": "在那里，我找到了一本《大西洋月刊》。我真希望它能成为我通往更广阔世界的大门，但实际上，我觉得它无聊且难以理解。就像一个孩子第一次尝威士忌却假装喜欢它一样，我小心翼翼地保存着那本杂志，仿佛它是一本书。"
    },
    {
      "original": "I'm sure I still have it somewhere. But though it was evidence that there was, somewhere, a world that wasn't red delicious, I didn't find it till college.It wasn't just as consumers that the big companies made us similar.",
      "translated": "我确定它还在某个地方。尽管它证明了在某个地方存在着一个并非红元的世界，但直到上大学我才找到它。大公司不仅作为消费者让我们变得相似。"
    },
    {
      "original": "They did as employers too. Within companies there were powerful forces pushing people toward a single model of how to look and act. IBM was particularly notorious for this, but they were only a little more extreme than other big companies.",
      "translated": "他们在雇主方面也是如此。在公司内部，有一种强大的力量推动人们朝着单一的外貌和行为模式发展。IBM在这方面尤为臭名昭著，但与其他大公司相比，他们只是稍微极端一些。"
    },
    {
      "original": "And the models of how to look and act varied little between companies. Meaning everyone within this world was expected to seem more or less the same. And not just those in the corporate world, but also everyone who aspired to it — which in the middle of the 20th century meant most people who weren't already in it.",
      "translated": "而且，关于如何表现和行事的模式在各家公司之间差异不大。这意味着在这个世界里的每个人都被期望看起来相差无几。不仅是那些在企业界的人，还包括所有向往它的人——而在20世纪中叶，这意味着大多数尚未进入该领域的人。"
    },
    {
      "original": "For most of the 20th century, working-class people tried hard to look middle class. You can see it in old photos. Few adults aspired to look dangerous in 1950.But the rise of national corporations didn't just compress us culturally.",
      "translated": "在20世纪的大部分时间里，工薪阶层的人们努力让自己看起来像中产阶级。从老照片中就能看出这一点。1950年，很少有成年人希望看起来危险。但国家公司的崛起不仅在文化上压缩了我们。"
    },
    {
      "original": "It compressed us economically too, and on both ends.Along with giant national corporations, we got giant national labor unions. And in the mid 20th century the corporations cut deals with the unions where they paid over market price for labor.",
      "translated": "它也在经济上对我们施加了压力，而且是双方面的。除了庞大的全国性公司，我们还有庞大的全国性工会。而在20世纪中叶，这些公司与工会达成了协议，支付的工资超过了市场价。"
    },
    {
      "original": "Partly because the unions were monopolies. [10] Partly because, as components of oligopolies themselves, the corporations knew they could safely pass the cost on to their customers, because their competitors would have to as well.",
      "translated": "部分是因为工会是垄断组织。[10] 部分是因为，作为寡头垄断企业的一部分，这些公司知道他们可以安全地将成本转嫁给消费者，因为他们的竞争对手也不得不这样做。"
    },
    {
      "original": "And partly because in mid-century most of the giant companies were still focused on finding new ways to milk economies of scale. Just as startups rightly pay AWS a premium over the cost of running their own servers so they can focus on growth, many of the big national corporations were willing to pay a premium for labor.",
      "translated": "而且，部分原因是到了20世纪中叶，大多数大型公司仍然专注于寻找新的方法来利用规模经济。就像初创公司为了专注于增长，合理地愿意为使用AWS支付高于自建服务器的成本一样，许多大型全国性公司也愿意为劳动力支付溢价。"
    },
    {
      "original": "[11]As well as pushing incomes up from the bottom, by overpaying unions, the big companies of the 20th century also pushed incomes down at the top, by underpaying their top management. Economist J. K.",
      "translated": "除了通过向工会超额支付来提高底层收入外，20世纪的大公司还通过向其高层管理人员支付不足来压低顶层收入。经济学家J. K."
    },
    {
      "original": "Galbraith wrote in 1967 that \"There are few corporations in which it would be suggested that executive salaries are at a maximum.\" [12]To some extent this was an illusion. Much of the de facto pay of executives never showed up on their income tax returns, because it took the form of perks.",
      "translated": "加尔布雷斯在1967年写道：“很少有公司会认为执行官的薪水已经达到了最高水平。”[12] 在一定程度上，这是一种错觉。许多高管的实际薪酬从未出现在他们的所得税申报表上，因为这些薪酬以福利的形式出现。"
    },
    {
      "original": "The higher the rate of income tax, the more pressure there was to pay employees upstream of it. (In the UK, where taxes were even higher than in the US, companies would even pay their kids' private school tuitions.) One of the most valuable things the big companies of the mid 20th century gave their employees was job security, and this too didn't show up in tax returns or income statistics.",
      "translated": "所得税率越高，向员工支付工资的压力就越大。（在英国，税收比美国更高，公司甚至会支付员工孩子的私立学校学费。）20世纪中叶的大公司为员工提供的最有价值的东西之一就是就业保障，而这一点在税务申报或收入统计数据中并未体现。"
    },
    {
      "original": "So the nature of employment in these organizations tended to yield falsely low numbers about economic inequality. But even accounting for that, the big companies paid their best people less than market price.",
      "translated": "因此，这些组织的就业性质往往导致关于经济不平等的数字被人为地低估。但即使考虑到这一点，大公司支付给最优秀员工的薪酬仍然低于市场价。"
    },
    {
      "original": "There was no market; the expectation was that you'd work for the same company for decades if not your whole career. [13]Your work was so illiquid there was little chance of getting market price. But that same illiquidity also encouraged you not to seek it.",
      "translated": "那时候没有人才市场；预期是你会在同一家公司工作几十年，甚至直到职业生涯结束。[13]你的工作流动性很差，几乎不可能获得市场价。但这种低流动性也促使你不去追求市场价。"
    },
    {
      "original": "If the company promised to employ you till you retired and give you a pension afterward, you didn't want to extract as much from it this year as you could. You needed to take care of the company so it could take care of you.",
      "translated": "如果公司承诺会雇佣你直到退休，并在之后给你发放养老金，你就不会想在今年尽可能多地从公司获取利益。你需要照顾公司，这样公司才能照顾你。"
    },
    {
      "original": "Especially when you'd been working with the same group of people for decades. If you tried to squeeze the company for more money, you were squeezing the organization that was going to take care of them.",
      "translated": "尤其是当你和同一群人共事了几十年。如果你试图从公司榨取更多的钱，你实际上是在压榨那个将来要照顾你们的组织。"
    },
    {
      "original": "Plus if you didn't put the company first you wouldn't be promoted, and if you couldn't switch ladders, promotion on this one was the only way up. [14]To someone who'd spent several formative years in the armed forces, this situation didn't seem as strange as it does to us now.",
      "translated": "而且，如果你不把公司放在第一位，你就不会得到晋升，如果你不能换跑道，那么在这个跑道上的晋升就是唯一的上升途径。[14]对于一个在军队度过了形成期的人来说，这种状况并不会像现在对我们看起来那么奇怪。"
    },
    {
      "original": "From their point of view, as big company executives, they were high-ranking officers. They got paid a lot more than privates. They got to have expense account lunches at the best restaurants and fly around on the company's Gulfstreams.",
      "translated": "从他们的角度来看，作为大公司的高管，他们是高层管理人员。他们的薪酬远高于普通员工。他们可以在最好的餐馆享受报销午餐，还可以乘坐公司的湾流公务机四处奔波。"
    },
    {
      "original": "It probably didn't occur to most of them to ask if they were being paid market price.The ultimate way to get market price is to work for yourself, by starting your own company. That seems obvious to any ambitious person now.",
      "translated": "他们大多数人可能都没有想到要问自己是否拿到了市场价格。获得市场价格的最终途径是为自己工作，创立自己的公司。这在现在看来，对任何有抱负的人来说都是显而易见的。"
    },
    {
      "original": "But in the mid 20th century it was an alien concept. Not because starting one's own company seemed too ambitious, but because it didn't seem ambitious enough. Even as late as the 1970s, when I grew up, the ambitious plan was to get lots of education at prestigious institutions, and then join some other prestigious institution and work one's way up the hierarchy.",
      "translated": "但在20世纪中叶，这还是一个陌生的概念。不是因为创办自己的公司显得太雄心勃勃，而是因为它显得不够雄心勃勃。即使到了20世纪70年代，我成长的年代，雄心勃勃的计划是到名牌院校接受大量教育，然后加入另一个声望显赫的机构，逐步在层级体系中晋升。"
    },
    {
      "original": "Your prestige was the prestige of the institution you belonged to. People did start their own businesses of course, but educated people rarely did, because in those days there was practically zero concept of starting what we now call a startup: a business that starts small and grows big.",
      "translated": "你的声望就是你所属机构的声望。当然，人们确实会自己创业，但受过教育的人很少这样做，因为在那个时代，几乎没有任何关于我们现在所说的创业公司的概念：从小做起，逐渐壮大的企业。"
    },
    {
      "original": "That was much harder to do in the mid 20th century. Starting one's own business meant starting a business that would start small and stay small. Which in those days of big companies often meant scurrying around trying to avoid being trampled by elephants.",
      "translated": "这在20世纪中叶要困难得多。独自创业意味着开办一个规模小且会保持小的生意。在那个大公司盛行的年代，这往往意味着要四处奔波，努力避免被“大象”踩踏。"
    },
    {
      "original": "It was more prestigious to be one of the executive class riding the elephant.By the 1970s, no one stopped to wonder where the big prestigious companies had come from in the first place. It seemed like they'd always been there, like the chemical elements.",
      "translated": "成为骑在大象上的执行阶层中的一员更为体面。到了20世纪70年代，已经没有人停下来思考这些大型知名公司最初是从哪里来的。它们似乎一直存在，就像化学元素一样。"
    },
    {
      "original": "And indeed, there was a double wall between ambitious kids in the 20th century and the origins of the big companies. Many of the big companies were roll-ups that didn't have clear founders. And when they did, the founders didn't seem like us.",
      "translated": "确实，20世纪有志向的年轻人与大公司起源之间存在着两道墙。许多大公司是通过合并形成的，没有明确的创始人。即使有创始人，他们也不像我们。"
    },
    {
      "original": "Nearly all of them had been uneducated, in the sense of not having been to college. They were what Shakespeare called rude mechanicals. College trained one to be a member of the professional classes.",
      "translated": "他们几乎都没有受过高等教育，也就是说没有上过大学。他们是莎士比亚所说的粗鄙的手艺人。大学培养的是专业人士。"
    },
    {
      "original": "Its graduates didn't expect to do the sort of grubby menial work that Andrew Carnegie or Henry Ford started out doing. [15]And in the 20th century there were more and more college graduates. They increased from about 2% of the population in 1900 to about 25% in 2000.",
      "translated": "它的毕业生们并不期望去做像安德鲁·卡内基或亨利·福特起初所做的那种卑微劳累的工作。[15]而在20世纪，大学毕业生的数量越来越多。从1900年的约占人口的2%增加到2000年的约25%。"
    },
    {
      "original": "In the middle of the century our two big forces intersect, in the form of the GI Bill, which sent 2.2 million World War II veterans to college. Few thought of it in these terms, but the result of making college the canonical path for the ambitious was a world in which it was socially acceptable to work for Henry Ford, but not to be Henry Ford.",
      "translated": "在本世纪中叶，我们的两大势力交汇在一起，形式就是《退伍军人法案》（GI Bill），该法案让220万二战退伍军人上了大学。尽管当时很少有人这样考虑，但让上大学成为有志之士的必经之路的结果是，社会上普遍认为为亨利·福特工作是可以接受的，但自己成为亨利·福特却不被接受。"
    },
    {
      "original": "[16]I remember this world well. I came of age just as it was starting to break up. In my childhood it was still dominant. Not quite so dominant as it had been. We could see from old TV shows and yearbooks and the way adults acted that people in the 1950s and 60s had been even more conformist than us.",
      "translated": "[16]我还记得这个世界。我成年时，它刚刚开始瓦解。在我童年时，它依然占据主导地位。虽然不像以前那么强势了。从旧电视剧、年鉴以及大人们的行为中，我们可以看出20世纪50年代和60年代的人们比我们更加循规蹈矩。"
    },
    {
      "original": "The mid-century model was already starting to get old. But that was not how we saw it at the time. We would at most have said that one could be a bit more daring in 1975 than 1965. And indeed, things hadn't changed much yet.But change was coming soon.",
      "translated": "中世纪的模式已经开始显得过时。但当时我们并不这么认为。顶多只会说1975年比1965年可以稍微大胆一些。确实，事情还没有多大变化。但变化即将来临。"
    },
    {
      "original": "And when the Duplo economy started to disintegrate, it disintegrated in several different ways at once. Vertically integrated companies literally dis-integrated because it was more efficient to. Incumbents faced new competitors as (a) markets went global and (b) technical innovation started to trump economies of scale, turning size from an asset into a liability.",
      "translated": "当杜普洛经济开始瓦解时，它以多种方式同时崩塌。垂直整合的企业因为这样做更有效率而实际上解体了。现有企业面临新的竞争对手，因为（a）市场全球化，（b）技术创新开始超越规模经济，使得规模从优势变成了劣势。"
    },
    {
      "original": "Smaller companies were increasingly able to survive as formerly narrow channels to consumers broadened. Markets themselves started to change faster, as whole new categories of products appeared. And last but not least, the federal government, which had previously smiled upon J.",
      "translated": "较小的公司越来越能够生存下去，因为以前狭窄的消费者渠道变得更为宽广。市场本身也开始更快地变化，因为全新的产品类别不断涌现。最后但同样重要的是，联邦政府，它以前对J. 微笑以待。"
    },
    {
      "original": "P. Morgan's world as the natural state of things, began to realize it wasn't the last word after all.What J. P. Morgan was to the horizontal axis, Henry Ford was to the vertical. He wanted to do everything himself.",
      "translated": "人们曾经将J. P. 摩根的世界视为自然的状态，但后来开始意识到事实并非如此。如果说J. P. 摩根代表了横向的发展，那么亨利·福特则代表了纵向的发展。他希望凡事都亲力亲为。"
    },
    {
      "original": "The giant plant he built at River Rouge between 1917 and 1928 literally took in iron ore at one end and sent cars out the other. 100,000 people worked there. At the time it seemed the future. But that is not how car companies operate today.",
      "translated": "他在1917年至1928年间在罗格河建造的这座巨型工厂，字面上是一端接收铁矿石，另一端输出汽车。有10万人在那里工作。当时，这似乎代表着未来。但如今，汽车公司已经不再这样运作了。"
    },
    {
      "original": "Now much of the design and manufacturing happens in a long supply chain, whose products the car companies ultimately assemble and sell. The reason car companies operate this way is that it works better.",
      "translated": "如今，许多设计和制造工作都在一个漫长的供应链中进行，汽车公司最终将这些产品组装并销售。汽车公司这样运作的原因是这种方式更有效。"
    },
    {
      "original": "Each company in the supply chain focuses on what they know best. And they each have to do it well or they can be swapped out for another supplier.Why didn't Henry Ford realize that networks of cooperating companies work better than a single big company?",
      "translated": "供应链中的每家公司都专注于自己最擅长的领域。而且他们每个人都必须做得很好，否则就会被其他供应商取代。为什么亨利·福特没有意识到合作的公司网络比单一的大公司更有效呢？"
    },
    {
      "original": "One reason is that supplier networks take a while to evolve. In 1917, doing everything himself seemed to Ford the only way to get the scale he needed. And the second reason is that if you want to solve a problem using a network of cooperating companies, you have to be able to coordinate their efforts, and you can do that much better with computers.",
      "translated": "一个原因是供应商网络的形成需要时间。1917年，福特认为只有自己亲力亲为才能达到他所需的规模。第二个原因是，如果你想通过一个合作公司网络来解决问题，就必须能够协调它们的努力，而使用计算机可以更好地实现这一点。"
    },
    {
      "original": "Computers reduce the transaction costs that Coase argued are the raison d'etre of corporations. That is a fundamental change.In the early 20th century, big companies were synonymous with efficiency. In the late 20th century they were synonymous with inefficiency.",
      "translated": "计算机降低了科斯所认为的企业存在的理由——交易成本。这是一个根本性的变化。在20世纪初，大公司等同于效率。而在20世纪末，它们则等同于低效率。"
    },
    {
      "original": "To some extent this was because the companies themselves had become sclerotic. But it was also because our standards were higher.It wasn't just within existing industries that change occurred. The industries themselves changed.",
      "translated": "在某种程度上，这是因为这些公司本身变得僵化。但这也因为我们对标准的要求更高了。变化不仅发生在现有行业内部，行业本身也在发生变化。"
    },
    {
      "original": "It became possible to make lots of new things, and sometimes the existing companies weren't the ones who did it best.Microcomputers are a classic example. The market was pioneered by upstarts like Apple.",
      "translated": "可以制造许多新的事物，而有时现有的公司并不是做得最好的。微型计算机就是一个典型的例子。这个市场是由像苹果这样的新兴公司开创的。"
    },
    {
      "original": "When it got big enough, IBM decided it was worth paying attention to. At the time IBM completely dominated the computer industry. They assumed that all they had to do, now that this market was ripe, was to reach out and pick it.",
      "translated": "当它变得足够大时，IBM认为值得对其加以关注。当时，IBM完全主导了计算机行业。他们以为现在这个市场已经成熟，他们只需要伸手去摘取就可以了。"
    },
    {
      "original": "Most people at the time would have agreed with them. But what happened next illustrated how much more complicated the world had become. IBM did launch a microcomputer. Though quite successful, it did not crush Apple.",
      "translated": "当时大多数人可能都会同意他们的观点。但接下来发生的事情揭示了世界变得多么复杂。IBM 确实推出了一台微型计算机。尽管非常成功，但它并没有击败苹果。"
    },
    {
      "original": "But even more importantly, IBM itself ended up being supplanted by a supplier coming in from the side — from software, which didn't even seem to be the same business. IBM's big mistake was to accept a non-exclusive license for DOS.",
      "translated": "但更重要的是，IBM 最终被一个来自侧面的供应商——软件公司所取代，而这个领域看上去甚至与 IBM 的主营业务截然不同。IBM 的重大失误在于接受了 DOS 的非独家许可。"
    },
    {
      "original": "It must have seemed a safe move at the time. No other computer manufacturer had ever been able to outsell them. What difference did it make if other manufacturers could offer DOS too? The result of that miscalculation was an explosion of inexpensive PC clones.",
      "translated": "当时这看起来似乎是一个安全的举措。没有其他计算机制造商能够超越他们的销量。其他制造商也能提供 DOS 又有什么关系？这一误判的结果是廉价的 PC 克隆机大量涌现。"
    },
    {
      "original": "Microsoft now owned the PC standard, and the customer. And the microcomputer business ended up being Apple vs Microsoft.Basically, Apple bumped IBM and then Microsoft stole its wallet. That sort of thing did not happen to big companies in mid-century.",
      "translated": "微软现在拥有了个人电脑的标准和客户。微型计算机业务最终变成了苹果对微软的局面。基本上，苹果把IBM挤出了市场，然后微软抢走了它的钱包。这种事情在20世纪中叶是不会发生在大公司身上的。"
    },
    {
      "original": "But it was going to happen increasingly often in the future.Change happened mostly by itself in the computer business. In other industries, legal obstacles had to be removed first. Many of the mid-century oligopolies had been anointed by the federal government with policies (and in wartime, large orders) that kept out competitors.",
      "translated": "但这种情况在未来将越来越频繁地发生。在计算机行业中，变化大多是由自身推动的。而在其他行业，首先需要消除法律障碍。许多中世纪的寡头垄断企业曾得到联邦政府政策的扶持（在战时还有大量订单），从而将竞争对手拒之门外。"
    },
    {
      "original": "This didn't seem as dubious to government officials at the time as it sounds to us. They felt a two-party system ensured sufficient competition in politics. It ought to work for business too.Gradually the government realized that anti-competitive policies were doing more harm than good, and during the Carter administration it started to remove them.",
      "translated": "这在当时并不像我们现在听起来那么可疑。政府官员认为，两党制确保了政治上的充分竞争。商业也应该如此。渐渐地，政府意识到反竞争政策弊大于利，于是在卡特政府时期开始废除这些政策。"
    },
    {
      "original": "The word used for this process was misleadingly narrow: deregulation. What was really happening was de-oligopolization. It happened to one industry after another. Two of the most visible to consumers were air travel and long-distance phone service, which both became dramatically cheaper after deregulation.Deregulation also contributed to the wave of hostile takeovers in the 1980s.",
      "translated": "用于描述这一过程的词语有些误导性地狭隘：去监管。实际上发生的是去寡头垄断。这一过程在各行各业相继发生。对消费者来说，最显而易见的两个行业是航空旅行和长途电话服务，这两个行业在去监管后价格大幅下降。去监管还促成了20世纪80年代敌意收购的浪潮。"
    },
    {
      "original": "In the old days the only limit on the inefficiency of companies, short of actual bankruptcy, was the inefficiency of their competitors. Now companies had to face absolute rather than relative standards.",
      "translated": "过去，除非公司真的破产，否则它们的低效率唯一的限制就是竞争对手的低效率。现在，公司必须面对的是绝对标准，而不再是相对标准。"
    },
    {
      "original": "Any public company that didn't generate sufficient returns on its assets risked having its management replaced with one that would. Often the new managers did this by breaking companies up into components that were more valuable separately.",
      "translated": "任何未能为其资产带来足够回报的上市公司都面临着被管理层更替的风险，而新的管理层通常会通过将公司拆分为更有价值的独立部分来实现这一目标。"
    },
    {
      "original": "[17]Version 1 of the national economy consisted of a few big blocks whose relationships were negotiated in back rooms by a handful of executives, politicians, regulators, and labor leaders. Version 2 was higher resolution: there were more companies, of more different sizes, making more different things, and their relationships changed faster.",
      "translated": "[17]国家经济的1.0版本由几个大型板块组成，它们之间的关系由少数高管、政客、监管者和劳工领袖在幕后协商确定。2.0版本则更为精细：公司数量更多，规模更加多样，生产的产品种类更丰富，且它们之间的关系变化更快。"
    },
    {
      "original": "In this world there were still plenty of back room negotiations, but more was left to market forces. Which further accelerated the fragmentation.It's a little misleading to talk of versions when describing a gradual process, but not as misleading as it might seem.",
      "translated": "在这个世界上，仍然有许多幕后谈判，但更多的事情交由市场力量决定。这进一步加速了碎片化。用“版本”来形容一个渐进的过程有点误导，但也没有看起来那么误导。"
    },
    {
      "original": "There was a lot of change in a few decades, and what we ended up with was qualitatively different. The companies in the S&P 500 in 1958 had been there an average of 61 years. By 2012 that number was 18 years.",
      "translated": "数十年间发生了许多变化，最终的结果在性质上有所不同。1958年，标准普尔500指数中的公司平均已存在61年。到2012年，这一数字缩短为18年。"
    },
    {
      "original": "[18]The breakup of the Duplo economy happened simultaneously with the spread of computing power. To what extent were computers a precondition? It would take a book to answer that. Obviously the spread of computing power was a precondition for the rise of startups.",
      "translated": "[18]杜普洛经济的解体与计算能力的普及同时发生。计算机在多大程度上是先决条件？这需要写一本书来回答。显然，计算能力的普及是初创企业崛起的先决条件。"
    },
    {
      "original": "I suspect it was for most of what happened in finance too. But was it a precondition for globalization or the LBO wave? I don't know, but I wouldn't discount the possibility. It may be that the refragmentation was driven by computers in the way the industrial revolution was driven by steam engines.",
      "translated": "我怀疑金融领域发生的事情大多也是如此。但这是否是全球化或杠杆收购浪潮的先决条件呢？我不知道，但我不会排除这种可能性。碎片化可能确实是由计算机推动的，就像工业革命是由蒸汽机推动的一样。"
    },
    {
      "original": "Whether or not computers were a precondition, they have certainly accelerated it.The new fluidity of companies changed people's relationships with their employers. Why climb a corporate ladder that might be yanked out from under you?",
      "translated": "无论计算机是否是先决条件，它们无疑加速了这一进程。公司的新流动性改变了人们与雇主之间的关系。为什么要攀登一个可能随时被抽走的公司阶梯呢？"
    },
    {
      "original": "Ambitious people started to think of a career less as climbing a single ladder than as a series of jobs that might be at different companies. More movement (or even potential movement) between companies introduced more competition in salaries.",
      "translated": "有抱负的人开始将职业发展视为一系列可能在不同公司进行的工作，而不仅仅是一步步攀登同一架梯子。公司间的更多流动（或潜在流动）引入了薪酬竞争。"
    },
    {
      "original": "Plus as companies became smaller it became easier to estimate how much an employee contributed to the company's revenue. Both changes drove salaries toward market price. And since people vary dramatically in productivity, paying market price meant salaries started to diverge.By no coincidence it was in the early 1980s that the term \"yuppie\" was coined.",
      "translated": "此外，随着公司规模的缩小，估算员工对公司收入的贡献变得更加容易。这两种变化推动了薪资向市场价格靠拢。由于人们的生产率差异巨大，按市场价格支付薪资意味着薪资开始出现分化。毫不奇怪，“雅皮士”这个术语是在20世纪80年代初被创造出来的。"
    },
    {
      "original": "That word is not much used now, because the phenomenon it describes is so taken for granted, but at the time it was a label for something novel. Yuppies were young professionals who made lots of money.",
      "translated": "这个词现在不怎么用了，因为其所描述的现象已经习以为常，但在当时，它是指一种新颖的现象。雅皮士是那些收入颇丰的年轻专业人士。"
    },
    {
      "original": "To someone in their twenties today, this wouldn't seem worth naming. Why wouldn't young professionals make lots of money? But until the 1980s, being underpaid early in your career was part of what it meant to be a professional.",
      "translated": "对于今天二十多岁的人来说，这似乎不值得特意提及。为什么年轻的专业人士不能赚很多钱呢？但在1980年代之前，职业生涯早期收入较低是成为专业人士的一部分含义。"
    },
    {
      "original": "Young professionals were paying their dues, working their way up the ladder. The rewards would come later. What was novel about yuppies was that they wanted market price for the work they were doing now.The first yuppies did not work for startups.",
      "translated": "年轻的专业人士在为自己的职业道路付出代价，逐步向上爬。奖励会在后来到来。而雅皮士的新颖之处在于，他们希望现在所做的工作能够得到市场价格的报酬。第一代雅皮士并不是在初创公司工作的。"
    },
    {
      "original": "That was still in the future. Nor did they work for big companies. They were professionals working in fields like law, finance, and consulting. But their example rapidly inspired their peers. Once they saw that new BMW 325i, they wanted one too.Underpaying people at the beginning of their career only works if everyone does it.",
      "translated": "那都还在未来。他们也不为大公司工作。他们是法律、金融和咨询等领域的专业人士。但他们的例子很快激励了同行。一旦看到了那辆新的宝马325i，他们也想要一辆。在职业生涯初期少付薪酬只有在大家都这么做的情况下才有效。"
    },
    {
      "original": "Once some employer breaks ranks, everyone else has to, or they can't get good people. And once started this process spreads through the whole economy, because at the beginnings of people's careers they can easily switch not merely employers but industries.But not all young professionals benefitted.",
      "translated": "一旦有雇主打破常规，其他雇主也必须跟进，否则他们就无法吸引到优秀的人才。而这一过程一旦开始，就会在整个经济体系中蔓延，因为在职业生涯的初期，人们很容易不仅更换雇主，甚至更换行业。但并非所有年轻专业人士都能从中受益。"
    },
    {
      "original": "You had to produce to get paid a lot. It was no coincidence that the first yuppies worked in fields where it was easy to measure that.More generally, an idea was returning whose name sounds old-fashioned precisely because it was so rare for so long: that you could make your fortune.",
      "translated": "你必须有所产出才能获得丰厚的报酬。第一批雅皮士从事的领域很容易衡量这一点，并非巧合。更广泛地说，一个想法正在回归，它的名称听起来有些过时，恰恰是因为它曾长时间如此罕见：你可以发家致富。"
    },
    {
      "original": "As in the past there were multiple ways to do it. Some made their fortunes by creating wealth, and others by playing zero-sum games. But once it became possible to make one's fortune, the ambitious had to decide whether or not to.",
      "translated": "过去，实现这一目标的方法多种多样。有些人通过创造财富发家致富，而另一些人则通过零和游戏获利。但一旦发财的机会出现，有抱负的人就必须决定是否要抓住这个机会。"
    },
    {
      "original": "A physicist who chose physics over Wall Street in 1990 was making a sacrifice that a physicist in 1960 didn't have to think about.The idea even flowed back into big companies. CEOs of big companies make more now than they used to, and I think much of the reason is prestige.",
      "translated": "1990年，一位物理学家选择了物理学而不是华尔街，这是一场1960年的物理学家不必考虑的牺牲。这种观念甚至反向流入了大公司。现在，大公司的首席执行官比过去赚得更多，我认为其中很大一部分原因是声望。"
    },
    {
      "original": "In 1960, corporate CEOs had immense prestige. They were the winners of the only economic game in town. But if they made as little now as they did then, in real dollar terms, they'd seem like small fry compared to professional athletes and whiz kids making millions from startups and hedge funds.",
      "translated": "1960年，企业首席执行官们享有极高的声望。他们是当时经济领域的唯一赢家。但如果他们现在的实际收入与当时一样低，与赚取数百万美元的职业运动员和创业公司及对冲基金的天才相比，他们就会显得微不足道。"
    },
    {
      "original": "They don't like that idea, so now they try to get as much as they can, which is more than they had been getting. [19]Meanwhile a similar fragmentation was happening at the other end of the economic scale.",
      "translated": "他们不喜欢那个主意，所以现在他们试图获取尽可能多的，这比他们以前得到的还要多。[19]同时，在经济规模的另一端也发生了类似的分化。"
    },
    {
      "original": "As big companies' oligopolies became less secure, they were less able to pass costs on to customers and thus less willing to overpay for labor. And as the Duplo world of a few big blocks fragmented into many companies of different sizes — some of them overseas — it became harder for unions to enforce their monopolies.",
      "translated": "随着大型公司寡头垄断地位的减弱，它们越来越无法将成本转嫁给消费者，因此也不再愿意为劳动力支付过高薪酬。而随着由几家大型企业主导的市场格局分化为众多不同规模的公司——其中一些位于海外——工会维持其垄断地位也变得更加困难。"
    },
    {
      "original": "As a result workers' wages also tended toward market price. Which (inevitably, if unions had been doing their job) tended to be lower. Perhaps dramatically so, if automation had decreased the need for some kind of work.And just as the mid-century model induced social as well as economic cohesion, its breakup brought social as well as economic fragmentation.",
      "translated": "因此，工人的工资也趋向于市场价格。这（如果工会尽到了职责的话，是不可避免的）往往会更低。如果自动化减少了对某种工作的需求，这种下降可能会非常显著。正如中世纪的模式促进了社会和经济的凝聚力，其瓦解也带来了社会和经济的分裂。"
    },
    {
      "original": "People started to dress and act differently. Those who would later be called the \"creative class\" became more mobile. People who didn't care much for religion felt less pressure to go to church for appearances' sake, while those who liked it a lot opted for increasingly colorful forms.",
      "translated": "人们开始穿着和行为不同。那些后来被称为“创意阶层”的人变得更加流动。对于宗教不太在意的人感到去教堂做样子的压力减少了，而那些非常喜欢宗教的人则选择了越来越多彩多姿的形式。"
    },
    {
      "original": "Some switched from meat loaf to tofu, and others to Hot Pockets. Some switched from driving Ford sedans to driving small imported cars, and others to driving SUVs. Kids who went to private schools or wished they did started to dress \"preppy,\" and kids who wanted to seem rebellious made a conscious effort to look disreputable.",
      "translated": "有些人从吃肉 loaf 转向吃豆腐，还有些人转向吃 Hot Pockets。有些人从驾驶福特轿车转为驾驶小型进口车，还有些人转为驾驶 SUV。那些上私立学校或希望上私立学校的孩子开始穿得“预备学校”风格，而那些想要显得叛逆的孩子则刻意打扮得不可靠。"
    },
    {
      "original": "In a hundred ways people spread apart. [20]Almost four decades later, fragmentation is still increasing. Has it been net good or bad? I don't know; the question may be unanswerable. Not entirely bad though.",
      "translated": "人们以各种方式分道扬镳。[20]近四十年后，分化仍在加剧。这总体上是好事还是坏事？我不知道；这个问题可能无解。不过，也不完全是坏事。"
    },
    {
      "original": "We take for granted the forms of fragmentation we like, and worry only about the ones we don't. But as someone who caught the tail end of mid-century conformism, I can tell you it was no utopia. [21]My goal here is not to say whether fragmentation has been good or bad, just to explain why it's happening.",
      "translated": "我们理所当然地接受我们喜欢的碎片化形式，而只担心那些我们不喜欢的。但是，作为20世纪中期同质化时代的末期见证者，我可以告诉你，那并不是乌托邦。[21] 我在这里的目的不是评价碎片化是好是坏，只是解释为什么它会发生。"
    },
    {
      "original": "With the centripetal forces of total war and 20th century oligopoly mostly gone, what will happen next? And more specifically, is it possible to reverse some of the fragmentation we've seen?If it is, it will have to happen piecemeal.",
      "translated": "随着全面战争和20世纪寡头垄断的向心力大部分消失，接下来会发生什么？更具体地说，我们能否逆转已经出现的一些分裂？如果可以，这将不得不逐步进行。"
    },
    {
      "original": "You can't reproduce mid-century cohesion the way it was originally produced. It would be insane to go to war just to induce more national unity. And once you understand the degree to which the economic history of the 20th century was a low-res version 1, it's clear you can't reproduce that either.20th century cohesion was something that happened at least in a sense naturally.",
      "translated": "你无法像当初那样再现中世纪的凝聚力。为了增强国家团结而发动战争将是疯狂的。一旦你理解了20世纪经济历史在很大程度上是一个低分辨率的版本，你就会明白也无法再现那个时代的凝聚力。20世纪的凝聚力在某种程度上是自然发生的。"
    },
    {
      "original": "The war was due mostly to external forces, and the Duplo economy was an evolutionary phase. If you want cohesion now, you'd have to induce it deliberately. And it's not obvious how. I suspect the best we'll be able to do is address the symptoms of fragmentation.",
      "translated": "这场战争主要是由于外部力量引起的，而杜普洛经济只是一个进化阶段。如果你想现在实现团结，就必须有意为之。而且，如何实现这一点并不明显。我怀疑我们能做到的最好也只是解决分裂的症状。"
    },
    {
      "original": "But that may be enough.The form of fragmentation people worry most about lately is economic inequality, and if you want to eliminate that you're up against a truly formidable headwind that has been in operation since the stone age.",
      "translated": "但这可能已经足够。人们最近最为担忧的分裂形式是经济不平等，而如果你想消除这种不平等，你将面临一个自石器时代以来就存在的真正强大的阻力。"
    },
    {
      "original": "Technology.Technology is a lever. It magnifies work. And the lever not only grows increasingly long, but the rate at which it grows is itself increasing.Which in turn means the variation in the amount of wealth people can create has not only been increasing, but accelerating.",
      "translated": "技术。技术是一种杠杆。它放大了工作效果。而且这个杠杆不仅越来越长，其增长的速度本身也在加快。这反过来意味着人们能够创造的财富量的差异不仅在增加，而且在加速增加。"
    },
    {
      "original": "The unusual conditions that prevailed in the mid 20th century masked this underlying trend. The ambitious had little choice but to join large organizations that made them march in step with lots of other people — literally in the case of the armed forces, figuratively in the case of big corporations.",
      "translated": "20世纪中叶的特殊状况掩盖了这一潜在趋势。有抱负的人别无选择，只能加入大型组织，与许多人步调一致——在武装部队中是字面意义上的，在大型企业中则是比喻意义上的。"
    },
    {
      "original": "Even if the big corporations had wanted to pay people proportionate to their value, they couldn't have figured out how. But that constraint has gone now. Ever since it started to erode in the 1970s, we've seen the underlying forces at work again.",
      "translated": "即使大型企业想要根据人们的价值来支付报酬，他们也无法做到。但这一限制现在已经不复存在。自20世纪70年代开始瓦解以来，我们再次看到了这些基本力量在起作用。"
    },
    {
      "original": "[22]Not everyone who gets rich now does it by creating wealth, certainly. But a significant number do, and the Baumol Effect means all their peers get dragged along too. [23] And as long as it's possible to get rich by creating wealth, the default tendency will be for economic inequality to increase.",
      "translated": "[22]当然，并不是所有现在变得富有的人都通过创造财富来实现。但确实有一部分人是这样做的，而鲍莫尔效应意味着他们的同行也会被带动起来。[23] 只要通过创造财富可以变得富有，经济不平等的默认趋势就会是增加的。"
    },
    {
      "original": "Even if you eliminate all the other ways to get rich. You can mitigate this with subsidies at the bottom and taxes at the top, but unless taxes are high enough to discourage people from creating wealth, you're always going to be fighting a losing battle against increasing variation in productivity.",
      "translated": "即使你消除了所有其他致富的途径。你可以通过向底层提供补贴和对顶层征税来缓解这种情况，但除非税率高到足以抑制人们创造财富的积极性，否则你始终会在与日益增长的生产力差异作斗争中处于不利地位。"
    },
    {
      "original": "[24]That form of fragmentation, like the others, is here to stay. Or rather, back to stay. Nothing is forever, but the tendency toward fragmentation should be more forever than most things, precisely because it's not due to any particular cause.",
      "translated": "[24]那种形式的分裂，像其他形式一样，将会长期存在。或者更准确地说，将再次长期存在。没有什么是永恒的，但分裂的倾向应该比大多数事情更接近永恒，正是因为这种倾向并非由任何特定原因造成。"
    },
    {
      "original": "It's simply a reversion to the mean. When Rockefeller said individualism was gone, he was right for a hundred years. It's back now, and that's likely to be true for longer.I worry that if we don't acknowledge this, we're headed for trouble.",
      "translated": "这只不过是均值回归。当洛克菲勒说个人主义已经消失时，他的观点在一百年间是正确的。现在个人主义又回来了，而且这种状态可能会持续更长时间。我担心如果我们不承认这一点，我们将面临麻烦。"
    },
    {
      "original": "If we think 20th century cohesion disappeared because of few policy tweaks, we'll be deluded into thinking we can get it back (minus the bad parts, somehow) with a few countertweaks. And then we'll waste our time trying to eliminate fragmentation, when we'd be better off thinking about how to mitigate its consequences.",
      "translated": "如果我们认为20世纪的社会凝聚力消失是因为少数政策调整，那么我们会误以为可以通过一些反向调整（ somehow 减去那些不好的部分）来恢复它。然后，我们将浪费时间试图消除分裂，而实际上我们应该考虑的是如何减轻其后果。"
    },
    {
      "original": "Notes[1] Lester Thurow, writing in 1975, said the wage differentials prevailing at the end of World War II had become so embedded that they \"were regarded as 'just' even after the egalitarian pressures of World War II had disappeared.",
      "translated": "注释[1] 莱斯特· Thurow 在1975年写道，第二次世界大战结束时的工资差异已经变得如此根深蒂固，以至于“即使在第二次世界大战的平等压力消失之后，这些差异仍被视为‘公正’的。”"
    },
    {
      "original": "Basically, the same differentials exist to this day, thirty years later.\" But Goldin and Margo think market forces in the postwar period also helped preserve the wartime compression of wages — specifically increased demand for unskilled workers, and oversupply of educated ones.(Oddly enough, the American custom of having employers pay for health insurance derives from efforts by businesses to circumvent NWLB wage controls in order to attract workers.)[2] As always, tax rates don't tell the whole story.",
      "translated": "基本上，这些差异至今仍存在，三十年过去了。”但高汀和马戈认为，战后时期的市场力量也有助于保持战时工资的压缩——具体来说，对非技术工人的需求增加，而受过教育的工人则供过于求。（有趣的是，美国雇主为员工支付健康保险的习俗，源于企业试图绕过 NWLB 工资管制以吸引工人的努力。）[2] 像往常一样，税率并不能说明全部问题。"
    },
    {
      "original": "There were lots of exemptions, especially for individuals. And in World War II the tax codes were so new that the government had little acquired immunity to tax avoidance. If the rich paid high taxes during the war it was more because they wanted to than because they had to.After the war, federal tax receipts as a percentage of GDP were about the same as they are now.",
      "translated": "有许多免税条款，特别是针对个人的。在第二次世界大战期间，税法非常新，政府对避税几乎没有免疫力。如果富人在战争期间缴纳了高额税款，更多的是因为他们想这么做，而不是必须这么做。战后，联邦税收占GDP的比例与现在大致相同。"
    },
    {
      "original": "In fact, for the entire period since the war, tax receipts have stayed close to 18% of GDP, despite dramatic changes in tax rates. The lowest point occurred when marginal income tax rates were highest: 14.1% in 1950.",
      "translated": "事实上，自战争结束以来的整个时期，税收收入一直保持在GDP的18%左右，尽管税率发生了巨大变化。最低点出现在边际所得税率最高的时候：1950年的14.1%。"
    },
    {
      "original": "Looking at the data, it's hard to avoid the conclusion that tax rates have had little effect on what people actually paid.[3] Though in fact the decade preceding the war had been a time of unprecedented federal power, in response to the Depression.",
      "translated": "从数据来看，很难不得出这样的结论：税率对人们实际支付的金额几乎没有影响。[3] 尽管事实上战前的十年是联邦政府权力空前增强的时期，这是为了应对大萧条。"
    },
    {
      "original": "Which is not entirely a coincidence, because the Depression was one of the causes of the war. In many ways the New Deal was a sort of dress rehearsal for the measures the federal government took during wartime.",
      "translated": "这并非完全巧合，因为大萧条是战争的原因之一。在许多方面，新政可以说是联邦政府在战时采取措施的一次彩排。"
    },
    {
      "original": "The wartime versions were much more drastic and more pervasive though. As Anthony Badger wrote, \"for many Americans the decisive change in their experiences came not with the New Deal but with World War II.\"[4] I don't know enough about the origins of the world wars to say, but it's not inconceivable they were connected to the rise of big corporations.",
      "translated": "战时版本则更为严厉且更为普遍。正如安东尼·巴杰所写：“对于许多美国人来说，他们经历中的决定性变化并非来自新政，而是来自第二次世界大战。”[4] 我对世界大战的起源了解不多，无法评论，但认为它们与大公司的崛起有关并非不可想象。"
    },
    {
      "original": "If that were the case, 20th century cohesion would have a single cause.[5] More precisely, there was a bimodal economy consisting, in Galbraith's words, of \"the world of the technically dynamic, massively capitalized and highly organized corporations on the one hand and the hundreds of thousands of small and traditional proprietors on the other.\" Money, prestige, and power were concentrated in the former, and there was near zero crossover.[6] I wonder how much of the decline in families eating together was due to the decline in families watching TV together afterward.[7] I know when this happened because it was the season Dallas premiered.",
      "translated": "如果真是这样的话，20世纪的社会凝聚力将只有一个原因。更准确地说，当时存在一个双模经济，用加尔布雷思的话来说，一方面是“技术动态、资本雄厚且高度组织化的大型企业”，另一方面是“成千上万的小企业和传统业主”。金钱、声望和权力集中在前者，而两者之间几乎没有交集。我好奇家庭聚餐减少有多少是由于餐后家庭共同观看电视的减少。我知道这发生在什么时期，因为这是《达拉斯》首播的季节。"
    },
    {
      "original": "Everyone else was talking about what was happening on Dallas, and I had no idea what they meant.[8] I didn't realize it till I started doing research for this essay, but the meretriciousness of the products I grew up with is a well-known byproduct of oligopoly.",
      "translated": "其他人都在谈论达拉斯发生的事情，而我完全不知道他们说的是什么。直到我开始为这篇论文做研究，我才意识到，我从小接触的产品的华而不实，其实是寡头垄断的众所周知的副产品。"
    },
    {
      "original": "When companies can't compete on price, they compete on tailfins.[9] Monroeville Mall was at the time of its completion in 1969 the largest in the country. In the late 1970s the movie Dawn of the Dead was shot there.",
      "translated": "当公司无法在价格上竞争时，他们就会在装饰性设计上竞争。[9] 单罗维尔购物中心在1969年完工时是全国最大的购物中心。20世纪70年代末，电影《生化危机的黎明》在此取景拍摄。"
    },
    {
      "original": "Apparently the mall was not just the location of the movie, but its inspiration; the crowds of shoppers drifting through this huge mall reminded George Romero of zombies. My first job was scooping ice cream in the Baskin-Robbins.[10] Labor unions were exempted from antitrust laws by the Clayton Antitrust Act in 1914 on the grounds that a person's work is not \"a commodity or article of commerce.\" I wonder if that means service companies are also exempt.[11] The relationships between unions and unionized companies can even be symbiotic, because unions will exert political pressure to protect their hosts.",
      "translated": "显然，这家购物中心不仅是电影的拍摄地，也是其灵感来源；乔治·罗梅罗看到在这座巨大的购物中心中缓缓移动的购物人群时，联想到了僵尸。我的第一份工作是在Baskin-Robbins冰淇淋店挖冰淇淋。[10] 1914年，《克莱顿反托拉斯法》以“个人的工作不是‘商品或商业物品’”为由，将劳动工会豁免于反托拉斯法。我很好奇这是否意味着服务公司也享有豁免权。[11] 工会与工会化公司之间的关系甚至可以是共生的，因为工会会施加政治压力来保护其宿主。"
    },
    {
      "original": "According to Michael Lind, when politicians tried to attack the A&P supermarket chain because it was putting local grocery stores out of business, \"A&P successfully defended itself by allowing the unionization of its workforce in 1938, thereby gaining organized labor as a constituency.\" I've seen this phenomenon myself: hotel unions are responsible for more of the political pressure against Airbnb than hotel companies.[12] Galbraith was clearly puzzled that corporate executives would work so hard to make money for other people (the shareholders) instead of themselves.",
      "translated": "根据迈克尔·林德的说法，当政治家试图攻击A&P超市连锁因为它正在使当地的杂货店倒闭时，“A&P通过在1938年允许其员工工会化成功地进行了自我辩护，从而获得了有组织的劳工作为其支持者。”我本人也目睹了这一现象：酒店工会对Airbnb的政治压力比酒店公司本身更大。[12] 加尔布雷思显然对企业的高管们如此努力地为他人（股东）赚钱而不是为自己感到困惑。"
    },
    {
      "original": "He devoted much of The New Industrial State to trying to figure this out.His theory was that professionalism had replaced money as a motive, and that modern corporate executives were, like (good) scientists, motivated less by financial rewards than by the desire to do good work and thereby earn the respect of their peers.",
      "translated": "他花了大量篇幅在《新的工业国》一书中试图弄清这一点。他的理论是，专业主义已经取代金钱成为动机，现代企业高管，就像（优秀的）科学家一样，更多地是出于做好工作并因此赢得同行尊重的愿望，而不是受到财务奖励的驱动。"
    },
    {
      "original": "There is something in this, though I think lack of movement between companies combined with self-interest explains much of observed behavior.[13] Galbraith (p. 94) says a 1952 study of the 800 highest paid executives at 300 big corporations found that three quarters of them had been with their company for more than 20 years.[14] It seems likely that in the first third of the 20th century executive salaries were low partly because companies then were more dependent on banks, who would have disapproved if executives got too much.",
      "translated": "这其中确实有些道理，尽管我认为公司之间的人员流动性不足加上个人利益可以解释大部分观察到的行为。[13] 加尔布雷思（第94页）提到，1952年对300家大公司中800名最高薪酬的高管进行的一项研究发现，其中四分之三的人在他们的公司工作了超过20年。[14] 似乎在20世纪的前三分之一时期，高管薪酬较低部分是因为当时的公司更依赖银行，而银行会不赞成高管薪酬过高。"
    },
    {
      "original": "This was certainly true in the beginning. The first big company CEOs were J. P. Morgan's hired hands.Companies didn't start to finance themselves with retained earnings till the 1920s. Till then they had to pay out their earnings in dividends, and so depended on banks for capital for expansion.",
      "translated": "这在一开始确实是这样的。最初的大公司首席执行官都是J.P.摩根的手下。直到20世纪20年代，公司才开始用留存收益进行融资。在此之前，他们不得不将利润以股息的形式支付出去，因此在扩张时依赖银行提供资金。"
    },
    {
      "original": "Bankers continued to sit on corporate boards till the Glass-Steagall act in 1933.By mid-century big companies funded 3/4 of their growth from earnings. But the early years of bank dependence, reinforced by the financial controls of World War II, must have had a big effect on social conventions about executive salaries.",
      "translated": "银行家们一直担任公司董事，直到1933年的《格拉斯-斯蒂格尔法》出台。到20世纪中叶，大公司有3/4的增长资金来自盈利。但早年对银行的依赖，加上第二次世界大战期间的金融管制，必然对关于高管薪酬的社会规范产生了重大影响。"
    },
    {
      "original": "So it may be that the lack of movement between companies was as much the effect of low salaries as the cause.Incidentally, the switch in the 1920s to financing growth with retained earnings was one cause of the 1929 crash.",
      "translated": "因此，公司之间的流动性不足可能是低薪的结果，而不仅仅是原因。顺便说一下，20世纪20年代转向用留存收益为增长融资是1929年股市崩盘的一个原因。"
    },
    {
      "original": "The banks now had to find someone else to lend to, so they made more margin loans.[15] Even now it's hard to get them to. One of the things I find hardest to get into the heads of would-be startup founders is how important it is to do certain kinds of menial work early in the life of a company.",
      "translated": "银行现在不得不寻找其他借款人，因此它们增加了更多的保证金贷款。[15] 即便如此，现在想让它们这样做也很难。我发现在初创公司成立初期，最难让潜在的创始人理解的一件事就是从事某些低级工作的重要性。"
    },
    {
      "original": "Doing things that don't scale is to how Henry Ford got started as a high-fiber diet is to the traditional peasant's diet: they had no choice but to do the right thing, while we have to make a conscious effort.[16] Founders weren't celebrated in the press when I was a kid.",
      "translated": "做那些不能规模化的事情，就像亨利·福特刚开始时的高纤维饮食之于传统农民的饮食：他们别无选择，只能做正确的事情，而我们则需要有意识地去努力。在我小时候，创始人并不会被媒体大肆吹捧。"
    },
    {
      "original": "\"Our founder\" meant a photograph of a severe-looking man with a walrus mustache and a wing collar who had died decades ago. The thing to be when I was a kid was an executive. If you weren't around then it's hard to grasp the cachet that term had.",
      "translated": "“我们的创始人”指的是一个留着八字胡、戴着翼领的严肃男人的照片，他几十年前就去世了。在我小时候，人们都渴望成为高管。如果你没有经历过那个时代，就很难理解这个称谓当时有多么风光。"
    },
    {
      "original": "The fancy version of everything was called the \"executive\" model.[17] The wave of hostile takeovers in the 1980s was enabled by a combination of circumstances: court decisions striking down state anti-takeover laws, starting with the Supreme Court's 1982 decision in Edgar v.",
      "translated": "所有高档版本的都被称作“行政”型号。[17] 20世纪80年代的敌意收购浪潮是由一系列因素促成的：法院裁决推翻了各州的反收购法律，始于1982年最高法院在Edgar v. 案中的判决。"
    },
    {
      "original": "MITE Corp.; the Reagan administration's comparatively sympathetic attitude toward takeovers; the Depository Institutions Act of 1982, which allowed banks and savings and loans to buy corporate bonds; a new SEC rule issued in 1982 (rule 415) that made it possible to bring corporate bonds to market faster; the creation of the junk bond business by Michael Milken; a vogue for conglomerates in the preceding period that caused many companies to be combined that never should have been; a decade of inflation that left many public companies trading below the value of their assets; and not least, the increasing complacency of managements.[18] Foster, Richard.",
      "translated": "MITE公司；里根政府对并购相对友好的态度；1982年《存款机构法》，允许银行和储蓄贷款机构购买公司债券；1982年美国证券交易委员会发布的新规则（415号规则），使得公司债券可以更快地进入市场；迈克尔·米尔肯创立的垃圾债券业务；此前一段时间内对联合企业的追捧，导致许多不应该合并的公司被合并；十年的通货膨胀使许多上市公司股价低于其资产价值；以及管理层日益增长的自满情绪。[18] 福斯特，理查德。"
    },
    {
      "original": "\"Creative Destruction Whips through Corporate America.\" Innosight, February 2012.[19] CEOs of big companies may be overpaid. I don't know enough about big companies to say. But it is certainly not impossible for a CEO to make 200x as much difference to a company's revenues as the average employee.",
      "translated": "“创造性破坏席卷美国企业界。”Innosight，2012年2月。[19] 大公司首席执行官可能薪酬过高。我对大公司了解不够，无法对此发表意见。但可以肯定的是，首席执行官对公司收入的影响可能是普通员工的200倍。"
    },
    {
      "original": "Look at what Steve Jobs did for Apple when he came back as CEO. It would have been a good deal for the board to give him 95% of the company. Apple's market cap the day Steve came back in July 1997 was 1.73 billion.",
      "translated": "看看史蒂夫·乔布斯重返苹果担任CEO后为公司做了什么。董事会给他95%的公司股权也是一笔划算的交易。1997年7月史蒂夫回归时，苹果的市值为17.3亿美元。"
    },
    {
      "original": "5% of Apple now (January 2016) would be worth about 30 billion. And it would not be if Steve hadn't come back; Apple probably wouldn't even exist anymore.Merely including Steve in the sample might be enough to answer the question of whether public company CEOs in the aggregate are overpaid.",
      "translated": "现在（2016年1月）苹果公司的5%股份价值约为300亿美元。如果史蒂夫没有回归，苹果可能甚至不复存在了。仅仅将史蒂夫纳入样本可能就足以回答关于整体上公众公司CEO是否薪酬过高的问题。"
    },
    {
      "original": "And that is not as facile a trick as it might seem, because the broader your holdings, the more the aggregate is what you care about.[20] The late 1960s were famous for social upheaval. But that was more rebellion (which can happen in any era if people are provoked sufficiently) than fragmentation.",
      "translated": "这并非如看起来那么简单，因为你的持有范围越广，你越关心整体的表现。20世纪60年代末期以社会动荡而著称。但那更多的是反抗（如果人们受到足够的刺激，任何时代都可能发生）而不是分裂。"
    },
    {
      "original": "You're not seeing fragmentation unless you see people breaking off to both left and right.[21] Globally the trend has been in the other direction. While the US is becoming more fragmented, the world as a whole is becoming less fragmented, and mostly in good ways.[22] There were a handful of ways to make a fortune in the mid 20th century.",
      "translated": "除非你看到人们向左和向右分裂，否则你没有看到碎片化。[21] 全球的趋势实际上是相反的。虽然美国正在变得更加碎片化，但世界整体上正在变得不那么碎片化，而且大多是以好的方式。[22] 在20世纪中叶，有少数几种方法可以致富。"
    },
    {
      "original": "The main one was drilling for oil, which was open to newcomers because it was not something big companies could dominate through economies of scale. How did individuals accumulate large fortunes in an era of such high taxes?",
      "translated": "主要的是钻探石油，这一行业对新入行者开放，因为大型公司无法通过规模经济来主导。在税收如此高的时代，个人是如何积累巨额财富的？"
    },
    {
      "original": "Giant tax loopholes defended by two of the most powerful men in Congress, Sam Rayburn and Lyndon Johnson.But becoming a Texas oilman was not in 1950 something one could aspire to the way starting a startup or going to work on Wall Street were in 2000, because (a) there was a strong local component and (b) success depended so much on luck.[23] The Baumol Effect induced by startups is very visible in Silicon Valley.",
      "translated": "由国会中最具权力的两位人物山姆·雷伯恩和林登·约翰逊捍卫的巨大税收漏洞。但在1950年，成为得克萨斯州的石油大亨并不是像2000年创业或到华尔街工作那样可以憧憬的目标，因为（a）这一行业有很强的地域性，（b）成功在很大程度上取决于运气。[23] 创业公司所引发的鲍莫尔效应在硅谷表现得尤为明显。"
    },
    {
      "original": "Google will pay people millions of dollars a year to keep them from leaving to start or join startups.[24] I'm not claiming variation in productivity is the only cause of economic inequality in the US.",
      "translated": "谷歌每年将支付数百万美元，以留住那些可能离职去创办或加入初创公司的人。[24] 我并不是说生产力的差异是美国经济不平等的唯一原因。"
    },
    {
      "original": "But it's a significant cause, and it will become as big a cause as it needs to, in the sense that if you ban other ways to get rich, people who want to get rich will use this route instead.Thanks to Sam Altman, Trevor Blackwell, Paul Buchheit, Patrick Collison, Ron Conway, Chris Dixon, Benedict Evans, Richard Florida, Ben Horowitz, Jessica Livingston, Robert Morris, Tim O'Reilly, Geoff Ralston, Max Roser, Alexia Tsotsis, and Qasar Younis for reading drafts of this.",
      "translated": "但这是一项重要的事业，它将变得和它需要成为的一样重要，也就是说，如果你禁止其他致富的方式，那些想要致富的人会转而使用这一途径。感谢Sam Altman、Trevor Blackwell、Paul Buchheit、Patrick Collison、Ron Conway、Chris Dixon、Benedict Evans、Richard Florida、Ben Horowitz、Jessica Livingston、Robert Morris、Tim O'Reilly、Geoff Ralston、Max Roser、Alexia Tsotsis和Qasar Younis审阅本文草稿。"
    },
    {
      "original": "Max also told me about several valuable sources.BibliographyAllen, Frederick Lewis. The Big Change. Harper, 1952.Averitt, Robert. The Dual Economy. Norton, 1968.Badger, Anthony. The New Deal. Hill and Wang, 1989.Bainbridge, John.",
      "translated": "马克斯还告诉我几个有价值的资料来源。参考书目：艾伦，弗雷德里克·刘易斯。《大变革》。哈珀出版社，1952年。阿韦里特，罗伯特。《双重经济》。诺顿出版社，1968年。巴杰，安东尼。《新政》。希尔和王出版社，1989年。贝恩布里奇，约翰。"
    },
    {
      "original": "The Super-Americans. Doubleday, 1961.Beatty, Jack. Collossus. Broadway, 2001.Brinkley, Douglas. Wheels for the World. Viking, 2003.Brownleee, W. Elliot. Federal Taxation in America. Cambridge, 1996.Chandler, Alfred.",
      "translated": "《超级美国人》. Doubleday, 1961.\n贝蒂，杰克. 《巨人》. Broadway, 2001.\n布林克利，道格拉斯. 《世界的车轮》. Viking, 2003.\n布朗利，W. 埃利奥特. 《美国联邦税收》. Cambridge, 1996.\n钱德勒，阿尔弗雷德."
    },
    {
      "original": "The Visible Hand. Harvard, 1977.Chernow, Ron. The House of Morgan. Simon & Schuster, 1990.Chernow, Ron. Titan: The Life of John D. Rockefeller. Random House, 1998.Galbraith, John. The New Industrial State.",
      "translated": "《看得见的手》。哈佛，1977年。切尔诺，罗恩。《摩根家族》。西蒙与舒斯特出版社，1990年。切尔诺，罗恩。《泰坦：约翰·D·洛克菲勒的一生》。兰登书屋，1998年。加尔布雷思，约翰。《新工业国》。"
    },
    {
      "original": "Houghton Mifflin, 1967.Goldin, Claudia and Robert A. Margo. \"The Great Compression: The Wage Structure in the United States at Mid-Century.\" NBER Working Paper 3817, 1991.Gordon, John. An Empire of Wealth.",
      "translated": "霍顿米夫林，1967年。高丁，克劳迪娅和罗伯特·A·马戈。《大压缩：20世纪中叶美国的工资结构》。NBER工作论文3817，1991年。戈登，约翰。《财富帝国》。"
    },
    {
      "original": "HarperCollins, 2004.Klein, Maury. The Genesis of Industrial America, 1870-1920. Cambridge, 2007.Lind, Michael. Land of Promise. HarperCollins, 2012.Mickelthwaite, John, and Adrian Wooldridge. The Company.",
      "translated": "HarperCollins，2004。克莱因，莫里。《美国工业的起源，1870-1920》。剑桥，2007。林德，迈克尔。《承诺之地》。HarperCollins，2012。米克尔思韦特，约翰，和阿德里安·伍尔德里奇。《公司》。"
    },
    {
      "original": "Modern Library, 2003.Nasaw, David. Andrew Carnegie. Penguin, 2006.Sobel, Robert. The Age of Giant Corporations. Praeger, 1993.Thurow, Lester. Generating Inequality: Mechanisms of Distribution. Basic Books, 1975.Witte, John.",
      "translated": "现代图书馆，2003。纳索，大卫。《安德鲁·卡内基》。企鹅出版社，2006。索贝尔，罗伯特。《大企业时代》。普雷格出版社，1993。索罗，莱斯特。《不平等的产生：分配机制》。基础图书出版社，1975。维特，约翰。"
    },
    {
      "original": "The Politics and Development of the Federal Income Tax. Wisconsin, 1985.Related:Too Many Elite American Men Are Obsessed With Work and Wealth",
      "translated": "《联邦所得税的政治与演变》。威斯康星州，1985年。相关文章：太多美国精英男性沉迷于工作和财富。"
    }
  ],
  "translation_completed": "2025-07-29T11:45:01.796845",
  "translation_stats": {
    "total_paragraphs": 148,
    "success_count": 148,
    "success_rate": "100.0%"
  }
}