{
  "title": "What Startups Are Really Like",
  "title_zh": "[待翻译] What Startups Are Really Like",
  "url": "https://www.paulgraham.com/really.html",
  "filename": "really.html",
  "date": "2020-08-29",
  "id": 93,
  "content": {
    "success": true,
    "paragraphs": [
      "Want to start a startup? Get funded by Y Combinator. October 2009(This essay is derived from a talk at the 2009 Startup School.)I wasn't sure what to talk about at Startup School, so I decided to ask the founders of the startups we'd funded.",
      "What hadn't I written about yet?I'm in the unusual position of being able to test the essays I write about startups. I hope the ones on other topics are right, but I have no way to test them. The ones on startups get tested by about 70 people every 6 months.So I sent all the founders an email asking what surprised them about starting a startup.",
      "This amounts to asking what I got wrong, because if I'd explained things well enough, nothing should have surprised them.I'm proud to report I got one response saying: What surprised me the most is that everything was actually fairly predictable!",
      "The bad news is that I got over 100 other responses listing the surprises they encountered.There were very clear patterns in the responses; it was remarkable how often several people had been surprised by exactly the same thing.",
      "These were the biggest: 1. Be Careful with CofoundersThis was the surprise mentioned by the most founders. There were two types of responses: that you have to be careful who you pick as a cofounder, and that you have to work hard to maintain your relationship.What people wished they'd paid more attention to when choosing cofounders was character and commitment, not ability.",
      "This was particularly true with startups that failed. The lesson: don't pick cofounders who will flake.Here's a typical reponse: You haven't seen someone's true colors unless you've worked with them on a startup.",
      "The reason character is so important is that it's tested more severely than in most other situations. One founder said explicitly that the relationship between founders was more important than ability: I would rather cofound a startup with a friend than a stranger with higher output.",
      "Startups are so hard and emotional that the bonds and emotional and social support that come with friendship outweigh the extra output lost. We learned this lesson a long time ago. If you look at the YC application, there are more questions about the commitment and relationship of the founders than their ability.Founders of successful startups talked less about choosing cofounders and more about how hard they worked to maintain their relationship.",
      "One thing that surprised me is how the relationship of startup founders goes from a friendship to a marriage. My relationship with my cofounder went from just being friends to seeing each other all the time, fretting over the finances and cleaning up shit.",
      "And the startup was our baby. I summed it up once like this: \"It's like we're married, but we're not fucking.\" Several people used that word \"married.\" It's a far more intense relationship than you usually see between coworkers—partly because the stresses are so much greater, and partly because at first the founders are the whole company.",
      "So this relationship has to be built of top quality materials and carefully maintained. It's the basis of everything. 2. Startups Take Over Your LifeJust as the relationship between cofounders is more intense than it usually is between coworkers, so is the relationship between the founders and the company.",
      "Running a startup is not like having a job or being a student, because it never stops. This is so foreign to most people's experience that they don't get it till it happens. [1] I didn't realize I would spend almost every waking moment either working or thinking about our startup.",
      "You enter a whole different way of life when it's your company vs. working for someone else's company. It's exacerbated by the fast pace of startups, which makes it seem like time slows down: I think the thing that's been most surprising to me is how one's perspective on time shifts.",
      "Working on our startup, I remember time seeming to stretch out, so that a month was a huge interval. In the best case, total immersion can be exciting: It's surprising how much you become consumed by your startup, in that you think about it day and night, but never once does it feel like \"work.\" Though I have to say, that quote is from someone we funded this summer.",
      "In a couple years he may not sound so chipper. 3. It's an Emotional Roller-coasterThis was another one lots of people were surprised about. The ups and downs were more extreme than they were prepared for.In a startup, things seem great one moment and hopeless the next.",
      "And by next, I mean a couple hours later. The emotional ups and downs were the biggest surprise for me. One day, we'd think of ourselves as the next Google and dream of buying islands; the next, we'd be pondering how to let our loved ones know of our utter failure; and on and on.",
      "The hard part, obviously, is the lows. For a lot of founders that was the big surprise: How hard it is to keep everyone motivated during rough days or weeks, i.e. how low the lows can be. After a while, if you don't have significant success to cheer you up, it wears you out: Your most basic advice to founders is \"just don't die,\" but the energy to keep a company going in lieu of unburdening success isn't free; it is siphoned from the founders themselves.",
      "There's a limit to how much you can take. If you get to the point where you can't keep working anymore, it's not the end of the world. Plenty of famous founders have had some failures along the way. 4.",
      "It Can Be FunThe good news is, the highs are also very high. Several founders said what surprised them most about doing a startup was how fun it was: I think you've left out just how fun it is to do a startup.",
      "I am more fulfilled in my work than pretty much any of my friends who did not start companies. What they like most is the freedom: I'm surprised by how much better it feels to be working on something that is challenging and creative, something I believe in, as opposed to the hired-gun stuff I was doing before.",
      "I knew it would feel better; what's surprising is how much better. Frankly, though, if I've misled people here, I'm not eager to fix that. I'd rather have everyone think starting a startup is grim and hard than have founders go into it expecting it to be fun, and a few months later saying \"This is supposed to be fun?",
      "Are you kidding?\"The truth is, it wouldn't be fun for most people. A lot of what we try to do in the application process is to weed out the people who wouldn't like it, both for our sake and theirs.The best way to put it might be that starting a startup is fun the way a survivalist training course would be fun, if you're into that sort of thing.",
      "Which is to say, not at all, if you're not. 5. Persistence Is the KeyA lot of founders were surprised how important persistence was in startups. It was both a negative and a positive surprise: they were surprised both by the degree of persistence required Everyone said how determined and resilient you must be, but going through it made me realize that the determination required was still understated.",
      "and also by the degree to which persistence alone was able to dissolve obstacles: If you are persistent, even problems that seem out of your control (i.e. immigration) seem to work themselves out. Several founders mentioned specifically how much more important persistence was than intelligence.",
      "I've been surprised again and again by just how much more important persistence is than raw intelligence. This applies not just to intelligence but to ability in general, and that's why so many people said character was more important in choosing cofounders.",
      "6. Think Long-TermYou need persistence because everything takes longer than you expect. A lot of people were surprised by that. I'm continually surprised by how long everything can take. Assuming your product doesn't experience the explosive growth that very few products do, everything from development to dealmaking (especially dealmaking) seems to take 2-3x longer than I always imagine.",
      "One reason founders are surprised is that because they work fast, they expect everyone else to. There's a shocking amount of shear stress at every point where a startup touches a more bureaucratic organization, like a big company or a VC fund.",
      "That's why fundraising and the enterprise market kill and maim so many startups. [2]But I think the reason most founders are surprised by how long it takes is that they're overconfident. They think they're going to be an instant success, like YouTube or Facebook.",
      "You tell them only 1 out of 100 successful startups has a trajectory like that, and they all think \"we're going to be that 1.\"Maybe they'll listen to one of the more successful founders: The top thing I didn't understand before going into it is that persistence is the name of the game.",
      "For the vast majority of startups that become successful, it's going to be a really long journey, at least 3 years and probably 5+. There is a positive side to thinking longer-term. It's not just that you have to resign yourself to everything taking longer than it should.",
      "If you work patiently it's less stressful, and you can do better work: Because we're relaxed, it's so much easier to have fun doing what we do. Gone is the awkward nervous energy fueled by the desperate need to not fail guiding our actions.",
      "We can concentrate on doing what's best for our company, product, employees and customers. That's why things get so much better when you hit ramen profitability. You can shift into a different mode of working.7.",
      "Lots of Little ThingsWe often emphasize how rarely startups win simply because they hit on some magic idea. I think founders have now gotten that into their heads. But a lot were surprised to find this also applies within startups.",
      "You have to do lots of different things: It's much more of a grind than glamorous. A timeslice selected at random would more likely find me tracking down a weird DLL loading bug on Swedish Windows, or tracking down a bug in the financial model Excel spreadsheet the night before a board meeting, rather than having brilliant flashes of strategic insight.",
      "Most hacker-founders would like to spend all their time programming. You won't get to, unless you fail. Which can be transformed into: If you spend all your time programming, you will fail.The principle extends even into programming.",
      "There is rarely a single brilliant hack that ensures success: I learnt never to bet on any one feature or deal or anything to bring you success. It is never a single thing. Everything is just incremental and you just have to keep doing lots of those things until you strike something.",
      "Even in the rare cases where a clever hack makes your fortune, you probably won't know till later: There is no such thing as a killer feature. Or at least you won't know what it is. So the best strategy is to try lots of different things.",
      "The reason not to put all your eggs in one basket is not the usual one, which applies even when you know which basket is best. In a startup you don't even know that. 8. Start with Something MinimalLots of founders mentioned how important it was to launch with the simplest possible thing.",
      "By this point everyone knows you should release fast and iterate. It's practically a mantra at YC. But even so a lot of people seem to have been burned by not doing it: Build the absolute smallest thing that can be considered a complete application and ship it.",
      "Why do people take too long on the first version? Pride, mostly. They hate to release something that could be better. They worry what people will say about them. But you have to overcome this: Doing something \"simple\" at first glance does not mean you aren't doing something meaningful, defensible, or valuable.",
      "Don't worry what people will say. If your first version is so impressive that trolls don't make fun of it, you waited too long to launch. [3]One founder said this should be your approach to all programming, not just startups, and I tend to agree.",
      "Now, when coding, I try to think \"How can I write this such that if people saw my code, they'd be amazed at how little there is and how little it does?\" Over-engineering is poison. It's not like doing extra work for extra credit.",
      "It's more like telling a lie that you then have to remember so you don't contradict it. 9. Engage UsersProduct development is a conversation with the user that doesn't really start till you launch. Before you launch, you're like a police artist before he's shown the first version of his sketch to the witness.It's so important to launch fast that it may be better to think of your initial version not as a product, but as a trick for getting users to start talking to you.",
      "I learned to think about the initial stages of a startup as a giant experiment. All products should be considered experiments, and those that have a market show promising results extremely quickly. Once you start talking to users, I guarantee you'll be surprised by what they tell you.",
      "When you let customers tell you what they're after, they will often reveal amazing details about what they find valuable as well what they're willing to pay for. The surprise is generally positive as well as negative.",
      "They won't like what you've built, but there will be other things they would like that would be trivially easy to implement. It's not till you start the conversation by launching the wrong thing that they can express (or perhaps even realize) what they're looking for.",
      "10. Change Your IdeaTo benefit from engaging with users you have to be willing to change your idea. We've always encouraged founders to see a startup idea as a hypothesis rather than a blueprint. And yet they're still surprised how well it works to change the idea.",
      "Normally if you complain about something being hard, the general advice is to work harder. With a startup, I think you should find a problem that's easy for you to solve. Optimizing in solution-space is familiar and straightforward, but you can make enormous gains playing around in problem-space.",
      "Whereas mere determination, without flexibility, is a greedy algorithm that may get you nothing more than a mediocre local maximum: When someone is determined, there's still a danger that they'll follow a long, hard path that ultimately leads nowhere.",
      "You want to push forward, but at the same time twist and turn to find the most promising path. One founder put it very succinctly: Fast iteration is the key to success. One reason this advice is so hard to follow is that people don't realize how hard it is to judge startup ideas, particularly their own.",
      "Experienced founders learn to keep an open mind: Now I don't laugh at ideas anymore, because I realized how terrible I was at knowing if they were good or not. You can never tell what will work. You just have to do whatever seems best at each point.",
      "We do this with YC itself. We still don't know if it will work, but it seems like a decent hypothesis. 11. Don't Worry about CompetitorsWhen you think you've got a great idea, it's sort of like having a guilty conscience about something.",
      "All someone has to do is look at you funny, and you think \"Oh my God, they know.\"These alarms are almost always false: Companies that seemed like competitors and threats at first glance usually never were when you really looked at it.",
      "Even if they were operating in the same area, they had a different goal. One reason people overreact to competitors is that they overvalue ideas. If ideas really were the key, a competitor with the same idea would be a real threat.",
      "But it's usually execution that matters: All the scares induced by seeing a new competitor pop up are forgotten weeks later. It always comes down to your own product and approach to the market. This is generally true even if competitors get lots of attention.",
      "Competitors riding on lots of good blogger perception aren't really the winners and can disappear from the map quickly. You need consumers after all. Hype doesn't make satisfied users, at least not for something as complicated as technology.12.",
      "It's Hard to Get UsersA lot of founders complained about how hard it was to get users, though. I had no idea how much time and effort needed to go into attaining users. This is a complicated topic. When you can't get users, it's hard to say whether the problem is lack of exposure, or whether the product's simply bad.",
      "Even good products can be blocked by switching or integration costs: Getting people to use a new service is incredibly difficult. This is especially true for a service that other companies can use, because it requires their developers to do work.",
      "If you're small, they don't think it is urgent. [4] The sharpest criticism of YC came from a founder who said we didn't focus enough on customer acquisition: YC preaches \"make something people want\" as an engineering task, a never ending stream of feature after feature until enough people are happy and the application takes off.",
      "There's very little focus on the cost of customer acquisition. This may be true; this may be something we need to fix, especially for applications like games. If you make something where the challenges are mostly technical, you can rely on word of mouth, like Google did.",
      "One founder was surprised by how well that worked for him: There is an irrational fear that no one will buy your product. But if you work hard and incrementally make it better, there is no need to worry.",
      "But with other types of startups you may win less by features and more by deals and marketing. 13. Expect the Worst with DealsDeals fall through. That's a constant of the startup world. Startups are powerless, and good startup ideas generally seem wrong.",
      "So everyone is nervous about closing deals with you, and you have no way to make them.This is particularly true with investors: In retrospect, it would have been much better if we had operated under the assumption that we would never get any additional outside investment.",
      "That would have focused us on finding revenue streams early. My advice is generally pessimistic. Assume you won't get money, and if someone does offer you any, assume you'll never get any more. If someone offers you money, take it.",
      "You say it a lot, but I think it needs even more emphasizing. We had the opportunity to raise a lot more money than we did last year and I wish we had. Why do founders ignore me? Mostly because they're optimistic by nature.",
      "The mistake is to be optimistic about things you can't control. By all means be optimistic about your ability to make something great. But you're asking for trouble if you're optimistic about big companies or investors.",
      "14. Investors Are CluelessA lot of founders mentioned how surprised they were by the cluelessness of investors: They don't even know about the stuff they've invested in. I met some investors that had invested in a hardware device and when I asked them to demo the device they had difficulty switching it on.",
      "Angels are a bit better than VCs, because they usually have startup experience themselves: VC investors don't know half the time what they are talking about and are years behind in their thinking. A few were great, but 95% of the investors we dealt with were unprofessional, didn't seem to be very good at business or have any kind of creative vision.",
      "Angels were generally much better to talk to. Why are founders surprised that VCs are clueless? I think it's because they seem so formidable.The reason VCs seem formidable is that it's their profession to.",
      "You get to be a VC by convincing asset managers to trust you with hundreds of millions of dollars. How do you do that? You have to seem confident, and you have to seem like you understand technology.",
      "[5] 15. You May Have to Play GamesBecause investors are so bad at judging you, you have to work harder than you should at selling yourself. One founder said the thing that surprised him most was The degree to which feigning certitude impressed investors.",
      "This is the thing that has surprised me most about YC founders' experiences. This summer we invited some of the alumni to talk to the new startups about fundraising, and pretty much 100% of their advice was about investor psychology.",
      "I thought I was cynical about VCs, but the founders were much more cynical. A lot of what startup founders do is just posturing. It works. VCs themselves have no idea of the extent to which the startups they like are the ones that are best at selling themselves to VCs.",
      "[6] It's exactly the same phenomenon we saw a step earlier. VCs get money by seeming confident to LPs, and founders get money by seeming confident to VCs. 16. Luck Is a Big FactorWith two such random linkages in the path between startups and money, it shouldn't be surprising that luck is a big factor in deals.",
      "And yet a lot of founders are surprised by it. I didn't realize how much of a role luck plays and how much is outside of our control. If you think about famous startups, it's pretty clear how big a role luck plays.",
      "Where would Microsoft be if IBM insisted on an exclusive license for DOS?Why are founders fooled by this? Business guys probably aren't, but hackers are used to a world where skill is paramount, and you get what you deserve.",
      "When we started our startup, I had bought the hype of the startup founder dream: that this is a game of skill. It is, in some ways. Having skill is valuable. So is being determined as all hell. But being lucky is the critical ingredient.",
      "Actually the best model would be to say that the outcome is the product of skill, determination, and luck. No matter how much skill and determination you have, if you roll a zero for luck, the outcome is zero.These quotes about luck are not from founders whose startups failed.",
      "Founders who fail quickly tend to blame themselves. Founders who succeed quickly don't usually realize how lucky they were. It's the ones in the middle who see how important luck is. 17. The Value of CommunityA surprising number of founders said what surprised them most about starting a startup was the value of community.",
      "Some meant the micro-community of YC founders: The immense value of the peer group of YC companies, and facing similar obstacles at similar times. which shouldn't be that surprising, because that's why it's structured that way.",
      "Others were surprised at the value of the startup community in the larger sense: How advantageous it is to live in Silicon Valley, where you can't help but hear all the cutting-edge tech and startup news, and run into useful people constantly.",
      "The specific thing that surprised them most was the general spirit of benevolence: One of the most surprising things I saw was the willingness of people to help us. Even people who had nothing to gain went out of their way to help our startup succeed.",
      "and particularly how it extended all the way to the top: The surprise for me was how accessible important and interesting people are. It's amazing how easily you can reach out to people and get immediate feedback.",
      "This is one of the reasons I like being part of this world. Creating wealth is not a zero-sum game, so you don't have to stab people in the back to win. 18. You Get No RespectThere was one surprise founders mentioned that I'd forgotten about: that outside the startup world, startup founders get no respect.",
      "In social settings, I found that I got a lot more respect when I said, \"I worked on Microsoft Office\" instead of \"I work at a small startup you've never heard of called x.\" Partly this is because the rest of the world just doesn't get startups, and partly it's yet another consequence of the fact that most good startup ideas seem bad: If you pitch your idea to a random person, 95% of the time you'll find the person instinctively thinks the idea will be a flop and you're wasting your time (although they probably won't say this directly).",
      "Unfortunately this extends even to dating: It surprised me that being a startup founder does not get you more admiration from women. I did know about that, but I'd forgotten. 19. Things Change as You GrowThe last big surprise founders mentioned is how much things changed as they grew.",
      "The biggest change was that you got to program even less: Your job description as technical founder/CEO is completely rewritten every 6-12 months. Less coding, more managing/planning/company building, hiring, cleaning up messes, and generally getting things in place for what needs to happen a few months from now.",
      "In particular, you now have to deal with employees, who often have different motivations: I knew the founder equation and had been focused on it since I knew I wanted to start a startup as a 19 year old.",
      "The employee equation is quite different so it took me a while to get it down. Fortunately, it can become a lot less stressful once you reach cruising altitude: I'd say 75% of the stress is gone now from when we first started.",
      "Running a business is so much more enjoyable now. We're more confident. We're more patient. We fight less. We sleep more. I wish I could say it was this way for every startup that succeeded, but 75% is probably on the high side.",
      "The Super-PatternThere were a few other patterns, but these were the biggest. One's first thought when looking at them all is to ask if there's a super-pattern, a pattern to the patterns.I saw it immediately, and so did a YC founder I read the list to.",
      "These are supposed to be the surprises, the things I didn't tell people. What do they all have in common? They're all things I tell people. If I wrote a new essay with the same outline as this that wasn't summarizing the founders' responses, everyone would say I'd run out of ideas and was just repeating myself.What is going on here?When I look at the responses, the common theme is that starting a startup was like I said, but way more so.",
      "People just don't seem to get how different it is till they do it. Why? The key to that mystery is to ask, how different from what? Once you phrase it that way, the answer is obvious: from a job. Everyone's model of work is a job.",
      "It's completely pervasive. Even if you've never had a job, your parents probably did, along with practically every other adult you've met.Unconsciously, everyone expects a startup to be like a job, and that explains most of the surprises.",
      "It explains why people are surprised how carefully you have to choose cofounders and how hard you have to work to maintain your relationship. You don't have to do that with coworkers. It explains why the ups and downs are surprisingly extreme.",
      "In a job there is much more damping. But it also explains why the good times are surprisingly good: most people can't imagine such freedom. As you go down the list, almost all the surprises are surprising in how much a startup differs from a job.You probably can't overcome anything so pervasive as the model of work you grew up with.",
      "So the best solution is to be consciously aware of that. As you go into a startup, you'll be thinking \"everyone says it's really extreme.\" Your next thought will probably be \"but I can't believe it will be that bad.\" If you want to avoid being surprised, the next thought after that should be: \"and the reason I can't believe it will be that bad is that my model of work is a job.\" Notes[1] Graduate students might understand it.",
      "In grad school you always feel you should be working on your thesis. It doesn't end every semester like classes do.[2] The best way for a startup to engage with slow-moving organizations is to fork off separate processes to deal with them.",
      "It's when they're on the critical path that they kill you—when you depend on closing a deal to move forward. It's worth taking extreme measures to avoid that.[3] This is a variant of Reid Hoffman's principle that if you aren't embarrassed by what you launch with, you waited too long to launch.[4] The question to ask about what you've built is not whether it's good, but whether it's good enough to supply the activation energy required.[5] Some VCs seem to understand technology because they actually do, but that's overkill; the defining test is whether you can talk about it well enough to convince limited partners.[6] This is the same phenomenon you see with defense contractors or fashion brands.",
      "The dumber the customers, the more effort you expend on the process of selling things to them rather than making the things you sell.Thanks: to Jessica Livingston for reading drafts of this, and to all the founders who responded to my email.Related:Startups in 13 SentencesThe Hardest Lessons for Startups to LearnHow Not to DieThe 18 Mistakes That Kill StartupsA Fundraising Survival GuideRussian TranslationKorean TranslationHebrew Translation"
    ],
    "word_count": 5025,
    "paragraph_count": 100
  },
  "processed_at": "2025-07-26T19:04:26.232244",
  "paragraphs": [
    {
      "original": "Want to start a startup? Get funded by Y Combinator. October 2009(This essay is derived from a talk at the 2009 Startup School.)I wasn't sure what to talk about at Startup School, so I decided to ask the founders of the startups we'd funded.",
      "translated": "想创业吗？获得Y Combinator的资助。2009年10月（本文源自2009年创业学校的一次演讲。）我不确定在创业学校该讲些什么，所以决定问问我们资助过的创业公司的创始人。"
    },
    {
      "original": "What hadn't I written about yet?I'm in the unusual position of being able to test the essays I write about startups. I hope the ones on other topics are right, but I have no way to test them. The ones on startups get tested by about 70 people every 6 months.So I sent all the founders an email asking what surprised them about starting a startup.",
      "translated": "我还有什么没写过呢？我处在一个特殊的位置，可以测试我所写的关于创业公司的文章。我希望其他主题的文章也是正确的，但我没有办法验证它们。而关于创业公司的文章，我每六个月就能通过大约70个人来测试。所以我给所有的创始人都发了一封邮件，问他们在创办创业公司过程中有什么意外的发现。"
    },
    {
      "original": "This amounts to asking what I got wrong, because if I'd explained things well enough, nothing should have surprised them.I'm proud to report I got one response saying: What surprised me the most is that everything was actually fairly predictable!",
      "translated": "这相当于问我哪里出错了，因为如果我解释得足够清楚，他们就不应该感到惊讶。我自豪地报告说，我收到一个回复说：最让我惊讶的是，一切实际上都相当可以预见！"
    },
    {
      "original": "The bad news is that I got over 100 other responses listing the surprises they encountered.There were very clear patterns in the responses; it was remarkable how often several people had been surprised by exactly the same thing.",
      "translated": "坏消息是我收到了100多条其他回复，列出了他们遇到的意外情况。回复中有着非常明显的模式；令人惊讶的是，有多人对完全相同的事情感到意外。"
    },
    {
      "original": "These were the biggest: 1. Be Careful with CofoundersThis was the surprise mentioned by the most founders. There were two types of responses: that you have to be careful who you pick as a cofounder, and that you have to work hard to maintain your relationship.What people wished they'd paid more attention to when choosing cofounders was character and commitment, not ability.",
      "translated": "这些是最主要的：1. 选择联合创始人要谨慎。这是大多数创始人提到的意外之谈。有两种回应：一是选择联合创始人时要谨慎，二是要努力维护你们的关系。人们希望在选择联合创始人时更多关注的是品格和承诺，而不是能力。"
    },
    {
      "original": "This was particularly true with startups that failed. The lesson: don't pick cofounders who will flake.Here's a typical reponse: You haven't seen someone's true colors unless you've worked with them on a startup.",
      "translated": "这一点在失败的初创企业中尤为明显。教训是：不要选择那些会半途而废的联合创始人。这是一个典型的回应：除非你和某人一起创业，否则你不会真正了解他们的本质。"
    },
    {
      "original": "The reason character is so important is that it's tested more severely than in most other situations. One founder said explicitly that the relationship between founders was more important than ability: I would rather cofound a startup with a friend than a stranger with higher output.",
      "translated": "性格之所以如此重要，是因为它在大多数其他情况下都经受着更严峻的考验。一位创始人明确表示，创始人之间的关系比能力更重要：我宁愿与朋友共同创办一家初创公司，也不愿与一个产出更高的陌生人合作。"
    },
    {
      "original": "Startups are so hard and emotional that the bonds and emotional and social support that come with friendship outweigh the extra output lost. We learned this lesson a long time ago. If you look at the YC application, there are more questions about the commitment and relationship of the founders than their ability.Founders of successful startups talked less about choosing cofounders and more about how hard they worked to maintain their relationship.",
      "translated": "创业公司既艰难又充满情感，因此友谊带来的精神和社会支持超过了所损失的额外产出。我们很早就学到了这一点。如果你看看YC的申请表，你会发现关于创始人之间的承诺和关系的问题比关于他们能力的问题要多。成功的创业公司的创始人较少谈论选择联合创始人，而更多地谈论他们为维持关系所付出的努力。"
    },
    {
      "original": "One thing that surprised me is how the relationship of startup founders goes from a friendship to a marriage. My relationship with my cofounder went from just being friends to seeing each other all the time, fretting over the finances and cleaning up shit.",
      "translated": "让我感到惊讶的一件事是，创业公司的创始人之间的关系从友谊变成了婚姻。我和我的联合创始人之间的关系从仅仅是朋友发展到经常见面，为财务问题焦虑并一起解决各种麻烦。"
    },
    {
      "original": "And the startup was our baby. I summed it up once like this: \"It's like we're married, but we're not fucking.\" Several people used that word \"married.\" It's a far more intense relationship than you usually see between coworkers—partly because the stresses are so much greater, and partly because at first the founders are the whole company.",
      "translated": "这家初创公司就是我们的孩子。我曾经这样总结：“我们就像结婚了，但没有性生活。” 很多人用了“结婚”这个词。这种关系比你通常在同事之间看到的要更加密切——部分是因为压力更大，部分是因为一开始创始人就是整个公司。"
    },
    {
      "original": "So this relationship has to be built of top quality materials and carefully maintained. It's the basis of everything. 2. Startups Take Over Your LifeJust as the relationship between cofounders is more intense than it usually is between coworkers, so is the relationship between the founders and the company.",
      "translated": "因此，这种关系必须建立在高质量的基础上，并且要精心维护。它是所有事情的基础。2. 创业公司会占据你的全部生活。就像联合创始人之间的关系比普通同事之间的关系更加紧密一样，创始人与公司之间的关系也是如此。"
    },
    {
      "original": "Running a startup is not like having a job or being a student, because it never stops. This is so foreign to most people's experience that they don't get it till it happens. [1] I didn't realize I would spend almost every waking moment either working or thinking about our startup.",
      "translated": "经营一家创业公司与拥有工作或当学生完全不同，因为它从不停歇。这一点对于大多数人来说是如此陌生，以至于他们直到亲身体验才明白。[1] 我没有意识到我几乎每时每刻都会在工作或思考我们的创业公司。"
    },
    {
      "original": "You enter a whole different way of life when it's your company vs. working for someone else's company. It's exacerbated by the fast pace of startups, which makes it seem like time slows down: I think the thing that's been most surprising to me is how one's perspective on time shifts.",
      "translated": "当你从为别人工作转变为经营自己的公司时，你会进入一种完全不同的生活方式。这种转变在初创公司的快速节奏中尤为明显，这会让你觉得时间似乎变慢了：我认为最让我惊讶的是，这种变化如何改变了人对时间的感知。"
    },
    {
      "original": "Working on our startup, I remember time seeming to stretch out, so that a month was a huge interval. In the best case, total immersion can be exciting: It's surprising how much you become consumed by your startup, in that you think about it day and night, but never once does it feel like \"work.\" Though I have to say, that quote is from someone we funded this summer.",
      "translated": "在我们的初创公司工作时，我还记得时间似乎被拉长了，以至于一个月都显得很长。在最好的情况下，全身心投入可以非常令人兴奋：你会惊讶于自己有多么专注于自己的初创公司，以至于日日夜夜都在思考它，但从未有过一次觉得这是“工作”。不过，我得说，这句话是今年夏天我们资助的一位创业者说的。"
    },
    {
      "original": "In a couple years he may not sound so chipper. 3. It's an Emotional Roller-coasterThis was another one lots of people were surprised about. The ups and downs were more extreme than they were prepared for.In a startup, things seem great one moment and hopeless the next.",
      "translated": "几年后，他可能就不会这么乐观了。3. 情感过山车这一点让很多人感到意外。起起伏伏比他们预想的要剧烈得多。在创业公司里，事情前一刻还看似一片大好，下一刻就变得毫无希望。"
    },
    {
      "original": "And by next, I mean a couple hours later. The emotional ups and downs were the biggest surprise for me. One day, we'd think of ourselves as the next Google and dream of buying islands; the next, we'd be pondering how to let our loved ones know of our utter failure; and on and on.",
      "translated": "我所说的“接下来”是指几个小时之后。情绪的起伏是我最大的意外。有时候，我们会自认为是下一个谷歌，梦想着买下岛屿；而接下来，我们又在考虑如何向亲人告知我们的彻底失败；如此反复。"
    },
    {
      "original": "The hard part, obviously, is the lows. For a lot of founders that was the big surprise: How hard it is to keep everyone motivated during rough days or weeks, i.e. how low the lows can be. After a while, if you don't have significant success to cheer you up, it wears you out: Your most basic advice to founders is \"just don't die,\" but the energy to keep a company going in lieu of unburdening success isn't free; it is siphoned from the founders themselves.",
      "translated": "显然，最难的部分是低谷期。对许多创始人来说，这是一个巨大的意外：在艰难的日子里或几周内保持团队士气有多么困难，低谷可以有多低。一段时间后，如果没有显著的成功来鼓舞士气，人就会被消耗殆尽：对创始人的最基本建议是“只要不倒下”，但在没有减轻负担的成功情况下维持公司所需的精力并非免费；这种精力是从创始人自身汲取的。"
    },
    {
      "original": "There's a limit to how much you can take. If you get to the point where you can't keep working anymore, it's not the end of the world. Plenty of famous founders have had some failures along the way. 4.",
      "translated": "你承受的能力是有限的。如果你到了无法继续工作的地步，这并不是世界末日。许多著名的企业家在成功的路上都曾经历过失败。4."
    },
    {
      "original": "It Can Be FunThe good news is, the highs are also very high. Several founders said what surprised them most about doing a startup was how fun it was: I think you've left out just how fun it is to do a startup.",
      "translated": "这可以很有趣。好消息是，高潮也非常高。几位创始人表示，做初创公司最令他们惊讶的是有多有趣：我认为你忽略了做初创公司有多么有趣。"
    },
    {
      "original": "I am more fulfilled in my work than pretty much any of my friends who did not start companies. What they like most is the freedom: I'm surprised by how much better it feels to be working on something that is challenging and creative, something I believe in, as opposed to the hired-gun stuff I was doing before.",
      "translated": "我在工作中的满足感远远超过了我那些没有创业的朋友。他们最喜欢的是自由：我惊讶地发现，从事具有挑战性和创造性、自己相信的事情，比之前我做的那种受雇工作感觉好太多了。"
    },
    {
      "original": "I knew it would feel better; what's surprising is how much better. Frankly, though, if I've misled people here, I'm not eager to fix that. I'd rather have everyone think starting a startup is grim and hard than have founders go into it expecting it to be fun, and a few months later saying \"This is supposed to be fun?",
      "translated": "我知道这会感觉更好；令人惊讶的是，它竟然好这么多。坦白说，如果我在这里误导了人们，我并不急于纠正这一点。我宁愿让每个人都认为创办创业公司是严峻而艰难的，也不希望创业者们满怀期待地认为这会很有趣，结果几个月后却说：“这居然要有趣？”"
    },
    {
      "original": "Are you kidding?\"The truth is, it wouldn't be fun for most people. A lot of what we try to do in the application process is to weed out the people who wouldn't like it, both for our sake and theirs.The best way to put it might be that starting a startup is fun the way a survivalist training course would be fun, if you're into that sort of thing.",
      "translated": "你开玩笑吧？事实上，对大多数人来说，这并不好玩。我们在申请过程中所做的很多事情都是为了筛选掉那些不会喜欢这项工作的人，既是为了我们自己，也是为了他们。最恰当的表达可能是，开始一家初创公司就像生存训练课程一样有趣，如果你喜欢这类事情的话。"
    },
    {
      "original": "Which is to say, not at all, if you're not. 5. Persistence Is the KeyA lot of founders were surprised how important persistence was in startups. It was both a negative and a positive surprise: they were surprised both by the degree of persistence required Everyone said how determined and resilient you must be, but going through it made me realize that the determination required was still understated.",
      "translated": "也就是说，如果你不是，那就一点也不。5. 坚持是关键许多创始人对坚持在创业中的重要性感到惊讶。这既是一个负面的也是一个正面的惊喜：他们对所需坚持的程度感到惊讶。每个人都说你必须多么坚定和有韧性，但经历过后我意识到所需的决心仍然被低估了。"
    },
    {
      "original": "and also by the degree to which persistence alone was able to dissolve obstacles: If you are persistent, even problems that seem out of your control (i.e. immigration) seem to work themselves out. Several founders mentioned specifically how much more important persistence was than intelligence.",
      "translated": "以及通过坚持不懈本身能够化解障碍的程度：如果你坚持不懈，即使看似超出你控制范围的问题（例如移民问题）似乎也会迎刃而解。几位创始人特别提到，坚持不懈比智力重要得多。"
    },
    {
      "original": "I've been surprised again and again by just how much more important persistence is than raw intelligence. This applies not just to intelligence but to ability in general, and that's why so many people said character was more important in choosing cofounders.",
      "translated": "我一直对坚持比原始智力重要得多这一点感到惊讶。这不仅适用于智力，也适用于一般的能力，这就是为什么那么多人说在选择联合创始人时，性格比能力更重要。"
    },
    {
      "original": "6. Think Long-TermYou need persistence because everything takes longer than you expect. A lot of people were surprised by that. I'm continually surprised by how long everything can take. Assuming your product doesn't experience the explosive growth that very few products do, everything from development to dealmaking (especially dealmaking) seems to take 2-3x longer than I always imagine.",
      "translated": "6. 长期思考你需要有毅力，因为一切都比你预期的要花更长时间。很多人都对此感到惊讶。我也不停地惊讶于一切事情所需的时间之长。除非你的产品经历了极少数产品才会有的爆炸性增长，否则从开发到交易（尤其是交易）的每一件事似乎都要比我想象的花2-3倍的时间。"
    },
    {
      "original": "One reason founders are surprised is that because they work fast, they expect everyone else to. There's a shocking amount of shear stress at every point where a startup touches a more bureaucratic organization, like a big company or a VC fund.",
      "translated": "创始人感到惊讶的一个原因是，因为他们工作速度很快，所以也期望其他人能做到同样的速度。每当初创公司与一个更加官僚的组织，比如大公司或风险投资基金接触时，都会产生令人震惊的剪切应力。"
    },
    {
      "original": "That's why fundraising and the enterprise market kill and maim so many startups. [2]But I think the reason most founders are surprised by how long it takes is that they're overconfident. They think they're going to be an instant success, like YouTube or Facebook.",
      "translated": "这就是为什么筹资和企业市场会摧毁许多初创公司。[2]但我认为，大多数创始人对所需时间之长感到惊讶的原因是他们过于自信。他们认为自己会像YouTube或Facebook一样一夜成功。"
    },
    {
      "original": "You tell them only 1 out of 100 successful startups has a trajectory like that, and they all think \"we're going to be that 1.\"Maybe they'll listen to one of the more successful founders: The top thing I didn't understand before going into it is that persistence is the name of the game.",
      "translated": "你告诉他们，只有1%的成功创业公司会有这样的发展轨迹，而他们都会想：“我们就是那1%。”也许他们会听从一个更成功的创始人的话：在创业之前，我最不了解的一点就是坚持才是关键。"
    },
    {
      "original": "For the vast majority of startups that become successful, it's going to be a really long journey, at least 3 years and probably 5+. There is a positive side to thinking longer-term. It's not just that you have to resign yourself to everything taking longer than it should.",
      "translated": "对于绝大多数成功的初创企业来说，这将是一段很长的旅程，至少需要3年，可能更长，达到5年以上。长远思考也有其积极的一面。这不仅仅是你必须接受一切都会比预期更久的事实。"
    },
    {
      "original": "If you work patiently it's less stressful, and you can do better work: Because we're relaxed, it's so much easier to have fun doing what we do. Gone is the awkward nervous energy fueled by the desperate need to not fail guiding our actions.",
      "translated": "如果你耐心工作，压力会小很多，而且可以做得更好：因为我们放松了，做事情会更加得心应手。那种由极度害怕失败而产生的紧张不安已经消失了，不再左右我们的行为。"
    },
    {
      "original": "We can concentrate on doing what's best for our company, product, employees and customers. That's why things get so much better when you hit ramen profitability. You can shift into a different mode of working.7.",
      "translated": "我们可以专注于为公司、产品、员工和客户做最好的事情。这就是为什么当达到拉面盈利时，一切会变得更好。你可以转换到不同的工作模式。"
    },
    {
      "original": "Lots of Little ThingsWe often emphasize how rarely startups win simply because they hit on some magic idea. I think founders have now gotten that into their heads. But a lot were surprised to find this also applies within startups.",
      "translated": "许多小事情\n\n我们经常强调，创业公司很少仅仅因为找到了某个神奇的想法而成功。我认为创始人现在已经明白了这一点。但许多人惊讶地发现，这一原则同样适用于创业公司内部。"
    },
    {
      "original": "You have to do lots of different things: It's much more of a grind than glamorous. A timeslice selected at random would more likely find me tracking down a weird DLL loading bug on Swedish Windows, or tracking down a bug in the financial model Excel spreadsheet the night before a board meeting, rather than having brilliant flashes of strategic insight.",
      "translated": "你得做很多不同的事情：这远比看起来要枯燥得多。随机选取的一段时间更可能发现我正在追踪瑞典版Windows上一个奇怪的DLL加载错误，或者在董事会会议前一晚查找财务模型Excel表格中的错误，而不是灵感闪现地提出战略洞察。"
    },
    {
      "original": "Most hacker-founders would like to spend all their time programming. You won't get to, unless you fail. Which can be transformed into: If you spend all your time programming, you will fail.The principle extends even into programming.",
      "translated": "大多数黑客创始人希望将所有时间都花在编程上。除非你失败了，否则你是做不到的。这可以转化为：如果你把所有时间都花在编程上，你就会失败。这个原则甚至延伸到了编程之中。"
    },
    {
      "original": "There is rarely a single brilliant hack that ensures success: I learnt never to bet on any one feature or deal or anything to bring you success. It is never a single thing. Everything is just incremental and you just have to keep doing lots of those things until you strike something.",
      "translated": "很少有单一的绝妙技巧能够确保成功：我学到永远不要孤注一掷地依赖任何一个功能、交易或任何事情来带来成功。成功从来不是由单一因素决定的。一切都是逐步积累的，你必须不断做很多这样的事情，直到你取得突破。"
    },
    {
      "original": "Even in the rare cases where a clever hack makes your fortune, you probably won't know till later: There is no such thing as a killer feature. Or at least you won't know what it is. So the best strategy is to try lots of different things.",
      "translated": "即使在那些罕见的情况下，一个巧妙的黑客技术让你大发横财，你可能也得等到后来才知道：没有什么所谓的杀手锏功能。或者至少你不会知道它是什么。所以，最好的策略是尝试各种不同的事情。"
    },
    {
      "original": "The reason not to put all your eggs in one basket is not the usual one, which applies even when you know which basket is best. In a startup you don't even know that. 8. Start with Something MinimalLots of founders mentioned how important it was to launch with the simplest possible thing.",
      "translated": "不要把所有鸡蛋放在一个篮子里的原因，并不是通常所说的那种，即使你知道哪个篮子最好。在创业公司中，你甚至不知道哪个篮子最好。8. 从最简单的东西开始许多创始人提到，以最简单的产品开始是多么重要。"
    },
    {
      "original": "By this point everyone knows you should release fast and iterate. It's practically a mantra at YC. But even so a lot of people seem to have been burned by not doing it: Build the absolute smallest thing that can be considered a complete application and ship it.",
      "translated": "到目前为止，每个人都知道应该快速发布并不断迭代。这几乎是YC的一句口头禅。但即便如此，还是有很多人因为没有这样做而受挫：构建一个可以被视为完整应用的最小程序并发布它。"
    },
    {
      "original": "Why do people take too long on the first version? Pride, mostly. They hate to release something that could be better. They worry what people will say about them. But you have to overcome this: Doing something \"simple\" at first glance does not mean you aren't doing something meaningful, defensible, or valuable.",
      "translated": "为什么人们在第一个版本上花费太多时间？主要是因为自尊心。他们不愿意发布一个可以更好的东西。他们担心别人会怎么说他们。但你必须克服这一点：一开始做些“简单”的事情并不意味着你做的不是有意义、有道理或有价值的事情。"
    },
    {
      "original": "Don't worry what people will say. If your first version is so impressive that trolls don't make fun of it, you waited too long to launch. [3]One founder said this should be your approach to all programming, not just startups, and I tend to agree.",
      "translated": "不要担心别人会怎么说。如果你的第一个版本做得太好，连喷子都没有嘲笑，那就说明你推出得晚了。[3]一位创始人说，这种态度不仅适用于创业，也适用于所有编程工作，我倾向于同意这一点。"
    },
    {
      "original": "Now, when coding, I try to think \"How can I write this such that if people saw my code, they'd be amazed at how little there is and how little it does?\" Over-engineering is poison. It's not like doing extra work for extra credit.",
      "translated": "现在，编写代码时，我尽量思考“我该怎样写这段代码，让别人看到时会惊讶于它的简洁和高效？”过度设计是毒药。这并不是为了额外加分而做额外的工作。"
    },
    {
      "original": "It's more like telling a lie that you then have to remember so you don't contradict it. 9. Engage UsersProduct development is a conversation with the user that doesn't really start till you launch. Before you launch, you're like a police artist before he's shown the first version of his sketch to the witness.It's so important to launch fast that it may be better to think of your initial version not as a product, but as a trick for getting users to start talking to you.",
      "translated": "这更像是一种谎言，你需要记住它，以免自相矛盾。9. 与用户互动产品开发是一种与用户的对话，这种对话在你发布产品之前实际上并没有真正开始。在发布之前，你就像是一位在向目击者展示第一版素描之前的警用画像师。快速发布如此重要，以至于你最好将初始版本视为一种让用户开始与你交流的技巧，而不是一个完整的产品。"
    },
    {
      "original": "I learned to think about the initial stages of a startup as a giant experiment. All products should be considered experiments, and those that have a market show promising results extremely quickly. Once you start talking to users, I guarantee you'll be surprised by what they tell you.",
      "translated": "我学会了将初创企业的初期阶段视为一个大型实验。所有产品都应被视为实验，而那些有市场的会在极短时间内显示出积极的结果。一旦你开始与用户交流，我保证你会对他们的反馈感到惊讶。"
    },
    {
      "original": "When you let customers tell you what they're after, they will often reveal amazing details about what they find valuable as well what they're willing to pay for. The surprise is generally positive as well as negative.",
      "translated": "当你让客户告诉你他们想要什么时，他们往往会揭示出他们认为有价值的东西以及他们愿意为之付费的细节。这些意外通常既有正面的也有负面的。"
    },
    {
      "original": "They won't like what you've built, but there will be other things they would like that would be trivially easy to implement. It's not till you start the conversation by launching the wrong thing that they can express (or perhaps even realize) what they're looking for.",
      "translated": "他们不会喜欢你所创建的东西，但会有一些他们喜欢的东西，而这些却是很容易实现的。只有当你启动了错误的项目开始对话时，他们才能表达（或者也许是意识到）他们真正想要的是什么。"
    },
    {
      "original": "10. Change Your IdeaTo benefit from engaging with users you have to be willing to change your idea. We've always encouraged founders to see a startup idea as a hypothesis rather than a blueprint. And yet they're still surprised how well it works to change the idea.",
      "translated": "10. 调整你的想法\n为了从与用户的互动中获益，你必须愿意调整你的想法。我们一直鼓励创始人将创业想法视为一种假设，而不是蓝图。然而，他们仍然对改变想法的效果感到惊讶。"
    },
    {
      "original": "Normally if you complain about something being hard, the general advice is to work harder. With a startup, I think you should find a problem that's easy for you to solve. Optimizing in solution-space is familiar and straightforward, but you can make enormous gains playing around in problem-space.",
      "translated": "通常，如果你抱怨某事很难，一般的建议是更加努力地工作。对于创业来说，我认为你应该找到一个对你来说容易解决的问题。在解决方案空间中进行优化是熟悉且直接的，但你可以在问题空间中探索并获得巨大的收益。"
    },
    {
      "original": "Whereas mere determination, without flexibility, is a greedy algorithm that may get you nothing more than a mediocre local maximum: When someone is determined, there's still a danger that they'll follow a long, hard path that ultimately leads nowhere.",
      "translated": "仅凭决心而缺乏灵活性，就像一种贪婪算法，最终可能只让你达到平庸的局部最优：当一个人下定决心时，仍有可能会走上一条漫长而艰难的道路，最终却一无所获。"
    },
    {
      "original": "You want to push forward, but at the same time twist and turn to find the most promising path. One founder put it very succinctly: Fast iteration is the key to success. One reason this advice is so hard to follow is that people don't realize how hard it is to judge startup ideas, particularly their own.",
      "translated": "你想要向前推进，但同时也要灵活变通，寻找最有前景的道路。一位创始人简洁地总结道：快速迭代是成功的关键。这些建议之所以难以遵循，一个原因是人们没有意识到评估创业点子，尤其是自己的点子，有多么困难。"
    },
    {
      "original": "Experienced founders learn to keep an open mind: Now I don't laugh at ideas anymore, because I realized how terrible I was at knowing if they were good or not. You can never tell what will work. You just have to do whatever seems best at each point.",
      "translated": "有经验的创始人学会了保持开放的心态：现在我不再嘲笑任何想法，因为我意识到自己根本无法准确判断这些想法的好坏。你永远无法预知什么会成功。你只能根据每个阶段的情况，去做当时看起来最合理的事情。"
    },
    {
      "original": "We do this with YC itself. We still don't know if it will work, but it seems like a decent hypothesis. 11. Don't Worry about CompetitorsWhen you think you've got a great idea, it's sort of like having a guilty conscience about something.",
      "translated": "我们对YC本身也是如此。我们还不知道这是否会奏效，但似乎是一个不错的假设。11. 不要担心竞争对手。当你觉得自己有了一个好主意时，这有点像对某事感到内疚。"
    },
    {
      "original": "All someone has to do is look at you funny, and you think \"Oh my God, they know.\"These alarms are almost always false: Companies that seemed like competitors and threats at first glance usually never were when you really looked at it.",
      "translated": "只要有人怪异地看你一眼，你就会想：“天啊，他们知道了。”这些警报几乎总是虚惊一场：一开始看似是竞争对手和威胁的公司，当你仔细研究后通常发现根本不是那么回事。"
    },
    {
      "original": "Even if they were operating in the same area, they had a different goal. One reason people overreact to competitors is that they overvalue ideas. If ideas really were the key, a competitor with the same idea would be a real threat.",
      "translated": "即使他们在同一领域运营，他们的目标也不同。人们之所以对竞争对手反应过度，一个原因是他们高估了想法的价值。如果想法真的是关键，那么拥有相同想法的竞争对手确实会构成威胁。"
    },
    {
      "original": "But it's usually execution that matters: All the scares induced by seeing a new competitor pop up are forgotten weeks later. It always comes down to your own product and approach to the market. This is generally true even if competitors get lots of attention.",
      "translated": "但通常重要的是执行：几周后，对新竞争对手出现所引起的恐慌就会被遗忘。归根结底，关键在于你自己的产品和市场策略。即使竞争对手获得大量关注，这一原则通常仍然适用。"
    },
    {
      "original": "Competitors riding on lots of good blogger perception aren't really the winners and can disappear from the map quickly. You need consumers after all. Hype doesn't make satisfied users, at least not for something as complicated as technology.12.",
      "translated": "依赖大量博主好评的竞争对手并不真正是赢家，可能会很快从市场上消失。毕竟，你需要的是消费者。炒作并不能造就满意的用户，至少对于像技术这样复杂的产品来说是这样。"
    },
    {
      "original": "It's Hard to Get UsersA lot of founders complained about how hard it was to get users, though. I had no idea how much time and effort needed to go into attaining users. This is a complicated topic. When you can't get users, it's hard to say whether the problem is lack of exposure, or whether the product's simply bad.",
      "translated": "获取用户很难。很多创始人抱怨获取用户有多么困难，我之前完全不知道需要投入多少时间和精力来吸引用户。这是一个复杂的话题。当你无法获取用户时，很难判断问题出在缺乏曝光度上，还是产品本身有问题。"
    },
    {
      "original": "Even good products can be blocked by switching or integration costs: Getting people to use a new service is incredibly difficult. This is especially true for a service that other companies can use, because it requires their developers to do work.",
      "translated": "即使优质的产品也可能因转换成本或集成成本而受阻：让人们使用新的服务是非常困难的。对于其他公司也能使用的服务而言，这一点尤为明显，因为这需要他们的开发人员进行工作。"
    },
    {
      "original": "If you're small, they don't think it is urgent. [4] The sharpest criticism of YC came from a founder who said we didn't focus enough on customer acquisition: YC preaches \"make something people want\" as an engineering task, a never ending stream of feature after feature until enough people are happy and the application takes off.",
      "translated": "如果你规模小，他们就不会认为这是紧急的。[4] 对YC最尖锐的批评来自一位创始人，他说YC在客户获取上投入的精力不足：YC宣扬“做出人们想要的东西”是一项工程任务，不断推出一个又一个功能，直到足够多的人满意，应用才能起飞。"
    },
    {
      "original": "There's very little focus on the cost of customer acquisition. This may be true; this may be something we need to fix, especially for applications like games. If you make something where the challenges are mostly technical, you can rely on word of mouth, like Google did.",
      "translated": "对于客户获取成本的关注非常少。这可能是事实，这可能是我们需要解决的问题，特别是对于游戏类应用。如果你制作的东西主要挑战在于技术方面，你可以依赖口碑传播，就像谷歌所做的那样。"
    },
    {
      "original": "One founder was surprised by how well that worked for him: There is an irrational fear that no one will buy your product. But if you work hard and incrementally make it better, there is no need to worry.",
      "translated": "一位创始人对他取得的成效感到惊讶：有一种非理性的恐惧，担心没有人会购买你的产品。但只要你努力工作，并逐步改进，就无需担心。"
    },
    {
      "original": "But with other types of startups you may win less by features and more by deals and marketing. 13. Expect the Worst with DealsDeals fall through. That's a constant of the startup world. Startups are powerless, and good startup ideas generally seem wrong.",
      "translated": "但对于其他类型的初创企业，你可能更多地依靠交易和营销，而不是产品特性来获得优势。13. 对交易抱最坏的预期交易可能会告吹。这是初创企业界的一个常数。初创企业无力回天，而好的创业点子通常看起来都是错的。"
    },
    {
      "original": "So everyone is nervous about closing deals with you, and you have no way to make them.This is particularly true with investors: In retrospect, it would have been much better if we had operated under the assumption that we would never get any additional outside investment.",
      "translated": "所以每个人都对你完成交易感到紧张，而你对此无能为力。这一点在投资者身上尤为明显：事后看来，如果我们一开始就假设不会获得任何额外的外部投资，情况会好得多。"
    },
    {
      "original": "That would have focused us on finding revenue streams early. My advice is generally pessimistic. Assume you won't get money, and if someone does offer you any, assume you'll never get any more. If someone offers you money, take it.",
      "translated": "这会使我们更早地专注于寻找收入来源。我的建议通常偏向悲观。假设你得不到资金，即使有人给你钱，也要假设你以后再也不会得到。如果有人给你钱，就接受吧。"
    },
    {
      "original": "You say it a lot, but I think it needs even more emphasizing. We had the opportunity to raise a lot more money than we did last year and I wish we had. Why do founders ignore me? Mostly because they're optimistic by nature.",
      "translated": "你经常说这一点，但我认为还需要进一步强调。我们本来有机会筹集到比去年更多的资金，而我希望我们当时那样做了。为什么创始人会忽视我？主要是因为他们天性乐观。"
    },
    {
      "original": "The mistake is to be optimistic about things you can't control. By all means be optimistic about your ability to make something great. But you're asking for trouble if you're optimistic about big companies or investors.",
      "translated": "错误在于对无法控制的事情抱有乐观态度。当然，你应该对自己的能力抱有乐观，相信自己能创造出伟大的事物。但如果你对大公司或投资者抱有乐观态度，那你就自找麻烦了。"
    },
    {
      "original": "14. Investors Are CluelessA lot of founders mentioned how surprised they were by the cluelessness of investors: They don't even know about the stuff they've invested in. I met some investors that had invested in a hardware device and when I asked them to demo the device they had difficulty switching it on.",
      "translated": "14. 投资者一无所知许多创始人提到，他们对投资者的无知感到惊讶：他们甚至不了解自己已经投资的项目。我遇到过一些投资了硬件设备的投资者，当要求他们演示设备时，他们连开机都有困难。"
    },
    {
      "original": "Angels are a bit better than VCs, because they usually have startup experience themselves: VC investors don't know half the time what they are talking about and are years behind in their thinking. A few were great, but 95% of the investors we dealt with were unprofessional, didn't seem to be very good at business or have any kind of creative vision.",
      "translated": "天使投资人比风险投资家略胜一筹，因为他们通常自己有过创业经验：风险投资家很多时候并不知道自己在说什么，他们的思维已经落后了好几年。少数几个非常出色，但我们接触的95%的投资人表现得不专业，似乎并不擅长商业，也没有任何创意远见。"
    },
    {
      "original": "Angels were generally much better to talk to. Why are founders surprised that VCs are clueless? I think it's because they seem so formidable.The reason VCs seem formidable is that it's their profession to.",
      "translated": "天使投资人通常更愿意与人交谈。为什么创始人会对风投一无所知感到惊讶？我认为这是因为风投看起来很厉害。风投之所以显得厉害，是因为这是他们的职业特点。"
    },
    {
      "original": "You get to be a VC by convincing asset managers to trust you with hundreds of millions of dollars. How do you do that? You have to seem confident, and you have to seem like you understand technology.",
      "translated": "你要成为风险投资家，就需要说服资产管理者信任你，将数亿美元交给你管理。你是怎么做到的？你必须显得自信，而且要显得你懂技术。"
    },
    {
      "original": "[5] 15. You May Have to Play GamesBecause investors are so bad at judging you, you have to work harder than you should at selling yourself. One founder said the thing that surprised him most was The degree to which feigning certitude impressed investors.",
      "translated": "[5] 15. 你可能不得不玩些心理战术\n由于投资者在评估你时表现得不够专业，你不得不更加努力地推销自己。一位创始人表示，最让他感到惊讶的是，假装自信竟然能给投资者留下深刻印象。"
    },
    {
      "original": "This is the thing that has surprised me most about YC founders' experiences. This summer we invited some of the alumni to talk to the new startups about fundraising, and pretty much 100% of their advice was about investor psychology.",
      "translated": "这是我最惊讶的关于YC创始人的经历。今年夏天，我们邀请了一些校友与新的创业公司分享融资经验，他们几乎100%的建议都是关于投资者心理的。"
    },
    {
      "original": "I thought I was cynical about VCs, but the founders were much more cynical. A lot of what startup founders do is just posturing. It works. VCs themselves have no idea of the extent to which the startups they like are the ones that are best at selling themselves to VCs.",
      "translated": "我以为我对风险投资家已经够冷嘲热讽了，但创始人们更加冷嘲热讽。许多初创企业的创始人所做的只是装样子。但这很管用。风险投资家自己也根本不知道，他们喜欢的初创企业恰恰是那些最擅长向风险投资家推销自己的企业。"
    },
    {
      "original": "[6] It's exactly the same phenomenon we saw a step earlier. VCs get money by seeming confident to LPs, and founders get money by seeming confident to VCs. 16. Luck Is a Big FactorWith two such random linkages in the path between startups and money, it shouldn't be surprising that luck is a big factor in deals.",
      "translated": "[6] 这正是我们之前看到的现象。风险投资家通过向有限合伙人表现出自信来获得资金，而创业者则通过向风险投资家表现出自信来获得资金。16. 运气是重要因素在初创企业和资金之间的路径上存在两个如此随机的环节，因此，交易中运气扮演着重要角色也就不足为奇了。"
    },
    {
      "original": "And yet a lot of founders are surprised by it. I didn't realize how much of a role luck plays and how much is outside of our control. If you think about famous startups, it's pretty clear how big a role luck plays.",
      "translated": "然而，许多创始人对此感到惊讶。我没有意识到运气起到了多大的作用，有多少事情超出了我们的控制。如果你想想那些著名的创业公司，运气所起的作用就很明显了。"
    },
    {
      "original": "Where would Microsoft be if IBM insisted on an exclusive license for DOS?Why are founders fooled by this? Business guys probably aren't, but hackers are used to a world where skill is paramount, and you get what you deserve.",
      "translated": "如果IBM坚持要求对DOS的独家许可，微软会怎么样？为什么创始人会被这一点愚弄？商业人士可能不会，但黑客习惯于一个技能至上的世界，在那里你得到的是你应得的。"
    },
    {
      "original": "When we started our startup, I had bought the hype of the startup founder dream: that this is a game of skill. It is, in some ways. Having skill is valuable. So is being determined as all hell. But being lucky is the critical ingredient.",
      "translated": "当我们开始创业时，我曾被创业者的梦想所吸引：这是一场技能的游戏。在某种程度上确实如此。拥有技能是宝贵的。坚定的决心也同样重要。但最关键的因素是运气。"
    },
    {
      "original": "Actually the best model would be to say that the outcome is the product of skill, determination, and luck. No matter how much skill and determination you have, if you roll a zero for luck, the outcome is zero.These quotes about luck are not from founders whose startups failed.",
      "translated": "实际上，最好的模型是说结果是技能、决心和运气的产物。无论你拥有多少技能和决心，如果运气为零，结果就是零。这些关于运气的名言并不是来自创业失败的创始人。"
    },
    {
      "original": "Founders who fail quickly tend to blame themselves. Founders who succeed quickly don't usually realize how lucky they were. It's the ones in the middle who see how important luck is. 17. The Value of CommunityA surprising number of founders said what surprised them most about starting a startup was the value of community.",
      "translated": "失败的创始人往往归咎于自己。成功的创始人通常没有意识到他们有多幸运。反而是那些处于中间状态的人看到了运气的重要性。令人惊讶的是，许多创始人表示，让他们最感到意外的是社区的价值。"
    },
    {
      "original": "Some meant the micro-community of YC founders: The immense value of the peer group of YC companies, and facing similar obstacles at similar times. which shouldn't be that surprising, because that's why it's structured that way.",
      "translated": "有些人指的是YC创始人的小微社区：YC公司同行群体的巨大价值，以及在相似的时间面对相似的障碍。这并不令人惊讶，因为YC就是以这种方式构建的。"
    },
    {
      "original": "Others were surprised at the value of the startup community in the larger sense: How advantageous it is to live in Silicon Valley, where you can't help but hear all the cutting-edge tech and startup news, and run into useful people constantly.",
      "translated": "其他人对创业社群在更广泛意义上的价值感到惊讶：生活在硅谷是多么有利，你无法避免地会听到所有前沿技术和创业新闻，并且不断遇到有用的人。"
    },
    {
      "original": "The specific thing that surprised them most was the general spirit of benevolence: One of the most surprising things I saw was the willingness of people to help us. Even people who had nothing to gain went out of their way to help our startup succeed.",
      "translated": "让他们最感到惊讶的是普遍的善意：我看到的最令人惊讶的事情之一是人们愿意帮助我们。即使那些一无所获的人也会不遗余力地帮助我们的初创企业取得成功。"
    },
    {
      "original": "and particularly how it extended all the way to the top: The surprise for me was how accessible important and interesting people are. It's amazing how easily you can reach out to people and get immediate feedback.",
      "translated": "尤其是它延伸到了最高层：让我感到惊讶的是，那些重要且有趣的人物竟然如此平易近人。你能很容易地联系到这些人并立即得到反馈，这真是令人惊讶。"
    },
    {
      "original": "This is one of the reasons I like being part of this world. Creating wealth is not a zero-sum game, so you don't have to stab people in the back to win. 18. You Get No RespectThere was one surprise founders mentioned that I'd forgotten about: that outside the startup world, startup founders get no respect.",
      "translated": "这是我喜欢成为这个世界一部分的原因之一。创造财富并不是零和游戏，所以你不必为了胜利而背后捅人。18. 你得不到尊重有一个创始人提到的意外之处我差点忘了：在创业圈之外，创业者的地位并不高。"
    },
    {
      "original": "In social settings, I found that I got a lot more respect when I said, \"I worked on Microsoft Office\" instead of \"I work at a small startup you've never heard of called x.\" Partly this is because the rest of the world just doesn't get startups, and partly it's yet another consequence of the fact that most good startup ideas seem bad: If you pitch your idea to a random person, 95% of the time you'll find the person instinctively thinks the idea will be a flop and you're wasting your time (although they probably won't say this directly).",
      "translated": "在社交场合，我发现当我提到“我在微软Office工作”时，会获得更多的尊重，而如果说“我在一家你从未听说过的叫x的小创业公司工作”，则不会得到同样的待遇。部分原因是外界对创业公司往往缺乏了解，部分则是因为大多数好的创业点子在一开始看起来都像是不靠谱的：如果你向一个随机的人推销你的想法，95%的情况下，对方会本能地认为这个点子不会成功，你在浪费时间（尽管他们可能不会直接说出来）。"
    },
    {
      "original": "Unfortunately this extends even to dating: It surprised me that being a startup founder does not get you more admiration from women. I did know about that, but I'd forgotten. 19. Things Change as You GrowThe last big surprise founders mentioned is how much things changed as they grew.",
      "translated": "不幸的是，这种情况甚至延伸到了约会：让我惊讶的是，作为一名创业公司的创始人并不能让你从女性那里获得更多 admiration。我知道这一点，但还是忘了。19. 随着成长，事情会有所变化最后，创始人提到的一个重大 surprise 是，随着公司的成长，很多事情都发生了变化。"
    },
    {
      "original": "The biggest change was that you got to program even less: Your job description as technical founder/CEO is completely rewritten every 6-12 months. Less coding, more managing/planning/company building, hiring, cleaning up messes, and generally getting things in place for what needs to happen a few months from now.",
      "translated": "最大的变化是你的编程工作变得更少了：作为技术创始人/CEO，你的工作描述每6-12个月就会完全改写一次。减少编码，增加管理/规划/公司建设、招聘、清理混乱，以及为几个月后需要发生的事情做好准备。"
    },
    {
      "original": "In particular, you now have to deal with employees, who often have different motivations: I knew the founder equation and had been focused on it since I knew I wanted to start a startup as a 19 year old.",
      "translated": "特别是，你现在必须处理员工的问题，他们往往有不同的动机：我知道创始人的等式，自从我19岁决定要创业以来，就一直专注于它。"
    },
    {
      "original": "The employee equation is quite different so it took me a while to get it down. Fortunately, it can become a lot less stressful once you reach cruising altitude: I'd say 75% of the stress is gone now from when we first started.",
      "translated": "员工问题确实有所不同，所以我花了一些时间才弄清楚。幸运的是，一旦进入平稳状态，压力就会大大减轻：我认为现在与我们刚开始时相比，压力已经减少了75%。"
    },
    {
      "original": "Running a business is so much more enjoyable now. We're more confident. We're more patient. We fight less. We sleep more. I wish I could say it was this way for every startup that succeeded, but 75% is probably on the high side.",
      "translated": "现在经营企业变得更加愉快了。我们更加自信，更加有耐心，争吵也少了，睡眠也更多了。我希望我可以说每个成功的初创公司都是这样，但75%的比例可能已经偏高了。"
    },
    {
      "original": "The Super-PatternThere were a few other patterns, but these were the biggest. One's first thought when looking at them all is to ask if there's a super-pattern, a pattern to the patterns.I saw it immediately, and so did a YC founder I read the list to.",
      "translated": "超级模式\n\n还有一些其他的模式，但这些是最大的。看到所有这些模式时，人们首先想到的是是否存在一个超级模式，即模式的模式。\n\n我立刻就看出来了，我读这份列表给一位YC创始人听时，他也立刻看出来了。"
    },
    {
      "original": "These are supposed to be the surprises, the things I didn't tell people. What do they all have in common? They're all things I tell people. If I wrote a new essay with the same outline as this that wasn't summarizing the founders' responses, everyone would say I'd run out of ideas and was just repeating myself.What is going on here?When I look at the responses, the common theme is that starting a startup was like I said, but way more so.",
      "translated": "这些本应是出人意料的事情，是我没有告诉人们的。但它们有什么共同点呢？它们都是我告诉过人们的。如果我写一篇新的文章，结构与这篇相同，但不是总结创始人的回应，每个人都会说我已经没有新想法了，只是在重复自己。这里到底发生了什么？当我看这些回应时，共同的主题是，创业确实如我所说，但要强烈得多。"
    },
    {
      "original": "People just don't seem to get how different it is till they do it. Why? The key to that mystery is to ask, how different from what? Once you phrase it that way, the answer is obvious: from a job. Everyone's model of work is a job.",
      "translated": "人们似乎只有亲身尝试后才能理解其中有多么不同。为什么？解开这个谜的关键在于问，与什么不同？一旦这样提问，答案就显而易见了：与工作不同。每个人对工作的理解都是基于一份工作。"
    },
    {
      "original": "It's completely pervasive. Even if you've never had a job, your parents probably did, along with practically every other adult you've met.Unconsciously, everyone expects a startup to be like a job, and that explains most of the surprises.",
      "translated": "它无处不在。即使你自己从未工作过，你的父母很可能工作过，你遇到的几乎每一个成年人大概也是如此。不知不觉中，每个人都期望初创公司像一份工作，而这解释了大多数的意外。"
    },
    {
      "original": "It explains why people are surprised how carefully you have to choose cofounders and how hard you have to work to maintain your relationship. You don't have to do that with coworkers. It explains why the ups and downs are surprisingly extreme.",
      "translated": "它解释了为什么人们会惊讶于选择联合创始人时需要如此谨慎，以及维护这种关系需要付出多么大的努力。对于同事，你不需要这样做。这也解释了为什么创业过程中的起伏会出乎意料地剧烈。"
    },
    {
      "original": "In a job there is much more damping. But it also explains why the good times are surprisingly good: most people can't imagine such freedom. As you go down the list, almost all the surprises are surprising in how much a startup differs from a job.You probably can't overcome anything so pervasive as the model of work you grew up with.",
      "translated": "在工作中有更多阻尼。但这也能解释为什么好时光出奇地美好：大多数人无法想象这样的自由。当你往下看这个列表时，几乎所有的惊喜都在于创业公司与工作有多么不同。你可能无法克服你从小习惯的工作模式。"
    },
    {
      "original": "So the best solution is to be consciously aware of that. As you go into a startup, you'll be thinking \"everyone says it's really extreme.\" Your next thought will probably be \"but I can't believe it will be that bad.\" If you want to avoid being surprised, the next thought after that should be: \"and the reason I can't believe it will be that bad is that my model of work is a job.\" Notes[1] Graduate students might understand it.",
      "translated": "所以最好的解决办法是有意识地认识到这一点。当你进入一家初创公司时，你可能会想“大家都说这真的很极端。”你接下来的想法可能是“但我无法相信会那么糟糕。”如果你想避免感到惊讶，那么接下来的想法应该是：“我无法相信会那么糟糕的原因是我对工作的认知是基于一份工作的模式。”注[1]研究生可能能理解这一点。"
    },
    {
      "original": "In grad school you always feel you should be working on your thesis. It doesn't end every semester like classes do.[2] The best way for a startup to engage with slow-moving organizations is to fork off separate processes to deal with them.",
      "translated": "在研究生期间，你总是觉得应该在写论文。这不像课程那样每学期都有结束。[2] 创业公司与行动迟缓的组织合作的最佳方式是分叉出单独的流程来处理它们。"
    },
    {
      "original": "It's when they're on the critical path that they kill you—when you depend on closing a deal to move forward. It's worth taking extreme measures to avoid that.[3] This is a variant of Reid Hoffman's principle that if you aren't embarrassed by what you launch with, you waited too long to launch.[4] The question to ask about what you've built is not whether it's good, but whether it's good enough to supply the activation energy required.[5] Some VCs seem to understand technology because they actually do, but that's overkill; the defining test is whether you can talk about it well enough to convince limited partners.[6] This is the same phenomenon you see with defense contractors or fashion brands.",
      "translated": "当它们处于关键路径上时，它们就会致命——当你的前进依赖于达成交易时。值得采取极端措施来避免这种情况。[3] 这是里德·霍夫曼原则的一个变体，即如果你在启动时没有感到尴尬，那就说明你启动得太晚了。[4] 关于你所构建的东西，应该问的问题不是它是否好，而是它是否足够好以提供所需的激活能量。[5] 一些风险投资家似乎理解技术，因为他们确实理解，但这有点过头了；真正的考验是你能否将技术讲得足够好以说服有限合伙人。[6] 这种现象在国防承包商或时尚品牌中也能看到。"
    },
    {
      "original": "The dumber the customers, the more effort you expend on the process of selling things to them rather than making the things you sell.Thanks: to Jessica Livingston for reading drafts of this, and to all the founders who responded to my email.Related:Startups in 13 SentencesThe Hardest Lessons for Startups to LearnHow Not to DieThe 18 Mistakes That Kill StartupsA Fundraising Survival GuideRussian TranslationKorean TranslationHebrew Translation",
      "translated": "顾客越愚蠢，你在销售过程上花费的精力就越多，而不是在你销售的产品上。感谢：感谢杰西卡·利文斯顿审阅本文草稿，以及所有回复我邮件的创始人。相关文章：创业公司在13句话中总结初创企业 hardest 的教训如何避免失败导致初创公司失败的18个错误融资生存指南俄文翻译韩文翻译希伯来文翻译"
    }
  ],
  "translation_completed": "2025-07-29T11:48:21.848167",
  "translation_stats": {
    "total_paragraphs": 100,
    "success_count": 100,
    "success_rate": "100.0%"
  }
}