{
  "title": "What You Can't Say",
  "title_zh": "[待翻译] What You Can't Say",
  "url": "https://www.paulgraham.com/say.html",
  "filename": "say.html",
  "date": "2004-01-01",
  "id": 217,
  "content": {
    "success": true,
    "paragraphs": [
      "January 2004 Have you ever seen an old photo of yourself and been embarrassed at the way you looked? Did we actually dress like that? We did. And we had no idea how silly we looked. It's the nature of fashion to be invisible, in the same way the movement of the earth is invisible to all of us riding on it.What scares me is that there are moral fashions too.",
      "They're just as arbitrary, and just as invisible to most people. But they're much more dangerous. Fashion is mistaken for good design; moral fashion is mistaken for good. Dressing oddly gets you laughed at.",
      "Violating moral fashions can get you fired, ostracized, imprisoned, or even killed.If you could travel back in a time machine, one thing would be true no matter where you went: you'd have to watch what you said.",
      "Opinions we consider harmless could have gotten you in big trouble. I've already said at least one thing that would have gotten me in big trouble in most of Europe in the seventeenth century, and did get Galileo in big trouble when he said it — that the earth moves.",
      "[1] It seems to be a constant throughout history: In every period, people believed things that were just ridiculous, and believed them so strongly that you would have gotten in terrible trouble for saying otherwise.Is our time any different?",
      "To anyone who has read any amount of history, the answer is almost certainly no. It would be a remarkable coincidence if ours were the first era to get everything just right.It's tantalizing to think we believe things that people in the future will find ridiculous.",
      "What would someone coming back to visit us in a time machine have to be careful not to say? That's what I want to study here. But I want to do more than just shock everyone with the heresy du jour. I want to find general recipes for discovering what you can't say, in any era.The Conformist TestLet's start with a test: Do you have any opinions that you would be reluctant to express in front of a group of your peers?If the answer is no, you might want to stop and think about that.",
      "If everything you believe is something you're supposed to believe, could that possibly be a coincidence? Odds are it isn't. Odds are you just think what you're told.The other alternative would be that you independently considered every question and came up with the exact same answers that are now considered acceptable.",
      "That seems unlikely, because you'd also have to make the same mistakes. Mapmakers deliberately put slight mistakes in their maps so they can tell when someone copies them. If another map has the same mistake, that's very convincing evidence.Like every other era in history, our moral map almost certainly contains a few mistakes.",
      "And anyone who makes the same mistakes probably didn't do it by accident. It would be like someone claiming they had independently decided in 1972 that bell-bottom jeans were a good idea.If you believe everything you're supposed to now, how can you be sure you wouldn't also have believed everything you were supposed to if you had grown up among the plantation owners of the pre-Civil War South, or in Germany in the 1930s — or among the Mongols in 1200, for that matter?",
      "Odds are you would have.Back in the era of terms like \"well-adjusted,\" the idea seemed to be that there was something wrong with you if you thought things you didn't dare say out loud. This seems backward.",
      "Almost certainly, there is something wrong with you if you don't think things you don't dare say out loud.TroubleWhat can't we say? One way to find these ideas is simply to look at things people do say, and get in trouble for.",
      "[2]Of course, we're not just looking for things we can't say. We're looking for things we can't say that are true, or at least have enough chance of being true that the question should remain open. But many of the things people get in trouble for saying probably do make it over this second, lower threshold.",
      "No one gets in trouble for saying that 2 + 2 is 5, or that people in Pittsburgh are ten feet tall. Such obviously false statements might be treated as jokes, or at worst as evidence of insanity, but they are not likely to make anyone mad.",
      "The statements that make people mad are the ones they worry might be believed. I suspect the statements that make people maddest are those they worry might be true.If Galileo had said that people in Padua were ten feet tall, he would have been regarded as a harmless eccentric.",
      "Saying the earth orbited the sun was another matter. The church knew this would set people thinking.Certainly, as we look back on the past, this rule of thumb works well. A lot of the statements people got in trouble for seem harmless now.",
      "So it's likely that visitors from the future would agree with at least some of the statements that get people in trouble today. Do we have no Galileos? Not likely.To find them, keep track of opinions that get people in trouble, and start asking, could this be true?",
      "Ok, it may be heretical (or whatever modern equivalent), but might it also be true?HeresyThis won't get us all the answers, though. What if no one happens to have gotten in trouble for a particular idea yet?",
      "What if some idea would be so radioactively controversial that no one would dare express it in public? How can we find these too?Another approach is to follow that word, heresy. In every period of history, there seem to have been labels that got applied to statements to shoot them down before anyone had a chance to ask if they were true or not.",
      "\"Blasphemy\", \"sacrilege\", and \"heresy\" were such labels for a good part of western history, as in more recent times \"indecent\", \"improper\", and \"unamerican\" have been. By now these labels have lost their sting.",
      "They always do. By now they're mostly used ironically. But in their time, they had real force.The word \"defeatist\", for example, has no particular political connotations now. But in Germany in 1917 it was a weapon, used by Ludendorff in a purge of those who favored a negotiated peace.",
      "At the start of World War II it was used extensively by Churchill and his supporters to silence their opponents. In 1940, any argument against Churchill's aggressive policy was \"defeatist\". Was it right or wrong?",
      "Ideally, no one got far enough to ask that. We have such labels today, of course, quite a lot of them, from the all-purpose \"inappropriate\" to the dreaded \"divisive.\" In any period, it should be easy to figure out what such labels are, simply by looking at what people call ideas they disagree with besides untrue.",
      "When a politician says his opponent is mistaken, that's a straightforward criticism, but when he attacks a statement as \"divisive\" or \"racially insensitive\" instead of arguing that it's false, we should start paying attention.So another way to figure out which of our taboos future generations will laugh at is to start with the labels.",
      "Take a label — \"sexist\", for example — and try to think of some ideas that would be called that. Then for each ask, might this be true?Just start listing ideas at random? Yes, because they won't really be random.",
      "The ideas that come to mind first will be the most plausible ones. They'll be things you've already noticed but didn't let yourself think.In 1989 some clever researchers tracked the eye movements of radiologists as they scanned chest images for signs of lung cancer.",
      "[3] They found that even when the radiologists missed a cancerous lesion, their eyes had usually paused at the site of it. Part of their brain knew there was something there; it just didn't percolate all the way up into conscious knowledge.",
      "I think many interesting heretical thoughts are already mostly formed in our minds. If we turn off our self-censorship temporarily, those will be the first to emerge.Time and SpaceIf we could look into the future it would be obvious which of our taboos they'd laugh at.",
      "We can't do that, but we can do something almost as good: we can look into the past. Another way to figure out what we're getting wrong is to look at what used to be acceptable and is now unthinkable.Changes between the past and the present sometimes do represent progress.",
      "In a field like physics, if we disagree with past generations it's because we're right and they're wrong. But this becomes rapidly less true as you move away from the certainty of the hard sciences. By the time you get to social questions, many changes are just fashion.",
      "The age of consent fluctuates like hemlines.We may imagine that we are a great deal smarter and more virtuous than past generations, but the more history you read, the less likely this seems. People in past times were much like us.",
      "Not heroes, not barbarians. Whatever their ideas were, they were ideas reasonable people could believe.So here is another source of interesting heresies. Diff present ideas against those of various past cultures, and see what you get.",
      "[4] Some will be shocking by present standards. Ok, fine; but which might also be true?You don't have to look into the past to find big differences. In our own time, different societies have wildly varying ideas of what's ok and what isn't.",
      "So you can try diffing other cultures' ideas against ours as well. (The best way to do that is to visit them.) Any idea that's considered harmless in a significant percentage of times and places, and yet is taboo in ours, is a candidate for something we're mistaken about.For example, at the high water mark of political correctness in the early 1990s, Harvard distributed to its faculty and staff a brochure saying, among other things, that it was inappropriate to compliment a colleague or student's clothes.",
      "No more \"nice shirt.\" I think this principle is rare among the world's cultures, past or present. There are probably more where it's considered especially polite to compliment someone's clothing than where it's considered improper.",
      "Odds are this is, in a mild form, an example of one of the taboos a visitor from the future would have to be careful to avoid if he happened to set his time machine for Cambridge, Massachusetts, 1992.",
      "[5]PrigsOf course, if they have time machines in the future they'll probably have a separate reference manual just for Cambridge. This has always been a fussy place, a town of i dotters and t crossers, where you're liable to get both your grammar and your ideas corrected in the same conversation.",
      "And that suggests another way to find taboos. Look for prigs, and see what's inside their heads.Kids' heads are repositories of all our taboos. It seems fitting to us that kids' ideas should be bright and clean.",
      "The picture we give them of the world is not merely simplified, to suit their developing minds, but sanitized as well, to suit our ideas of what kids ought to think. [6]You can see this on a small scale in the matter of dirty words.",
      "A lot of my friends are starting to have children now, and they're all trying not to use words like \"fuck\" and \"shit\" within baby's hearing, lest baby start using these words too. But these words are part of the language, and adults use them all the time.",
      "So parents are giving their kids an inaccurate idea of the language by not using them. Why do they do this? Because they don't think it's fitting that kids should use the whole language. We like children to seem innocent.",
      "[7]Most adults, likewise, deliberately give kids a misleading view of the world. One of the most obvious examples is Santa Claus. We think it's cute for little kids to believe in Santa Claus. I myself think it's cute for little kids to believe in Santa Claus.",
      "But one wonders, do we tell them this stuff for their sake, or for ours?I'm not arguing for or against this idea here. It is probably inevitable that parents should want to dress up their kids' minds in cute little baby outfits.",
      "I'll probably do it myself. The important thing for our purposes is that, as a result, a well brought-up teenage kid's brain is a more or less complete collection of all our taboos — and in mint condition, because they're untainted by experience.",
      "Whatever we think that will later turn out to be ridiculous, it's almost certainly inside that head.How do we get at these ideas? By the following thought experiment. Imagine a kind of latter-day Conrad character who has worked for a time as a mercenary in Africa, for a time as a doctor in Nepal, for a time as the manager of a nightclub in Miami.",
      "The specifics don't matter — just someone who has seen a lot. Now imagine comparing what's inside this guy's head with what's inside the head of a well-behaved sixteen year old girl from the suburbs.",
      "What does he think that would shock her? He knows the world; she knows, or at least embodies, present taboos. Subtract one from the other, and the result is what we can't say. MechanismI can think of one more way to figure out what we can't say: to look at how taboos are created.",
      "How do moral fashions arise, and why are they adopted? If we can understand this mechanism, we may be able to see it at work in our own time.Moral fashions don't seem to be created the way ordinary fashions are.",
      "Ordinary fashions seem to arise by accident when everyone imitates the whim of some influential person. The fashion for broad-toed shoes in late fifteenth century Europe began because Charles VIII of France had six toes on one foot.",
      "The fashion for the name Gary began when the actor Frank Cooper adopted the name of a tough mill town in Indiana. Moral fashions more often seem to be created deliberately. When there's something we can't say, it's often because some group doesn't want us to.The prohibition will be strongest when the group is nervous.",
      "The irony of Galileo's situation was that he got in trouble for repeating Copernicus's ideas. Copernicus himself didn't. In fact, Copernicus was a canon of a cathedral, and dedicated his book to the pope.",
      "But by Galileo's time the church was in the throes of the Counter-Reformation and was much more worried about unorthodox ideas.To launch a taboo, a group has to be poised halfway between weakness and power.",
      "A confident group doesn't need taboos to protect it. It's not considered improper to make disparaging remarks about Americans, or the English. And yet a group has to be powerful enough to enforce a taboo.",
      "Coprophiles, as of this writing, don't seem to be numerous or energetic enough to have had their interests promoted to a lifestyle.I suspect the biggest source of moral taboos will turn out to be power struggles in which one side only barely has the upper hand.",
      "That's where you'll find a group powerful enough to enforce taboos, but weak enough to need them.Most struggles, whatever they're really about, will be cast as struggles between competing ideas. The English Reformation was at bottom a struggle for wealth and power, but it ended up being cast as a struggle to preserve the souls of Englishmen from the corrupting influence of Rome.",
      "It's easier to get people to fight for an idea. And whichever side wins, their ideas will also be considered to have triumphed, as if God wanted to signal his agreement by selecting that side as the victor.We often like to think of World War II as a triumph of freedom over totalitarianism.",
      "We conveniently forget that the Soviet Union was also one of the winners.I'm not saying that struggles are never about ideas, just that they will always be made to seem to be about ideas, whether they are or not.",
      "And just as there is nothing so unfashionable as the last, discarded fashion, there is nothing so wrong as the principles of the most recently defeated opponent. Representational art is only now recovering from the approval of both Hitler and Stalin.",
      "[8]Although moral fashions tend to arise from different sources than fashions in clothing, the mechanism of their adoption seems much the same. The early adopters will be driven by ambition: self-consciously cool people who want to distinguish themselves from the common herd.",
      "As the fashion becomes established they'll be joined by a second, much larger group, driven by fear. [9] This second group adopt the fashion not because they want to stand out but because they are afraid of standing out.So if you want to figure out what we can't say, look at the machinery of fashion and try to predict what it would make unsayable.",
      "What groups are powerful but nervous, and what ideas would they like to suppress? What ideas were tarnished by association when they ended up on the losing side of a recent struggle? If a self-consciously cool person wanted to differentiate himself from preceding fashions (e.g.",
      "from his parents), which of their ideas would he tend to reject? What are conventional-minded people afraid of saying?This technique won't find us all the things we can't say. I can think of some that aren't the result of any recent struggle.",
      "Many of our taboos are rooted deep in the past. But this approach, combined with the preceding four, will turn up a good number of unthinkable ideas.WhySome would ask, why would one want to do this? Why deliberately go poking around among nasty, disreputable ideas?",
      "Why look under rocks?I do it, first of all, for the same reason I did look under rocks as a kid: plain curiosity. And I'm especially curious about anything that's forbidden. Let me see and decide for myself.Second, I do it because I don't like the idea of being mistaken.",
      "If, like other eras, we believe things that will later seem ridiculous, I want to know what they are so that I, at least, can avoid believing them.Third, I do it because it's good for the brain. To do good work you need a brain that can go anywhere.",
      "And you especially need a brain that's in the habit of going where it's not supposed to.Great work tends to grow out of ideas that others have overlooked, and no idea is so overlooked as one that's unthinkable.",
      "Natural selection, for example. It's so simple. Why didn't anyone think of it before? Well, that is all too obvious. Darwin himself was careful to tiptoe around the implications of his theory. He wanted to spend his time thinking about biology, not arguing with people who accused him of being an atheist.In the sciences, especially, it's a great advantage to be able to question assumptions.",
      "The m.o. of scientists, or at least of the good ones, is precisely that: look for places where conventional wisdom is broken, and then try to pry apart the cracks and see what's underneath. That's where new theories come from.A good scientist, in other words, does not merely ignore conventional wisdom, but makes a special effort to break it.",
      "Scientists go looking for trouble. This should be the m.o. of any scholar, but scientists seem much more willing to look under rocks. [10]Why? It could be that the scientists are simply smarter; most physicists could, if necessary, make it through a PhD program in French literature, but few professors of French literature could make it through a PhD program in physics.",
      "Or it could be because it's clearer in the sciences whether theories are true or false, and this makes scientists bolder. (Or it could be that, because it's clearer in the sciences whether theories are true or false, you have to be smart to get jobs as a scientist, rather than just a good politician.)Whatever the reason, there seems a clear correlation between intelligence and willingness to consider shocking ideas.",
      "This isn't just because smart people actively work to find holes in conventional thinking. I think conventions also have less hold over them to start with. You can see that in the way they dress.It's not only in the sciences that heresy pays off.",
      "In any competitive field, you can win big by seeing things that others daren't. And in every field there are probably heresies few dare utter. Within the US car industry there is a lot of hand-wringing now about declining market share.",
      "Yet the cause is so obvious that any observant outsider could explain it in a second: they make bad cars. And they have for so long that by now the US car brands are antibrands — something you'd buy a car despite, not because of.",
      "Cadillac stopped being the Cadillac of cars in about 1970. And yet I suspect no one dares say this. [11] Otherwise these companies would have tried to fix the problem.Training yourself to think unthinkable thoughts has advantages beyond the thoughts themselves.",
      "It's like stretching. When you stretch before running, you put your body into positions much more extreme than any it will assume during the run. If you can think things so outside the box that they'd make people's hair stand on end, you'll have no trouble with the small trips outside the box that people call innovative.Pensieri StrettiWhen you find something you can't say, what do you do with it?",
      "My advice is, don't say it. Or at least, pick your battles.Suppose in the future there is a movement to ban the color yellow. Proposals to paint anything yellow are denounced as \"yellowist\", as is anyone suspected of liking the color.",
      "People who like orange are tolerated but viewed with suspicion. Suppose you realize there is nothing wrong with yellow. If you go around saying this, you'll be denounced as a yellowist too, and you'll find yourself having a lot of arguments with anti-yellowists.",
      "If your aim in life is to rehabilitate the color yellow, that may be what you want. But if you're mostly interested in other questions, being labelled as a yellowist will just be a distraction. Argue with idiots, and you become an idiot.The most important thing is to be able to think what you want, not to say what you want.",
      "And if you feel you have to say everything you think, it may inhibit you from thinking improper thoughts. I think it's better to follow the opposite policy. Draw a sharp line between your thoughts and your speech.",
      "Inside your head, anything is allowed. Within my head I make a point of encouraging the most outrageous thoughts I can imagine. But, as in a secret society, nothing that happens within the building should be told to outsiders.",
      "The first rule of Fight Club is, you do not talk about Fight Club.When Milton was going to visit Italy in the 1630s, Sir Henry Wootton, who had been ambassador to Venice, told him his motto should be \"i pensieri stretti & il viso sciolto.\" Closed thoughts and an open face.",
      "Smile at everyone, and don't tell them what you're thinking. This was wise advice. Milton was an argumentative fellow, and the Inquisition was a bit restive at that time. But I think the difference between Milton's situation and ours is only a matter of degree.",
      "Every era has its heresies, and if you don't get imprisoned for them you will at least get in enough trouble that it becomes a complete distraction.I admit it seems cowardly to keep quiet. When I read about the harassment to which the Scientologists subject their critics [12], or that pro-Israel groups are \"compiling dossiers\" on those who speak out against Israeli human rights abuses [13], or about people being sued for violating the DMCA [14], part of me wants to say, \"All right, you bastards, bring it on.\" The problem is, there are so many things you can't say.",
      "If you said them all you'd have no time left for your real work. You'd have to turn into Noam Chomsky. [15]The trouble with keeping your thoughts secret, though, is that you lose the advantages of discussion.",
      "Talking about an idea leads to more ideas. So the optimal plan, if you can manage it, is to have a few trusted friends you can speak openly to. This is not just a way to develop ideas; it's also a good rule of thumb for choosing friends.",
      "The people you can say heretical things to without getting jumped on are also the most interesting to know.Viso Sciolto?I don't think we need the viso sciolto so much as the pensieri stretti. Perhaps the best policy is to make it plain that you don't agree with whatever zealotry is current in your time, but not to be too specific about what you disagree with.",
      "Zealots will try to draw you out, but you don't have to answer them. If they try to force you to treat a question on their terms by asking \"are you with us or against us?\" you can always just answer \"neither\".Better still, answer \"I haven't decided.\" That's what Larry Summers did when a group tried to put him in this position.",
      "Explaining himself later, he said \"I don't do litmus tests.\" [16] A lot of the questions people get hot about are actually quite complicated. There is no prize for getting the answer quickly.If the anti-yellowists seem to be getting out of hand and you want to fight back, there are ways to do it without getting yourself accused of being a yellowist.",
      "Like skirmishers in an ancient army, you want to avoid directly engaging the main body of the enemy's troops. Better to harass them with arrows from a distance.One way to do this is to ratchet the debate up one level of abstraction.",
      "If you argue against censorship in general, you can avoid being accused of whatever heresy is contained in the book or film that someone is trying to censor. You can attack labels with meta-labels: labels that refer to the use of labels to prevent discussion.",
      "The spread of the term \"political correctness\" meant the beginning of the end of political correctness, because it enabled one to attack the phenomenon as a whole without being accused of any of the specific heresies it sought to suppress.Another way to counterattack is with metaphor.",
      "Arthur Miller undermined the House Un-American Activities Committee by writing a play, \"The Crucible,\" about the Salem witch trials. He never referred directly to the committee and so gave them no way to reply.",
      "What could HUAC do, defend the Salem witch trials? And yet Miller's metaphor stuck so well that to this day the activities of the committee are often described as a \"witch-hunt.\"Best of all, probably, is humor.",
      "Zealots, whatever their cause, invariably lack a sense of humor. They can't reply in kind to jokes. They're as unhappy on the territory of humor as a mounted knight on a skating rink. Victorian prudishness, for example, seems to have been defeated mainly by treating it as a joke.",
      "Likewise its reincarnation as political correctness. \"I am glad that I managed to write 'The Crucible,'\" Arthur Miller wrote, \"but looking back I have often wished I'd had the temperament to do an absurd comedy, which is what the situation deserved.\" [17]ABQA Dutch friend says I should use Holland as an example of a tolerant society.",
      "It's true they have a long tradition of comparative open-mindedness. For centuries the low countries were the place to go to say things you couldn't say anywhere else, and this helped to make the region a center of scholarship and industry (which have been closely tied for longer than most people realize).",
      "Descartes, though claimed by the French, did much of his thinking in Holland.And yet, I wonder. The Dutch seem to live their lives up to their necks in rules and regulations. There's so much you can't do there; is there really nothing you can't say?Certainly the fact that they value open-mindedness is no guarantee.",
      "Who thinks they're not open-minded? Our hypothetical prim miss from the suburbs thinks she's open-minded. Hasn't she been taught to be? Ask anyone, and they'll say the same thing: they're pretty open-minded, though they draw the line at things that are really wrong.",
      "(Some tribes may avoid \"wrong\" as judgemental, and may instead use a more neutral sounding euphemism like \"negative\" or \"destructive\".)When people are bad at math, they know it, because they get the wrong answers on tests.",
      "But when people are bad at open-mindedness they don't know it. In fact they tend to think the opposite. Remember, it's the nature of fashion to be invisible. It wouldn't work otherwise. Fashion doesn't seem like fashion to someone in the grip of it.",
      "It just seems like the right thing to do. It's only by looking from a distance that we see oscillations in people's idea of the right thing to do, and can identify them as fashions.Time gives us such distance for free.",
      "Indeed, the arrival of new fashions makes old fashions easy to see, because they seem so ridiculous by contrast. From one end of a pendulum's swing, the other end seems especially far away.To see fashion in your own time, though, requires a conscious effort.",
      "Without time to give you distance, you have to create distance yourself. Instead of being part of the mob, stand as far away from it as you can and watch what it's doing. And pay especially close attention whenever an idea is being suppressed.",
      "Web filters for children and employees often ban sites containing pornography, violence, and hate speech. What counts as pornography and violence? And what, exactly, is \"hate speech?\" This sounds like a phrase out of 1984.Labels like that are probably the biggest external clue.",
      "If a statement is false, that's the worst thing you can say about it. You don't need to say that it's heretical. And if it isn't false, it shouldn't be suppressed. So when you see statements being attacked as x-ist or y-ic (substitute your current values of x and y), whether in 1630 or 2030, that's a sure sign that something is wrong.",
      "When you hear such labels being used, ask why.Especially if you hear yourself using them. It's not just the mob you need to learn to watch from a distance. You need to be able to watch your own thoughts from a distance.",
      "That's not a radical idea, by the way; it's the main difference between children and adults. When a child gets angry because he's tired, he doesn't know what's happening. An adult can distance himself enough from the situation to say \"never mind, I'm just tired.\" I don't see why one couldn't, by a similar process, learn to recognize and discount the effects of moral fashions.You have to take that extra step if you want to think clearly.",
      "But it's harder, because now you're working against social customs instead of with them. Everyone encourages you to grow up to the point where you can discount your own bad moods. Few encourage you to continue to the point where you can discount society's bad moods.How can you see the wave, when you're the water?",
      "Always be questioning. That's the only defence. What can't you say? And why?NotesThanks to Sarah Harlin, Trevor Blackwell, Jessica Livingston, Robert Morris, Eric Raymond and Bob van der Zwaan for reading drafts of this essay, and to Lisa Randall, Jackie McDonough, Ryan Stanley and Joel Rainey for conversations about heresy.",
      "Needless to say they bear no blame for opinions expressed in it, and especially for opinions not expressed in it.Re: What You Can't SayLabelsJapanese TranslationFrench TranslationGerman TranslationDutch TranslationRomanian TranslationHebrew TranslationTurkish TranslationChinese TranslationButtonsA Civic Duty to AnnoyThe Perils of ObedienceAliens Cause Global WarmingHays CodeStratagem 32Conspiracy TheoriesMark Twain: Corn-pone OpinionsA Blacklist for \"Excuse Makers\"What You Can't Say Will Hurt You"
    ],
    "word_count": 5363,
    "paragraph_count": 110
  },
  "processed_at": "2025-07-26T19:08:33.885143",
  "paragraphs": [
    {
      "original": "January 2004 Have you ever seen an old photo of yourself and been embarrassed at the way you looked? Did we actually dress like that? We did. And we had no idea how silly we looked. It's the nature of fashion to be invisible, in the same way the movement of the earth is invisible to all of us riding on it.What scares me is that there are moral fashions too.",
      "translated": "2004年1月 你是否曾经看到过自己的一张旧照片，对自己的样子感到尴尬？我们真的曾经那样打扮过吗？确实如此。而且我们一点也没有意识到自己看起来有多滑稽。时尚的本质就是隐形的，就像地球的运动对我们这些搭乘者来说是看不见的一样。令我感到害怕的是，道德也有时尚。"
    },
    {
      "original": "They're just as arbitrary, and just as invisible to most people. But they're much more dangerous. Fashion is mistaken for good design; moral fashion is mistaken for good. Dressing oddly gets you laughed at.",
      "translated": "它们同样随意，同样为大多数人所忽视。但它们更加危险。时尚被误认为是优秀的设计；道德时尚被误认为是正确的。穿着古怪会被人嘲笑。"
    },
    {
      "original": "Violating moral fashions can get you fired, ostracized, imprisoned, or even killed.If you could travel back in a time machine, one thing would be true no matter where you went: you'd have to watch what you said.",
      "translated": "违反道德风尚可能会让你被解雇、排斥、监禁，甚至丧命。如果你能乘坐时间机器回到过去，有一件事是肯定的：无论你去哪里，都必须注意自己的言行。"
    },
    {
      "original": "Opinions we consider harmless could have gotten you in big trouble. I've already said at least one thing that would have gotten me in big trouble in most of Europe in the seventeenth century, and did get Galileo in big trouble when he said it — that the earth moves.",
      "translated": "我们认为无害的观点可能会给你带来大麻烦。我已经说了一件在17世纪的欧洲大部分地区会让我陷入大麻烦的事情，而当伽利略说出这件事时，确实给他带来了大麻烦——那就是地球是运动的。"
    },
    {
      "original": "[1] It seems to be a constant throughout history: In every period, people believed things that were just ridiculous, and believed them so strongly that you would have gotten in terrible trouble for saying otherwise.Is our time any different?",
      "translated": "[1] 历史上似乎有一个不变的现象：在每一个时期，人们都相信一些荒谬的事情，并且相信得如此坚定，以至于如果你提出异议，就会陷入极大的麻烦。我们这个时代有何不同？"
    },
    {
      "original": "To anyone who has read any amount of history, the answer is almost certainly no. It would be a remarkable coincidence if ours were the first era to get everything just right.It's tantalizing to think we believe things that people in the future will find ridiculous.",
      "translated": "对于任何读过一些历史的人来说，答案几乎肯定是否定的。如果我们的时代是第一个把一切都做得恰到好处的时代，那将是一个令人惊讶的巧合。想象我们相信的一些事情会被未来的人认为是荒谬的，这确实令人着迷。"
    },
    {
      "original": "What would someone coming back to visit us in a time machine have to be careful not to say? That's what I want to study here. But I want to do more than just shock everyone with the heresy du jour. I want to find general recipes for discovering what you can't say, in any era.The Conformist TestLet's start with a test: Do you have any opinions that you would be reluctant to express in front of a group of your peers?If the answer is no, you might want to stop and think about that.",
      "translated": "一个乘坐时间机器回到现在的人需要小心不要说什么？这就是我想在这儿研究的问题。但我不仅仅想用当下的异端邪说来震惊大家。我想找到一些普遍的方法，来发现任何时代中不能说的话。\n\n从一个测试开始：你有没有什么观点，不愿意在一群同龄人面前表达？\n\n如果答案是否定的，你可能需要停下来思考一下这个问题。"
    },
    {
      "original": "If everything you believe is something you're supposed to believe, could that possibly be a coincidence? Odds are it isn't. Odds are you just think what you're told.The other alternative would be that you independently considered every question and came up with the exact same answers that are now considered acceptable.",
      "translated": "如果你所相信的一切都恰好是你应该相信的，这难道会是巧合吗？很可能不是。很可能你只是在按照别人告诉你的方式思考。另一种可能性是你独立思考了每一个问题，并且恰好得出了现在被认为是正确答案的结论。"
    },
    {
      "original": "That seems unlikely, because you'd also have to make the same mistakes. Mapmakers deliberately put slight mistakes in their maps so they can tell when someone copies them. If another map has the same mistake, that's very convincing evidence.Like every other era in history, our moral map almost certainly contains a few mistakes.",
      "translated": "这似乎不太可能，因为你还要犯同样的错误。地图制作人员故意在地图中加入细微的错误，以便发现他人是否抄袭。如果另一张地图也有同样的错误，这将是非常有力的证据。就像历史上的每一个时代一样，我们的道德地图几乎肯定也存在一些错误。"
    },
    {
      "original": "And anyone who makes the same mistakes probably didn't do it by accident. It would be like someone claiming they had independently decided in 1972 that bell-bottom jeans were a good idea.If you believe everything you're supposed to now, how can you be sure you wouldn't also have believed everything you were supposed to if you had grown up among the plantation owners of the pre-Civil War South, or in Germany in the 1930s — or among the Mongols in 1200, for that matter?",
      "translated": "而且，任何犯相同错误的人可能都不是偶然的。这就像有人声称他们在1972年独立地认为喇叭裤是个好主意。如果你现在相信你应该相信的一切，你怎么能确定，如果你生长在美国内战前的种植园主中，或者1930年代的德国——或者1200年的蒙古人中，你不会也相信你本应相信的一切？"
    },
    {
      "original": "Odds are you would have.Back in the era of terms like \"well-adjusted,\" the idea seemed to be that there was something wrong with you if you thought things you didn't dare say out loud. This seems backward.",
      "translated": "很可能你也有过这种感觉。在“适应良好”这样的词汇流行的年代，似乎认为如果你有不敢大声说出来的心思，那你就是有问题的。这看起来是倒退的。"
    },
    {
      "original": "Almost certainly, there is something wrong with you if you don't think things you don't dare say out loud.TroubleWhat can't we say? One way to find these ideas is simply to look at things people do say, and get in trouble for.",
      "translated": "如果你觉得有些事情你不敢大声说出来，那么很可能你确实有问题。那么，我们不能说什么？一种找到这些想法的方法就是看看人们说了什么，然后因此惹上麻烦。"
    },
    {
      "original": "[2]Of course, we're not just looking for things we can't say. We're looking for things we can't say that are true, or at least have enough chance of being true that the question should remain open. But many of the things people get in trouble for saying probably do make it over this second, lower threshold.",
      "translated": "当然，我们不仅仅是在寻找不能说的事情。我们是在寻找那些可能是真实的，或者至少有足够的可能性是真实的，以至于这个问题应该保持开放的事情。但人们因为说出而惹上麻烦的许多事情，很可能确实超过了这个较低的门槛。"
    },
    {
      "original": "No one gets in trouble for saying that 2 + 2 is 5, or that people in Pittsburgh are ten feet tall. Such obviously false statements might be treated as jokes, or at worst as evidence of insanity, but they are not likely to make anyone mad.",
      "translated": "没有人会因为说2加2等于5，或者匹兹堡的人有十英尺高而惹上麻烦。这些明显错误的陈述可能会被当作笑话，或者最多被视为精神失常的证据，但不太可能让任何人生气。"
    },
    {
      "original": "The statements that make people mad are the ones they worry might be believed. I suspect the statements that make people maddest are those they worry might be true.If Galileo had said that people in Padua were ten feet tall, he would have been regarded as a harmless eccentric.",
      "translated": "让人恼火的言论往往是那些他们担心可能会被相信的言论。我怀疑最让人愤怒的言论是那些他们担心可能是真的言论。如果伽利略说帕多瓦的人有十英尺高，他会被视为一个无害的怪人。"
    },
    {
      "original": "Saying the earth orbited the sun was another matter. The church knew this would set people thinking.Certainly, as we look back on the past, this rule of thumb works well. A lot of the statements people got in trouble for seem harmless now.",
      "translated": "说地球围绕太阳运转则是另一回事。教会知道这会引起人们的思考。当然，当我们回顾过去时，这条经验法则非常有效。许多人们因此而陷入麻烦的言论现在看来似乎无害。"
    },
    {
      "original": "So it's likely that visitors from the future would agree with at least some of the statements that get people in trouble today. Do we have no Galileos? Not likely.To find them, keep track of opinions that get people in trouble, and start asking, could this be true?",
      "translated": "因此，来自未来的访客可能会同意今天让某些人陷入麻烦的至少一部分观点。难道我们没有伽利略吗？这不太可能。要找到他们，就要关注那些让人陷入麻烦的观点，并开始思考，这可能是真的吗？"
    },
    {
      "original": "Ok, it may be heretical (or whatever modern equivalent), but might it also be true?HeresyThis won't get us all the answers, though. What if no one happens to have gotten in trouble for a particular idea yet?",
      "translated": "好吧，这可能被视为异端（或是现代的某种等价物），但也许它也是真实的。异端并不会给我们所有的答案。如果没有人因为某个特定的想法而遇到麻烦呢？"
    },
    {
      "original": "What if some idea would be so radioactively controversial that no one would dare express it in public? How can we find these too?Another approach is to follow that word, heresy. In every period of history, there seem to have been labels that got applied to statements to shoot them down before anyone had a chance to ask if they were true or not.",
      "translated": "如果有些想法过于具有争议性，以至于没有人敢公开表达，那该怎么办？我们如何找到这些想法呢？另一种方法是追随“异端”这个词。在历史的每一个时期，似乎都有一些标签被贴在某些言论上，以在任何人有机会探究其真实性之前就将其驳倒。"
    },
    {
      "original": "\"Blasphemy\", \"sacrilege\", and \"heresy\" were such labels for a good part of western history, as in more recent times \"indecent\", \"improper\", and \"unamerican\" have been. By now these labels have lost their sting.",
      "translated": "“渎神”、“亵渎”和“异端”在西方历史的很长一段时间里被用作标签，就像近现代的“不道德”、“不正当”和“不美国”一样。如今，这些标签已经失去了它们的刺痛感。"
    },
    {
      "original": "They always do. By now they're mostly used ironically. But in their time, they had real force.The word \"defeatist\", for example, has no particular political connotations now. But in Germany in 1917 it was a weapon, used by Ludendorff in a purge of those who favored a negotiated peace.",
      "translated": "他们总是这样。如今，这些词大多被用来讽刺。但在它们的时代，却有着真正的威力。例如，“失败主义者”这个词现在并没有特别的政治含义。但在1917年的德国，它是一个武器，鲁登道夫用它来清除那些主张通过谈判实现和平的人。"
    },
    {
      "original": "At the start of World War II it was used extensively by Churchill and his supporters to silence their opponents. In 1940, any argument against Churchill's aggressive policy was \"defeatist\". Was it right or wrong?",
      "translated": "第二次世界大战初期，丘吉尔和他的支持者广泛使用这一手段来压制反对者。1940年，任何反对丘吉尔激进政策的论点都被视为“失败主义”。这种做法是对是错？"
    },
    {
      "original": "Ideally, no one got far enough to ask that. We have such labels today, of course, quite a lot of them, from the all-purpose \"inappropriate\" to the dreaded \"divisive.\" In any period, it should be easy to figure out what such labels are, simply by looking at what people call ideas they disagree with besides untrue.",
      "translated": "理想情况下，没有人会走到那一步去问这个问题。如今，我们确实有这样的标签，而且相当多，从通用的“不恰当”到令人畏惧的“分裂”。在任何时期，只要看看人们除了“不真实”之外，还把哪些想法称为什么，就可以很容易地弄清楚这些标签是什么。"
    },
    {
      "original": "When a politician says his opponent is mistaken, that's a straightforward criticism, but when he attacks a statement as \"divisive\" or \"racially insensitive\" instead of arguing that it's false, we should start paying attention.So another way to figure out which of our taboos future generations will laugh at is to start with the labels.",
      "translated": "当一位政客说他的对手错了，这是一次直接的批评，但当他指责某言论“分裂”或“种族不敏感”而不是论证其为虚假时，我们就应该开始关注了。因此，另一种方法来判断未来几代人会嘲笑我们哪些禁忌，就是从这些标签入手。"
    },
    {
      "original": "Take a label — \"sexist\", for example — and try to think of some ideas that would be called that. Then for each ask, might this be true?Just start listing ideas at random? Yes, because they won't really be random.",
      "translated": "拿一个标签——比如“性别歧视”——然后试着想出一些会被这样称呼的想法。然后对每一个想法问，这可能是真的吗？只是随意地列出这些想法？是的，因为它们实际上并不会真正随机。"
    },
    {
      "original": "The ideas that come to mind first will be the most plausible ones. They'll be things you've already noticed but didn't let yourself think.In 1989 some clever researchers tracked the eye movements of radiologists as they scanned chest images for signs of lung cancer.",
      "translated": "最先想到的想法将是那些最有可能的。它们会是你已经注意到但没有让自己去深思的事情。1989年，一些聪明的研究人员追踪了放射科医生在检查胸部图像以寻找肺癌迹象时的眼球运动。"
    },
    {
      "original": "[3] They found that even when the radiologists missed a cancerous lesion, their eyes had usually paused at the site of it. Part of their brain knew there was something there; it just didn't percolate all the way up into conscious knowledge.",
      "translated": "他们发现，即使放射科医生漏诊了癌性病灶，他们的眼睛通常也会在病灶位置停留。他们大脑的某部分已经意识到那里有异常；只是这种意识没有完全上升到有意识的知识层面。"
    },
    {
      "original": "I think many interesting heretical thoughts are already mostly formed in our minds. If we turn off our self-censorship temporarily, those will be the first to emerge.Time and SpaceIf we could look into the future it would be obvious which of our taboos they'd laugh at.",
      "translated": "我认为许多有趣的异端思想在我们的脑海中已经大多成形。如果我们暂时关闭自我审查，这些思想将是首先浮现的。时间和空间如果我们可以窥见未来，就会很明显地知道，我们现在的一些禁忌，未来的人们会嘲笑。"
    },
    {
      "original": "We can't do that, but we can do something almost as good: we can look into the past. Another way to figure out what we're getting wrong is to look at what used to be acceptable and is now unthinkable.Changes between the past and the present sometimes do represent progress.",
      "translated": "我们无法做到这一点，但我们几乎可以做到同样好的事情：回顾过去。另一种方法是看看过去被认为是正常而现在无法想象的事情，以此来找出我们的错误所在。过去和现在之间的变化有时确实代表了进步。"
    },
    {
      "original": "In a field like physics, if we disagree with past generations it's because we're right and they're wrong. But this becomes rapidly less true as you move away from the certainty of the hard sciences. By the time you get to social questions, many changes are just fashion.",
      "translated": "在物理学这样的领域，如果我们与前几代人意见不同，那是因为我们是正确的，而他们是错误的。但当你远离硬科学的确定性时，这种情况会迅速变得不那么真实。到了社会问题时，许多变化只不过是时尚潮流。"
    },
    {
      "original": "The age of consent fluctuates like hemlines.We may imagine that we are a great deal smarter and more virtuous than past generations, but the more history you read, the less likely this seems. People in past times were much like us.",
      "translated": "同意年龄像裙摆一样起伏不定。我们可能会认为自己比过去的几代人更聪明、更道德，但你读的历史越多，这种看法就越站不住脚。过去的人们和我们非常相似。"
    },
    {
      "original": "Not heroes, not barbarians. Whatever their ideas were, they were ideas reasonable people could believe.So here is another source of interesting heresies. Diff present ideas against those of various past cultures, and see what you get.",
      "translated": "不是英雄，也不是野蛮人。无论他们的想法是什么，都是理智的人可以相信的。因此，这里有一个有趣异端的来源。将当前的想法与过去各种文化的思想进行对比，看看你会得到什么。"
    },
    {
      "original": "[4] Some will be shocking by present standards. Ok, fine; but which might also be true?You don't have to look into the past to find big differences. In our own time, different societies have wildly varying ideas of what's ok and what isn't.",
      "translated": "[4] 有些按照现行标准来看可能会让人震惊。好吧，确实如此；但哪些也可能属实呢？你不必回顾过去就能发现巨大的差异。在我们这个时代，不同的社会对于什么是可接受的、什么是不可接受的有着截然不同的看法。"
    },
    {
      "original": "So you can try diffing other cultures' ideas against ours as well. (The best way to do that is to visit them.) Any idea that's considered harmless in a significant percentage of times and places, and yet is taboo in ours, is a candidate for something we're mistaken about.For example, at the high water mark of political correctness in the early 1990s, Harvard distributed to its faculty and staff a brochure saying, among other things, that it was inappropriate to compliment a colleague or student's clothes.",
      "translated": "因此，你可以尝试将其他文化的观点与我们的进行对比。（最好的方法是亲自去访问这些地方。）任何在相当一部分时间和地点被视为无害，但在我们文化中却被视为禁忌的想法，都有可能是我们误解了的东西。例如，在20世纪90年代初政治正确达到顶峰时，哈佛大学向其教职员工发放了一份小册子，其中提到，赞美同事或学生的着装是不合适的。"
    },
    {
      "original": "No more \"nice shirt.\" I think this principle is rare among the world's cultures, past or present. There are probably more where it's considered especially polite to compliment someone's clothing than where it's considered improper.",
      "translated": "不再说“好衬衫”。我认为这一原则在世界文化中，无论是过去还是现在，都极为罕见。可能更多的是在那些文化中，认为赞美别人的衣着特别有礼貌，而不是认为这样做不合适。"
    },
    {
      "original": "Odds are this is, in a mild form, an example of one of the taboos a visitor from the future would have to be careful to avoid if he happened to set his time machine for Cambridge, Massachusetts, 1992.",
      "translated": "这大概是一个温和的例子，说明了一个来自未来的时间旅行者如果将时间机器设置为1992年的马萨诸塞州剑桥市，需要小心避免的禁忌之一。"
    },
    {
      "original": "[5]PrigsOf course, if they have time machines in the future they'll probably have a separate reference manual just for Cambridge. This has always been a fussy place, a town of i dotters and t crossers, where you're liable to get both your grammar and your ideas corrected in the same conversation.",
      "translated": "当然，如果将来有时间机器，他们可能会为剑桥单独编写一份参考手册。这里一直是个讲究的地方，一个注重细节的城镇，在这里，你很可能在同一次对话中既被纠正语法又被纠正观点。"
    },
    {
      "original": "And that suggests another way to find taboos. Look for prigs, and see what's inside their heads.Kids' heads are repositories of all our taboos. It seems fitting to us that kids' ideas should be bright and clean.",
      "translated": "这提示了另一种发现禁忌的方法。观察那些自以为是的人，看看他们脑子里装着什么。孩子们的头脑是我们所有禁忌的储存库。对我们来说，孩子们的想法应该是光明而纯洁的，这似乎很合适。"
    },
    {
      "original": "The picture we give them of the world is not merely simplified, to suit their developing minds, but sanitized as well, to suit our ideas of what kids ought to think. [6]You can see this on a small scale in the matter of dirty words.",
      "translated": "我们给孩子们展示的世界不仅仅是简化的，以适应他们正在发展的思维，同时也是净化过的，以符合我们对孩子们应该思考什么的看法。[6]你可以在脏话这个问题上小规模地看到这一点。"
    },
    {
      "original": "A lot of my friends are starting to have children now, and they're all trying not to use words like \"fuck\" and \"shit\" within baby's hearing, lest baby start using these words too. But these words are part of the language, and adults use them all the time.",
      "translated": "我的许多朋友现在都开始有了孩子，他们都尽量不在孩子面前说“他妈的”和“狗屎”这类话，以免孩子也开始学着说这些词。但这些词毕竟是语言的一部分，成年人经常使用。"
    },
    {
      "original": "So parents are giving their kids an inaccurate idea of the language by not using them. Why do they do this? Because they don't think it's fitting that kids should use the whole language. We like children to seem innocent.",
      "translated": "所以，父母通过不使用某些语言，给了孩子们一个不准确的语言观念。他们为什么会这样做？因为他们认为孩子们使用完整的语言是不合适的。我们希望孩子们显得天真无邪。"
    },
    {
      "original": "[7]Most adults, likewise, deliberately give kids a misleading view of the world. One of the most obvious examples is Santa Claus. We think it's cute for little kids to believe in Santa Claus. I myself think it's cute for little kids to believe in Santa Claus.",
      "translated": "[7]同样，大多数成年人有意地给孩子一个对世界的错误认识。最明显的例子之一就是圣诞老人。我们认为小孩子相信圣诞老是很可爱的。我自己也觉得小孩子相信圣诞老人很可爱。"
    },
    {
      "original": "But one wonders, do we tell them this stuff for their sake, or for ours?I'm not arguing for or against this idea here. It is probably inevitable that parents should want to dress up their kids' minds in cute little baby outfits.",
      "translated": "但人们不禁要问，我们告诉他们这些事情是为了他们好，还是为了我们自己？我在这里并不是要对这个观点进行支持或反对。父母想把自己孩子的思想打扮得像可爱的小宝宝一样，这可能是不可避免的。"
    },
    {
      "original": "I'll probably do it myself. The important thing for our purposes is that, as a result, a well brought-up teenage kid's brain is a more or less complete collection of all our taboos — and in mint condition, because they're untainted by experience.",
      "translated": "我大概会自己来。对我们来说，重要的是，这样一来，一个受过良好教育的青少年的大脑几乎收集了我们所有的禁忌——而且是全新的，因为它们未被经验玷污。"
    },
    {
      "original": "Whatever we think that will later turn out to be ridiculous, it's almost certainly inside that head.How do we get at these ideas? By the following thought experiment. Imagine a kind of latter-day Conrad character who has worked for a time as a mercenary in Africa, for a time as a doctor in Nepal, for a time as the manager of a nightclub in Miami.",
      "translated": "无论我们后来认为什么样的想法会显得可笑，几乎可以肯定这些想法都在那个头脑里。我们如何获得这些想法呢？通过以下的思想实验。想象一个现代的康拉德式人物，他曾在非洲当过一段时间的雇佣兵，在尼泊尔当过一段时间的医生，在迈阿密当过一段时间的夜总会经理。"
    },
    {
      "original": "The specifics don't matter — just someone who has seen a lot. Now imagine comparing what's inside this guy's head with what's inside the head of a well-behaved sixteen year old girl from the suburbs.",
      "translated": "具体的细节不重要——只要是一个见过很多世面的人。现在想象一下，将这个人的头脑与一个来自郊区、表现良好的十六岁女孩的头脑做比较。"
    },
    {
      "original": "What does he think that would shock her? He knows the world; she knows, or at least embodies, present taboos. Subtract one from the other, and the result is what we can't say. MechanismI can think of one more way to figure out what we can't say: to look at how taboos are created.",
      "translated": "他认为这会让她震惊吗？他了解这个世界；而她，或至少代表了，当下的禁忌。将一个从另一个中减去，结果就是我们不能说的东西。还有一种方法可以找出我们不能说的内容：观察禁忌是如何产生的。"
    },
    {
      "original": "How do moral fashions arise, and why are they adopted? If we can understand this mechanism, we may be able to see it at work in our own time.Moral fashions don't seem to be created the way ordinary fashions are.",
      "translated": "道德风尚是如何产生的，为什么会被采纳？如果我们能理解这一机制，或许就能看到它在我们这个时代的作用。道德风尚似乎并不是像普通风尚那样被创造出来的。"
    },
    {
      "original": "Ordinary fashions seem to arise by accident when everyone imitates the whim of some influential person. The fashion for broad-toed shoes in late fifteenth century Europe began because Charles VIII of France had six toes on one foot.",
      "translated": "普通的时尚似乎是偶然出现的，当每个人都模仿某位有影响力人士的奇想时。15世纪末欧洲流行的宽头鞋就是从法国国王查理八世的一只脚有六个脚趾开始的。"
    },
    {
      "original": "The fashion for the name Gary began when the actor Frank Cooper adopted the name of a tough mill town in Indiana. Moral fashions more often seem to be created deliberately. When there's something we can't say, it's often because some group doesn't want us to.The prohibition will be strongest when the group is nervous.",
      "translated": "Gary 这个名字的流行始于演员 Frank Cooper 采用了印第安纳州一个硬朗的工业小镇的名字。道德风尚则更常似乎是被有意创造出来的。当我们有话不能说时，往往是因为某个群体不希望我们说。当这个群体感到紧张时，这种禁令就会最为强烈。"
    },
    {
      "original": "The irony of Galileo's situation was that he got in trouble for repeating Copernicus's ideas. Copernicus himself didn't. In fact, Copernicus was a canon of a cathedral, and dedicated his book to the pope.",
      "translated": "伽利略的处境具有讽刺意味，他因为重申哥白尼的观点而陷入麻烦，而哥白尼本人却没有。事实上，哥白尼是一位大教堂的执事，并将他的书献给了教皇。"
    },
    {
      "original": "But by Galileo's time the church was in the throes of the Counter-Reformation and was much more worried about unorthodox ideas.To launch a taboo, a group has to be poised halfway between weakness and power.",
      "translated": "但到伽利略的时代，教会正处于反宗教改革的高潮，对异端思想更为担忧。要发起一个禁忌，一个群体必须处于弱小与强权之间的中间状态。"
    },
    {
      "original": "A confident group doesn't need taboos to protect it. It's not considered improper to make disparaging remarks about Americans, or the English. And yet a group has to be powerful enough to enforce a taboo.",
      "translated": "一个自信的群体不需要禁忌来保护自己。对美国人或英国人出言不逊并不被视为不妥。然而，一个群体必须足够强大才能执行禁忌。"
    },
    {
      "original": "Coprophiles, as of this writing, don't seem to be numerous or energetic enough to have had their interests promoted to a lifestyle.I suspect the biggest source of moral taboos will turn out to be power struggles in which one side only barely has the upper hand.",
      "translated": "截至本文撰写时，粪便爱好者似乎人数不多，也不够活跃，因此他们的兴趣尚未被提升为一种生活方式。我怀疑最大的道德禁忌来源将是权力斗争，其中一方仅勉强占上风。"
    },
    {
      "original": "That's where you'll find a group powerful enough to enforce taboos, but weak enough to need them.Most struggles, whatever they're really about, will be cast as struggles between competing ideas. The English Reformation was at bottom a struggle for wealth and power, but it ended up being cast as a struggle to preserve the souls of Englishmen from the corrupting influence of Rome.",
      "translated": "那里你会发现一群势力强大到足以实施禁忌，但同时又弱到需要这些禁忌的人。大多数斗争，无论其真实目的为何，都会被塑造为理念之间的较量。英国宗教改革从根本上说是一场财富和权力的斗争，但最终却被描绘成一场保护英格兰人免受罗马腐败影响、拯救灵魂的斗争。"
    },
    {
      "original": "It's easier to get people to fight for an idea. And whichever side wins, their ideas will also be considered to have triumphed, as if God wanted to signal his agreement by selecting that side as the victor.We often like to think of World War II as a triumph of freedom over totalitarianism.",
      "translated": "让人们为一个理念而战更容易。而无论哪一方获胜，他们的理念也会被认为取得了胜利，仿佛上帝通过选择那一方作为胜利者来表示他的赞同。我们常常喜欢将第二次世界大战视为自由对极权主义的胜利。"
    },
    {
      "original": "We conveniently forget that the Soviet Union was also one of the winners.I'm not saying that struggles are never about ideas, just that they will always be made to seem to be about ideas, whether they are or not.",
      "translated": "我们往往 Conveniently 忘记苏联也是胜利者之一。我不是说斗争从来不是关于思想的，只是说无论斗争是否真的关于思想，它们总是会被描绘成是关于思想的。"
    },
    {
      "original": "And just as there is nothing so unfashionable as the last, discarded fashion, there is nothing so wrong as the principles of the most recently defeated opponent. Representational art is only now recovering from the approval of both Hitler and Stalin.",
      "translated": "正如最不合时宜的莫过于刚刚被抛弃的时尚，最错误的莫过于最近被击败的对手的原则。具象艺术直到现在才从希特勒和斯大林的青睐中恢复过来。"
    },
    {
      "original": "[8]Although moral fashions tend to arise from different sources than fashions in clothing, the mechanism of their adoption seems much the same. The early adopters will be driven by ambition: self-consciously cool people who want to distinguish themselves from the common herd.",
      "translated": "尽管道德风尚的起源通常与服装时尚不同，但它们被采纳的机制似乎非常相似。早期采纳者将由野心驱使：那些自觉很酷、想要与普通人区分开来的人。"
    },
    {
      "original": "As the fashion becomes established they'll be joined by a second, much larger group, driven by fear. [9] This second group adopt the fashion not because they want to stand out but because they are afraid of standing out.So if you want to figure out what we can't say, look at the machinery of fashion and try to predict what it would make unsayable.",
      "translated": "当这一风尚确立后，一个更大、由恐惧驱动的第二群体将会加入。[9] 这个第二群体接受风尚不是因为他们想脱颖而出，而是因为他们害怕与众不同。所以，如果你想弄清楚我们不能说什么，就看看时尚的机制，并尝试预测它会使什么变得不可言说。"
    },
    {
      "original": "What groups are powerful but nervous, and what ideas would they like to suppress? What ideas were tarnished by association when they ended up on the losing side of a recent struggle? If a self-consciously cool person wanted to differentiate himself from preceding fashions (e.g.",
      "translated": "哪些群体强大但又紧张，他们想要压制哪些思想？哪些思想因与最近斗争中的失败方联系在一起而蒙受污名？如果一个刻意追求酷的人想要与之前的时尚区分开来（例如："
    },
    {
      "original": "from his parents), which of their ideas would he tend to reject? What are conventional-minded people afraid of saying?This technique won't find us all the things we can't say. I can think of some that aren't the result of any recent struggle.",
      "translated": "从他的父母那里，他会倾向于拒绝他们的哪些观点？传统思想的人害怕说什么？这种方法不会让我们发现所有我们不能说的事情。我能想到一些并不是任何最近斗争的结果。"
    },
    {
      "original": "Many of our taboos are rooted deep in the past. But this approach, combined with the preceding four, will turn up a good number of unthinkable ideas.WhySome would ask, why would one want to do this? Why deliberately go poking around among nasty, disreputable ideas?",
      "translated": "许多禁忌都深深植根于过去。但这种方法，结合前四种方法，将会产生许多令人难以想象的想法。有些人会问，为什么要这样做？为什么要故意去探究那些令人不快、名声不佳的想法？"
    },
    {
      "original": "Why look under rocks?I do it, first of all, for the same reason I did look under rocks as a kid: plain curiosity. And I'm especially curious about anything that's forbidden. Let me see and decide for myself.Second, I do it because I don't like the idea of being mistaken.",
      "translated": "为什么要去翻石头？首先，我这么做是因为和小时候一样，出于纯粹的好奇心。而且，我对任何被禁止的事物尤其好奇。让我自己看看，自己做决定。其次，我不喜欢出错的想法。"
    },
    {
      "original": "If, like other eras, we believe things that will later seem ridiculous, I want to know what they are so that I, at least, can avoid believing them.Third, I do it because it's good for the brain. To do good work you need a brain that can go anywhere.",
      "translated": "如果像其他时代一样，我们相信一些将来会显得荒谬的事情，我希望知道它们是什么，这样至少我可以避免相信它们。第三，我这样做是因为这对大脑有好处。要做好工作，你需要一个可以自由驰骋的大脑。"
    },
    {
      "original": "And you especially need a brain that's in the habit of going where it's not supposed to.Great work tends to grow out of ideas that others have overlooked, and no idea is so overlooked as one that's unthinkable.",
      "translated": "你需要的尤其是一个习惯于走向不应该去的地方的大脑。伟大的工作往往源自于他人忽视的想法，而最被忽视的想法莫过于那些被认为不可能的想法。"
    },
    {
      "original": "Natural selection, for example. It's so simple. Why didn't anyone think of it before? Well, that is all too obvious. Darwin himself was careful to tiptoe around the implications of his theory. He wanted to spend his time thinking about biology, not arguing with people who accused him of being an atheist.In the sciences, especially, it's a great advantage to be able to question assumptions.",
      "translated": "自然选择，例如。它非常简单。为什么之前没有人想到呢？这显然太明显了。达尔文本人在涉及他的理论的含义时也非常谨慎。他希望把时间花在思考生物学上，而不是与那些指责他是无神论者的人争论。在科学领域，特别是能够质疑假设是一个很大的优势。"
    },
    {
      "original": "The m.o. of scientists, or at least of the good ones, is precisely that: look for places where conventional wisdom is broken, and then try to pry apart the cracks and see what's underneath. That's where new theories come from.A good scientist, in other words, does not merely ignore conventional wisdom, but makes a special effort to break it.",
      "translated": "科学家们，至少是那些优秀的科学家，正是这样做的：寻找传统智慧失效的地方，然后试图撬开这些裂缝，看看下面有什么。新的理论正是从这些地方产生的。换句话说，优秀的科学家不仅仅忽略传统智慧，而是特别努力地去打破它。"
    },
    {
      "original": "Scientists go looking for trouble. This should be the m.o. of any scholar, but scientists seem much more willing to look under rocks. [10]Why? It could be that the scientists are simply smarter; most physicists could, if necessary, make it through a PhD program in French literature, but few professors of French literature could make it through a PhD program in physics.",
      "translated": "科学家们喜欢寻找问题。这应该是任何学者的行事方式，但科学家似乎更愿意去探索未知。[10]为什么？可能是科学家们确实更聪明；大多数物理学家如果需要的话，都能完成法国文学的博士学位，但很少有法国文学教授能够完成物理学的博士学位。"
    },
    {
      "original": "Or it could be because it's clearer in the sciences whether theories are true or false, and this makes scientists bolder. (Or it could be that, because it's clearer in the sciences whether theories are true or false, you have to be smart to get jobs as a scientist, rather than just a good politician.)Whatever the reason, there seems a clear correlation between intelligence and willingness to consider shocking ideas.",
      "translated": "或者是因为在科学领域，理论的真伪更加明确，这使得科学家们更加大胆。（或者是因为在科学领域，理论的真伪更加明确，所以要想成为科学家，你必须聪明，而不仅仅是善于做政治工作。）无论原因是什么，智力与愿意考虑震撼性想法之间似乎存在明显的关联。"
    },
    {
      "original": "This isn't just because smart people actively work to find holes in conventional thinking. I think conventions also have less hold over them to start with. You can see that in the way they dress.It's not only in the sciences that heresy pays off.",
      "translated": "这不仅仅是因为聪明人积极地寻找传统思维中的漏洞。我认为，传统对他们的束缚从一开始就较少。从他们的穿着方式就可以看出这一点。异端思想不仅仅在科学领域中能带来好处。"
    },
    {
      "original": "In any competitive field, you can win big by seeing things that others daren't. And in every field there are probably heresies few dare utter. Within the US car industry there is a lot of hand-wringing now about declining market share.",
      "translated": "在任何竞争领域，你都可以通过看到别人不敢看到的事情而大获全胜。在每个领域，可能都有很少有人敢说的异端之言。在美国汽车行业中，现在有很多人对市场份额的下降感到焦虑。"
    },
    {
      "original": "Yet the cause is so obvious that any observant outsider could explain it in a second: they make bad cars. And they have for so long that by now the US car brands are antibrands — something you'd buy a car despite, not because of.",
      "translated": "然而，原因显而易见，任何细心的局外人都能在一秒钟内解释清楚：他们制造的是劣质汽车。而且这种情况已经持续了很长时间，以至于现在美国汽车品牌已经变成了反品牌——人们买汽车是因为其他原因，而不是因为这些品牌。"
    },
    {
      "original": "Cadillac stopped being the Cadillac of cars in about 1970. And yet I suspect no one dares say this. [11] Otherwise these companies would have tried to fix the problem.Training yourself to think unthinkable thoughts has advantages beyond the thoughts themselves.",
      "translated": "凯迪拉克大约在1970年就不再是汽车中的凯迪拉克了。然而，我怀疑没有人敢这么说。[11] 否则这些公司就会尝试解决这个问题。训练自己思考那些难以想象的想法，其好处不仅限于这些想法本身。"
    },
    {
      "original": "It's like stretching. When you stretch before running, you put your body into positions much more extreme than any it will assume during the run. If you can think things so outside the box that they'd make people's hair stand on end, you'll have no trouble with the small trips outside the box that people call innovative.Pensieri StrettiWhen you find something you can't say, what do you do with it?",
      "translated": "这就像是做拉伸。当你在跑步前做拉伸时，你会把身体置于比跑步过程中更极端的位置。如果你能想出一些让人毛骨悚然的离谱想法，那么那些被称为创新的小幅度突破对你来说就轻而易举了。当你发现有些话无法说出口时，你会怎么处理？"
    },
    {
      "original": "My advice is, don't say it. Or at least, pick your battles.Suppose in the future there is a movement to ban the color yellow. Proposals to paint anything yellow are denounced as \"yellowist\", as is anyone suspected of liking the color.",
      "translated": "我的建议是，不要说出来。或者至少，选择你的战斗。假设将来有一场运动要禁止黄色。任何将东西涂成黄色的提议都会被谴责为“黄派”，任何被怀疑喜欢这种颜色的人也会遭到同样的待遇。"
    },
    {
      "original": "People who like orange are tolerated but viewed with suspicion. Suppose you realize there is nothing wrong with yellow. If you go around saying this, you'll be denounced as a yellowist too, and you'll find yourself having a lot of arguments with anti-yellowists.",
      "translated": "喜欢橙色的人虽然被容忍，但会受到怀疑。假设你意识到黄色并没有什么不对。如果你到处宣传这一点，你也会被谴责为“黄派”，并且会发现自己与反黄派有很多争论。"
    },
    {
      "original": "If your aim in life is to rehabilitate the color yellow, that may be what you want. But if you're mostly interested in other questions, being labelled as a yellowist will just be a distraction. Argue with idiots, and you become an idiot.The most important thing is to be able to think what you want, not to say what you want.",
      "translated": "如果你的人生目标是为黄色正名，那可能就是你所追求的。但如果你主要关注的是其他问题，被贴上“黄色主义者”的标签只会成为一种干扰。与蠢人争论，你自己也会变得愚蠢。最重要的是能够思考你想思考的问题，而不是说出你想说的话。"
    },
    {
      "original": "And if you feel you have to say everything you think, it may inhibit you from thinking improper thoughts. I think it's better to follow the opposite policy. Draw a sharp line between your thoughts and your speech.",
      "translated": "如果你觉得必须说出你所有的想法，这可能会抑制你产生不恰当的念头。我认为最好采取相反的策略。在你的思想和言语之间划清界限。"
    },
    {
      "original": "Inside your head, anything is allowed. Within my head I make a point of encouraging the most outrageous thoughts I can imagine. But, as in a secret society, nothing that happens within the building should be told to outsiders.",
      "translated": "在你的脑海中，任何事情都是被允许的。在我的头脑中，我特意鼓励自己想象出最荒诞的想法。但是，就像在一个秘密社团里一样，发生在社团内部的事情不应该告诉外人。"
    },
    {
      "original": "The first rule of Fight Club is, you do not talk about Fight Club.When Milton was going to visit Italy in the 1630s, Sir Henry Wootton, who had been ambassador to Venice, told him his motto should be \"i pensieri stretti & il viso sciolto.\" Closed thoughts and an open face.",
      "translated": "Fight Club的第一条规则是，不谈论Fight Club。当弥尔顿在17世纪30年代准备访问意大利时，曾任威尼斯大使的亨利·伍顿爵士告诉他，他的座右铭应该是“i pensieri stretti & il viso sciolto”。意为心思缜密，面容开朗。"
    },
    {
      "original": "Smile at everyone, and don't tell them what you're thinking. This was wise advice. Milton was an argumentative fellow, and the Inquisition was a bit restive at that time. But I think the difference between Milton's situation and ours is only a matter of degree.",
      "translated": "对每个人微笑，但不要告诉他们你在想什么。这是一条明智的建议。弥尔顿是个好争论的人，而那时的宗教裁判所也有些不安分。但我觉得弥尔顿的情况和我们的区别只在于程度而已。"
    },
    {
      "original": "Every era has its heresies, and if you don't get imprisoned for them you will at least get in enough trouble that it becomes a complete distraction.I admit it seems cowardly to keep quiet. When I read about the harassment to which the Scientologists subject their critics [12], or that pro-Israel groups are \"compiling dossiers\" on those who speak out against Israeli human rights abuses [13], or about people being sued for violating the DMCA [14], part of me wants to say, \"All right, you bastards, bring it on.\" The problem is, there are so many things you can't say.",
      "translated": "每个时代都有它的异端，如果你没有因此被监禁，至少也会惹上足够的麻烦，让你完全分心。我承认保持沉默似乎很懦弱。当我读到关于科学教对批评者进行骚扰[12]，或者支持以色列的团体正在“编制档案”以对付那些对以色列人权侵犯行为发声的人[13]，或者有人因违反《数字千年版权法》而被起诉[14]时，我心中的一部分想说：“好吧，你们这些混蛋，来吧。”问题在于，有太多的话是不能说的。"
    },
    {
      "original": "If you said them all you'd have no time left for your real work. You'd have to turn into Noam Chomsky. [15]The trouble with keeping your thoughts secret, though, is that you lose the advantages of discussion.",
      "translated": "如果你把它们都说出来，你就没有时间做你真正的工作了。你得变成诺姆·乔姆斯基。[15]然而，把想法保密的麻烦在于，你会失去讨论带来的好处。"
    },
    {
      "original": "Talking about an idea leads to more ideas. So the optimal plan, if you can manage it, is to have a few trusted friends you can speak openly to. This is not just a way to develop ideas; it's also a good rule of thumb for choosing friends.",
      "translated": "谈论一个想法会引出更多的想法。因此，如果可以的话，最优的方案是拥有一些可以坦诚交流的知己朋友。这不仅是一种发展想法的方式，也是选择朋友的一个好准则。"
    },
    {
      "original": "The people you can say heretical things to without getting jumped on are also the most interesting to know.Viso Sciolto?I don't think we need the viso sciolto so much as the pensieri stretti. Perhaps the best policy is to make it plain that you don't agree with whatever zealotry is current in your time, but not to be too specific about what you disagree with.",
      "translated": "你可以毫无顾忌地说一些异端邪说的人，往往也是最有趣的人。Viso Sciolto？我认为我们更需要的是心思缜密，而不是放任自流。也许最好的策略是明确表示你不同意当代的任何狂热主义，但不要具体说明你不同意的是什么。"
    },
    {
      "original": "Zealots will try to draw you out, but you don't have to answer them. If they try to force you to treat a question on their terms by asking \"are you with us or against us?\" you can always just answer \"neither\".Better still, answer \"I haven't decided.\" That's what Larry Summers did when a group tried to put him in this position.",
      "translated": "狂热分子会试图引你上钩，但你不必回应他们。如果他们试图通过问“你是支持我们还是反对我们？”来迫使你按照他们的条件回答问题，你总是可以回答“两者都不是”。更好的是，回答“我还没有决定。” 当一群试图让他陷入这种境地时，拉里·萨默斯就是这样做的。"
    },
    {
      "original": "Explaining himself later, he said \"I don't do litmus tests.\" [16] A lot of the questions people get hot about are actually quite complicated. There is no prize for getting the answer quickly.If the anti-yellowists seem to be getting out of hand and you want to fight back, there are ways to do it without getting yourself accused of being a yellowist.",
      "translated": "后来解释时，他说：“我不做酸碱测试。”[16] 许多人们争论不休的问题实际上相当复杂。快速得出答案并不会获得任何奖励。如果反黄人士似乎过于激进，而你想要反击，也有方法可以避免自己被指控为黄化分子。"
    },
    {
      "original": "Like skirmishers in an ancient army, you want to avoid directly engaging the main body of the enemy's troops. Better to harass them with arrows from a distance.One way to do this is to ratchet the debate up one level of abstraction.",
      "translated": "就像古代军队中的散兵一样，你要避免直接与敌军主力交战。最好是远距离用箭骚扰他们。一种方法是将辩论提升到更高一层的抽象层面。"
    },
    {
      "original": "If you argue against censorship in general, you can avoid being accused of whatever heresy is contained in the book or film that someone is trying to censor. You can attack labels with meta-labels: labels that refer to the use of labels to prevent discussion.",
      "translated": "如果你总体上反对审查制度，你就可以避免被指责为含有某人试图审查的书籍或电影中的任何异端邪说。你可以用元标签来攻击标签：这些元标签指的是使用标签来阻止讨论的行为。"
    },
    {
      "original": "The spread of the term \"political correctness\" meant the beginning of the end of political correctness, because it enabled one to attack the phenomenon as a whole without being accused of any of the specific heresies it sought to suppress.Another way to counterattack is with metaphor.",
      "translated": "“政治正确”一词的流行意味着政治正确的终结的开始，因为它使得人们可以攻击这一现象的总体，而不被指控犯有它试图抑制的任何具体异端。另一种反击方式是使用比喻。"
    },
    {
      "original": "Arthur Miller undermined the House Un-American Activities Committee by writing a play, \"The Crucible,\" about the Salem witch trials. He never referred directly to the committee and so gave them no way to reply.",
      "translated": "阿瑟·米勒通过撰写关于塞勒姆女巫审判的剧作《炼狱》来挑战众议院非美活动委员会。他从未直接提及该委员会，因此委员会无从回应。"
    },
    {
      "original": "What could HUAC do, defend the Salem witch trials? And yet Miller's metaphor stuck so well that to this day the activities of the committee are often described as a \"witch-hunt.\"Best of all, probably, is humor.",
      "translated": "HUAC能做什么，为塞勒姆女巫审判辩护吗？然而，米勒的比喻如此贴切，以至于至今委员会的活动常被描述为“猎巫”。最好的回应，大概还是幽默。"
    },
    {
      "original": "Zealots, whatever their cause, invariably lack a sense of humor. They can't reply in kind to jokes. They're as unhappy on the territory of humor as a mounted knight on a skating rink. Victorian prudishness, for example, seems to have been defeated mainly by treating it as a joke.",
      "translated": "狂热者，无论其信仰为何，总是缺乏幽默感。他们无法以牙还牙地回应玩笑。他们在幽默的领地上就像一个骑马的骑士在滑冰场上一样不自在。例如，维多利亚时代的保守主义似乎主要是通过将其当作一个笑话来击败的。"
    },
    {
      "original": "Likewise its reincarnation as political correctness. \"I am glad that I managed to write 'The Crucible,'\" Arthur Miller wrote, \"but looking back I have often wished I'd had the temperament to do an absurd comedy, which is what the situation deserved.\" [17]ABQA Dutch friend says I should use Holland as an example of a tolerant society.",
      "translated": "同样，它的转世为政治正确。“我很高兴我写成了《萨勒姆的女巫》,”阿瑟·米勒写道，“但回想起来，我常常希望自己能有那种心态去创作一部荒诞喜剧，因为当时的情况确实值得这样。”[17]ABQA 一位荷兰朋友说，我应该以荷兰为例，作为一个宽容的社会。"
    },
    {
      "original": "It's true they have a long tradition of comparative open-mindedness. For centuries the low countries were the place to go to say things you couldn't say anywhere else, and this helped to make the region a center of scholarship and industry (which have been closely tied for longer than most people realize).",
      "translated": "确实，他们有着悠久的相对开明的传统。几个世纪以来，低地国家一直是人们可以畅所欲言的地方，而在其他地方这是无法做到的，这有助于使该地区成为学术和工业的中心（这两者之间的密切联系比大多数人意识到的要悠久得多）。"
    },
    {
      "original": "Descartes, though claimed by the French, did much of his thinking in Holland.And yet, I wonder. The Dutch seem to live their lives up to their necks in rules and regulations. There's so much you can't do there; is there really nothing you can't say?Certainly the fact that they value open-mindedness is no guarantee.",
      "translated": "尽管笛卡尔被法国人所声称，但他大部分的思考是在荷兰完成的。然而，我对此有所怀疑。荷兰人似乎生活在繁多的规则和条例之中，以至于在那儿有太多事情是不能做的；那么，真的没有什么是不能说的吗？当然，他们重视开放的态度这一事实并不能作为保证。"
    },
    {
      "original": "Who thinks they're not open-minded? Our hypothetical prim miss from the suburbs thinks she's open-minded. Hasn't she been taught to be? Ask anyone, and they'll say the same thing: they're pretty open-minded, though they draw the line at things that are really wrong.",
      "translated": "谁会认为自己不心胸开阔呢？我们假设的那位来自郊区的端庄小姐认为自己心胸开阔。她不是被教导要有这种态度吗？问任何人，他们都会说同样的话：他们相当心胸开阔，尽管对于那些真正错误的事情，他们还是会划清界限。"
    },
    {
      "original": "(Some tribes may avoid \"wrong\" as judgemental, and may instead use a more neutral sounding euphemism like \"negative\" or \"destructive\".)When people are bad at math, they know it, because they get the wrong answers on tests.",
      "translated": "有些部落可能避免使用带有评判意味的“错误”，而可能会使用更中性的委婉语，如“负面”或“破坏性”。当人们数学不好的时候，他们知道自己不行，因为他们在测试中会得到错误的答案。"
    },
    {
      "original": "But when people are bad at open-mindedness they don't know it. In fact they tend to think the opposite. Remember, it's the nature of fashion to be invisible. It wouldn't work otherwise. Fashion doesn't seem like fashion to someone in the grip of it.",
      "translated": "但当人们不善于开放思维时，他们自己却意识不到。事实上，他们往往会有相反的想法。记住，时尚的本质就是无形的。否则就无法奏效。对处于时尚潮流中的人来说，时尚并不显得像时尚。"
    },
    {
      "original": "It just seems like the right thing to do. It's only by looking from a distance that we see oscillations in people's idea of the right thing to do, and can identify them as fashions.Time gives us such distance for free.",
      "translated": "这似乎就是应该做的事情。只有从远处看，我们才能发现人们对于正确行为的看法存在波动，并将其识别为时尚。时间为我们提供了这样的距离。"
    },
    {
      "original": "Indeed, the arrival of new fashions makes old fashions easy to see, because they seem so ridiculous by contrast. From one end of a pendulum's swing, the other end seems especially far away.To see fashion in your own time, though, requires a conscious effort.",
      "translated": "确实，新潮流的出现使旧潮流变得容易察觉，因为相比之下它们显得如此荒谬。从钟摆的一端看，另一端似乎格外遥远。然而，要看到自己时代中的潮流，则需要有意识的努力。"
    },
    {
      "original": "Without time to give you distance, you have to create distance yourself. Instead of being part of the mob, stand as far away from it as you can and watch what it's doing. And pay especially close attention whenever an idea is being suppressed.",
      "translated": "没有时间给你距离，你必须自己创造距离。不要成为人群的一部分，而是尽可能远离他们，观察他们的行为。特别是当某个观点被压制时，要特别留心。"
    },
    {
      "original": "Web filters for children and employees often ban sites containing pornography, violence, and hate speech. What counts as pornography and violence? And what, exactly, is \"hate speech?\" This sounds like a phrase out of 1984.Labels like that are probably the biggest external clue.",
      "translated": "儿童和员工用的网络过滤器经常禁止包含色情、暴力和仇恨言论的网站。什么是色情和暴力？什么是“仇恨言论？”这听起来像是《1984》中的术语。这样的标签可能是最大的外部线索。"
    },
    {
      "original": "If a statement is false, that's the worst thing you can say about it. You don't need to say that it's heretical. And if it isn't false, it shouldn't be suppressed. So when you see statements being attacked as x-ist or y-ic (substitute your current values of x and y), whether in 1630 or 2030, that's a sure sign that something is wrong.",
      "translated": "如果一个陈述是错误的，这就是你对它能说的最坏的事情。你不需要说它是异端。而如果它不是错误的，就不应该被压制。所以，当你看到某些陈述被指责为“x-主义”或“y-性质”（无论x和y代表什么当前的含义），无论是1630年还是2030年，这都是一个明显的迹象，表明有问题。"
    },
    {
      "original": "When you hear such labels being used, ask why.Especially if you hear yourself using them. It's not just the mob you need to learn to watch from a distance. You need to be able to watch your own thoughts from a distance.",
      "translated": "当你听到这些标签被使用时，问问为什么。特别是当你自己使用它们时。你需要学会从远处观察的不仅仅是群体。你还需要能够从远处观察自己的想法。"
    },
    {
      "original": "That's not a radical idea, by the way; it's the main difference between children and adults. When a child gets angry because he's tired, he doesn't know what's happening. An adult can distance himself enough from the situation to say \"never mind, I'm just tired.\" I don't see why one couldn't, by a similar process, learn to recognize and discount the effects of moral fashions.You have to take that extra step if you want to think clearly.",
      "translated": "这其实并不是一个激进的想法；它其实是孩子和成年人之间的主要区别。当一个孩子因为疲劳而生气时，他并不知道自己发生了什么。而成年人则能够从情境中抽离出来，说“没关系，我只是累了。” 我不明白为什么通过类似的过程，人们不能学会识别并减少道德时尚的影响。如果你想清晰地思考，就必须多迈出这一步。"
    },
    {
      "original": "But it's harder, because now you're working against social customs instead of with them. Everyone encourages you to grow up to the point where you can discount your own bad moods. Few encourage you to continue to the point where you can discount society's bad moods.How can you see the wave, when you're the water?",
      "translated": "但这更难，因为现在你是与社会习俗作对，而不是顺从它们。每个人都鼓励你成长到可以忽视自己坏情绪的地步。很少有人鼓励你继续前行，直到你能忽视社会的坏情绪。你如何看到波浪，当你自己就是水的一部分？"
    },
    {
      "original": "Always be questioning. That's the only defence. What can't you say? And why?NotesThanks to Sarah Harlin, Trevor Blackwell, Jessica Livingston, Robert Morris, Eric Raymond and Bob van der Zwaan for reading drafts of this essay, and to Lisa Randall, Jackie McDonough, Ryan Stanley and Joel Rainey for conversations about heresy.",
      "translated": "始终保持质疑。这是唯一的防御。有什么是你不能说的？为什么不能说？  \n\n致谢：感谢 Sarah Harlin、Trevor Blackwell、Jessica Livingston、Robert Morris、Eric Raymond 和 Bob van der Zwaan 阅读本文草稿，以及感谢 Lisa Randall、Jackie McDonough、Ryan Stanley 和 Joel Rainey 关于异端的讨论。"
    },
    {
      "original": "Needless to say they bear no blame for opinions expressed in it, and especially for opinions not expressed in it.Re: What You Can't SayLabelsJapanese TranslationFrench TranslationGerman TranslationDutch TranslationRomanian TranslationHebrew TranslationTurkish TranslationChinese TranslationButtonsA Civic Duty to AnnoyThe Perils of ObedienceAliens Cause Global WarmingHays CodeStratagem 32Conspiracy TheoriesMark Twain: Corn-pone OpinionsA Blacklist for \"Excuse Makers\"What You Can't Say Will Hurt You",
      "translated": "毫无疑问，他们对其中表达的观点不负任何责任，尤其是对未在其中表达的观点不负责任。关于你不能说的话的标签日语翻译法语翻译德语翻译荷兰语翻译罗马尼亚语翻译希伯来语翻译土耳其语翻译中文翻译按钮履行公民职责的烦恼顺从的危险外星人导致全球变暖海斯法第三十二条策略阴谋论马克·吐温：玉米面包式的意见“借口制造者”的黑名单你不能说的话会伤害你"
    }
  ],
  "translation_completed": "2025-07-29T11:56:49.423753",
  "translation_stats": {
    "total_paragraphs": 110,
    "success_count": 110,
    "success_rate": "100.0%"
  }
}