{
  "title": "Writing and Speaking",
  "title_zh": "[待翻译] Writing and Speaking",
  "url": "https://www.paulgraham.com/speak.html",
  "filename": "speak.html",
  "date": "2012-03-01",
  "id": 135,
  "content": {
    "success": true,
    "paragraphs": [
      "March 2012I'm not a very good speaker. I say \"um\" a lot. Sometimes I have to pause when I lose my train of thought. I wish I were a better speaker. But I don't wish I were a better speaker like I wish I were a better writer.",
      "What I really want is to have good ideas, and that's a much bigger part of being a good writer than being a good speaker.Having good ideas is most of writing well. If you know what you're talking about, you can say it in the plainest words and you'll be perceived as having a good style.",
      "With speaking it's the opposite: having good ideas is an alarmingly small component of being a good speaker.I first noticed this at a conference several years ago. There was another speaker who was much better than me.",
      "He had all of us roaring with laughter. I seemed awkward and halting by comparison. Afterward I put my talk online like I usually do. As I was doing it I tried to imagine what a transcript of the other guy's talk would be like, and it was only then I realized he hadn't said very much.Maybe this would have been obvious to someone who knew more about speaking, but it was a revelation to me how much less ideas mattered in speaking than writing.",
      "[1]A few years later I heard a talk by someone who was not merely a better speaker than me, but a famous speaker. Boy was he good. So I decided I'd pay close attention to what he said, to learn how he did it.",
      "After about ten sentences I found myself thinking \"I don't want to be a good speaker.\"Being a really good speaker is not merely orthogonal to having good ideas, but in many ways pushes you in the opposite direction.",
      "For example, when I give a talk, I usually write it out beforehand. I know that's a mistake; I know delivering a prewritten talk makes it harder to engage with an audience. The way to get the attention of an audience is to give them your full attention, and when you're delivering a prewritten talk, your attention is always divided between the audience and the talk — even if you've memorized it.",
      "If you want to engage an audience, it's better to start with no more than an outline of what you want to say and ad lib the individual sentences. But if you do that, you might spend no more time thinking about each sentence than it takes to say it.",
      "[2] Occasionally the stimulation of talking to a live audience makes you think of new things, but in general this is not going to generate ideas as well as writing does, where you can spend as long on each sentence as you want.If you rehearse a prewritten speech enough, you can get asymptotically close to the sort of engagement you get when speaking ad lib.",
      "Actors do. But here again there's a tradeoff between smoothness and ideas. All the time you spend practicing a talk, you could instead spend making it better. Actors don't face that temptation, except in the rare cases where they've written the script, but any speaker does.",
      "Before I give a talk I can usually be found sitting in a corner somewhere with a copy printed out on paper, trying to rehearse it in my head. But I always end up spending most of the time rewriting it instead.",
      "Every talk I give ends up being given from a manuscript full of things crossed out and rewritten. Which of course makes me um even more, because I haven't had any time to practice the new bits. [3]Depending on your audience, there are even worse tradeoffs than these.",
      "Audiences like to be flattered; they like jokes; they like to be swept off their feet by a vigorous stream of words. As you decrease the intelligence of the audience, being a good speaker is increasingly a matter of being a good bullshitter.",
      "That's true in writing too of course, but the descent is steeper with talks. Any given person is dumber as a member of an audience than as a reader. Just as a speaker ad libbing can only spend as long thinking about each sentence as it takes to say it, a person hearing a talk can only spend as long thinking about each sentence as it takes to hear it.",
      "Plus people in an audience are always affected by the reactions of those around them, and the reactions that spread from person to person in an audience are disproportionately the more brutish sort, just as low notes travel through walls better than high ones.",
      "Every audience is an incipient mob, and a good speaker uses that. Part of the reason I laughed so much at the talk by the good speaker at that conference was that everyone else did. [4]So are talks useless?",
      "They're certainly inferior to the written word as a source of ideas. But that's not all talks are good for. When I go to a talk, it's usually because I'm interested in the speaker. Listening to a talk is the closest most of us can get to having a conversation with someone like the president, who doesn't have time to meet individually with all the people who want to meet him.Talks are also good at motivating me to do things.",
      "It's probably no coincidence that so many famous speakers are described as motivational speakers. That may be what public speaking is really for. It's probably what it was originally for. The emotional reactions you can elicit with a talk can be a powerful force.",
      "I wish I could say that this force was more often used for good than ill, but I'm not sure.Notes[1] I'm not talking here about academic talks, which are a different type of thing. While the audience at an academic talk might appreciate a joke, they will (or at least should) make a conscious effort to see what new ideas you're presenting.[2] That's the lower bound.",
      "In practice you can often do better, because talks are usually about things you've written or talked about before, and when you ad lib, you end up reproducing some of those sentences. Like early medieval architecture, impromptu talks are made of spolia.",
      "Which feels a bit dishonest, incidentally, because you have to deliver these sentences as if you'd just thought of them.[3] Robert Morris points out that there is a way in which practicing talks makes them better: reading a talk out loud can expose awkward parts.",
      "I agree and in fact I read most things I write out loud at least once for that reason.[4] For sufficiently small audiences, it may not be true that being part of an audience makes people dumber. The real decline seems to set in when the audience gets too big for the talk to feel like a conversation — maybe around 10 people.",
      "Thanks to Sam Altman and Robert Morris for reading drafts of this."
    ],
    "word_count": 1179,
    "paragraph_count": 23
  },
  "processed_at": "2025-07-26T19:05:47.948776",
  "paragraphs": [
    {
      "original": "March 2012I'm not a very good speaker. I say \"um\" a lot. Sometimes I have to pause when I lose my train of thought. I wish I were a better speaker. But I don't wish I were a better speaker like I wish I were a better writer.",
      "translated": "2012年3月，我不是一个很好的演讲者。我经常说“嗯”。有时候，当我思路中断时，我不得不暂停。我希望自己能成为一个更好的演讲者。但我不像希望成为一个更好的作家那样希望成为一个更好的演讲者。"
    },
    {
      "original": "What I really want is to have good ideas, and that's a much bigger part of being a good writer than being a good speaker.Having good ideas is most of writing well. If you know what you're talking about, you can say it in the plainest words and you'll be perceived as having a good style.",
      "translated": "我真正想要的是有好的想法，这比成为一个好的演讲者更是成为一个好作家的重要部分。有好的想法是写得好的大部分。如果你知道自己在说什么，即使使用最朴实的语言表达，人们也会认为你有很好的文风。"
    },
    {
      "original": "With speaking it's the opposite: having good ideas is an alarmingly small component of being a good speaker.I first noticed this at a conference several years ago. There was another speaker who was much better than me.",
      "translated": "在演讲方面，情况则恰恰相反：拥有好的想法只是成为一个优秀演讲者的一个令人惊讶的小部分。几年前在一次会议上我首次注意到了这一点。当时有另一位演讲者，他的表现远胜于我。"
    },
    {
      "original": "He had all of us roaring with laughter. I seemed awkward and halting by comparison. Afterward I put my talk online like I usually do. As I was doing it I tried to imagine what a transcript of the other guy's talk would be like, and it was only then I realized he hadn't said very much.Maybe this would have been obvious to someone who knew more about speaking, but it was a revelation to me how much less ideas mattered in speaking than writing.",
      "translated": "他让我们所有人都笑得前俯后仰。相比之下，我显得笨拙而结巴。之后，我像往常一样把我的演讲放到了网上。在做的时候，我试着想象那位先生的演讲记录会是什么样子，就在那时我意识到他说的内容其实并不多。也许这对那些更懂演讲的人来说是显而易见的，但对我来说，这是个启示——在演讲中，思想的重要性远不如写作。"
    },
    {
      "original": "[1]A few years later I heard a talk by someone who was not merely a better speaker than me, but a famous speaker. Boy was he good. So I decided I'd pay close attention to what he said, to learn how he did it.",
      "translated": "几年后，我听了一场演讲，演讲者不仅比我更优秀，而且是一位著名的演讲家。他真是太棒了。于是，我决定仔细聆听他的每一句话，学习他是如何做到的。"
    },
    {
      "original": "After about ten sentences I found myself thinking \"I don't want to be a good speaker.\"Being a really good speaker is not merely orthogonal to having good ideas, but in many ways pushes you in the opposite direction.",
      "translated": "大约十句话后，我发现自己在想：“我不想像成为一个优秀的演讲者。”成为一个真正的优秀演讲者不仅与拥有好想法无关，而且在很多方面会把你推向相反的方向。"
    },
    {
      "original": "For example, when I give a talk, I usually write it out beforehand. I know that's a mistake; I know delivering a prewritten talk makes it harder to engage with an audience. The way to get the attention of an audience is to give them your full attention, and when you're delivering a prewritten talk, your attention is always divided between the audience and the talk — even if you've memorized it.",
      "translated": "例如，当我发表演讲时，通常会事先写好讲稿。我知道这是一个错误；我知道发表事先准备好的演讲会让与观众的互动变得更加困难。要吸引观众的注意力，就需要全神贯注地对待他们，而当你在发表事先准备好的演讲时，你的注意力总是会在观众和讲稿之间分散——即使你已经将讲稿背得滚瓜烂熟。"
    },
    {
      "original": "If you want to engage an audience, it's better to start with no more than an outline of what you want to say and ad lib the individual sentences. But if you do that, you might spend no more time thinking about each sentence than it takes to say it.",
      "translated": "如果你想吸引听众，最好先准备一个你想要说的内容大纲，然后即兴发挥具体的句子。但如果你这样做，可能每句话的思考时间就只相当于说出它所需的时间。"
    },
    {
      "original": "[2] Occasionally the stimulation of talking to a live audience makes you think of new things, but in general this is not going to generate ideas as well as writing does, where you can spend as long on each sentence as you want.If you rehearse a prewritten speech enough, you can get asymptotically close to the sort of engagement you get when speaking ad lib.",
      "translated": "偶尔，与现场观众交谈的刺激会让你想到新的事物，但总体而言，这不如写作那样能激发创意，因为写作时你可以对每个句子花费任意长的时间。如果你足够多地排练一篇预先写好的演讲，你几乎可以达到即兴演讲时的那种互动效果。"
    },
    {
      "original": "Actors do. But here again there's a tradeoff between smoothness and ideas. All the time you spend practicing a talk, you could instead spend making it better. Actors don't face that temptation, except in the rare cases where they've written the script, but any speaker does.",
      "translated": "演员确实如此。但在这里，流畅性和内容之间又有了权衡。你花在练习演讲上的所有时间，本可以用来改进演讲的内容。演员除了少数自己编写剧本的情况外，通常不会面临这种诱惑，但任何演讲者都会面临。"
    },
    {
      "original": "Before I give a talk I can usually be found sitting in a corner somewhere with a copy printed out on paper, trying to rehearse it in my head. But I always end up spending most of the time rewriting it instead.",
      "translated": "在做演讲之前，我通常会找一个角落，手里拿着打印在纸上的讲稿，试图在脑海中练习。但最终，我总是会花费大部分时间来重新修改它。"
    },
    {
      "original": "Every talk I give ends up being given from a manuscript full of things crossed out and rewritten. Which of course makes me um even more, because I haven't had any time to practice the new bits. [3]Depending on your audience, there are even worse tradeoffs than these.",
      "translated": "我每次演讲都是从一份满是划掉和重写内容的讲稿中进行的。这当然让我更加紧张，因为我没有时间去练习这些新的部分。[3]根据你的听众，还有比这些更糟糕的权衡。"
    },
    {
      "original": "Audiences like to be flattered; they like jokes; they like to be swept off their feet by a vigorous stream of words. As you decrease the intelligence of the audience, being a good speaker is increasingly a matter of being a good bullshitter.",
      "translated": "观众喜欢奉承；他们喜欢笑话；他们喜欢被一连串有力的言辞所打动。随着观众智力的降低，成为一个好演说家越来越取决于能否成为一个好的吹牛大王。"
    },
    {
      "original": "That's true in writing too of course, but the descent is steeper with talks. Any given person is dumber as a member of an audience than as a reader. Just as a speaker ad libbing can only spend as long thinking about each sentence as it takes to say it, a person hearing a talk can only spend as long thinking about each sentence as it takes to hear it.",
      "translated": "当然，写作也是如此，但演讲的下降速度更快。任何一个人作为听众时，都会比作为读者时更显得愚钝。就像即兴演讲者思考每个句子的时间只能是说出它所需的时间一样，一个人听演讲时思考每个句子的时间也只能是听到它所需的时间。"
    },
    {
      "original": "Plus people in an audience are always affected by the reactions of those around them, and the reactions that spread from person to person in an audience are disproportionately the more brutish sort, just as low notes travel through walls better than high ones.",
      "translated": "此外，观众中的每个人都会受到周围人反应的影响，而观众中从一个人传到另一个人的反应往往是更粗暴的类型，就像低音比高音更容易穿透墙壁一样。"
    },
    {
      "original": "Every audience is an incipient mob, and a good speaker uses that. Part of the reason I laughed so much at the talk by the good speaker at that conference was that everyone else did. [4]So are talks useless?",
      "translated": "每个听众群体都潜在地像是一个群体，而一位优秀的演讲者会利用这一点。我在那次会议中对那位优秀演讲者的演讲笑得如此之多，部分原因是因为其他人都在笑。[4]那么，演讲是否毫无用处？"
    },
    {
      "original": "They're certainly inferior to the written word as a source of ideas. But that's not all talks are good for. When I go to a talk, it's usually because I'm interested in the speaker. Listening to a talk is the closest most of us can get to having a conversation with someone like the president, who doesn't have time to meet individually with all the people who want to meet him.Talks are also good at motivating me to do things.",
      "translated": "它们作为思想来源当然不如文字。但演讲的作用不止于此。当我参加一个演讲时，通常是因为我对演讲者感兴趣。对大多数人来说，听演讲是与像总统这样没有时间单独会见所有想见他的人进行交谈的最接近的方式。演讲还能激发我去做事情。"
    },
    {
      "original": "It's probably no coincidence that so many famous speakers are described as motivational speakers. That may be what public speaking is really for. It's probably what it was originally for. The emotional reactions you can elicit with a talk can be a powerful force.",
      "translated": "很可能不是巧合，许多著名的演讲者都被描述为励志演讲者。这也许才是公共演讲的真正目的，也许正是它最初的用途。通过演讲激发的情感反应可以成为一股强大的力量。"
    },
    {
      "original": "I wish I could say that this force was more often used for good than ill, but I'm not sure.Notes[1] I'm not talking here about academic talks, which are a different type of thing. While the audience at an academic talk might appreciate a joke, they will (or at least should) make a conscious effort to see what new ideas you're presenting.[2] That's the lower bound.",
      "translated": "我希望我能说这种力量更多地被用于好的方面而不是坏的方面，但我不确定。注[1] 这里我不是指学术演讲，那是一种不同性质的事情。尽管学术演讲的听众可能会欣赏一个玩笑，但他们（或至少应该）会自觉地关注你提出的新思想。[2] 这是下限。"
    },
    {
      "original": "In practice you can often do better, because talks are usually about things you've written or talked about before, and when you ad lib, you end up reproducing some of those sentences. Like early medieval architecture, impromptu talks are made of spolia.",
      "translated": "实际上，你往往可以做得更好，因为演讲通常是你之前写过或谈论过的内容，即兴发挥时，你会不自觉地复述其中的一些句子。就像早期中世纪的建筑一样，即兴演讲也是由“斯波利亚”（即旧材料）构建而成的。"
    },
    {
      "original": "Which feels a bit dishonest, incidentally, because you have to deliver these sentences as if you'd just thought of them.[3] Robert Morris points out that there is a way in which practicing talks makes them better: reading a talk out loud can expose awkward parts.",
      "translated": "顺便说一下，这样做感觉有点不诚实，因为你必须像刚想到这些句子一样把它们说出来。[3] 罗伯特·莫里斯指出，练习演讲确实可以让演讲更好：大声朗读演讲可以暴露出不流畅的部分。"
    },
    {
      "original": "I agree and in fact I read most things I write out loud at least once for that reason.[4] For sufficiently small audiences, it may not be true that being part of an audience makes people dumber. The real decline seems to set in when the audience gets too big for the talk to feel like a conversation — maybe around 10 people.",
      "translated": "我同意，并且事实上我通常会把写的东西大声读一遍，至少一次，就是为了这个原因。[4] 对于规模足够小的听众来说，成为听众的一部分并不会让人变笨。真正的衰退似乎是在听众人数多到无法让演讲感觉像是一场对话时开始的——可能是在10人左右。"
    },
    {
      "original": "Thanks to Sam Altman and Robert Morris for reading drafts of this.",
      "translated": "感谢萨姆·阿尔特曼和罗伯特·莫里斯阅读本文的草稿。"
    }
  ],
  "translation_completed": "2025-07-28T14:27:02.750233",
  "translation_stats": {
    "total_paragraphs": 23,
    "success_count": 23,
    "success_rate": "100.0%"
  }
}