{
  "title": "Stuff",
  "title_zh": "[待翻译] Stuff",
  "url": "https://www.paulgraham.com/stuff.html",
  "filename": "stuff.html",
  "date": "2007-07-01",
  "id": 179,
  "content": {
    "success": true,
    "paragraphs": [
      "July 2007I have too much stuff. Most people in America do. In fact, the poorer people are, the more stuff they seem to have. Hardly anyone is so poor that they can't afford a front yard full of old cars.It wasn't always this way.",
      "Stuff used to be rare and valuable. You can still see evidence of that if you look for it. For example, in my house in Cambridge, which was built in 1876, the bedrooms don't have closets. In those days people's stuff fit in a chest of drawers.",
      "Even as recently as a few decades ago there was a lot less stuff. When I look back at photos from the 1970s, I'm surprised how empty houses look. As a kid I had what I thought was a huge fleet of toy cars, but they'd be dwarfed by the number of toys my nephews have.",
      "All together my Matchboxes and Corgis took up about a third of the surface of my bed. In my nephews' rooms the bed is the only clear space.Stuff has gotten a lot cheaper, but our attitudes toward it haven't changed correspondingly.",
      "We overvalue stuff.That was a big problem for me when I had no money. I felt poor, and stuff seemed valuable, so almost instinctively I accumulated it. Friends would leave something behind when they moved, or I'd see something as I was walking down the street on trash night (beware of anything you find yourself describing as \"perfectly good\"), or I'd find something in almost new condition for a tenth its retail price at a garage sale.",
      "And pow, more stuff.In fact these free or nearly free things weren't bargains, because they were worth even less than they cost. Most of the stuff I accumulated was worthless, because I didn't need it.What I didn't understand was that the value of some new acquisition wasn't the difference between its retail price and what I paid for it.",
      "It was the value I derived from it. Stuff is an extremely illiquid asset. Unless you have some plan for selling that valuable thing you got so cheaply, what difference does it make what it's \"worth?\" The only way you're ever going to extract any value from it is to use it.",
      "And if you don't have any immediate use for it, you probably never will.Companies that sell stuff have spent huge sums training us to think stuff is still valuable. But it would be closer to the truth to treat stuff as worthless.In fact, worse than worthless, because once you've accumulated a certain amount of stuff, it starts to own you rather than the other way around.",
      "I know of one couple who couldn't retire to the town they preferred because they couldn't afford a place there big enough for all their stuff. Their house isn't theirs; it's their stuff's.And unless you're extremely organized, a house full of stuff can be very depressing.",
      "A cluttered room saps one's spirits. One reason, obviously, is that there's less room for people in a room full of stuff. But there's more going on than that. I think humans constantly scan their environment to build a mental model of what's around them.",
      "And the harder a scene is to parse, the less energy you have left for conscious thoughts. A cluttered room is literally exhausting.(This could explain why clutter doesn't seem to bother kids as much as adults.",
      "Kids are less perceptive. They build a coarser model of their surroundings, and this consumes less energy.)I first realized the worthlessness of stuff when I lived in Italy for a year. All I took with me was one large backpack of stuff.",
      "The rest of my stuff I left in my landlady's attic back in the US. And you know what? All I missed were some of the books. By the end of the year I couldn't even remember what else I had stored in that attic.And yet when I got back I didn't discard so much as a box of it.",
      "Throw away a perfectly good rotary telephone? I might need that one day.The really painful thing to recall is not just that I accumulated all this useless stuff, but that I often spent money I desperately needed on stuff that I didn't.Why would I do that?",
      "Because the people whose job is to sell you stuff are really, really good at it. The average 25 year old is no match for companies that have spent years figuring out how to get you to spend money on stuff.",
      "They make the experience of buying stuff so pleasant that \"shopping\" becomes a leisure activity.How do you protect yourself from these people? It can't be easy. I'm a fairly skeptical person, and their tricks worked on me well into my thirties.",
      "But one thing that might work is to ask yourself, before buying something, \"is this going to make my life noticeably better?\"A friend of mine cured herself of a clothes buying habit by asking herself before she bought anything \"Am I going to wear this all the time?\" If she couldn't convince herself that something she was thinking of buying would become one of those few things she wore all the time, she wouldn't buy it.",
      "I think that would work for any kind of purchase. Before you buy anything, ask yourself: will this be something I use constantly? Or is it just something nice? Or worse still, a mere bargain?The worst stuff in this respect may be stuff you don't use much because it's too good.",
      "Nothing owns you like fragile stuff. For example, the \"good china\" so many households have, and whose defining quality is not so much that it's fun to use, but that one must be especially careful not to break it.Another way to resist acquiring stuff is to think of the overall cost of owning it.",
      "The purchase price is just the beginning. You're going to have to think about that thing for years—perhaps for the rest of your life. Every thing you own takes energy away from you. Some give more than they take.",
      "Those are the only things worth having.I've now stopped accumulating stuff. Except books—but books are different. Books are more like a fluid than individual objects. It's not especially inconvenient to own several thousand books, whereas if you owned several thousand random possessions you'd be a local celebrity.",
      "But except for books, I now actively avoid stuff. If I want to spend money on some kind of treat, I'll take services over goods any day.I'm not claiming this is because I've achieved some kind of zenlike detachment from material things.",
      "I'm talking about something more mundane. A historical change has taken place, and I've now realized it. Stuff used to be valuable, and now it's not.In industrialized countries the same thing happened with food in the middle of the twentieth century.",
      "As food got cheaper (or we got richer; they're indistinguishable), eating too much started to be a bigger danger than eating too little. We've now reached that point with stuff. For most people, rich or poor, stuff has become a burden.The good news is, if you're carrying a burden without knowing it, your life could be better than you realize.",
      "Imagine walking around for years with five pound ankle weights, then suddenly having them removed. Spanish TranslationRussian TranslationItalian TranslationPolish TranslationTurkish TranslationFrench TranslationSlovak TranslationRomanian TranslationGerman Translation"
    ],
    "word_count": 1234,
    "paragraph_count": 25
  },
  "processed_at": "2025-07-26T19:07:12.084000",
  "paragraphs": [
    {
      "original": "July 2007I have too much stuff. Most people in America do. In fact, the poorer people are, the more stuff they seem to have. Hardly anyone is so poor that they can't afford a front yard full of old cars.It wasn't always this way.",
      "translated": "2007年7月，我东西太多了。大多数美国人也是如此。事实上，越是贫穷的人，似乎拥有的东西越多。几乎没有人穷到连前院里放满旧车都买不起。过去并不是这样。"
    },
    {
      "original": "Stuff used to be rare and valuable. You can still see evidence of that if you look for it. For example, in my house in Cambridge, which was built in 1876, the bedrooms don't have closets. In those days people's stuff fit in a chest of drawers.",
      "translated": "过去，物品稀有且珍贵。如果你留意，仍然可以看到这种现象的证据。例如，在我位于剑桥的房子里，这栋房子建于1876年，卧室里没有衣柜。在那个时代，人们的物品可以放在一个抽屉柜里。"
    },
    {
      "original": "Even as recently as a few decades ago there was a lot less stuff. When I look back at photos from the 1970s, I'm surprised how empty houses look. As a kid I had what I thought was a huge fleet of toy cars, but they'd be dwarfed by the number of toys my nephews have.",
      "translated": "即使在几十年前，物品也少得多。当我回顾20世纪70年代的照片时，我惊讶于房子看起来多么空旷。小时候，我认为自己拥有一支庞大的玩具汽车队伍，但与我侄子们的玩具数量相比，那简直不值一提。"
    },
    {
      "original": "All together my Matchboxes and Corgis took up about a third of the surface of my bed. In my nephews' rooms the bed is the only clear space.Stuff has gotten a lot cheaper, but our attitudes toward it haven't changed correspondingly.",
      "translated": "所有的Matchboxes和柯基犬玩具占据了我床面大约三分之一的空间。在我侄子们的房间里，床上是唯一干净的地方。东西变得便宜了很多，但我们对物品的态度却没有相应地改变。"
    },
    {
      "original": "We overvalue stuff.That was a big problem for me when I had no money. I felt poor, and stuff seemed valuable, so almost instinctively I accumulated it. Friends would leave something behind when they moved, or I'd see something as I was walking down the street on trash night (beware of anything you find yourself describing as \"perfectly good\"), or I'd find something in almost new condition for a tenth its retail price at a garage sale.",
      "translated": "我们过分看重物质。这在我没钱的时候是个大问题。我觉得自己很穷，物质似乎变得很有价值，所以几乎出于本能地，我开始积累这些东西。朋友们搬家时会留下一些东西，或者在我走在街上垃圾夜时（当心任何你自认为是“完全好的”东西），或者我在车库 sale 上发现一些几乎全新的东西，价格只有零售价的十分之一。"
    },
    {
      "original": "And pow, more stuff.In fact these free or nearly free things weren't bargains, because they were worth even less than they cost. Most of the stuff I accumulated was worthless, because I didn't need it.What I didn't understand was that the value of some new acquisition wasn't the difference between its retail price and what I paid for it.",
      "translated": "结果，我又得到了更多的东西。事实上，这些免费或几乎免费的东西并不是实惠之选，因为它们的价值甚至低于成本。我积攒的大部分东西都是毫无价值的，因为我根本不需要它们。我当时没有意识到，新获得物品的价值并不在于其零售价与我支付价格之间的差额。"
    },
    {
      "original": "It was the value I derived from it. Stuff is an extremely illiquid asset. Unless you have some plan for selling that valuable thing you got so cheaply, what difference does it make what it's \"worth?\" The only way you're ever going to extract any value from it is to use it.",
      "translated": "这是我从中获得的价值。物品是一种极难变现的资产。除非你有计划出售那些你以如此低廉价格获得的有价值的东西，否则它的“价值”有什么区别呢？你唯一能从中提取价值的方法就是使用它。"
    },
    {
      "original": "And if you don't have any immediate use for it, you probably never will.Companies that sell stuff have spent huge sums training us to think stuff is still valuable. But it would be closer to the truth to treat stuff as worthless.In fact, worse than worthless, because once you've accumulated a certain amount of stuff, it starts to own you rather than the other way around.",
      "translated": "如果你现在没有立即将它派上用场的需求，那么你很可能永远都不会需要。那些出售商品的公司已经花费了巨额资金训练我们，让我们认为这些物品仍然有价值。但实际上，更接近真相的是将这些物品视为毫无价值。事实上，它们不仅仅是毫无价值，因为一旦你积累了一定数量的物品，它们就开始控制你，而不是你控制它们。"
    },
    {
      "original": "I know of one couple who couldn't retire to the town they preferred because they couldn't afford a place there big enough for all their stuff. Their house isn't theirs; it's their stuff's.And unless you're extremely organized, a house full of stuff can be very depressing.",
      "translated": "我知道有一对夫妇因为负担不起他们心仪小镇里的足够大房子来容纳所有物品，而无法退休到那里。他们的房子其实不是属于他们，而是属于那些物品的。除非你非常有条理，否则一个堆满物品的房子可能会让人感到非常沮丧。"
    },
    {
      "original": "A cluttered room saps one's spirits. One reason, obviously, is that there's less room for people in a room full of stuff. But there's more going on than that. I think humans constantly scan their environment to build a mental model of what's around them.",
      "translated": "凌乱的房间会消磨人的精神。显然，其中一个原因是，满是杂物的房间留给人们的活动空间减少了。但问题不止于此。我认为，人类会不断扫描周围环境，以构建一个关于周围事物的心理模型。"
    },
    {
      "original": "And the harder a scene is to parse, the less energy you have left for conscious thoughts. A cluttered room is literally exhausting.(This could explain why clutter doesn't seem to bother kids as much as adults.",
      "translated": "而且，场景越难以解析，你就越没有精力进行有意识的思考。杂乱的房间确实会让人感到疲惫。（这也许可以解释为什么杂乱似乎对孩子的困扰不如对成人那么大。）"
    },
    {
      "original": "Kids are less perceptive. They build a coarser model of their surroundings, and this consumes less energy.)I first realized the worthlessness of stuff when I lived in Italy for a year. All I took with me was one large backpack of stuff.",
      "translated": "孩子们的感知能力较差。他们构建的周围环境模型较为粗糙，这消耗的能量较少。我是在意大利生活了一年的时候，第一次意识到物质的无足轻重。我带去的只有一大背包的东西。"
    },
    {
      "original": "The rest of my stuff I left in my landlady's attic back in the US. And you know what? All I missed were some of the books. By the end of the year I couldn't even remember what else I had stored in that attic.And yet when I got back I didn't discard so much as a box of it.",
      "translated": "其余的东西我都留在美国房东家的阁楼里了。你知道吗？我唯一想念的就是一些书。到了年底，我甚至都记不起阁楼里还存着什么东西了。然而，当我回去时，我连一个箱子都没舍得扔。"
    },
    {
      "original": "Throw away a perfectly good rotary telephone? I might need that one day.The really painful thing to recall is not just that I accumulated all this useless stuff, but that I often spent money I desperately needed on stuff that I didn't.Why would I do that?",
      "translated": "扔掉一个好好的旋转拨号电话？说不定哪天我还会用到。真正让我痛苦的是，不仅是我积累了这么多没用的东西，而且我常常把急需的钱花在了我不需要的东西上。我为什么会这么做？"
    },
    {
      "original": "Because the people whose job is to sell you stuff are really, really good at it. The average 25 year old is no match for companies that have spent years figuring out how to get you to spend money on stuff.",
      "translated": "因为那些以向你推销商品为职业的人真的很擅长这一点。平均而言，25岁的人在面对那些花了多年时间研究如何让你花钱购买商品的公司时，根本不是对手。"
    },
    {
      "original": "They make the experience of buying stuff so pleasant that \"shopping\" becomes a leisure activity.How do you protect yourself from these people? It can't be easy. I'm a fairly skeptical person, and their tricks worked on me well into my thirties.",
      "translated": "他们让购物体验如此愉快，以至于“购物”变成了一种休闲活动。你如何保护自己不受这些人影响？这绝非易事。我本是一个相当疑心重的人，但他们的手段在我三十多岁时依然奏效。"
    },
    {
      "original": "But one thing that might work is to ask yourself, before buying something, \"is this going to make my life noticeably better?\"A friend of mine cured herself of a clothes buying habit by asking herself before she bought anything \"Am I going to wear this all the time?\" If she couldn't convince herself that something she was thinking of buying would become one of those few things she wore all the time, she wouldn't buy it.",
      "translated": "但有一个方法可能奏效，那就是在购买某样东西之前问自己：“这会让我的生活明显变得更好吗？”我的一个朋友通过在购买任何衣物之前问自己“我会一直穿这件衣服吗？”来改掉了买衣服的习惯。如果她不能说服自己，认为她想买的那件东西会成为她经常穿的少数几件衣服之一，她就不会购买。"
    },
    {
      "original": "I think that would work for any kind of purchase. Before you buy anything, ask yourself: will this be something I use constantly? Or is it just something nice? Or worse still, a mere bargain?The worst stuff in this respect may be stuff you don't use much because it's too good.",
      "translated": "我认为这适用于任何购买。在你购买任何东西之前，问问自己：这会是我经常使用的东西吗？还只是一个好东西？或者更糟糕的是，仅仅是个便宜货？在这方面最糟糕的东西可能是那些你因为太好而不常使用的东西。"
    },
    {
      "original": "Nothing owns you like fragile stuff. For example, the \"good china\" so many households have, and whose defining quality is not so much that it's fun to use, but that one must be especially careful not to break it.Another way to resist acquiring stuff is to think of the overall cost of owning it.",
      "translated": "没有什么像易碎物品那样占有你。例如，许多家庭都有的“好瓷器”，其主要特点不是使用起来多么有趣，而是必须特别小心不要打破它。另一种避免积累物品的方法是考虑拥有这些物品的总体成本。"
    },
    {
      "original": "The purchase price is just the beginning. You're going to have to think about that thing for years—perhaps for the rest of your life. Every thing you own takes energy away from you. Some give more than they take.",
      "translated": "购买价格只是开始。你将会对那件东西念念不忘——可能是一生之久。你拥有的每一样东西都会消耗你的精力。有些东西给予的多于它们所索取的。"
    },
    {
      "original": "Those are the only things worth having.I've now stopped accumulating stuff. Except books—but books are different. Books are more like a fluid than individual objects. It's not especially inconvenient to own several thousand books, whereas if you owned several thousand random possessions you'd be a local celebrity.",
      "translated": "这些才是值得拥有的东西。我现在已经停止了积累物品。除了书——但书是不同的。书更像是流体，而不是单独的物品。拥有几千本书并不会特别不方便，而如果你拥有几千件随机的物品，你就会成为当地名人。"
    },
    {
      "original": "But except for books, I now actively avoid stuff. If I want to spend money on some kind of treat, I'll take services over goods any day.I'm not claiming this is because I've achieved some kind of zenlike detachment from material things.",
      "translated": "但除了书籍，我现在积极地避免拥有其他物品。如果我想花钱买些享受，我宁愿选择服务而不是物品。我并不是说自己已经达到了对物质东西的某种禅宗般的超脱。"
    },
    {
      "original": "I'm talking about something more mundane. A historical change has taken place, and I've now realized it. Stuff used to be valuable, and now it's not.In industrialized countries the same thing happened with food in the middle of the twentieth century.",
      "translated": "我说的是更平凡的事情。一种历史性的变化已经发生，我现在意识到了这一点。过去东西有价值，而现在却没有了。在工业化的国家，这种情况在二十世纪中叶也曾发生在食品上。"
    },
    {
      "original": "As food got cheaper (or we got richer; they're indistinguishable), eating too much started to be a bigger danger than eating too little. We've now reached that point with stuff. For most people, rich or poor, stuff has become a burden.The good news is, if you're carrying a burden without knowing it, your life could be better than you realize.",
      "translated": "随着食物变得便宜（或者我们变得更富有；这两者是难以区分的），吃得过多开始比吃得过少更危险。我们现在对物质财富也达到了同样的境地。对大多数人来说，无论是富人还是穷人，物质财富已经成为了一种负担。好消息是，如果你在不知情的情况下背负着这种负担，你的生活可能比你想象的要好。"
    },
    {
      "original": "Imagine walking around for years with five pound ankle weights, then suddenly having them removed. Spanish TranslationRussian TranslationItalian TranslationPolish TranslationTurkish TranslationFrench TranslationSlovak TranslationRomanian TranslationGerman Translation",
      "translated": "想象多年来一直带着五磅的脚踝重物行走，突然间这些重物被移除了。西班牙语翻译俄语翻译意大利语翻译波兰语翻译土耳其语翻译法语翻译斯洛伐克语翻译罗马尼亚语翻译德语翻译"
    }
  ],
  "translation_completed": "2025-07-28T14:37:36.510860",
  "translation_stats": {
    "total_paragraphs": 25,
    "success_count": 25,
    "success_rate": "100.0%"
  }
}