{
  "title": "The New Funding Landscape",
  "title_zh": "[待翻译] The New Funding Landscape",
  "url": "https://www.paulgraham.com/superangels.html",
  "filename": "superangels.html",
  "date": "2010-10-01",
  "id": 142,
  "content": {
    "success": true,
    "paragraphs": [
      "Want to start a startup? Get funded by Y Combinator. October 2010After barely changing at all for decades, the startup funding business is now in what could, at least by comparison, be called turmoil.",
      "At Y Combinator we've seen dramatic changes in the funding environment for startups. Fortunately one of them is much higher valuations.The trends we've been seeing are probably not YC-specific. I wish I could say they were, but the main cause is probably just that we see trends first—partly because the startups we fund are very plugged into the Valley and are quick to take advantage of anything new, and partly because we fund so many that we have enough data points to see patterns clearly.What we're seeing now, everyone's probably going to be seeing in the next couple years.",
      "So I'm going to explain what we're seeing, and what that will mean for you if you try to raise money.Super-AngelsLet me start by describing what the world of startup funding used to look like. There used to be two sharply differentiated types of investors: angels and venture capitalists.",
      "Angels are individual rich people who invest small amounts of their own money, while VCs are employees of funds that invest large amounts of other people's.For decades there were just those two types of investors, but now a third type has appeared halfway between them: the so-called super-angels.",
      "[1] And VCs have been provoked by their arrival into making a lot of angel-style investments themselves. So the previously sharp line between angels and VCs has become hopelessly blurred.There used to be a no man's land between angels and VCs.",
      "Angels would invest $20k to $50k apiece, and VCs usually a million or more. So an angel round meant a collection of angel investments that combined to maybe $200k, and a VC round meant a series A round in which a single VC fund (or occasionally two) invested $1-5 million.The no man's land between angels and VCs was a very inconvenient one for startups, because it coincided with the amount many wanted to raise.",
      "Most startups coming out of Demo Day wanted to raise around $400k. But it was a pain to stitch together that much out of angel investments, and most VCs weren't interested in investments so small. That's the fundamental reason the super-angels have appeared.",
      "They're responding to the market.The arrival of a new type of investor is big news for startups, because there used to be only two and they rarely competed with one another. Super-angels compete with both angels and VCs.",
      "That's going to change the rules about how to raise money. I don't know yet what the new rules will be, but it looks like most of the changes will be for the better.A super-angel has some of the qualities of an angel, and some of the qualities of a VC.",
      "They're usually individuals, like angels. In fact many of the current super-angels were initially angels of the classic type. But like VCs, they invest other people's money. This allows them to invest larger amounts than angels: a typical super-angel investment is currently about $100k.",
      "They make investment decisions quickly, like angels. And they make a lot more investments per partner than VCs—up to 10 times as many.The fact that super-angels invest other people's money makes them doubly alarming to VCs.",
      "They don't just compete for startups; they also compete for investors. What super-angels really are is a new form of fast-moving, lightweight VC fund. And those of us in the technology world know what usually happens when something comes along that can be described in terms like that.",
      "Usually it's the replacement.Will it be? As of now, few of the startups that take money from super-angels are ruling out taking VC money. They're just postponing it. But that's still a problem for VCs.",
      "Some of the startups that postpone raising VC money may do so well on the angel money they raise that they never bother to raise more. And those who do raise VC rounds will be able to get higher valuations when they do.",
      "If the best startups get 10x higher valuations when they raise series A rounds, that would cut VCs' returns from winners at least tenfold. [2]So I think VC funds are seriously threatened by the super-angels.",
      "But one thing that may save them to some extent is the uneven distribution of startup outcomes: practically all the returns are concentrated in a few big successes. The expected value of a startup is the percentage chance it's Google.",
      "So to the extent that winning is a matter of absolute returns, the super-angels could win practically all the battles for individual startups and yet lose the war, if they merely failed to get those few big winners.",
      "And there's a chance that could happen, because the top VC funds have better brands, and can also do more for their portfolio companies. [3]Because super-angels make more investments per partner, they have less partner per investment.",
      "They can't pay as much attention to you as a VC on your board could. How much is that extra attention worth? It will vary enormously from one partner to another. There's no consensus yet in the general case.",
      "So for now this is something startups are deciding individually.Till now, VCs' claims about how much value they added were sort of like the government's. Maybe they made you feel better, but you had no choice in the matter, if you needed money on the scale only VCs could supply.",
      "Now that VCs have competitors, that's going to put a market price on the help they offer. The interesting thing is, no one knows yet what it will be.Do startups that want to get really big need the sort of advice and connections only the top VCs can supply?",
      "Or would super-angel money do just as well? The VCs will say you need them, and the super-angels will say you don't. But the truth is, no one knows yet, not even the VCs and super-angels themselves. All the super-angels know is that their new model seems promising enough to be worth trying, and all the VCs know is that it seems promising enough to worry about.RoundsWhatever the outcome, the conflict between VCs and super-angels is good news for founders.",
      "And not just for the obvious reason that more competition for deals means better terms. The whole shape of deals is changing.One of the biggest differences between angels and VCs is the amount of your company they want.",
      "VCs want a lot. In a series A round they want a third of your company, if they can get it. They don't care much how much they pay for it, but they want a lot because the number of series A investments they can do is so small.",
      "In a traditional series A investment, at least one partner from the VC fund takes a seat on your board. [4] Since board seats last about 5 years and each partner can't handle more than about 10 at once, that means a VC fund can only do about 2 series A deals per partner per year.",
      "And that means they need to get as much of the company as they can in each one. You'd have to be a very promising startup indeed to get a VC to use up one of his 10 board seats for only a few percent of you.Since angels generally don't take board seats, they don't have this constraint.",
      "They're happy to buy only a few percent of you. And although the super-angels are in most respects mini VC funds, they've retained this critical property of angels. They don't take board seats, so they don't need a big percentage of your company.Though that means you'll get correspondingly less attention from them, it's good news in other respects.",
      "Founders never really liked giving up as much equity as VCs wanted. It was a lot of the company to give up in one shot. Most founders doing series A deals would prefer to take half as much money for half as much stock, and then see what valuation they could get for the second half of the stock after using the first half of the money to increase its value.",
      "But VCs never offered that option.Now startups have another alternative. Now it's easy to raise angel rounds about half the size of series A rounds. Many of the startups we fund are taking this route, and I predict that will be true of startups in general.A typical big angel round might be $600k on a convertible note with a valuation cap of $4 million premoney.",
      "Meaning that when the note converts into stock (in a later round, or upon acquisition), the investors in that round will get .6 / 4.6, or 13% of the company. That's a lot less than the 30 to 40% of the company you usually give up in a series A round if you do it so early.",
      "[5]But the advantage of these medium-sized rounds is not just that they cause less dilution. You also lose less control. After an angel round, the founders almost always still have control of the company, whereas after a series A round they often don't.",
      "The traditional board structure after a series A round is two founders, two VCs, and a (supposedly) neutral fifth person. Plus series A terms usually give the investors a veto over various kinds of important decisions, including selling the company.",
      "Founders usually have a lot of de facto control after a series A, as long as things are going well. But that's not the same as just being able to do what you want, like you could before.A third and quite significant advantage of angel rounds is that they're less stressful to raise.",
      "Raising a traditional series A round has in the past taken weeks, if not months. When a VC firm can only do 2 deals per partner per year, they're careful about which they do. To get a traditional series A round you have to go through a series of meetings, culminating in a full partner meeting where the firm as a whole says yes or no.",
      "That's the really scary part for founders: not just that series A rounds take so long, but at the end of this long process the VCs might still say no. The chance of getting rejected after the full partner meeting averages about 25%.",
      "At some firms it's over 50%.Fortunately for founders, VCs have been getting a lot faster. Nowadays Valley VCs are more likely to take 2 weeks than 2 months. But they're still not as fast as angels and super-angels, the most decisive of whom sometimes decide in hours.Raising an angel round is not only quicker, but you get feedback as it progresses.",
      "An angel round is not an all or nothing thing like a series A. It's composed of multiple investors with varying degrees of seriousness, ranging from the upstanding ones who commit unequivocally to the jerks who give you lines like \"come back to me to fill out the round.\" You usually start collecting money from the most committed investors and work your way out toward the ambivalent ones, whose interest increases as the round fills up.But at each point you know how you're doing.",
      "If investors turn cold you may have to raise less, but when investors in an angel round turn cold the process at least degrades gracefully, instead of blowing up in your face and leaving you with nothing, as happens if you get rejected by a VC fund after a full partner meeting.",
      "Whereas if investors seem hot, you can not only close the round faster, but now that convertible notes are becoming the norm, actually raise the price to reflect demand.ValuationHowever, the VCs have a weapon they can use against the super-angels, and they have started to use it.",
      "VCs have started making angel-sized investments too. The term \"angel round\" doesn't mean that all the investors in it are angels; it just describes the structure of the round. Increasingly the participants include VCs making investments of a hundred thousand or two.",
      "And when VCs invest in angel rounds they can do things that super-angels don't like. VCs are quite valuation-insensitive in angel rounds—partly because they are in general, and partly because they don't care that much about the returns on angel rounds, which they still view mostly as a way to recruit startups for series A rounds later.",
      "So VCs who invest in angel rounds can blow up the valuations for angels and super-angels who invest in them. [6]Some super-angels seem to care about valuations. Several turned down YC-funded startups after Demo Day because their valuations were too high.",
      "This was not a problem for the startups; by definition a high valuation means enough investors were willing to accept it. But it was mysterious to me that the super-angels would quibble about valuations.",
      "Did they not understand that the big returns come from a few big successes, and that it therefore mattered far more which startups you picked than how much you paid for them?After thinking about it for a while and observing certain other signs, I have a theory that explains why the super-angels may be smarter than they seem.",
      "It would make sense for super-angels to want low valuations if they're hoping to invest in startups that get bought early. If you're hoping to hit the next Google, you shouldn't care if the valuation is 20 million.",
      "But if you're looking for companies that are going to get bought for 30 million, you care. If you invest at 20 and the company gets bought for 30, you only get 1.5x. You might as well buy Apple.So if some of the super-angels were looking for companies that could get acquired quickly, that would explain why they'd care about valuations.",
      "But why would they be looking for those? Because depending on the meaning of \"quickly,\" it could actually be very profitable. A company that gets acquired for 30 million is a failure to a VC, but it could be a 10x return for an angel, and moreover, a quick 10x return.",
      "Rate of return is what matters in investing—not the multiple you get, but the multiple per year. If a super-angel gets 10x in one year, that's a higher rate of return than a VC could ever hope to get from a company that took 6 years to go public.",
      "To get the same rate of return, the VC would have to get a multiple of 10^6—one million x. Even Google didn't come close to that.So I think at least some super-angels are looking for companies that will get bought.",
      "That's the only rational explanation for focusing on getting the right valuations, instead of the right companies. And if so they'll be different to deal with than VCs. They'll be tougher on valuations, but more accommodating if you want to sell early.PrognosisWho will win, the super-angels or the VCs?",
      "I think the answer to that is, some of each. They'll each become more like one another. The super-angels will start to invest larger amounts, and the VCs will gradually figure out ways to make more, smaller investments faster.",
      "A decade from now the players will be hard to tell apart, and there will probably be survivors from each group.What does that mean for founders? One thing it means is that the high valuations startups are presently getting may not last forever.",
      "To the extent that valuations are being driven up by price-insensitive VCs, they'll fall again if VCs become more like super-angels and start to become more miserly about valuations. Fortunately if this does happen it will take years.The short term forecast is more competition between investors, which is good news for you.",
      "The super-angels will try to undermine the VCs by acting faster, and the VCs will try to undermine the super-angels by driving up valuations. Which for founders will result in the perfect combination: funding rounds that close fast, with high valuations.But remember that to get that combination, your startup will have to appeal to both super-angels and VCs.",
      "If you don't seem like you have the potential to go public, you won't be able to use VCs to drive up the valuation of an angel round.There is a danger of having VCs in an angel round: the so-called signalling risk.",
      "If VCs are only doing it in the hope of investing more later, what happens if they don't? That's a signal to everyone else that they think you're lame.How much should you worry about that? The seriousness of signalling risk depends on how far along you are.",
      "If by the next time you need to raise money, you have graphs showing rising revenue or traffic month after month, you don't have to worry about any signals your existing investors are sending. Your results will speak for themselves.",
      "[7]Whereas if the next time you need to raise money you won't yet have concrete results, you may need to think more about the message your investors might send if they don't invest more. I'm not sure yet how much you have to worry, because this whole phenomenon of VCs doing angel investments is so new.",
      "But my instincts tell me you don't have to worry much. Signalling risk smells like one of those things founders worry about that's not a real problem. As a rule, the only thing that can kill a good startup is the startup itself.",
      "Startups hurt themselves way more often than competitors hurt them, for example. I suspect signalling risk is in this category too.One thing YC-funded startups have been doing to mitigate the risk of taking money from VCs in angel rounds is not to take too much from any one VC.",
      "Maybe that will help, if you have the luxury of turning down money.Fortunately, more and more startups will. After decades of competition that could best be described as intramural, the startup funding business is finally getting some real competition.",
      "That should last several years at least, and maybe a lot longer. Unless there's some huge market crash, the next couple years are going to be a good time for startups to raise money. And that's exciting because it means lots more startups will happen.",
      "Notes[1] I've also heard them called \"Mini-VCs\" and \"Micro-VCs.\" I don't know which name will stick.There were a couple predecessors. Ron Conway had angel funds starting in the 1990s, and in some ways First Round Capital is closer to a super-angel than a VC fund.[2] It wouldn't cut their overall returns tenfold, because investing later would probably (a) cause them to lose less on investments that failed, and (b) not allow them to get as large a percentage of startups as they do now.",
      "So it's hard to predict precisely what would happen to their returns.[3] The brand of an investor derives mostly from the success of their portfolio companies. The top VCs thus have a big brand advantage over the super-angels.",
      "They could make it self-perpetuating if they used it to get all the best new startups. But I don't think they'll be able to. To get all the best startups, you have to do more than make them want you.",
      "You also have to want them; you have to recognize them when you see them, and that's much harder. Super-angels will snap up stars that VCs miss. And that will cause the brand gap between the top VCs and the super-angels gradually to erode.[4] Though in a traditional series A round VCs put two partners on your board, there are signs now that VCs may begin to conserve board seats by switching to what used to be considered an angel-round board, consisting of two founders and one VC.",
      "Which is also to the founders' advantage if it means they still control the company.[5] In a series A round, you usually have to give up more than the actual amount of stock the VCs buy, because they insist you dilute yourselves to set aside an \"option pool\" as well.",
      "I predict this practice will gradually disappear though.[6] The best thing for founders, if they can get it, is a convertible note with no valuation cap at all. In that case the money invested in the angel round just converts into stock at the valuation of the next round, no matter how large.",
      "Angels and super-angels tend not to like uncapped notes. They have no idea how much of the company they're buying. If the company does well and the valuation of the next round is high, they may end up with only a sliver of it.",
      "So by agreeing to uncapped notes, VCs who don't care about valuations in angel rounds can make offers that super-angels hate to match.[7] Obviously signalling risk is also not a problem if you'll never need to raise more money.",
      "But startups are often mistaken about that.Thanks to Sam Altman, John Bautista, Patrick Collison, James Lindenbaum, Reid Hoffman, Jessica Livingston and Harj Taggar for reading drafts of this."
    ],
    "word_count": 3529,
    "paragraph_count": 71
  },
  "processed_at": "2025-07-26T19:06:02.380614",
  "paragraphs": [
    {
      "original": "Want to start a startup? Get funded by Y Combinator. October 2010After barely changing at all for decades, the startup funding business is now in what could, at least by comparison, be called turmoil.",
      "translated": "想创办一家初创公司吗？那就争取得到 Y Combinator 的资助吧。2010年10月，在几十年几乎没有任何变化之后，初创公司的融资行业现在可以说正处于一种可以称为动荡的状态。"
    },
    {
      "original": "At Y Combinator we've seen dramatic changes in the funding environment for startups. Fortunately one of them is much higher valuations.The trends we've been seeing are probably not YC-specific. I wish I could say they were, but the main cause is probably just that we see trends first—partly because the startups we fund are very plugged into the Valley and are quick to take advantage of anything new, and partly because we fund so many that we have enough data points to see patterns clearly.What we're seeing now, everyone's probably going to be seeing in the next couple years.",
      "translated": "在Y Combinator，我们见证了初创公司融资环境的显著变化。幸运的是，其中一项变化是估值大幅提高。我们观察到的趋势可能不仅限于YC。我希望这些趋势仅限于我们，但主要原因可能只是我们率先看到了这些趋势——部分原因是，我们资助的初创公司非常融入硅谷，能够迅速利用任何新的机会，部分原因则是我们资助的公司数量众多，因此有足够的数据点来清晰地识别模式。我们现在看到的，可能在未来的几年里，大家都会看到。"
    },
    {
      "original": "So I'm going to explain what we're seeing, and what that will mean for you if you try to raise money.Super-AngelsLet me start by describing what the world of startup funding used to look like. There used to be two sharply differentiated types of investors: angels and venture capitalists.",
      "translated": "所以，我要解释一下我们看到的情况，以及这对你在尝试筹集资金时意味着什么。超级天使投资者\n\n让我先描述一下创业资金领域的过去情况。过去，投资者分为两种截然不同的类型：天使投资者和风险投资者。"
    },
    {
      "original": "Angels are individual rich people who invest small amounts of their own money, while VCs are employees of funds that invest large amounts of other people's.For decades there were just those two types of investors, but now a third type has appeared halfway between them: the so-called super-angels.",
      "translated": "天使投资人是个人 wealthy 人士，他们用自己的钱进行小额投资，而风险投资家则是基金的雇员，他们用他人的钱进行大额投资。几十年来，只有这两种类型的投资者，但现在在这两者之间出现了一种新的类型：所谓的超级天使投资人。"
    },
    {
      "original": "[1] And VCs have been provoked by their arrival into making a lot of angel-style investments themselves. So the previously sharp line between angels and VCs has become hopelessly blurred.There used to be a no man's land between angels and VCs.",
      "translated": "[1] 风险投资家由于他们的到来，也被激发出进行大量天使风格的投资。因此，天使投资者和风险投资家之间曾经泾渭分明的界限已经变得模糊不清。过去，在天使投资者和风险投资家之间存在着一片空白地带。"
    },
    {
      "original": "Angels would invest $20k to $50k apiece, and VCs usually a million or more. So an angel round meant a collection of angel investments that combined to maybe $200k, and a VC round meant a series A round in which a single VC fund (or occasionally two) invested $1-5 million.The no man's land between angels and VCs was a very inconvenient one for startups, because it coincided with the amount many wanted to raise.",
      "translated": "天使投资人通常会每人投资2万到5万美元，而风险投资公司通常会投资100万美元或更多。因此，天使轮融资意味着一群天使投资人的投资加起来可能达到20万美元，而风险投资轮融资则意味着A轮融资，其中单一风险投资基金（或偶尔两个）会投资100万到500万美元。天使投资人和风险投资公司之间的这个“无人区”对于初创公司来说非常不便，因为这恰好是许多初创公司想要筹集的资金数额。"
    },
    {
      "original": "Most startups coming out of Demo Day wanted to raise around $400k. But it was a pain to stitch together that much out of angel investments, and most VCs weren't interested in investments so small. That's the fundamental reason the super-angels have appeared.",
      "translated": "大多数从演示日走出的初创公司都希望筹集大约40万美元。但是，从天使投资中凑齐这么多资金是很麻烦的，而大多数风险投资公司对如此小额的投资并不感兴趣。这就是超级天使投资者出现的根本原因。"
    },
    {
      "original": "They're responding to the market.The arrival of a new type of investor is big news for startups, because there used to be only two and they rarely competed with one another. Super-angels compete with both angels and VCs.",
      "translated": "他们在回应市场。对于初创企业来说，新型投资者的出现是个大新闻，因为过去只有两种投资者，而且他们很少相互竞争。超级天使投资者与天使投资者和风险投资家竞争。"
    },
    {
      "original": "That's going to change the rules about how to raise money. I don't know yet what the new rules will be, but it looks like most of the changes will be for the better.A super-angel has some of the qualities of an angel, and some of the qualities of a VC.",
      "translated": "这将改变筹集资金的规则。我还不知道新的规则会是什么，但看起来大多数变化都会是积极的。超级天使投资者兼具天使投资者和风险投资家的一些特点。"
    },
    {
      "original": "They're usually individuals, like angels. In fact many of the current super-angels were initially angels of the classic type. But like VCs, they invest other people's money. This allows them to invest larger amounts than angels: a typical super-angel investment is currently about $100k.",
      "translated": "他们通常是个人，比如天使投资者。事实上，许多当前的超级天使投资者最初都是经典的天使投资者。但是像风险投资家一样，他们投资的是别人的钱。这使得他们能够比天使投资者投资更多的资金：目前，典型的超级天使投资金额约为10万美元。"
    },
    {
      "original": "They make investment decisions quickly, like angels. And they make a lot more investments per partner than VCs—up to 10 times as many.The fact that super-angels invest other people's money makes them doubly alarming to VCs.",
      "translated": "他们像天使投资人一样迅速做出投资决策，并且每位合伙人参与的投资项目数量远多于风险投资公司——多至10倍。超级天使投资人用他人的资金进行投资，这一点让风险投资公司更加担忧。"
    },
    {
      "original": "They don't just compete for startups; they also compete for investors. What super-angels really are is a new form of fast-moving, lightweight VC fund. And those of us in the technology world know what usually happens when something comes along that can be described in terms like that.",
      "translated": "他们不仅争夺初创公司，还争夺投资者。所谓的超级天使实际上是一种新型的快速行动、轻量级的风险投资基金。而我们这些科技界的人士都知道，当有某种可以用这类术语描述的事物出现时，通常会发生什么。"
    },
    {
      "original": "Usually it's the replacement.Will it be? As of now, few of the startups that take money from super-angels are ruling out taking VC money. They're just postponing it. But that's still a problem for VCs.",
      "translated": "通常情况下是这样的替代。它会成为现实吗？至少目前，从超级天使那里获得资金的初创公司很少排除接受风险投资的可能性。他们只是在推迟这一过程。但这对风险投资者来说仍然是一个问题。"
    },
    {
      "original": "Some of the startups that postpone raising VC money may do so well on the angel money they raise that they never bother to raise more. And those who do raise VC rounds will be able to get higher valuations when they do.",
      "translated": "一些初创公司可能会因为天使轮融资的资金就运作得非常好，以至于它们从未需要再次融资。而那些确实进行风险投资轮融资的公司，将会在融资时获得更高的估值。"
    },
    {
      "original": "If the best startups get 10x higher valuations when they raise series A rounds, that would cut VCs' returns from winners at least tenfold. [2]So I think VC funds are seriously threatened by the super-angels.",
      "translated": "如果最好的初创公司在进行A轮融资时估值能高出10倍，这将至少使风险投资从赢家那里获得的回报减少十倍。因此，我认为超级天使投资人对风险投资基金构成了严重威胁。"
    },
    {
      "original": "But one thing that may save them to some extent is the uneven distribution of startup outcomes: practically all the returns are concentrated in a few big successes. The expected value of a startup is the percentage chance it's Google.",
      "translated": "但有一件事在某种程度上可能会拯救他们，那就是初创企业成果的不均匀分布：几乎所有回报都集中在少数几个大成功上。初创企业的期望价值在于它成为谷歌的可能性。"
    },
    {
      "original": "So to the extent that winning is a matter of absolute returns, the super-angels could win practically all the battles for individual startups and yet lose the war, if they merely failed to get those few big winners.",
      "translated": "因此，如果超级天使投资者只是没能获得那几个大赢家，他们即使在个别初创企业的争夺战中几乎全胜，最终也可能输掉整场战争。"
    },
    {
      "original": "And there's a chance that could happen, because the top VC funds have better brands, and can also do more for their portfolio companies. [3]Because super-angels make more investments per partner, they have less partner per investment.",
      "translated": "这有可能发生，因为顶级风投基金拥有更好的品牌，并且能够为他们的投资组合公司提供更多的支持。[3]由于超级天使投资人每位合伙人负责的投资项目更多，因此每个项目获得的合伙人关注较少。"
    },
    {
      "original": "They can't pay as much attention to you as a VC on your board could. How much is that extra attention worth? It will vary enormously from one partner to another. There's no consensus yet in the general case.",
      "translated": "他们不能像董事会中的风投那样给予你那么多的关注。这种额外的关注值多少？这将因不同的合伙人而异。目前还没有一个普遍的共识。"
    },
    {
      "original": "So for now this is something startups are deciding individually.Till now, VCs' claims about how much value they added were sort of like the government's. Maybe they made you feel better, but you had no choice in the matter, if you needed money on the scale only VCs could supply.",
      "translated": "所以目前这仍然是创业公司各自作出的决定。到目前为止，风险投资家关于他们所增加的价值的说法有点像政府的。也许他们让你感觉更好，但如果你需要只有风投才能提供的大规模资金，你别无选择。"
    },
    {
      "original": "Now that VCs have competitors, that's going to put a market price on the help they offer. The interesting thing is, no one knows yet what it will be.Do startups that want to get really big need the sort of advice and connections only the top VCs can supply?",
      "translated": "现在风投有了竞争对手，这将为他们提供的帮助定价。有趣的是，目前还没有人知道这个价格会是多少。想要做大的初创公司是否需要只有顶级风投才能提供的建议和人脉？"
    },
    {
      "original": "Or would super-angel money do just as well? The VCs will say you need them, and the super-angels will say you don't. But the truth is, no one knows yet, not even the VCs and super-angels themselves. All the super-angels know is that their new model seems promising enough to be worth trying, and all the VCs know is that it seems promising enough to worry about.RoundsWhatever the outcome, the conflict between VCs and super-angels is good news for founders.",
      "translated": "或者超级天使资金也同样可行？风投们会说你需要他们，而超级天使们则会说你不需要。但事实上，还没有人知道答案，即便是风投和超级天使自己也不知道。超级天使们只知道他们的新模式看起来足够有前景，值得一试，而风投们只知道这种模式看起来足够有前景，以至于让他们感到担忧。无论如何，风投和超级天使之间的冲突对创始人来说是个好消息。"
    },
    {
      "original": "And not just for the obvious reason that more competition for deals means better terms. The whole shape of deals is changing.One of the biggest differences between angels and VCs is the amount of your company they want.",
      "translated": "不仅仅是因为更多的竞争意味着更好的条件。交易的整体结构正在发生变化。天使投资者和风险投资者之间最大的区别之一是他们希望持有的公司股份比例。"
    },
    {
      "original": "VCs want a lot. In a series A round they want a third of your company, if they can get it. They don't care much how much they pay for it, but they want a lot because the number of series A investments they can do is so small.",
      "translated": "风投想要很多。在A轮融资中，如果可能的话，他们希望获得你公司三分之一的股份。他们不太关心为此支付多少，但他们想要很多，因为他们能够进行的A轮投资数量非常有限。"
    },
    {
      "original": "In a traditional series A investment, at least one partner from the VC fund takes a seat on your board. [4] Since board seats last about 5 years and each partner can't handle more than about 10 at once, that means a VC fund can only do about 2 series A deals per partner per year.",
      "translated": "在传统的A轮融资中，风险投资基金至少会有一名合伙人加入你的董事会。[4] 由于董事会席位通常持续大约5年，而每位合伙人同时最多只能处理大约10个席位，这意味着每名合伙人每年只能完成大约2笔A轮融资交易。"
    },
    {
      "original": "And that means they need to get as much of the company as they can in each one. You'd have to be a very promising startup indeed to get a VC to use up one of his 10 board seats for only a few percent of you.Since angels generally don't take board seats, they don't have this constraint.",
      "translated": "这意味着他们需要在每一家公司中获得尽可能多的股份。你必须是一个非常有前途的初创公司，才能让一位风险投资家用掉他十个董事会席位中的一个，而仅仅获得你公司几个百分点的股份。由于天使投资者通常不占董事会席位，他们没有这样的限制。"
    },
    {
      "original": "They're happy to buy only a few percent of you. And although the super-angels are in most respects mini VC funds, they've retained this critical property of angels. They don't take board seats, so they don't need a big percentage of your company.Though that means you'll get correspondingly less attention from them, it's good news in other respects.",
      "translated": "他们乐于只购买你公司几个百分点的股份。尽管超级天使投资者在大多数方面类似于小型风险投资基金，但他们保留了天使投资者的一个关键特性：他们不担任董事会席位，因此不需要你公司的大比例股份。虽然这意味着你从他们那里得到的关注会相应减少，但这在其他方面也是个好消息。"
    },
    {
      "original": "Founders never really liked giving up as much equity as VCs wanted. It was a lot of the company to give up in one shot. Most founders doing series A deals would prefer to take half as much money for half as much stock, and then see what valuation they could get for the second half of the stock after using the first half of the money to increase its value.",
      "translated": "创始人们从来都不喜欢放弃风投所要求的那么多股权。一次性放弃公司那么多股份实在太多了。大多数进行A轮融资的创始人都更愿意接受一半的资金以换取一半的股份，然后看看在用第一笔资金增加公司价值之后，剩余一半的股份能获得什么样的估值。"
    },
    {
      "original": "But VCs never offered that option.Now startups have another alternative. Now it's easy to raise angel rounds about half the size of series A rounds. Many of the startups we fund are taking this route, and I predict that will be true of startups in general.A typical big angel round might be $600k on a convertible note with a valuation cap of $4 million premoney.",
      "translated": "但风险投资公司从未提供过这种选择。现在，初创企业有了另一种选择。现在筹集相当于A轮融资一半规模的天使轮资金变得容易多了。我们资助的许多初创企业都在走这条路，我预测这将成为初创企业的普遍趋势。一个典型的大型天使轮融资可能是60万美元，以可转换债券的形式，前轮估值上限为400万美元。"
    },
    {
      "original": "Meaning that when the note converts into stock (in a later round, or upon acquisition), the investors in that round will get .6 / 4.6, or 13% of the company. That's a lot less than the 30 to 40% of the company you usually give up in a series A round if you do it so early.",
      "translated": "这意味着当这笔投资转换为公司股份（在后续轮次或被收购时），该轮次的投资者将获得0.6 / 4.6，即公司13%的股份。这远低于如果你过早进行A轮融资通常需要出让的30%到40%的公司股份。"
    },
    {
      "original": "[5]But the advantage of these medium-sized rounds is not just that they cause less dilution. You also lose less control. After an angel round, the founders almost always still have control of the company, whereas after a series A round they often don't.",
      "translated": "但这些中等规模轮融资的优势不仅在于稀释程度较低。你也会失去较少的控制权。在天使轮融资之后，创始人几乎总是仍然掌控公司，而在A轮融资之后，他们往往就不再是这样了。"
    },
    {
      "original": "The traditional board structure after a series A round is two founders, two VCs, and a (supposedly) neutral fifth person. Plus series A terms usually give the investors a veto over various kinds of important decisions, including selling the company.",
      "translated": "传统的一轮融资后的董事会结构是两位创始人、两位风险投资家和一位（理论上）中立的第五人。此外，A轮融资条款通常赋予投资者对包括出售公司在内的各种重要决策的否决权。"
    },
    {
      "original": "Founders usually have a lot of de facto control after a series A, as long as things are going well. But that's not the same as just being able to do what you want, like you could before.A third and quite significant advantage of angel rounds is that they're less stressful to raise.",
      "translated": "创始人在A轮融资后通常仍然拥有相当大的实际控制权，只要一切进展顺利。但这并不意味着他们可以像以前那样随心所欲地做事。天使轮融资的第三个且相当重要的优势是，筹集资金的压力较小。"
    },
    {
      "original": "Raising a traditional series A round has in the past taken weeks, if not months. When a VC firm can only do 2 deals per partner per year, they're careful about which they do. To get a traditional series A round you have to go through a series of meetings, culminating in a full partner meeting where the firm as a whole says yes or no.",
      "translated": "过去，筹集传统的A轮融资需要几周，甚至几个月的时间。当一家风投公司每年每位合伙人只能做2笔交易时，他们对选择哪些项目会非常谨慎。要获得传统的A轮融资，你需要经历一系列会议，最终在全体合伙人会议上由整个公司决定是否投资。"
    },
    {
      "original": "That's the really scary part for founders: not just that series A rounds take so long, but at the end of this long process the VCs might still say no. The chance of getting rejected after the full partner meeting averages about 25%.",
      "translated": "这对创始人来说才是真正可怕的部分：不仅仅是A轮融资耗时长久，而且在这漫长的过程中，风险投资人在最后的全体合伙人会议后仍可能拒绝投资。被拒绝的平均概率约为25%。"
    },
    {
      "original": "At some firms it's over 50%.Fortunately for founders, VCs have been getting a lot faster. Nowadays Valley VCs are more likely to take 2 weeks than 2 months. But they're still not as fast as angels and super-angels, the most decisive of whom sometimes decide in hours.Raising an angel round is not only quicker, but you get feedback as it progresses.",
      "translated": "在某些公司，这一比例超过50%。对创始人来说幸运的是，风险投资人的决策速度已经大大加快。如今，硅谷的风险投资人更可能在两周内而非两个月内做出决定。但他们仍然没有天使投资人和超级天使投资人那么迅速，最果断的天使投资人有时甚至在几小时内就能做出决定。筹集天使轮融资不仅更快，而且在这个过程中你还能得到反馈。"
    },
    {
      "original": "An angel round is not an all or nothing thing like a series A. It's composed of multiple investors with varying degrees of seriousness, ranging from the upstanding ones who commit unequivocally to the jerks who give you lines like \"come back to me to fill out the round.\" You usually start collecting money from the most committed investors and work your way out toward the ambivalent ones, whose interest increases as the round fills up.But at each point you know how you're doing.",
      "translated": "天使轮融资不像A轮融资那样是全有或全无的事情。它由多个投资者组成，这些投资者的认真程度各不相同，从那些明确承诺的正直人士到那些会跟你说“等你把这一轮融资差不多填满了再回来找我”的混蛋。你通常会从最坚定的投资者那里开始筹集资金，然后逐渐向那些态度模棱两可的投资者推进，而这些人的兴趣会随着融资轮次的逐渐填满而增加。但在每个阶段，你都能清楚地知道自己的进展。"
    },
    {
      "original": "If investors turn cold you may have to raise less, but when investors in an angel round turn cold the process at least degrades gracefully, instead of blowing up in your face and leaving you with nothing, as happens if you get rejected by a VC fund after a full partner meeting.",
      "translated": "如果投资者态度转冷，你可能需要筹集的资金会减少，但当天使轮的投资者态度转冷时，这一过程至少会逐渐恶化，而不会像在完成全体合伙人会议后被风险投资基金拒绝那样，让你一无所获。"
    },
    {
      "original": "Whereas if investors seem hot, you can not only close the round faster, but now that convertible notes are becoming the norm, actually raise the price to reflect demand.ValuationHowever, the VCs have a weapon they can use against the super-angels, and they have started to use it.",
      "translated": "如果投资者热情高涨，你不仅能够更快地完成融资轮次，而且由于可转换债券现在已成为常态，还可以提高价格以反映需求。然而，风险投资家们有一个可以用来对抗超级天使投资者的武器，他们已经开始使用这个武器了。"
    },
    {
      "original": "VCs have started making angel-sized investments too. The term \"angel round\" doesn't mean that all the investors in it are angels; it just describes the structure of the round. Increasingly the participants include VCs making investments of a hundred thousand or two.",
      "translated": "风险投资家也开始进行天使轮规模的投资。\"天使轮\"这个词并不意味着参与的所有投资者都是天使投资者；它只是描述了这一轮融资的结构。越来越多的情况下，参与者包括进行十几万或几十万美元投资的风险投资家。"
    },
    {
      "original": "And when VCs invest in angel rounds they can do things that super-angels don't like. VCs are quite valuation-insensitive in angel rounds—partly because they are in general, and partly because they don't care that much about the returns on angel rounds, which they still view mostly as a way to recruit startups for series A rounds later.",
      "translated": "当风险投资人在天使轮融资中进行投资时，他们可能会做一些超级天使投资人不喜欢的事情。风险投资人在天使轮融资中对估值相对不敏感——部分原因是他们总体上就是这样，部分原因是因为他们并不太关心天使轮融资的回报，他们仍然主要将天使轮视为吸引初创企业参加后续A轮融资的一种方式。"
    },
    {
      "original": "So VCs who invest in angel rounds can blow up the valuations for angels and super-angels who invest in them. [6]Some super-angels seem to care about valuations. Several turned down YC-funded startups after Demo Day because their valuations were too high.",
      "translated": "因此，投资天使轮融资的风险投资家可能会推高那些天使投资人和超级天使投资人投资的估值。[6]一些超级天使投资人似乎很在意估值。有几位在Demo Day后拒绝了YC资助的初创公司，原因是估值过高。"
    },
    {
      "original": "This was not a problem for the startups; by definition a high valuation means enough investors were willing to accept it. But it was mysterious to me that the super-angels would quibble about valuations.",
      "translated": "这并不是初创企业的问题；高估值的定义本身就说明有足够的投资者愿意接受。但令我感到困惑的是，超级天使投资人竟然会在估值问题上斤斤计较。"
    },
    {
      "original": "Did they not understand that the big returns come from a few big successes, and that it therefore mattered far more which startups you picked than how much you paid for them?After thinking about it for a while and observing certain other signs, I have a theory that explains why the super-angels may be smarter than they seem.",
      "translated": "他们难道不明白，巨大的回报来自于少数几个大成功，因此选择哪些初创企业比你为它们支付多少更重要吗？在思考了一段时间并观察到某些其他迹象后，我有一个理论可以解释为什么超级天使投资人可能比表面上看起来更聪明。"
    },
    {
      "original": "It would make sense for super-angels to want low valuations if they're hoping to invest in startups that get bought early. If you're hoping to hit the next Google, you shouldn't care if the valuation is 20 million.",
      "translated": "超级天使投资者希望获得较低的估值是合情合理的，如果他们期望投资的初创公司能够早期被收购。但如果你的目标是找到下一个谷歌，那么2000万美元的估值就不应该成为你的顾虑。"
    },
    {
      "original": "But if you're looking for companies that are going to get bought for 30 million, you care. If you invest at 20 and the company gets bought for 30, you only get 1.5x. You might as well buy Apple.So if some of the super-angels were looking for companies that could get acquired quickly, that would explain why they'd care about valuations.",
      "translated": "但如果你寻找的是那些可能以3000万美元被收购的公司，这就会变得重要。如果你以2000万美元投资，而公司最终以3000万美元被收购，你只能获得1.5倍的回报。你还不如去买苹果股票。所以，如果一些超级天使投资者在寻找可以迅速被收购的公司，这就可以解释为什么他们会对估值如此在意。"
    },
    {
      "original": "But why would they be looking for those? Because depending on the meaning of \"quickly,\" it could actually be very profitable. A company that gets acquired for 30 million is a failure to a VC, but it could be a 10x return for an angel, and moreover, a quick 10x return.",
      "translated": "但他们为什么要寻找这些呢？因为根据“迅速”的含义，这实际上可能非常有利可图。一家公司以3000万美元被收购对风投来说是失败的，但对天使投资者来说，这可能是一个10倍的回报，而且是一个快速的10倍回报。"
    },
    {
      "original": "Rate of return is what matters in investing—not the multiple you get, but the multiple per year. If a super-angel gets 10x in one year, that's a higher rate of return than a VC could ever hope to get from a company that took 6 years to go public.",
      "translated": "投资中重要的是回报率——不是你获得的倍数，而是每年的倍数。如果超级天使投资者在一年内获得10倍回报，那么这个回报率比风投从一家花了6年时间上市的公司所能期望获得的回报率要高得多。"
    },
    {
      "original": "To get the same rate of return, the VC would have to get a multiple of 10^6—one million x. Even Google didn't come close to that.So I think at least some super-angels are looking for companies that will get bought.",
      "translated": "为了获得相同的回报率，风险投资需要获得10的6次方倍——也就是一百万倍的回报。即使是谷歌也远远没有达到这个水平。所以我认为至少有一些超级天使投资者是在寻找会被收购的公司。"
    },
    {
      "original": "That's the only rational explanation for focusing on getting the right valuations, instead of the right companies. And if so they'll be different to deal with than VCs. They'll be tougher on valuations, but more accommodating if you want to sell early.PrognosisWho will win, the super-angels or the VCs?",
      "translated": "这是唯一合理的解释，即关注获得正确的估值，而不是正确的公司。如果是这样的话，他们与风险投资人的处理方式将会不同。他们在估值上会更加严格，但如果你希望早点出售，他们会更加通融。预测：超级天使投资人和风险投资人，谁会胜出？"
    },
    {
      "original": "I think the answer to that is, some of each. They'll each become more like one another. The super-angels will start to invest larger amounts, and the VCs will gradually figure out ways to make more, smaller investments faster.",
      "translated": "我认为答案是，两者都会有。它们会逐渐变得更加相似。超级天使投资人将开始投资更大的金额，而风险投资公司将逐渐找到更快地进行更多小额投资的方法。"
    },
    {
      "original": "A decade from now the players will be hard to tell apart, and there will probably be survivors from each group.What does that mean for founders? One thing it means is that the high valuations startups are presently getting may not last forever.",
      "translated": "十年后，各大玩家将难以区分，每个阵营可能都会有幸存者。这对创始人意味着什么？其中一个含义是，初创公司目前获得的高估值可能不会永远持续。"
    },
    {
      "original": "To the extent that valuations are being driven up by price-insensitive VCs, they'll fall again if VCs become more like super-angels and start to become more miserly about valuations. Fortunately if this does happen it will take years.The short term forecast is more competition between investors, which is good news for you.",
      "translated": "估值在很大程度上是由对价格不敏感的风险投资推动的，如果风险投资变得更加像超级天使投资人，开始对估值更加吝啬，那么这些估值将会再次下跌。幸运的是，如果这种情况发生，将需要数年时间。短期内的预测是投资者之间的竞争将更加激烈，这对您来说是个好消息。"
    },
    {
      "original": "The super-angels will try to undermine the VCs by acting faster, and the VCs will try to undermine the super-angels by driving up valuations. Which for founders will result in the perfect combination: funding rounds that close fast, with high valuations.But remember that to get that combination, your startup will have to appeal to both super-angels and VCs.",
      "translated": "超级天使投资人会试图通过更快的行动来削弱风险投资人的地位，而风险投资人则会通过抬高估值来打击超级天使投资人。这将为创始人带来完美的组合：快速完成融资轮次，同时估值高。但请记住，要获得这种组合，你的初创公司必须同时吸引超级天使投资人和风险投资人。"
    },
    {
      "original": "If you don't seem like you have the potential to go public, you won't be able to use VCs to drive up the valuation of an angel round.There is a danger of having VCs in an angel round: the so-called signalling risk.",
      "translated": "如果你看起来没有上市的潜力，你就无法利用风险投资来提升天使轮融资的估值。天使轮融资中引入风险投资存在一个风险：所谓的信号风险。"
    },
    {
      "original": "If VCs are only doing it in the hope of investing more later, what happens if they don't? That's a signal to everyone else that they think you're lame.How much should you worry about that? The seriousness of signalling risk depends on how far along you are.",
      "translated": "如果风险投资家只是出于希望将来能更多投资的目的而这样做，那么如果他们不继续投资会发生什么？这将向其他人发出信号，表明他们认为你不行。你该为此担心多少呢？信号风险的严重性取决于你的公司发展到了什么阶段。"
    },
    {
      "original": "If by the next time you need to raise money, you have graphs showing rising revenue or traffic month after month, you don't have to worry about any signals your existing investors are sending. Your results will speak for themselves.",
      "translated": "如果你下次需要筹集资金时，能够展示出月度收入或流量持续增长的图表，就无需担心现有投资者发出的任何信号。你的成果将不言自明。"
    },
    {
      "original": "[7]Whereas if the next time you need to raise money you won't yet have concrete results, you may need to think more about the message your investors might send if they don't invest more. I'm not sure yet how much you have to worry, because this whole phenomenon of VCs doing angel investments is so new.",
      "translated": "而如果下次你需要筹集资金时还没有具体成果，你可能需要更多考虑，如果投资者不再追加投资，这会传递出什么样的信息。我目前还不能确定你有多大需要担心，因为这种风险投资公司进行天使投资的现象还非常新。"
    },
    {
      "original": "But my instincts tell me you don't have to worry much. Signalling risk smells like one of those things founders worry about that's not a real problem. As a rule, the only thing that can kill a good startup is the startup itself.",
      "translated": "但我的直觉告诉你，你不必过于担心。标榜风险听起来像是创始人担忧的那些其实并不存在的问题之一。一般来说，唯一能摧毁一家好初创企业的，只有企业自身。"
    },
    {
      "original": "Startups hurt themselves way more often than competitors hurt them, for example. I suspect signalling risk is in this category too.One thing YC-funded startups have been doing to mitigate the risk of taking money from VCs in angel rounds is not to take too much from any one VC.",
      "translated": "初创公司更多的是因为自身的问题而受到伤害，而不是竞争对手造成的。我认为信号风险也属于这一类。YC资助的初创公司为了减少从风险投资人在天使轮融资中拿钱的风险，采取的一个策略是不要从任何一个风险投资人那里拿太多的钱。"
    },
    {
      "original": "Maybe that will help, if you have the luxury of turning down money.Fortunately, more and more startups will. After decades of competition that could best be described as intramural, the startup funding business is finally getting some real competition.",
      "translated": "也许这会有帮助，如果你有拒绝金钱的奢侈条件。幸运的是，越来越多的初创公司将能够这样做。在经历了数十年可以最好地描述为内部竞争的初创企业融资业务之后，这一领域终于迎来了一些真正的竞争。"
    },
    {
      "original": "That should last several years at least, and maybe a lot longer. Unless there's some huge market crash, the next couple years are going to be a good time for startups to raise money. And that's exciting because it means lots more startups will happen.",
      "translated": "这应该至少能持续几年，甚至可能更长。除非发生重大市场崩盘，否则接下来的几年对于初创公司来说将是筹集资金的好时机。这令人兴奋，因为它意味着将会有更多的初创公司涌现。"
    },
    {
      "original": "Notes[1] I've also heard them called \"Mini-VCs\" and \"Micro-VCs.\" I don't know which name will stick.There were a couple predecessors. Ron Conway had angel funds starting in the 1990s, and in some ways First Round Capital is closer to a super-angel than a VC fund.[2] It wouldn't cut their overall returns tenfold, because investing later would probably (a) cause them to lose less on investments that failed, and (b) not allow them to get as large a percentage of startups as they do now.",
      "translated": "注释[1] 我还听说过它们被称为“小型风险投资”和“微型风险投资”。我不知道哪个名称会流行起来。有一些先驱者。Ron Conway 从 1990 年代就开始有天使基金，从某些方面来看，First Round Capital 更接近于超级天使投资人，而不是风险投资基金。[2] 这并不会使它们的总体回报减少十倍，因为后期投资可能会（a）使它们在失败的投资上损失更少，以及（b）无法像现在这样获得同样高的创业公司股份比例。"
    },
    {
      "original": "So it's hard to predict precisely what would happen to their returns.[3] The brand of an investor derives mostly from the success of their portfolio companies. The top VCs thus have a big brand advantage over the super-angels.",
      "translated": "因此，很难准确预测他们的回报会受到怎样的影响。[3] 投资者的品牌主要源自其投资组合公司的成功。因此，顶级风投公司在品牌上对超级天使投资者具有显著优势。"
    },
    {
      "original": "They could make it self-perpetuating if they used it to get all the best new startups. But I don't think they'll be able to. To get all the best startups, you have to do more than make them want you.",
      "translated": "他们可以通过吸引所有最好的新创企业来实现自我持续发展。但我认为他们做不到。要吸引所有最好的新创企业，你必须做的不仅仅是让它们想要你。"
    },
    {
      "original": "You also have to want them; you have to recognize them when you see them, and that's much harder. Super-angels will snap up stars that VCs miss. And that will cause the brand gap between the top VCs and the super-angels gradually to erode.[4] Though in a traditional series A round VCs put two partners on your board, there are signs now that VCs may begin to conserve board seats by switching to what used to be considered an angel-round board, consisting of two founders and one VC.",
      "translated": "你还需要想要它们；当你看到它们时，你必须能够认出它们，而这要难得多。超级天使会抢走那些风险投资家错过的明星项目。而这将导致顶级风险投资公司与超级天使之间的品牌差距逐渐缩小。尽管在传统的A轮融资中，风险投资公司会委派两名合伙人进入你的董事会，但现在已有迹象表明，风险投资公司可能会通过转向过去被认为是天使轮融资的董事会结构（即两名创始人和一名风险投资家）来节省董事会席位。"
    },
    {
      "original": "Which is also to the founders' advantage if it means they still control the company.[5] In a series A round, you usually have to give up more than the actual amount of stock the VCs buy, because they insist you dilute yourselves to set aside an \"option pool\" as well.",
      "translated": "这对于创始人来说也是有利的，如果这意味着他们仍然控制着公司。在A轮融资中，通常你不仅要放弃风投实际购买的股份，还要稀释自己的股份，以便留出一个“期权池”。"
    },
    {
      "original": "I predict this practice will gradually disappear though.[6] The best thing for founders, if they can get it, is a convertible note with no valuation cap at all. In that case the money invested in the angel round just converts into stock at the valuation of the next round, no matter how large.",
      "translated": "我预测这种做法将逐渐消失。[6] 对创始人来说，如果他们能够争取到的话，最好的选择是没有估值上限的可转换债券。在这种情况下，天使轮融资中投入的资金将在下一轮融资时以该轮的估值转换为股权，无论估值多高。"
    },
    {
      "original": "Angels and super-angels tend not to like uncapped notes. They have no idea how much of the company they're buying. If the company does well and the valuation of the next round is high, they may end up with only a sliver of it.",
      "translated": "天使投资人和超级天使投资人通常不喜欢无上限的可转换债券。他们不知道自己购买的公司股份究竟有多少。如果公司发展良好，下一轮的估值很高，他们最终可能只持有微不足道的一小部分股份。"
    },
    {
      "original": "So by agreeing to uncapped notes, VCs who don't care about valuations in angel rounds can make offers that super-angels hate to match.[7] Obviously signalling risk is also not a problem if you'll never need to raise more money.",
      "translated": "因此，通过同意无上限的注资，那些在天使轮融资中不关心估值的风险投资人可以提出超级天使投资人不愿匹配的条件。[7] 显然，如果你永远不需要再筹集资金，那么发出风险信号也不是问题。"
    },
    {
      "original": "But startups are often mistaken about that.Thanks to Sam Altman, John Bautista, Patrick Collison, James Lindenbaum, Reid Hoffman, Jessica Livingston and Harj Taggar for reading drafts of this.",
      "translated": "但初创公司经常在这个问题上犯错。感谢Sam Altman、John Bautista、Patrick Collison、James Lindenbaum、Reid Hoffman、Jessica Livingston和Harj Taggar审阅本文的草稿。"
    }
  ],
  "translation_completed": "2025-07-29T01:30:09.484016",
  "translation_stats": {
    "total_paragraphs": 71,
    "success_count": 71,
    "success_rate": "100.0%"
  }
}