{
  "title": "Taste for Makers",
  "title_zh": "[待翻译] Taste for Makers",
  "url": "https://www.paulgraham.com/taste.html",
  "filename": "taste.html",
  "date": "2002-02-01",
  "id": 225,
  "content": {
    "success": true,
    "paragraphs": [
      "February 2002 \"...Copernicus' aesthetic objections to [equants] provided one essential motive for his rejection of the Ptolemaic system....\"- Thomas Kuhn, The Copernican Revolution\"All of us had been trained by Kelly Johnson and believed fanatically in his insistence that an airplane that looked beautiful would fly the same way.\"- Ben Rich, Skunk Works\"Beauty is the first test: there is no permanent place in this world for ugly mathematics.\"- G.",
      "H. Hardy, A Mathematician's Apology I was talking recently to a friend who teaches at MIT. His field is hot now and every year he is inundated by applications from would-be graduate students. \"A lot of them seem smart,\" he said.",
      "\"What I can't tell is whether they have any kind of taste.\"Taste. You don't hear that word much now. And yet we still need the underlying concept, whatever we call it. What my friend meant was that he wanted students who were not just good technicians, but who could use their technical knowledge to design beautiful things.Mathematicians call good work \"beautiful,\" and so, either now or in the past, have scientists, engineers, musicians, architects, designers, writers, and painters.",
      "Is it just a coincidence that they used the same word, or is there some overlap in what they meant? If there is an overlap, can we use one field's discoveries about beauty to help us in another?For those of us who design things, these are not just theoretical questions.",
      "If there is such a thing as beauty, we need to be able to recognize it. We need good taste to make good things. Instead of treating beauty as an airy abstraction, to be either blathered about or avoided depending on how one feels about airy abstractions, let's try considering it as a practical question: how do you make good stuff?If you mention taste nowadays, a lot of people will tell you that \"taste is subjective.\" They believe this because it really feels that way to them.",
      "When they like something, they have no idea why. It could be because it's beautiful, or because their mother had one, or because they saw a movie star with one in a magazine, or because they know it's expensive.",
      "Their thoughts are a tangle of unexamined impulses.Most of us are encouraged, as children, to leave this tangle unexamined. If you make fun of your little brother for coloring people green in his coloring book, your mother is likely to tell you something like \"you like to do it your way and he likes to do it his way.\"Your mother at this point is not trying to teach you important truths about aesthetics.",
      "She's trying to get the two of you to stop bickering.Like many of the half-truths adults tell us, this one contradicts other things they tell us. After dinning into you that taste is merely a matter of personal preference, they take you to the museum and tell you that you should pay attention because Leonardo is a great artist.What goes through the kid's head at this point?",
      "What does he think \"great artist\" means? After having been told for years that everyone just likes to do things their own way, he is unlikely to head straight for the conclusion that a great artist is someone whose work is better than the others'.",
      "A far more likely theory, in his Ptolemaic model of the universe, is that a great artist is something that's good for you, like broccoli, because someone said so in a book.Saying that taste is just personal preference is a good way to prevent disputes.",
      "The trouble is, it's not true. You feel this when you start to design things.Whatever job people do, they naturally want to do better. Football players like to win games. CEOs like to increase earnings.",
      "It's a matter of pride, and a real pleasure, to get better at your job. But if your job is to design things, and there is no such thing as beauty, then there is no way to get better at your job. If taste is just personal preference, then everyone's is already perfect: you like whatever you like, and that's it.As in any job, as you continue to design things, you'll get better at it.",
      "Your tastes will change. And, like anyone who gets better at their job, you'll know you're getting better. If so, your old tastes were not merely different, but worse. Poof goes the axiom that taste can't be wrong.Relativism is fashionable at the moment, and that may hamper you from thinking about taste, even as yours grows.",
      "But if you come out of the closet and admit, at least to yourself, that there is such a thing as good and bad design, then you can start to study good design in detail. How has your taste changed? When you made mistakes, what caused you to make them?",
      "What have other people learned about design?Once you start to examine the question, it's surprising how much different fields' ideas of beauty have in common. The same principles of good design crop up again and again.Good design is simple.",
      "You hear this from math to painting. In math it means that a shorter proof tends to be a better one. Where axioms are concerned, especially, less is more. It means much the same thing in programming.",
      "For architects and designers it means that beauty should depend on a few carefully chosen structural elements rather than a profusion of superficial ornament. (Ornament is not in itself bad, only when it's camouflage on insipid form.) Similarly, in painting, a still life of a few carefully observed and solidly modelled objects will tend to be more interesting than a stretch of flashy but mindlessly repetitive painting of, say, a lace collar.",
      "In writing it means: say what you mean and say it briefly.It seems strange to have to emphasize simplicity. You'd think simple would be the default. Ornate is more work. But something seems to come over people when they try to be creative.",
      "Beginning writers adopt a pompous tone that doesn't sound anything like the way they speak. Designers trying to be artistic resort to swooshes and curlicues. Painters discover that they're expressionists.",
      "It's all evasion. Underneath the long words or the \"expressive\" brush strokes, there is not much going on, and that's frightening.When you're forced to be simple, you're forced to face the real problem.",
      "When you can't deliver ornament, you have to deliver substance.Good design is timeless. In math, every proof is timeless unless it contains a mistake. So what does Hardy mean when he says there is no permanent place for ugly mathematics?",
      "He means the same thing Kelly Johnson did: if something is ugly, it can't be the best solution. There must be a better one, and eventually someone will discover it.Aiming at timelessness is a way to make yourself find the best answer: if you can imagine someone surpassing you, you should do it yourself.",
      "Some of the greatest masters did this so well that they left little room for those who came after. Every engraver since Durer has had to live in his shadow.Aiming at timelessness is also a way to evade the grip of fashion.",
      "Fashions almost by definition change with time, so if you can make something that will still look good far into the future, then its appeal must derive more from merit and less from fashion.Strangely enough, if you want to make something that will appeal to future generations, one way to do it is to try to appeal to past generations.",
      "It's hard to guess what the future will be like, but we can be sure it will be like the past in caring nothing for present fashions. So if you can make something that appeals to people today and would also have appealed to people in 1500, there is a good chance it will appeal to people in 2500.Good design solves the right problem.",
      "The typical stove has four burners arranged in a square, and a dial to control each. How do you arrange the dials? The simplest answer is to put them in a row. But this is a simple answer to the wrong question.",
      "The dials are for humans to use, and if you put them in a row, the unlucky human will have to stop and think each time about which dial matches which burner. Better to arrange the dials in a square like the burners.A lot of bad design is industrious, but misguided.",
      "In the mid twentieth century there was a vogue for setting text in sans-serif fonts. These fonts are closer to the pure, underlying letterforms. But in text that's not the problem you're trying to solve.",
      "For legibility it's more important that letters be easy to tell apart. It may look Victorian, but a Times Roman lowercase g is easy to tell from a lowercase y.Problems can be improved as well as solutions.",
      "In software, an intractable problem can usually be replaced by an equivalent one that's easy to solve. Physics progressed faster as the problem became predicting observable behavior, instead of reconciling it with scripture.Good design is suggestive.",
      "Jane Austen's novels contain almost no description; instead of telling you how everything looks, she tells her story so well that you envision the scene for yourself. Likewise, a painting that suggests is usually more engaging than one that tells.",
      "Everyone makes up their own story about the Mona Lisa.In architecture and design, this principle means that a building or object should let you use it how you want: a good building, for example, will serve as a backdrop for whatever life people want to lead in it, instead of making them live as if they were executing a program written by the architect.In software, it means you should give users a few basic elements that they can combine as they wish, like Lego.",
      "In math it means a proof that becomes the basis for a lot of new work is preferable to a proof that was difficult, but doesn't lead to future discoveries; in the sciences generally, citation is considered a rough indicator of merit.Good design is often slightly funny.",
      "This one may not always be true. But Durer's engravings and Saarinen's womb chair and the Pantheon and the original Porsche 911 all seem to me slightly funny. Godel's incompleteness theorem seems like a practical joke.I think it's because humor is related to strength.",
      "To have a sense of humor is to be strong: to keep one's sense of humor is to shrug off misfortunes, and to lose one's sense of humor is to be wounded by them. And so the mark-- or at least the prerogative-- of strength is not to take oneself too seriously.",
      "The confident will often, like swallows, seem to be making fun of the whole process slightly, as Hitchcock does in his films or Bruegel in his paintings-- or Shakespeare, for that matter.Good design may not have to be funny, but it's hard to imagine something that could be called humorless also being good design.Good design is hard.",
      "If you look at the people who've done great work, one thing they all seem to have in common is that they worked very hard. If you're not working hard, you're probably wasting your time.Hard problems call for great efforts.",
      "In math, difficult proofs require ingenious solutions, and those tend to be interesting. Ditto in engineering.When you have to climb a mountain you toss everything unnecessary out of your pack. And so an architect who has to build on a difficult site, or a small budget, will find that he is forced to produce an elegant design.",
      "Fashions and flourishes get knocked aside by the difficult business of solving the problem at all.Not every kind of hard is good. There is good pain and bad pain. You want the kind of pain you get from going running, not the kind you get from stepping on a nail.",
      "A difficult problem could be good for a designer, but a fickle client or unreliable materials would not be.In art, the highest place has traditionally been given to paintings of people. There is something to this tradition, and not just because pictures of faces get to press buttons in our brains that other pictures don't.",
      "We are so good at looking at faces that we force anyone who draws them to work hard to satisfy us. If you draw a tree and you change the angle of a branch five degrees, no one will know. When you change the angle of someone's eye five degrees, people notice.When Bauhaus designers adopted Sullivan's \"form follows function,\" what they meant was, form should follow function.",
      "And if function is hard enough, form is forced to follow it, because there is no effort to spare for error. Wild animals are beautiful because they have hard lives.Good design looks easy. Like great athletes, great designers make it look easy.",
      "Mostly this is an illusion. The easy, conversational tone of good writing comes only on the eighth rewrite.In science and engineering, some of the greatest discoveries seem so simple that you say to yourself, I could have thought of that.",
      "The discoverer is entitled to reply, why didn't you?Some Leonardo heads are just a few lines. You look at them and you think, all you have to do is get eight or ten lines in the right place and you've made this beautiful portrait.",
      "Well, yes, but you have to get them in exactly the right place. The slightest error will make the whole thing collapse.Line drawings are in fact the most difficult visual medium, because they demand near perfection.",
      "In math terms, they are a closed-form solution; lesser artists literally solve the same problems by successive approximation. One of the reasons kids give up drawing at ten or so is that they decide to start drawing like grownups, and one of the first things they try is a line drawing of a face.",
      "Smack!In most fields the appearance of ease seems to come with practice. Perhaps what practice does is train your unconscious mind to handle tasks that used to require conscious thought. In some cases you literally train your body.",
      "An expert pianist can play notes faster than the brain can send signals to his hand. Likewise an artist, after a while, can make visual perception flow in through his eye and out through his hand as automatically as someone tapping his foot to a beat.When people talk about being in \"the zone,\" I think what they mean is that the spinal cord has the situation under control.",
      "Your spinal cord is less hesitant, and it frees conscious thought for the hard problems. Good design uses symmetry. I think symmetry may just be one way to achieve simplicity, but it's important enough to be mentioned on its own.",
      "Nature uses it a lot, which is a good sign.There are two kinds of symmetry, repetition and recursion. Recursion means repetition in subelements, like the pattern of veins in a leaf.Symmetry is unfashionable in some fields now, in reaction to excesses in the past.",
      "Architects started consciously making buildings asymmetric in Victorian times and by the 1920s asymmetry was an explicit premise of modernist architecture. Even these buildings only tended to be asymmetric about major axes, though; there were hundreds of minor symmetries.In writing you find symmetry at every level, from the phrases in a sentence to the plot of a novel.",
      "You find the same in music and art. Mosaics (and some Cezannes) get extra visual punch by making the whole picture out of the same atoms. Compositional symmetry yields some of the most memorable paintings, especially when two halves react to one another, as in the Creation of Adam or American Gothic.In math and engineering, recursion, especially, is a big win.",
      "Inductive proofs are wonderfully short. In software, a problem that can be solved by recursion is nearly always best solved that way. The Eiffel Tower looks striking partly because it is a recursive solution, a tower on a tower.The danger of symmetry, and repetition especially, is that it can be used as a substitute for thought.Good design resembles nature.",
      "It's not so much that resembling nature is intrinsically good as that nature has had a long time to work on the problem. It's a good sign when your answer resembles nature's.It's not cheating to copy.",
      "Few would deny that a story should be like life. Working from life is a valuable tool in painting too, though its role has often been misunderstood. The aim is not simply to make a record. The point of painting from life is that it gives your mind something to chew on: when your eyes are looking at something, your hand will do more interesting work.Imitating nature also works in engineering.",
      "Boats have long had spines and ribs like an animal's ribcage. In some cases we may have to wait for better technology: early aircraft designers were mistaken to design aircraft that looked like birds, because they didn't have materials or power sources light enough (the Wrights' engine weighed 152 lbs.",
      "and generated only 12 hp.) or control systems sophisticated enough for machines that flew like birds, but I could imagine little unmanned reconnaissance planes flying like birds in fifty years.Now that we have enough computer power, we can imitate nature's method as well as its results.",
      "Genetic algorithms may let us create things too complex to design in the ordinary sense.Good design is redesign. It's rare to get things right the first time. Experts expect to throw away some early work.",
      "They plan for plans to change.It takes confidence to throw work away. You have to be able to think, there's more where that came from. When people first start drawing, for example, they're often reluctant to redo parts that aren't right; they feel they've been lucky to get that far, and if they try to redo something, it will turn out worse.",
      "Instead they convince themselves that the drawing is not that bad, really-- in fact, maybe they meant it to look that way.Dangerous territory, that; if anything you should cultivate dissatisfaction. In Leonardo's drawings there are often five or six attempts to get a line right.",
      "The distinctive back of the Porsche 911 only appeared in the redesign of an awkward prototype. In Wright's early plans for the Guggenheim, the right half was a ziggurat; he inverted it to get the present shape.Mistakes are natural.",
      "Instead of treating them as disasters, make them easy to acknowledge and easy to fix. Leonardo more or less invented the sketch, as a way to make drawing bear a greater weight of exploration. Open-source software has fewer bugs because it admits the possibility of bugs.It helps to have a medium that makes change easy.",
      "When oil paint replaced tempera in the fifteenth century, it helped painters to deal with difficult subjects like the human figure because, unlike tempera, oil can be blended and overpainted. Good design can copy.",
      "Attitudes to copying often make a round trip. A novice imitates without knowing it; next he tries consciously to be original; finally, he decides it's more important to be right than original.Unknowing imitation is almost a recipe for bad design.",
      "If you don't know where your ideas are coming from, you're probably imitating an imitator. Raphael so pervaded mid-nineteenth century taste that almost anyone who tried to draw was imitating him, often at several removes.",
      "It was this, more than Raphael's own work, that bothered the Pre-Raphaelites.The ambitious are not content to imitate. The second phase in the growth of taste is a conscious attempt at originality.I think the greatest masters go on to achieve a kind of selflessness.",
      "They just want to get the right answer, and if part of the right answer has already been discovered by someone else, that's no reason not to use it. They're confident enough to take from anyone without feeling that their own vision will be lost in the process.",
      "Good design is often strange. Some of the very best work has an uncanny quality: Euler's Formula, Bruegel's Hunters in the Snow, the SR-71, Lisp. They're not just beautiful, but strangely beautiful.I'm not sure why.",
      "It may just be my own stupidity. A can-opener must seem miraculous to a dog. Maybe if I were smart enough it would seem the most natural thing in the world that ei*pi = -1. It is after all necessarily true.Most of the qualities I've mentioned are things that can be cultivated, but I don't think it works to cultivate strangeness.",
      "The best you can do is not squash it if it starts to appear. Einstein didn't try to make relativity strange. He tried to make it true, and the truth turned out to be strange.At an art school where I once studied, the students wanted most of all to develop a personal style.",
      "But if you just try to make good things, you'll inevitably do it in a distinctive way, just as each person walks in a distinctive way. Michelangelo was not trying to paint like Michelangelo. He was just trying to paint well; he couldn't help painting like Michelangelo.The only style worth having is the one you can't help.",
      "And this is especially true for strangeness. There is no shortcut to it. The Northwest Passage that the Mannerists, the Romantics, and two generations of American high school students have searched for does not seem to exist.",
      "The only way to get there is to go through good and come out the other side. Good design happens in chunks. The inhabitants of fifteenth century Florence included Brunelleschi, Ghiberti, Donatello, Masaccio, Filippo Lippi, Fra Angelico, Verrocchio, Botticelli, Leonardo, and Michelangelo.",
      "Milan at the time was as big as Florence. How many fifteenth century Milanese artists can you name?Something was happening in Florence in the fifteenth century. And it can't have been heredity, because it isn't happening now.",
      "You have to assume that whatever inborn ability Leonardo and Michelangelo had, there were people born in Milan with just as much. What happened to the Milanese Leonardo?There are roughly a thousand times as many people alive in the US right now as lived in Florence during the fifteenth century.",
      "A thousand Leonardos and a thousand Michelangelos walk among us. If DNA ruled, we should be greeted daily by artistic marvels. We aren't, and the reason is that to make Leonardo you need more than his innate ability.",
      "You also need Florence in 1450.Nothing is more powerful than a community of talented people working on related problems. Genes count for little by comparison: being a genetic Leonardo was not enough to compensate for having been born near Milan instead of Florence.",
      "Today we move around more, but great work still comes disproportionately from a few hotspots: the Bauhaus, the Manhattan Project, the New Yorker, Lockheed's Skunk Works, Xerox Parc.At any given time there are a few hot topics and a few groups doing great work on them, and it's nearly impossible to do good work yourself if you're too far removed from one of these centers.",
      "You can push or pull these trends to some extent, but you can't break away from them. (Maybe you can, but the Milanese Leonardo couldn't.) Good design is often daring. At every period of history, people have believed things that were just ridiculous, and believed them so strongly that you risked ostracism or even violence by saying otherwise.If our own time were any different, that would be remarkable.",
      "As far as I can tell it isn't.This problem afflicts not just every era, but in some degree every field. Much Renaissance art was in its time considered shockingly secular: according to Vasari, Botticelli repented and gave up painting, and Fra Bartolommeo and Lorenzo di Credi actually burned some of their work.",
      "Einstein's theory of relativity offended many contemporary physicists, and was not fully accepted for decades-- in France, not until the 1950s.Today's experimental error is tomorrow's new theory. If you want to discover great new things, then instead of turning a blind eye to the places where conventional wisdom and truth don't quite meet, you should pay particular attention to them.As a practical matter, I think it's easier to see ugliness than to imagine beauty.",
      "Most of the people who've made beautiful things seem to have done it by fixing something that they thought ugly. Great work usually seems to happen because someone sees something and thinks, I could do better than that.",
      "Giotto saw traditional Byzantine madonnas painted according to a formula that had satisfied everyone for centuries, and to him they looked wooden and unnatural. Copernicus was so troubled by a hack that all his contemporaries could tolerate that he felt there must be a better solution.Intolerance for ugliness is not in itself enough.",
      "You have to understand a field well before you develop a good nose for what needs fixing. You have to do your homework. But as you become expert in a field, you'll start to hear little voices saying, What a hack!",
      "There must be a better way. Don't ignore those voices. Cultivate them. The recipe for great work is: very exacting taste, plus the ability to gratify it.NotesSullivan actually said \"form ever follows function,\" but I think the usual misquotation is closer to what modernist architects meant.",
      "Stephen G. Brush, \"Why was Relativity Accepted?\" Phys. Perspect. 1 (1999) 184-214.Japanese TranslationChinese TranslationSlovenian TranslationGerman TranslationInterview: Milton GlaserRussian Translation You'll find this essay and 14 others in Hackers & Painters."
    ],
    "word_count": 4261,
    "paragraph_count": 86
  },
  "processed_at": "2025-07-26T19:08:51.891810",
  "paragraphs": [
    {
      "original": "February 2002 \"...Copernicus' aesthetic objections to [equants] provided one essential motive for his rejection of the Ptolemaic system....\"- Thomas Kuhn, The Copernican Revolution\"All of us had been trained by Kelly Johnson and believed fanatically in his insistence that an airplane that looked beautiful would fly the same way.\"- Ben Rich, Skunk Works\"Beauty is the first test: there is no permanent place in this world for ugly mathematics.\"- G.",
      "translated": "2002年2月 “…哥白尼对[均轮]的美学反感是他拒绝托勒密体系的一个重要因素……” —— 托马斯·库恩，《哥白尼革命》\n“我们所有人都接受了凯利·约翰逊的培训，并坚信他的一贯主张：一架外观优美的飞机飞行性能也会同样出色。” —— 本·里奇，《臭鼬工厂》\n“美是第一道检验：在这个世界上，丑陋的数学没有立足之地。” —— G. H. 哈代"
    },
    {
      "original": "H. Hardy, A Mathematician's Apology I was talking recently to a friend who teaches at MIT. His field is hot now and every year he is inundated by applications from would-be graduate students. \"A lot of them seem smart,\" he said.",
      "translated": "H. 哈代，《一个数学家的辩白》。我最近和一位在麻省理工学院教书的朋友聊天。他的研究领域现在非常热门，每年都会收到大量希望成为研究生的申请。“他们中很多人看起来都很聪明，”他说。"
    },
    {
      "original": "\"What I can't tell is whether they have any kind of taste.\"Taste. You don't hear that word much now. And yet we still need the underlying concept, whatever we call it. What my friend meant was that he wanted students who were not just good technicians, but who could use their technical knowledge to design beautiful things.Mathematicians call good work \"beautiful,\" and so, either now or in the past, have scientists, engineers, musicians, architects, designers, writers, and painters.",
      "translated": "“我不能判断的是他们是否有某种品味。”品味。这个词现在不常听到了。然而，我们仍然需要这个概念，不管我们怎么称呼它。我的朋友的意思是，他希望招收到的不仅仅是技术高超的学生，而是能够运用他们的技术知识设计出美丽事物的学生。数学家将优秀的工作称为“美丽的”，科学家、工程师、音乐家、建筑师、设计师、作家和画家，无论是现在还是过去，也都是这样称呼的。"
    },
    {
      "original": "Is it just a coincidence that they used the same word, or is there some overlap in what they meant? If there is an overlap, can we use one field's discoveries about beauty to help us in another?For those of us who design things, these are not just theoretical questions.",
      "translated": "他们使用相同的词汇只是一个巧合，还是他们所指的内容有某种重叠？如果有重叠，我们是否可以利用一个领域对美的发现来帮助另一个领域？对于我们这些设计事物的人来说，这些问题并不仅仅是理论上的。"
    },
    {
      "original": "If there is such a thing as beauty, we need to be able to recognize it. We need good taste to make good things. Instead of treating beauty as an airy abstraction, to be either blathered about or avoided depending on how one feels about airy abstractions, let's try considering it as a practical question: how do you make good stuff?If you mention taste nowadays, a lot of people will tell you that \"taste is subjective.\" They believe this because it really feels that way to them.",
      "translated": "如果存在美，我们就需要能够识别它。我们需要良好的品味来创造美好的事物。与其将美视为一种空洞的抽象概念，或根据个人对这种抽象概念的感受而选择谈论或回避，不如尝试将其视为一个实际问题：如何创造优质的东西？如果你现在提到品味，许多人会告诉你“品味是主观的”。他们之所以这样认为，是因为对他们来说确实有这样的感觉。"
    },
    {
      "original": "When they like something, they have no idea why. It could be because it's beautiful, or because their mother had one, or because they saw a movie star with one in a magazine, or because they know it's expensive.",
      "translated": "当他们喜欢某个东西时，自己也不清楚为什么。可能是因为它漂亮，或者因为他们的母亲曾经有一个，或者因为他们看到杂志上的电影明星手里拿着一个，或者因为他们知道这东西很贵。"
    },
    {
      "original": "Their thoughts are a tangle of unexamined impulses.Most of us are encouraged, as children, to leave this tangle unexamined. If you make fun of your little brother for coloring people green in his coloring book, your mother is likely to tell you something like \"you like to do it your way and he likes to do it his way.\"Your mother at this point is not trying to teach you important truths about aesthetics.",
      "translated": "他们的想法是一团未经审视的冲动。我们大多数人从小就被鼓励不去审视这团乱麻。如果你因为弟弟在他的图画书里把人涂成绿色而嘲笑他，你的母亲很可能会告诉你“你喜欢按自己的方式来做，而他喜欢按他的方式来做。”在这一刻，你的母亲并不是想教你关于美学的重要真理。"
    },
    {
      "original": "She's trying to get the two of you to stop bickering.Like many of the half-truths adults tell us, this one contradicts other things they tell us. After dinning into you that taste is merely a matter of personal preference, they take you to the museum and tell you that you should pay attention because Leonardo is a great artist.What goes through the kid's head at this point?",
      "translated": "她试图让你们两个停止争吵。就像大人告诉我们的许多半真半假的话一样，这句话与他们告诉我们的其他事情相矛盾。在反复强调品味只是个人偏好之后，他们又带你去博物馆，告诉你应该注意，因为达芬奇是一位伟大的艺术家。这时孩子会怎么想？"
    },
    {
      "original": "What does he think \"great artist\" means? After having been told for years that everyone just likes to do things their own way, he is unlikely to head straight for the conclusion that a great artist is someone whose work is better than the others'.",
      "translated": "他认为“伟大艺术家”意味着什么？多年来，人们一直告诉他每个人只是喜欢按照自己的方式做事，因此他不太可能直接得出伟大艺术家是那些作品比其他人更好的人的结论。"
    },
    {
      "original": "A far more likely theory, in his Ptolemaic model of the universe, is that a great artist is something that's good for you, like broccoli, because someone said so in a book.Saying that taste is just personal preference is a good way to prevent disputes.",
      "translated": "在他的托勒密宇宙模型中，一个更有可能的理论是，伟大的艺术家就像西兰花一样对你有好处，因为某本书里是这么说的。说品味只是个人偏好，是一种避免争端的好方法。"
    },
    {
      "original": "The trouble is, it's not true. You feel this when you start to design things.Whatever job people do, they naturally want to do better. Football players like to win games. CEOs like to increase earnings.",
      "translated": "问题在于，这并不真实。当你开始设计东西时，你会有这种感觉。无论人们从事什么工作，他们自然而然地希望做得更好。足球运动员喜欢赢球。首席执行官喜欢增加利润。"
    },
    {
      "original": "It's a matter of pride, and a real pleasure, to get better at your job. But if your job is to design things, and there is no such thing as beauty, then there is no way to get better at your job. If taste is just personal preference, then everyone's is already perfect: you like whatever you like, and that's it.As in any job, as you continue to design things, you'll get better at it.",
      "translated": "能够提升自己的工作能力是一种骄傲，也是一件非常愉快的事情。但如果你的工作是设计，而美感并不存在，那么你就无法提升自己的工作水平。如果品味只是个人偏好，那么每个人的品味已经都是完美的：你喜欢的就是你喜欢的，就这么简单。和任何工作一样，随着你不断设计，你会变得越来越好。"
    },
    {
      "original": "Your tastes will change. And, like anyone who gets better at their job, you'll know you're getting better. If so, your old tastes were not merely different, but worse. Poof goes the axiom that taste can't be wrong.Relativism is fashionable at the moment, and that may hamper you from thinking about taste, even as yours grows.",
      "translated": "你的品味会发生变化。就像任何人在工作中变得更出色一样，你会意识到自己的进步。如果确实如此，那么你过去的品味不仅仅是不同，而是更差。品味无误的观点就此烟消云散。相对主义目前很流行，这可能会妨碍你去思考品味，即使你的品味正在成长。"
    },
    {
      "original": "But if you come out of the closet and admit, at least to yourself, that there is such a thing as good and bad design, then you can start to study good design in detail. How has your taste changed? When you made mistakes, what caused you to make them?",
      "translated": "但是，如果你坦诚面对自己，承认确实存在好设计和坏设计，那么你就可以开始详细研究好设计了。你的品味发生了怎样的变化？当你犯错时，是什么导致了这些错误？"
    },
    {
      "original": "What have other people learned about design?Once you start to examine the question, it's surprising how much different fields' ideas of beauty have in common. The same principles of good design crop up again and again.Good design is simple.",
      "translated": "其他人对设计有哪些了解？一旦开始探讨这个问题，就会惊讶地发现不同领域对美的看法有如此多的共通之处。好的设计原则一次又一次地出现。好的设计是简洁的。"
    },
    {
      "original": "You hear this from math to painting. In math it means that a shorter proof tends to be a better one. Where axioms are concerned, especially, less is more. It means much the same thing in programming.",
      "translated": "你从数学到绘画都会听到这一点。在数学中，这意味着较短的证明往往是更好的。特别是在处理公理时，少即是多。在编程中，这句话的意思也大致相同。"
    },
    {
      "original": "For architects and designers it means that beauty should depend on a few carefully chosen structural elements rather than a profusion of superficial ornament. (Ornament is not in itself bad, only when it's camouflage on insipid form.) Similarly, in painting, a still life of a few carefully observed and solidly modelled objects will tend to be more interesting than a stretch of flashy but mindlessly repetitive painting of, say, a lace collar.",
      "translated": "对于建筑师和设计师来说，这意味着美应该依赖于少数精心选择的结构元素，而不是大量的表面装饰。（装饰本身并不是坏事，只有当它成为平淡形式的伪装时才是如此。）同样，在绘画中，几件经过仔细观察和扎实塑造的静物画，往往比一段华丽但单调重复的蕾丝领画作更有趣。"
    },
    {
      "original": "In writing it means: say what you mean and say it briefly.It seems strange to have to emphasize simplicity. You'd think simple would be the default. Ornate is more work. But something seems to come over people when they try to be creative.",
      "translated": "在写作中这意味着：表达你的意思，并且简明扼要。强调简洁似乎有些奇怪。你可能会认为简单应该是默认的。华丽的表达需要更多的功夫。但当人们试图富有创造性时，似乎会有一种倾向使他们偏离简洁。"
    },
    {
      "original": "Beginning writers adopt a pompous tone that doesn't sound anything like the way they speak. Designers trying to be artistic resort to swooshes and curlicues. Painters discover that they're expressionists.",
      "translated": "初学写作的人会采用一种装腔作势的语气，这和他们平时说话的方式大相径庭。设计者试图追求艺术效果时，往往会使用旋涡和卷曲的线条。画家们则发现自己成了表现主义者。"
    },
    {
      "original": "It's all evasion. Underneath the long words or the \"expressive\" brush strokes, there is not much going on, and that's frightening.When you're forced to be simple, you're forced to face the real problem.",
      "translated": "这都是逃避。在那些冗长的词汇或“表现力强”的笔触之下，实际上并没有什么实质性内容，这令人害怕。当你被迫简化时，你就不得不面对真正的问题。"
    },
    {
      "original": "When you can't deliver ornament, you have to deliver substance.Good design is timeless. In math, every proof is timeless unless it contains a mistake. So what does Hardy mean when he says there is no permanent place for ugly mathematics?",
      "translated": "当你无法提供装饰时，你就必须提供实质。好的设计是永恒的。在数学中，每个证明都是永恒的，除非它包含错误。那么，当哈代说丑陋的数学没有永久的地位时，他指的是什么？"
    },
    {
      "original": "He means the same thing Kelly Johnson did: if something is ugly, it can't be the best solution. There must be a better one, and eventually someone will discover it.Aiming at timelessness is a way to make yourself find the best answer: if you can imagine someone surpassing you, you should do it yourself.",
      "translated": "他的意思和凯利·约翰逊是一样的：如果某样东西难看，那就不可能是最佳方案。一定有更优的解决方案，最终会有人找到它。追求永恒是一种让自己找到最佳答案的方法：如果你能想象有人超越你，那么你应该自己去实现。"
    },
    {
      "original": "Some of the greatest masters did this so well that they left little room for those who came after. Every engraver since Durer has had to live in his shadow.Aiming at timelessness is also a way to evade the grip of fashion.",
      "translated": "一些最伟大的大师做得如此出色，以至于他们给后人留下的空间极其有限。自丢勒以来，每位版画家都不得不在他的阴影下生活。追求永恒也是一种避免时尚束缚的方式。"
    },
    {
      "original": "Fashions almost by definition change with time, so if you can make something that will still look good far into the future, then its appeal must derive more from merit and less from fashion.Strangely enough, if you want to make something that will appeal to future generations, one way to do it is to try to appeal to past generations.",
      "translated": "时尚几乎从定义上来说是随时间而变化的，所以如果你能制作出即使在遥远的未来依然美观的东西，那么它的魅力一定更多地来自于其本身的价值，而不是时尚。有趣的是，如果你想制作出能够吸引后代的东西，一个方法就是试着去吸引前辈们的目光。"
    },
    {
      "original": "It's hard to guess what the future will be like, but we can be sure it will be like the past in caring nothing for present fashions. So if you can make something that appeals to people today and would also have appealed to people in 1500, there is a good chance it will appeal to people in 2500.Good design solves the right problem.",
      "translated": "很难预测未来会是什么样子，但我们可以确定的是，未来就像过去一样，不会顾及当下的时尚。因此，如果你能创造出既吸引今天的人，也能吸引1500年的人的东西，那么它很可能会吸引2500年的人。好的设计能够解决正确的问题。"
    },
    {
      "original": "The typical stove has four burners arranged in a square, and a dial to control each. How do you arrange the dials? The simplest answer is to put them in a row. But this is a simple answer to the wrong question.",
      "translated": "典型的炉灶有四个以方形排列的炉头，每个炉头都有一个旋钮来控制。你如何布置这些旋钮？最简单的答案是将它们排成一行。但这是对错误问题的简单回答。"
    },
    {
      "original": "The dials are for humans to use, and if you put them in a row, the unlucky human will have to stop and think each time about which dial matches which burner. Better to arrange the dials in a square like the burners.A lot of bad design is industrious, but misguided.",
      "translated": "旋钮是为了人使用的，如果把它们排成一排，不幸的人每次都要停下来思考哪个旋钮对应哪个炉头。最好将旋钮像炉头那样排成方形。很多设计虽然用心，但却方向错了。"
    },
    {
      "original": "In the mid twentieth century there was a vogue for setting text in sans-serif fonts. These fonts are closer to the pure, underlying letterforms. But in text that's not the problem you're trying to solve.",
      "translated": "在二十世纪中叶，流行使用无衬线字体排版文本。这些字体更接近纯粹的基础字母形状。但在正文排版中，这并不是你需要解决的问题。"
    },
    {
      "original": "For legibility it's more important that letters be easy to tell apart. It may look Victorian, but a Times Roman lowercase g is easy to tell from a lowercase y.Problems can be improved as well as solutions.",
      "translated": "为了提高可读性，字母之间容易区分更为重要。虽然看起来可能有些维多利亚风格，但《泰晤士罗马体》的小写字母 g 很容易与小写字母 y 区分开来。问题可以得到改善，就像解决方案一样。"
    },
    {
      "original": "In software, an intractable problem can usually be replaced by an equivalent one that's easy to solve. Physics progressed faster as the problem became predicting observable behavior, instead of reconciling it with scripture.Good design is suggestive.",
      "translated": "在软件中，一个棘手的问题通常可以被一个等价且容易解决的问题所替代。物理学进展得更快，因为问题变成了预测可观察的行为，而不是将其与经文协调一致。好的设计是富有启发性的。"
    },
    {
      "original": "Jane Austen's novels contain almost no description; instead of telling you how everything looks, she tells her story so well that you envision the scene for yourself. Likewise, a painting that suggests is usually more engaging than one that tells.",
      "translated": "简·奥斯汀的小说几乎不含任何描述；她不告诉你每样东西看起来如何，而是将故事讲述得如此之好，以至于你能自行想象出场景。同样地，一幅暗示性的画通常比一幅直白的画更具吸引力。"
    },
    {
      "original": "Everyone makes up their own story about the Mona Lisa.In architecture and design, this principle means that a building or object should let you use it how you want: a good building, for example, will serve as a backdrop for whatever life people want to lead in it, instead of making them live as if they were executing a program written by the architect.In software, it means you should give users a few basic elements that they can combine as they wish, like Lego.",
      "translated": "每个人都对《蒙娜丽莎》编织了自己的故事。在建筑和设计领域，这一原则意味着，一栋建筑或一个物件应该允许你按照自己的意愿使用：例如，一个好的建筑会为人们想要在其内部过的生活提供背景，而不是让人们像执行建筑师编写的程序一样生活。在软件开发中，这意味着你应该提供一些基本的元素，让用户可以像拼搭乐高积木一样自由组合。"
    },
    {
      "original": "In math it means a proof that becomes the basis for a lot of new work is preferable to a proof that was difficult, but doesn't lead to future discoveries; in the sciences generally, citation is considered a rough indicator of merit.Good design is often slightly funny.",
      "translated": "在数学中，一个能够成为大量新工作基础的证明比一个虽然很难但不会导致未来发现的证明更受欢迎；在科学领域，引用通常被视为衡量价值的一个粗略指标。好的设计往往带有一点幽默感。"
    },
    {
      "original": "This one may not always be true. But Durer's engravings and Saarinen's womb chair and the Pantheon and the original Porsche 911 all seem to me slightly funny. Godel's incompleteness theorem seems like a practical joke.I think it's because humor is related to strength.",
      "translated": "这可能并不总是正确的。但杜勒的版画、萨里宁的子宫椅、万神殿和最初的保时捷911，在我看来都有些滑稽。哥德尔的不完全性定理也像是一个实用的玩笑。我想，这是因为幽默与力量有关。"
    },
    {
      "original": "To have a sense of humor is to be strong: to keep one's sense of humor is to shrug off misfortunes, and to lose one's sense of humor is to be wounded by them. And so the mark-- or at least the prerogative-- of strength is not to take oneself too seriously.",
      "translated": "有幽默感就是一种力量：保持幽默感可以让人对不幸一笑置之，而失去幽默感则会让这些不幸伤害到你。因此，力量的标志——或者至少是力量的特权——就是不要把自己太当回事。"
    },
    {
      "original": "The confident will often, like swallows, seem to be making fun of the whole process slightly, as Hitchcock does in his films or Bruegel in his paintings-- or Shakespeare, for that matter.Good design may not have to be funny, but it's hard to imagine something that could be called humorless also being good design.Good design is hard.",
      "translated": "自信的人往往像燕子一样，似乎对整个过程略带戏谑，就像希区柯克在他的电影中、勃鲁盖尔在他的画作中——或者莎士比亚也是如此。好的设计不一定非得有趣，但很难想象一个完全没有幽默感的东西也能被称为好的设计。好的设计很难。"
    },
    {
      "original": "If you look at the people who've done great work, one thing they all seem to have in common is that they worked very hard. If you're not working hard, you're probably wasting your time.Hard problems call for great efforts.",
      "translated": "如果你观察那些做出伟大工作的人，你会发现他们有一个共同点，那就是都非常努力。如果你不努力工作，你可能就是在浪费时间。难题需要付出巨大的努力。"
    },
    {
      "original": "In math, difficult proofs require ingenious solutions, and those tend to be interesting. Ditto in engineering.When you have to climb a mountain you toss everything unnecessary out of your pack. And so an architect who has to build on a difficult site, or a small budget, will find that he is forced to produce an elegant design.",
      "translated": "在数学中，困难的证明需要巧妙的解决方案，而这些往往很有趣。同样，在工程学中也是如此。当你需要攀登山峰时，你会把背包里所有不必要的东西都扔掉。因此，一个建筑师如果要在困难的地点或有限的预算下建造，他会发现自己被迫设计出优雅的作品。"
    },
    {
      "original": "Fashions and flourishes get knocked aside by the difficult business of solving the problem at all.Not every kind of hard is good. There is good pain and bad pain. You want the kind of pain you get from going running, not the kind you get from stepping on a nail.",
      "translated": "浮华和装饰在解决实际问题时都会被抛到一边。不是所有的困难都是有益的。有好的痛苦和坏的痛苦。你希望得到的是像跑步时的那种痛苦，而不是踩到钉子时的那种痛苦。"
    },
    {
      "original": "A difficult problem could be good for a designer, but a fickle client or unreliable materials would not be.In art, the highest place has traditionally been given to paintings of people. There is something to this tradition, and not just because pictures of faces get to press buttons in our brains that other pictures don't.",
      "translated": "一个棘手的问题对设计师来说可能是好事，但是一位善变的客户或不可靠的材料就不是了。在艺术领域，传统上最高地位一直属于人物画。这种传统有其道理，而不仅仅是因为人脸的图像能触动我们大脑中其他图像无法触动的按钮。"
    },
    {
      "original": "We are so good at looking at faces that we force anyone who draws them to work hard to satisfy us. If you draw a tree and you change the angle of a branch five degrees, no one will know. When you change the angle of someone's eye five degrees, people notice.When Bauhaus designers adopted Sullivan's \"form follows function,\" what they meant was, form should follow function.",
      "translated": "我们善于观察人脸，以至于迫使任何画人脸的人都必须努力满足我们的要求。如果你画一棵树，把树枝的角度改变五度，没有人会注意到。但当你把某人的眼睛的角度改变五度时，人们就会注意到。当包豪斯设计师采用沙利文的“形式追随功能”时，他们的意思是，形式应该追随功能。"
    },
    {
      "original": "And if function is hard enough, form is forced to follow it, because there is no effort to spare for error. Wild animals are beautiful because they have hard lives.Good design looks easy. Like great athletes, great designers make it look easy.",
      "translated": "如果功能足够复杂，形式就会被迫追随功能，因为没有多余的精力去犯错。野生动物之所以美丽，是因为它们的生活艰难。好的设计看起来轻松自如。就像伟大的运动员一样，伟大的设计师让一切显得轻松简单。"
    },
    {
      "original": "Mostly this is an illusion. The easy, conversational tone of good writing comes only on the eighth rewrite.In science and engineering, some of the greatest discoveries seem so simple that you say to yourself, I could have thought of that.",
      "translated": "这大多是一种错觉。优秀的写作之所以能呈现出轻松、对话般的语气，往往是在第八次修改后才得以实现。在科学和工程领域，一些最伟大的发现似乎如此简单，以至于你会对自己说，我本也可以想到这一点。"
    },
    {
      "original": "The discoverer is entitled to reply, why didn't you?Some Leonardo heads are just a few lines. You look at them and you think, all you have to do is get eight or ten lines in the right place and you've made this beautiful portrait.",
      "translated": "发现者有权回应，你为什么没有呢？有些达芬奇的头部肖像只用了几条线。你看着它们，会想，只要把八到十条线放在正确的位置上，就能创作出这幅美丽的肖像。"
    },
    {
      "original": "Well, yes, but you have to get them in exactly the right place. The slightest error will make the whole thing collapse.Line drawings are in fact the most difficult visual medium, because they demand near perfection.",
      "translated": "嗯，是的，但你必须把它们放在完全正确的位置。哪怕是最微小的错误也会使整个作品崩溃。线描实际上是最难的视觉媒介，因为它们要求近乎完美。"
    },
    {
      "original": "In math terms, they are a closed-form solution; lesser artists literally solve the same problems by successive approximation. One of the reasons kids give up drawing at ten or so is that they decide to start drawing like grownups, and one of the first things they try is a line drawing of a face.",
      "translated": "在数学上，它们是闭式解；而水平较低的艺术家则通过逐次逼近来解决同样的问题。孩子们在十岁左右放弃绘画的一个原因是，他们决定开始像成年人那样画画，而他们尝试的第一件事往往是画人脸的线条画。"
    },
    {
      "original": "Smack!In most fields the appearance of ease seems to come with practice. Perhaps what practice does is train your unconscious mind to handle tasks that used to require conscious thought. In some cases you literally train your body.",
      "translated": "啪！在大多数领域，轻松自如的表现似乎都是通过练习得来的。也许练习的作用就是训练你的潜意识去处理那些原本需要有意识思考的任务。在某些情况下，你实际上是训练了你的身体。"
    },
    {
      "original": "An expert pianist can play notes faster than the brain can send signals to his hand. Likewise an artist, after a while, can make visual perception flow in through his eye and out through his hand as automatically as someone tapping his foot to a beat.When people talk about being in \"the zone,\" I think what they mean is that the spinal cord has the situation under control.",
      "translated": "一位钢琴大师弹奏的速度可以超过大脑向手发送信号的速度。同样，一位艺术家在经过一段时间后，可以像一个人随着节拍打脚一样自然地让视觉感知通过眼睛流入，再从手中流出。当人们谈论处于“状态”时，我认为他们的意思是脊髓已经控制了局面。"
    },
    {
      "original": "Your spinal cord is less hesitant, and it frees conscious thought for the hard problems. Good design uses symmetry. I think symmetry may just be one way to achieve simplicity, but it's important enough to be mentioned on its own.",
      "translated": "你的脊髓反应更为迅速，从而让意识思维专注于复杂的难题。好的设计会运用对称性。我认为，对称性可能是实现简洁的一种方式，但它重要到足以单独提及。"
    },
    {
      "original": "Nature uses it a lot, which is a good sign.There are two kinds of symmetry, repetition and recursion. Recursion means repetition in subelements, like the pattern of veins in a leaf.Symmetry is unfashionable in some fields now, in reaction to excesses in the past.",
      "translated": "自然界经常使用对称，这是一个好的迹象。对称有两种形式：重复和递归。递归指的是在子元素中的重复，比如叶子中叶脉的图案。现在，在某些领域，对称已经不太流行了，这是对过去过度使用的一种反应。"
    },
    {
      "original": "Architects started consciously making buildings asymmetric in Victorian times and by the 1920s asymmetry was an explicit premise of modernist architecture. Even these buildings only tended to be asymmetric about major axes, though; there were hundreds of minor symmetries.In writing you find symmetry at every level, from the phrases in a sentence to the plot of a novel.",
      "translated": "建筑师在维多利亚时代开始有意识地设计不对称的建筑，到1920年代，不对称已成为现代主义建筑的明确前提。即使这些建筑在主要轴线上趋于不对称，但仍存在数百个微小的对称元素。在写作中，从句子中的短语到小说的情节，你可以在每个层面上发现对称。"
    },
    {
      "original": "You find the same in music and art. Mosaics (and some Cezannes) get extra visual punch by making the whole picture out of the same atoms. Compositional symmetry yields some of the most memorable paintings, especially when two halves react to one another, as in the Creation of Adam or American Gothic.In math and engineering, recursion, especially, is a big win.",
      "translated": "你在音乐和艺术中也能发现同样的现象。马赛克（以及一些塞尚的作品）通过使用相同的元素构成整幅画面，获得了额外的视觉冲击力。构图上的对称性产生了一些最令人难忘的画作，尤其是在两部分相互呼应时，如《创世纪中的亚当》或《美国哥特式》。在数学和工程学中，递归尤其是一种巨大的胜利。"
    },
    {
      "original": "Inductive proofs are wonderfully short. In software, a problem that can be solved by recursion is nearly always best solved that way. The Eiffel Tower looks striking partly because it is a recursive solution, a tower on a tower.The danger of symmetry, and repetition especially, is that it can be used as a substitute for thought.Good design resembles nature.",
      "translated": "归纳证明简洁明了。在软件开发中，能够通过递归解决的问题几乎总是最适合用递归来解决。埃菲尔铁塔之所以引人注目，部分原因在于它是一个递归的解决方案，塔上建塔。对称性和重复的危险在于，它们可能会被用作思考的替代品。好的设计应模仿自然。"
    },
    {
      "original": "It's not so much that resembling nature is intrinsically good as that nature has had a long time to work on the problem. It's a good sign when your answer resembles nature's.It's not cheating to copy.",
      "translated": "与其说模仿自然本身是好的，不如说自然有很长的时间来解决这个问题。当你的答案与自然相似时，这是一个好兆头。模仿并不是作弊。"
    },
    {
      "original": "Few would deny that a story should be like life. Working from life is a valuable tool in painting too, though its role has often been misunderstood. The aim is not simply to make a record. The point of painting from life is that it gives your mind something to chew on: when your eyes are looking at something, your hand will do more interesting work.Imitating nature also works in engineering.",
      "translated": "很少有人会否认故事应该像生活一样。从生活中取材也是绘画中一个宝贵的工具，尽管其作用常常被误解。目的不仅仅是为了记录。从生活中绘画的要点在于，它给你的思维提供了一些值得思考的东西：当你的眼睛在观察某物时，你的手会做出更有意思的工作。模仿自然在工程学中也同样适用。"
    },
    {
      "original": "Boats have long had spines and ribs like an animal's ribcage. In some cases we may have to wait for better technology: early aircraft designers were mistaken to design aircraft that looked like birds, because they didn't have materials or power sources light enough (the Wrights' engine weighed 152 lbs.",
      "translated": "船长期以来像动物的骨架一样拥有脊柱和肋骨。在某些情况下，我们可能需要等待更好的技术：早期的飞机设计师错误地设计了看起来像鸟的飞机，因为他们没有足够轻的材料或动力源（莱特兄弟的发动机重达152磅）。"
    },
    {
      "original": "and generated only 12 hp.) or control systems sophisticated enough for machines that flew like birds, but I could imagine little unmanned reconnaissance planes flying like birds in fifty years.Now that we have enough computer power, we can imitate nature's method as well as its results.",
      "translated": "并且只产生了12马力。）或者像鸟一样飞行的机器的复杂控制系统，但我可以想象，在五十年后，小型无人侦察机能够像鸟一样飞行。现在我们拥有足够的计算能力，不仅可以模仿自然的方法，还能模仿自然的结果。"
    },
    {
      "original": "Genetic algorithms may let us create things too complex to design in the ordinary sense.Good design is redesign. It's rare to get things right the first time. Experts expect to throw away some early work.",
      "translated": "遗传算法可能让我们创造出在普通意义上过于复杂而无法设计的事物。好的设计是再设计。很少有人能够一次就做对。专家们预期会丢弃一些早期的工作。"
    },
    {
      "original": "They plan for plans to change.It takes confidence to throw work away. You have to be able to think, there's more where that came from. When people first start drawing, for example, they're often reluctant to redo parts that aren't right; they feel they've been lucky to get that far, and if they try to redo something, it will turn out worse.",
      "translated": "他们计划着计划会改变。有勇气放弃已有的工作是需要自信的。你必须能够相信，还会有更多的创意涌现。例如，当人们刚开始画画时，他们通常不愿意重做那些不完美的部分；他们觉得能够画到这一步已经很幸运了，如果试图重做，可能会变得更糟。"
    },
    {
      "original": "Instead they convince themselves that the drawing is not that bad, really-- in fact, maybe they meant it to look that way.Dangerous territory, that; if anything you should cultivate dissatisfaction. In Leonardo's drawings there are often five or six attempts to get a line right.",
      "translated": "相反，他们说服自己这幅画其实并不那么糟糕——事实上，也许他们本来就是想画成这样的。这是个危险的领域；如果有什么的话，你应该培养不满的情绪。在达芬奇的画作中，经常可以看到为了画好一条线而尝试五六次。"
    },
    {
      "original": "The distinctive back of the Porsche 911 only appeared in the redesign of an awkward prototype. In Wright's early plans for the Guggenheim, the right half was a ziggurat; he inverted it to get the present shape.Mistakes are natural.",
      "translated": "保时捷911独特的背部设计只出现在一个笨拙的原型重新设计中。在赖特早期为古根海姆博物馆制定的计划中，右侧部分是一个金字塔；他将其倒置，形成了现在的形状。错误是自然的。"
    },
    {
      "original": "Instead of treating them as disasters, make them easy to acknowledge and easy to fix. Leonardo more or less invented the sketch, as a way to make drawing bear a greater weight of exploration. Open-source software has fewer bugs because it admits the possibility of bugs.It helps to have a medium that makes change easy.",
      "translated": "不要将它们视为灾难，而要使其易于承认和修复。达芬奇或多或少地发明了速写，作为一种使绘画承载更多探索重量的方式。开源软件的错误更少，因为它承认错误的可能性。有一个使变更变得容易的媒介是有帮助的。"
    },
    {
      "original": "When oil paint replaced tempera in the fifteenth century, it helped painters to deal with difficult subjects like the human figure because, unlike tempera, oil can be blended and overpainted. Good design can copy.",
      "translated": "当油画家在十五世纪取代蛋彩画时，它帮助画家处理像人体这样的难题，因为与蛋彩画不同，油彩可以调和和覆盖。好的设计可以模仿。"
    },
    {
      "original": "Attitudes to copying often make a round trip. A novice imitates without knowing it; next he tries consciously to be original; finally, he decides it's more important to be right than original.Unknowing imitation is almost a recipe for bad design.",
      "translated": "对待模仿的态度常常会经历一个循环。初学者在不知不觉中模仿；接下来，他会努力尝试去追求原创；最终，他决定认为正确比原创更重要。不知不觉中的模仿几乎注定会导致设计不佳。"
    },
    {
      "original": "If you don't know where your ideas are coming from, you're probably imitating an imitator. Raphael so pervaded mid-nineteenth century taste that almost anyone who tried to draw was imitating him, often at several removes.",
      "translated": "如果你不知道自己的想法从何而来，那么你可能是在模仿别人的作品。拉斐尔对19世纪中期的审美影响如此之深，以至于几乎任何尝试绘画的人都在模仿他，而且往往是经过多次转手的模仿。"
    },
    {
      "original": "It was this, more than Raphael's own work, that bothered the Pre-Raphaelites.The ambitious are not content to imitate. The second phase in the growth of taste is a conscious attempt at originality.I think the greatest masters go on to achieve a kind of selflessness.",
      "translated": "这比拉斐尔自己的作品更让前拉斐尔派感到困扰。有抱负的人不会满足于模仿。品味发展的第二阶段是有意识地追求原创性。我认为最伟大的大师最终会达到一种无私的境界。"
    },
    {
      "original": "They just want to get the right answer, and if part of the right answer has already been discovered by someone else, that's no reason not to use it. They're confident enough to take from anyone without feeling that their own vision will be lost in the process.",
      "translated": "他们只是想得到正确的答案，如果正确答案的一部分已经被其他人发现，那没有理由不去使用。他们足够自信，可以从任何人那里吸取知识，而不会担心在这个过程中自己的观点会丧失。"
    },
    {
      "original": "Good design is often strange. Some of the very best work has an uncanny quality: Euler's Formula, Bruegel's Hunters in the Snow, the SR-71, Lisp. They're not just beautiful, but strangely beautiful.I'm not sure why.",
      "translated": "好的设计常常显得奇异。一些最优秀的作品具有一种不可思议的特质：欧拉公式、勃鲁盖尔的《雪中猎人》、SR-71侦察机、Lisp语言。它们不仅美丽，而且是奇怪地美丽。我也不确定为什么会这样。"
    },
    {
      "original": "It may just be my own stupidity. A can-opener must seem miraculous to a dog. Maybe if I were smart enough it would seem the most natural thing in the world that ei*pi = -1. It is after all necessarily true.Most of the qualities I've mentioned are things that can be cultivated, but I don't think it works to cultivate strangeness.",
      "translated": "这可能只是我自己的愚钝。开罐器对狗来说一定像是奇迹。也许如果我足够聪明，eiπ = -1 这件事对我来说就会显得再自然不过了。毕竟这是必然的。我提到的大多数品质都是可以培养的，但我认为奇怪这一点是无法刻意培养的。"
    },
    {
      "original": "The best you can do is not squash it if it starts to appear. Einstein didn't try to make relativity strange. He tried to make it true, and the truth turned out to be strange.At an art school where I once studied, the students wanted most of all to develop a personal style.",
      "translated": "你最好做的就是，如果它开始出现，不要去压制它。爱因斯坦并没有试图让相对论变得奇怪。他试图让它变得真实，而真相结果证明是奇怪的。在我曾经就读的一所艺术学校里，学生们最渴望的是发展出自己的个人风格。"
    },
    {
      "original": "But if you just try to make good things, you'll inevitably do it in a distinctive way, just as each person walks in a distinctive way. Michelangelo was not trying to paint like Michelangelo. He was just trying to paint well; he couldn't help painting like Michelangelo.The only style worth having is the one you can't help.",
      "translated": "但如果你只是努力去做好事情，你必然会以一种独特的方式去做，就像每个人走路都有自己独特的步态一样。米开朗基罗并不是想要画得像米开朗基罗。他只是努力画好；他无法避免画得像米开朗基罗。唯一值得拥有的风格就是你无法避免的那种。"
    },
    {
      "original": "And this is especially true for strangeness. There is no shortcut to it. The Northwest Passage that the Mannerists, the Romantics, and two generations of American high school students have searched for does not seem to exist.",
      "translated": "而这对于奇异感尤其如此。对此没有捷径可言。形式主义者、浪漫主义者以及两代美国高中生所寻找的西北航道似乎并不存在。"
    },
    {
      "original": "The only way to get there is to go through good and come out the other side. Good design happens in chunks. The inhabitants of fifteenth century Florence included Brunelleschi, Ghiberti, Donatello, Masaccio, Filippo Lippi, Fra Angelico, Verrocchio, Botticelli, Leonardo, and Michelangelo.",
      "translated": "到达那里的唯一途径是经历美好并从中脱颖而出。好的设计是一步步实现的。15世纪佛罗伦萨的居民包括布鲁内莱斯基、吉贝蒂、多纳泰罗、马萨乔、菲利波·利皮、弗拉·安杰利科、韦罗基奥、波提切利、达芬奇和米开朗基罗。"
    },
    {
      "original": "Milan at the time was as big as Florence. How many fifteenth century Milanese artists can you name?Something was happening in Florence in the fifteenth century. And it can't have been heredity, because it isn't happening now.",
      "translated": "当时的米兰和佛罗伦萨一样大。你能说出多少15世纪的米兰艺术家？15世纪的佛罗伦萨发生了某些事情。而这不可能是遗传因素，因为现在并没有发生这种情况。"
    },
    {
      "original": "You have to assume that whatever inborn ability Leonardo and Michelangelo had, there were people born in Milan with just as much. What happened to the Milanese Leonardo?There are roughly a thousand times as many people alive in the US right now as lived in Florence during the fifteenth century.",
      "translated": "你必须假设，无论达芬奇和米开朗基罗拥有怎样的天赋，米兰也一定有人与之相当。那么，米兰的达芬奇去哪儿了？如今在美国生活的人口数量大约是15世纪佛罗伦萨人口的一千倍。"
    },
    {
      "original": "A thousand Leonardos and a thousand Michelangelos walk among us. If DNA ruled, we should be greeted daily by artistic marvels. We aren't, and the reason is that to make Leonardo you need more than his innate ability.",
      "translated": "一千个莱昂纳多和一千个米开朗基罗生活在我们 midst 之中。如果基因决定一切，我们应该每天都能见到艺术奇迹。然而，事实并非如此，原因在于，要造就一个莱昂纳多，仅靠他与生俱来的能力是不够的。"
    },
    {
      "original": "You also need Florence in 1450.Nothing is more powerful than a community of talented people working on related problems. Genes count for little by comparison: being a genetic Leonardo was not enough to compensate for having been born near Milan instead of Florence.",
      "translated": "你也需要1450年的佛罗伦萨。没有什么比一群有才华的人共同解决相关问题更强大的了。相比之下，基因的作用微乎其微：作为一个遗传上的达·芬奇，如果出生在米兰而不是佛罗伦萨，也无法弥补这一点。"
    },
    {
      "original": "Today we move around more, but great work still comes disproportionately from a few hotspots: the Bauhaus, the Manhattan Project, the New Yorker, Lockheed's Skunk Works, Xerox Parc.At any given time there are a few hot topics and a few groups doing great work on them, and it's nearly impossible to do good work yourself if you're too far removed from one of these centers.",
      "translated": "今天，人们的流动性更大了，但杰出的工作成果仍然主要来自少数几个热点地区：包豪斯、曼哈顿计划、《纽约客》、洛克希德的臭鼬工厂、施乐帕克。在任何特定时期，总有一些热门话题和少数几个团队在这些话题上取得卓越成就，如果你与这些中心相距过远，几乎不可能独自做出优秀的工作。"
    },
    {
      "original": "You can push or pull these trends to some extent, but you can't break away from them. (Maybe you can, but the Milanese Leonardo couldn't.) Good design is often daring. At every period of history, people have believed things that were just ridiculous, and believed them so strongly that you risked ostracism or even violence by saying otherwise.If our own time were any different, that would be remarkable.",
      "translated": "你可以在一定程度上推动或抵制这些趋势，但你无法完全摆脱它们。（也许你可以，但米兰的达芬奇却不能。）好的设计往往是大胆的。在每一个历史时期，人们都曾坚信一些荒谬的事情，并且坚信到如果你提出异议，就可能面临被排斥甚至暴力的风险。如果我们这个时代有所不同，那将是非常值得注意的。"
    },
    {
      "original": "As far as I can tell it isn't.This problem afflicts not just every era, but in some degree every field. Much Renaissance art was in its time considered shockingly secular: according to Vasari, Botticelli repented and gave up painting, and Fra Bartolommeo and Lorenzo di Credi actually burned some of their work.",
      "translated": "据我所知，情况并非如此。这个问题不仅困扰着每一个时代，还在某种程度上影响着每一个领域。许多文艺复兴时期的艺术作品在其时代被认为令人震惊地世俗：根据瓦萨里的记载，波提切利悔过并放弃了绘画，而弗拉·巴托洛梅奥和洛伦佐·迪·克雷迪甚至烧毁了他们的一些作品。"
    },
    {
      "original": "Einstein's theory of relativity offended many contemporary physicists, and was not fully accepted for decades-- in France, not until the 1950s.Today's experimental error is tomorrow's new theory. If you want to discover great new things, then instead of turning a blind eye to the places where conventional wisdom and truth don't quite meet, you should pay particular attention to them.As a practical matter, I think it's easier to see ugliness than to imagine beauty.",
      "translated": "爱因斯坦的相对论触怒了许多当时的物理学家，并且数十年间并未得到完全接受——在法国，直到20世纪50年代才被接受。今天的实验误差可能是明天的新理论。如果你想发现伟大的新事物，那么就不应该对传统智慧与真理不完全吻合的地方视而不见，而应该特别关注它们。实际上，我认为看到缺陷比想象美好更容易。"
    },
    {
      "original": "Most of the people who've made beautiful things seem to have done it by fixing something that they thought ugly. Great work usually seems to happen because someone sees something and thinks, I could do better than that.",
      "translated": "大多数创作出美好事物的人似乎都是通过改进他们认为丑陋的东西来实现的。伟大的作品通常是因为某人看到某物后心想，我可以做得比这更好。"
    },
    {
      "original": "Giotto saw traditional Byzantine madonnas painted according to a formula that had satisfied everyone for centuries, and to him they looked wooden and unnatural. Copernicus was so troubled by a hack that all his contemporaries could tolerate that he felt there must be a better solution.Intolerance for ugliness is not in itself enough.",
      "translated": "乔托看到传统的拜占庭圣母像按照一个几个世纪以来让 everyone 都满意的公式绘制，对他来说，这些圣母像看起来呆板而不自然。哥白尼对一个所有同时代人都能容忍的瑕疵感到如此困扰，以至于他认为一定有更好的解决办法。对丑陋的 intolerance 本身是不够的。"
    },
    {
      "original": "You have to understand a field well before you develop a good nose for what needs fixing. You have to do your homework. But as you become expert in a field, you'll start to hear little voices saying, What a hack!",
      "translated": "你必须充分了解一个领域，才能培养出敏锐的洞察力，发现需要改进的地方。你必须做好功课。但随着你在这个领域变得越来越专业，你会开始听到内心的声音说：真糟糕！"
    },
    {
      "original": "There must be a better way. Don't ignore those voices. Cultivate them. The recipe for great work is: very exacting taste, plus the ability to gratify it.NotesSullivan actually said \"form ever follows function,\" but I think the usual misquotation is closer to what modernist architects meant.",
      "translated": "一定有更好的方法。不要忽视那些声音。培养它们。伟大的工作配方是：极其挑剔的品味，加上满足这种品味的能力。注：沙利文实际上说的是“形式永远追随功能”，但我认为通常的误引更接近于现代主义建筑师的本意。"
    },
    {
      "original": "Stephen G. Brush, \"Why was Relativity Accepted?\" Phys. Perspect. 1 (1999) 184-214.Japanese TranslationChinese TranslationSlovenian TranslationGerman TranslationInterview: Milton GlaserRussian Translation You'll find this essay and 14 others in Hackers & Painters.",
      "translated": "斯蒂芬·G·布什，“为什么相对论被接受？”《物理透视》1（1999）184-214。日文翻译中文翻译斯洛文尼亚语翻译德文翻译访谈：米尔顿·格拉泽俄文翻译你可以在《黑客与画家》中找到这篇论文及其他14篇论文。"
    }
  ],
  "translation_completed": "2025-07-29T01:35:32.853454",
  "translation_stats": {
    "total_paragraphs": 86,
    "success_count": 86,
    "success_rate": "100.0%"
  }
}