{
  "title": "Is It Worth Being Wise?",
  "title_zh": "[待翻译] Is It Worth Being Wise?",
  "url": "https://www.paulgraham.com/wisdom.html",
  "filename": "wisdom.html",
  "date": "2007-02-01",
  "id": 185,
  "content": {
    "success": true,
    "paragraphs": [
      "February 2007A few days ago I finally figured out something I've wondered about for 25 years: the relationship between wisdom and intelligence. Anyone can see they're not the same by the number of people who are smart, but not very wise.",
      "And yet intelligence and wisdom do seem related. How?What is wisdom? I'd say it's knowing what to do in a lot of situations. I'm not trying to make a deep point here about the true nature of wisdom, just to figure out how we use the word.",
      "A wise person is someone who usually knows the right thing to do.And yet isn't being smart also knowing what to do in certain situations? For example, knowing what to do when the teacher tells your elementary school class to add all the numbers from 1 to 100?",
      "[1]Some say wisdom and intelligence apply to different types of problems—wisdom to human problems and intelligence to abstract ones. But that isn't true. Some wisdom has nothing to do with people: for example, the wisdom of the engineer who knows certain structures are less prone to failure than others.",
      "And certainly smart people can find clever solutions to human problems as well as abstract ones. [2]Another popular explanation is that wisdom comes from experience while intelligence is innate. But people are not simply wise in proportion to how much experience they have.",
      "Other things must contribute to wisdom besides experience, and some may be innate: a reflective disposition, for example.Neither of the conventional explanations of the difference between wisdom and intelligence stands up to scrutiny.",
      "So what is the difference? If we look at how people use the words \"wise\" and \"smart,\" what they seem to mean is different shapes of performance.Curve\"Wise\" and \"smart\" are both ways of saying someone knows what to do.",
      "The difference is that \"wise\" means one has a high average outcome across all situations, and \"smart\" means one does spectacularly well in a few. That is, if you had a graph in which the x axis represented situations and the y axis the outcome, the graph of the wise person would be high overall, and the graph of the smart person would have high peaks.The distinction is similar to the rule that one should judge talent at its best and character at its worst.",
      "Except you judge intelligence at its best, and wisdom by its average. That's how the two are related: they're the two different senses in which the same curve can be high.So a wise person knows what to do in most situations, while a smart person knows what to do in situations where few others could.",
      "We need to add one more qualification: we should ignore cases where someone knows what to do because they have inside information. [3] But aside from that, I don't think we can get much more specific without starting to be mistaken.Nor do we need to.",
      "Simple as it is, this explanation predicts, or at least accords with, both of the conventional stories about the distinction between wisdom and intelligence. Human problems are the most common type, so being good at solving those is key in achieving a high average outcome.",
      "And it seems natural that a high average outcome depends mostly on experience, but that dramatic peaks can only be achieved by people with certain rare, innate qualities; nearly anyone can learn to be a good swimmer, but to be an Olympic swimmer you need a certain body type.This explanation also suggests why wisdom is such an elusive concept: there's no such thing.",
      "\"Wise\" means something—that one is on average good at making the right choice. But giving the name \"wisdom\" to the supposed quality that enables one to do that doesn't mean such a thing exists. To the extent \"wisdom\" means anything, it refers to a grab-bag of qualities as various as self-discipline, experience, and empathy.",
      "[4]Likewise, though \"intelligent\" means something, we're asking for trouble if we insist on looking for a single thing called \"intelligence.\" And whatever its components, they're not all innate. We use the word \"intelligent\" as an indication of ability: a smart person can grasp things few others could.",
      "It does seem likely there's some inborn predisposition to intelligence (and wisdom too), but this predisposition is not itself intelligence.One reason we tend to think of intelligence as inborn is that people trying to measure it have concentrated on the aspects of it that are most measurable.",
      "A quality that's inborn will obviously be more convenient to work with than one that's influenced by experience, and thus might vary in the course of a study. The problem comes when we drag the word \"intelligence\" over onto what they're measuring.",
      "If they're measuring something inborn, they can't be measuring intelligence. Three year olds aren't smart. When we describe one as smart, it's shorthand for \"smarter than other three year olds.\"SplitPerhaps it's a technicality to point out that a predisposition to intelligence is not the same as intelligence.",
      "But it's an important technicality, because it reminds us that we can become smarter, just as we can become wiser.The alarming thing is that we may have to choose between the two.If wisdom and intelligence are the average and peaks of the same curve, then they converge as the number of points on the curve decreases.",
      "If there's just one point, they're identical: the average and maximum are the same. But as the number of points increases, wisdom and intelligence diverge. And historically the number of points on the curve seems to have been increasing: our ability is tested in an ever wider range of situations.In the time of Confucius and Socrates, people seem to have regarded wisdom, learning, and intelligence as more closely related than we do.",
      "Distinguishing between \"wise\" and \"smart\" is a modern habit. [5] And the reason we do is that they've been diverging. As knowledge gets more specialized, there are more points on the curve, and the distinction between the spikes and the average becomes sharper, like a digital image rendered with more pixels.One consequence is that some old recipes may have become obsolete.",
      "At the very least we have to go back and figure out if they were really recipes for wisdom or intelligence. But the really striking change, as intelligence and wisdom drift apart, is that we may have to decide which we prefer.",
      "We may not be able to optimize for both simultaneously.Society seems to have voted for intelligence. We no longer admire the sage—not the way people did two thousand years ago. Now we admire the genius.",
      "Because in fact the distinction we began with has a rather brutal converse: just as you can be smart without being very wise, you can be wise without being very smart. That doesn't sound especially admirable.",
      "That gets you James Bond, who knows what to do in a lot of situations, but has to rely on Q for the ones involving math.Intelligence and wisdom are obviously not mutually exclusive. In fact, a high average may help support high peaks.",
      "But there are reasons to believe that at some point you have to choose between them. One is the example of very smart people, who are so often unwise that in popular culture this now seems to be regarded as the rule rather than the exception.",
      "Perhaps the absent-minded professor is wise in his way, or wiser than he seems, but he's not wise in the way Confucius or Socrates wanted people to be. [6]NewFor both Confucius and Socrates, wisdom, virtue, and happiness were necessarily related.",
      "The wise man was someone who knew what the right choice was and always made it; to be the right choice, it had to be morally right; he was therefore always happy, knowing he'd done the best he could.",
      "I can't think of many ancient philosophers who would have disagreed with that, so far as it goes.\"The superior man is always happy; the small man sad,\" said Confucius. [7]Whereas a few years ago I read an interview with a mathematician who said that most nights he went to bed discontented, feeling he hadn't made enough progress.",
      "[8] The Chinese and Greek words we translate as \"happy\" didn't mean exactly what we do by it, but there's enough overlap that this remark contradicts them.Is the mathematician a small man because he's discontented?",
      "No; he's just doing a kind of work that wasn't very common in Confucius's day.Human knowledge seems to grow fractally. Time after time, something that seemed a small and uninteresting area—experimental error, even—turns out, when examined up close, to have as much in it as all knowledge up to that point.",
      "Several of the fractal buds that have exploded since ancient times involve inventing and discovering new things. Math, for example, used to be something a handful of people did part-time. Now it's the career of thousands.",
      "And in work that involves making new things, some old rules don't apply.Recently I've spent some time advising people, and there I find the ancient rule still works: try to understand the situation as well as you can, give the best advice you can based on your experience, and then don't worry about it, knowing you did all you could.",
      "But I don't have anything like this serenity when I'm writing an essay. Then I'm worried. What if I run out of ideas? And when I'm writing, four nights out of five I go to bed discontented, feeling I didn't get enough done.Advising people and writing are fundamentally different types of work.",
      "When people come to you with a problem and you have to figure out the right thing to do, you don't (usually) have to invent anything. You just weigh the alternatives and try to judge which is the prudent choice.",
      "But prudence can't tell me what sentence to write next. The search space is too big.Someone like a judge or a military officer can in much of his work be guided by duty, but duty is no guide in making things.",
      "Makers depend on something more precarious: inspiration. And like most people who lead a precarious existence, they tend to be worried, not contented. In that respect they're more like the small man of Confucius's day, always one bad harvest (or ruler) away from starvation.",
      "Except instead of being at the mercy of weather and officials, they're at the mercy of their own imagination.LimitsTo me it was a relief just to realize it might be ok to be discontented. The idea that a successful person should be happy has thousands of years of momentum behind it.",
      "If I was any good, why didn't I have the easy confidence winners are supposed to have? But that, I now believe, is like a runner asking \"If I'm such a good athlete, why do I feel so tired?\" Good runners still get tired; they just get tired at higher speeds.People whose work is to invent or discover things are in the same position as the runner.",
      "There's no way for them to do the best they can, because there's no limit to what they could do. The closest you can come is to compare yourself to other people. But the better you do, the less this matters.",
      "An undergrad who gets something published feels like a star. But for someone at the top of the field, what's the test of doing well? Runners can at least compare themselves to others doing exactly the same thing; if you win an Olympic gold medal, you can be fairly content, even if you think you could have run a bit faster.",
      "But what is a novelist to do?Whereas if you're doing the kind of work in which problems are presented to you and you have to choose between several alternatives, there's an upper bound on your performance: choosing the best every time.",
      "In ancient societies, nearly all work seems to have been of this type. The peasant had to decide whether a garment was worth mending, and the king whether or not to invade his neighbor, but neither was expected to invent anything.",
      "In principle they could have; the king could have invented firearms, then invaded his neighbor. But in practice innovations were so rare that they weren't expected of you, any more than goalkeepers are expected to score goals.",
      "[9] In practice, it seemed as if there was a correct decision in every situation, and if you made it you'd done your job perfectly, just as a goalkeeper who prevents the other team from scoring is considered to have played a perfect game.In this world, wisdom seemed paramount.",
      "[10] Even now, most people do work in which problems are put before them and they have to choose the best alternative. But as knowledge has grown more specialized, there are more and more types of work in which people have to make up new things, and in which performance is therefore unbounded.",
      "Intelligence has become increasingly important relative to wisdom because there is more room for spikes.RecipesAnother sign we may have to choose between intelligence and wisdom is how different their recipes are.",
      "Wisdom seems to come largely from curing childish qualities, and intelligence largely from cultivating them.Recipes for wisdom, particularly ancient ones, tend to have a remedial character. To achieve wisdom one must cut away all the debris that fills one's head on emergence from childhood, leaving only the important stuff.",
      "Both self-control and experience have this effect: to eliminate the random biases that come from your own nature and from the circumstances of your upbringing respectively. That's not all wisdom is, but it's a large part of it.",
      "Much of what's in the sage's head is also in the head of every twelve year old. The difference is that in the head of the twelve year old it's mixed together with a lot of random junk.The path to intelligence seems to be through working on hard problems.",
      "You develop intelligence as you might develop muscles, through exercise. But there can't be too much compulsion here. No amount of discipline can replace genuine curiosity. So cultivating intelligence seems to be a matter of identifying some bias in one's character—some tendency to be interested in certain types of things—and nurturing it.",
      "Instead of obliterating your idiosyncrasies in an effort to make yourself a neutral vessel for the truth, you select one and try to grow it from a seedling into a tree.The wise are all much alike in their wisdom, but very smart people tend to be smart in distinctive ways.Most of our educational traditions aim at wisdom.",
      "So perhaps one reason schools work badly is that they're trying to make intelligence using recipes for wisdom. Most recipes for wisdom have an element of subjection. At the very least, you're supposed to do what the teacher says.",
      "The more extreme recipes aim to break down your individuality the way basic training does. But that's not the route to intelligence. Whereas wisdom comes through humility, it may actually help, in cultivating intelligence, to have a mistakenly high opinion of your abilities, because that encourages you to keep working.",
      "Ideally till you realize how mistaken you were.(The reason it's hard to learn new skills late in life is not just that one's brain is less malleable. Another probably even worse obstacle is that one has higher standards.)I realize we're on dangerous ground here.",
      "I'm not proposing the primary goal of education should be to increase students' \"self-esteem.\" That just breeds laziness. And in any case, it doesn't really fool the kids, not the smart ones. They can tell at a young age that a contest where everyone wins is a fraud.A teacher has to walk a narrow path: you want to encourage kids to come up with things on their own, but you can't simply applaud everything they produce.",
      "You have to be a good audience: appreciative, but not too easily impressed. And that's a lot of work. You have to have a good enough grasp of kids' capacities at different ages to know when to be surprised.That's the opposite of traditional recipes for education.",
      "Traditionally the student is the audience, not the teacher; the student's job is not to invent, but to absorb some prescribed body of material. (The use of the term \"recitation\" for sections in some colleges is a fossil of this.) The problem with these old traditions is that they're too much influenced by recipes for wisdom.DifferentI deliberately gave this essay a provocative title; of course it's worth being wise.",
      "But I think it's important to understand the relationship between intelligence and wisdom, and particularly what seems to be the growing gap between them. That way we can avoid applying rules and standards to intelligence that are really meant for wisdom.",
      "These two senses of \"knowing what to do\" are more different than most people realize. The path to wisdom is through discipline, and the path to intelligence through carefully selected self-indulgence.",
      "Wisdom is universal, and intelligence idiosyncratic. And while wisdom yields calmness, intelligence much of the time leads to discontentment.That's particularly worth remembering. A physicist friend recently told me half his department was on Prozac.",
      "Perhaps if we acknowledge that some amount of frustration is inevitable in certain kinds of work, we can mitigate its effects. Perhaps we can box it up and put it away some of the time, instead of letting it flow together with everyday sadness to produce what seems an alarmingly large pool.",
      "At the very least, we can avoid being discontented about being discontented.If you feel exhausted, it's not necessarily because there's something wrong with you. Maybe you're just running fast.Notes[1] Gauss was supposedly asked this when he was 10.",
      "Instead of laboriously adding together the numbers like the other students, he saw that they consisted of 50 pairs that each summed to 101 (100 + 1, 99 + 2, etc), and that he could just multiply 101 by 50 to get the answer, 5050.[2] A variant is that intelligence is the ability to solve problems, and wisdom the judgement to know how to use those solutions.",
      "But while this is certainly an important relationship between wisdom and intelligence, it's not the distinction between them. Wisdom is useful in solving problems too, and intelligence can help in deciding what to do with the solutions.[3] In judging both intelligence and wisdom we have to factor out some knowledge.",
      "People who know the combination of a safe will be better at opening it than people who don't, but no one would say that was a test of intelligence or wisdom.But knowledge overlaps with wisdom and probably also intelligence.",
      "A knowledge of human nature is certainly part of wisdom. So where do we draw the line?Perhaps the solution is to discount knowledge that at some point has a sharp drop in utility. For example, understanding French will help you in a large number of situations, but its value drops sharply as soon as no one else involved knows French.",
      "Whereas the value of understanding vanity would decline more gradually.The knowledge whose utility drops sharply is the kind that has little relation to other knowledge. This includes mere conventions, like languages and safe combinations, and also what we'd call \"random\" facts, like movie stars' birthdays, or how to distinguish 1956 from 1957 Studebakers.[4] People seeking some single thing called \"wisdom\" have been fooled by grammar.",
      "Wisdom is just knowing the right thing to do, and there are a hundred and one different qualities that help in that. Some, like selflessness, might come from meditating in an empty room, and others, like a knowledge of human nature, might come from going to drunken parties.Perhaps realizing this will help dispel the cloud of semi-sacred mystery that surrounds wisdom in so many people's eyes.",
      "The mystery comes mostly from looking for something that doesn't exist. And the reason there have historically been so many different schools of thought about how to achieve wisdom is that they've focused on different components of it.When I use the word \"wisdom\" in this essay, I mean no more than whatever collection of qualities helps people make the right choice in a wide variety of situations.[5] Even in English, our sense of the word \"intelligence\" is surprisingly recent.",
      "Predecessors like \"understanding\" seem to have had a broader meaning.[6] There is of course some uncertainty about how closely the remarks attributed to Confucius and Socrates resemble their actual opinions.",
      "I'm using these names as we use the name \"Homer,\" to mean the hypothetical people who said the things attributed to them.[7] Analects VII:36, Fung trans.Some translators use \"calm\" instead of \"happy.\" One source of difficulty here is that present-day English speakers have a different idea of happiness from many older societies.",
      "Every language probably has a word meaning \"how one feels when things are going well,\" but different cultures react differently when things go well. We react like children, with smiles and laughter. But in a more reserved society, or in one where life was tougher, the reaction might be a quiet contentment.[8] It may have been Andrew Wiles, but I'm not sure.",
      "If anyone remembers such an interview, I'd appreciate hearing from you.[9] Confucius claimed proudly that he had never invented anything—that he had simply passed on an accurate account of ancient traditions.",
      "[Analects VII:1] It's hard for us now to appreciate how important a duty it must have been in preliterate societies to remember and pass on the group's accumulated knowledge. Even in Confucius's time it still seems to have been the first duty of the scholar.[10] The bias toward wisdom in ancient philosophy may be exaggerated by the fact that, in both Greece and China, many of the first philosophers (including Confucius and Plato) saw themselves as teachers of administrators, and so thought disproportionately about such matters.",
      "The few people who did invent things, like storytellers, must have seemed an outlying data point that could be ignored.Thanks to Trevor Blackwell, Sarah Harlin, Jessica Livingston, and Robert Morris for reading drafts of this.Polish TranslationFrench TranslationRussian TranslationRussian Translation"
    ],
    "word_count": 3679,
    "paragraph_count": 75
  },
  "processed_at": "2025-07-26T19:07:25.884221",
  "paragraphs": [
    {
      "original": "February 2007A few days ago I finally figured out something I've wondered about for 25 years: the relationship between wisdom and intelligence. Anyone can see they're not the same by the number of people who are smart, but not very wise.",
      "translated": "2007年2月，几天前我终于弄清楚了困扰我25年的一个问题：智慧与智力之间的关系。任何人都可以看到，它们并不是一回事，因为有很多人很聪明，但却并不非常有智慧。"
    },
    {
      "original": "And yet intelligence and wisdom do seem related. How?What is wisdom? I'd say it's knowing what to do in a lot of situations. I'm not trying to make a deep point here about the true nature of wisdom, just to figure out how we use the word.",
      "translated": "然而，智力和智慧似乎确实有关联。如何关联？什么是智慧？我认为智慧是在很多情况下知道该怎么做。我这里并不是想要探讨智慧的真正本质，只是想弄清楚我们是如何使用这个词的。"
    },
    {
      "original": "A wise person is someone who usually knows the right thing to do.And yet isn't being smart also knowing what to do in certain situations? For example, knowing what to do when the teacher tells your elementary school class to add all the numbers from 1 to 100?",
      "translated": "一个明智的人通常是知道在大多数情况下该做什么的人。然而，聪明不也是指在特定情况下知道该做什么吗？例如，当老师让你的小学班级把1到100的所有数字加起来时，知道该怎么做？"
    },
    {
      "original": "[1]Some say wisdom and intelligence apply to different types of problems—wisdom to human problems and intelligence to abstract ones. But that isn't true. Some wisdom has nothing to do with people: for example, the wisdom of the engineer who knows certain structures are less prone to failure than others.",
      "translated": "有人说，智慧和智力适用于不同类型的问题——智慧适用于人类问题，而智力适用于抽象问题。但这种说法并不正确。有些智慧与人无关：例如，工程师所拥有的智慧，知道某些结构比其他结构更不易出故障。"
    },
    {
      "original": "And certainly smart people can find clever solutions to human problems as well as abstract ones. [2]Another popular explanation is that wisdom comes from experience while intelligence is innate. But people are not simply wise in proportion to how much experience they have.",
      "translated": "当然，聪明的人可以找到解决人类问题和抽象问题的巧妙方法。[2]另一种流行的解释是，智慧来自经验，而智力是与生俱来的。但人们的智慧并不仅仅与他们的经验多少成正比。"
    },
    {
      "original": "Other things must contribute to wisdom besides experience, and some may be innate: a reflective disposition, for example.Neither of the conventional explanations of the difference between wisdom and intelligence stands up to scrutiny.",
      "translated": "除了经验之外，其他因素也必须对智慧有所贡献，有些可能是与生俱来的：例如，反思的倾向。关于智慧与智力之间差异的传统解释都不经得起推敲。"
    },
    {
      "original": "So what is the difference? If we look at how people use the words \"wise\" and \"smart,\" what they seem to mean is different shapes of performance.Curve\"Wise\" and \"smart\" are both ways of saying someone knows what to do.",
      "translated": "那么区别在哪里呢？如果我们看看人们如何使用“明智”和“聪明”这两个词，它们所指的是不同的表现形态。“明智”和“聪明”都是表示某人知道该做什么的方式。"
    },
    {
      "original": "The difference is that \"wise\" means one has a high average outcome across all situations, and \"smart\" means one does spectacularly well in a few. That is, if you had a graph in which the x axis represented situations and the y axis the outcome, the graph of the wise person would be high overall, and the graph of the smart person would have high peaks.The distinction is similar to the rule that one should judge talent at its best and character at its worst.",
      "translated": "区别在于，“明智”意味着在所有情况下都有较高的平均结果，而“聪明”则意味着在少数几个方面表现得非常出色。也就是说，如果你有一个图表，其中x轴代表情况，y轴代表结果，那么明智之人的图表整体上会很高，而聪明之人的图表则会有很高的峰值。这种区分类似于一条规则，即应该在最佳状态下评判才能，在最差状态下评判品格。"
    },
    {
      "original": "Except you judge intelligence at its best, and wisdom by its average. That's how the two are related: they're the two different senses in which the same curve can be high.So a wise person knows what to do in most situations, while a smart person knows what to do in situations where few others could.",
      "translated": "除了你应在最佳状态时评判智慧，在平均水平时评判智能。这就是两者的关系：它们是同一曲线在不同意义上可以达到的高度。因此，一个有智慧的人在大多数情况下都知道该怎么做，而一个聪明的人则在很少有人能应对的情况下知道该怎么做。"
    },
    {
      "original": "We need to add one more qualification: we should ignore cases where someone knows what to do because they have inside information. [3] But aside from that, I don't think we can get much more specific without starting to be mistaken.Nor do we need to.",
      "translated": "我们需要再补充一个条件：当某人因为掌握内部信息而知道该怎么做时，我们应该忽略这种情况。[3] 但除此之外，我认为我们无法在不开始犯错的情况下变得更加具体。我们也没有必要这样做。"
    },
    {
      "original": "Simple as it is, this explanation predicts, or at least accords with, both of the conventional stories about the distinction between wisdom and intelligence. Human problems are the most common type, so being good at solving those is key in achieving a high average outcome.",
      "translated": "尽管简单，这一解释却预测或至少符合关于智慧与智力区别的两种传统说法。人类问题是最常见的类型，因此善于解决这类问题是实现高平均结果的关键。"
    },
    {
      "original": "And it seems natural that a high average outcome depends mostly on experience, but that dramatic peaks can only be achieved by people with certain rare, innate qualities; nearly anyone can learn to be a good swimmer, but to be an Olympic swimmer you need a certain body type.This explanation also suggests why wisdom is such an elusive concept: there's no such thing.",
      "translated": "高平均成就似乎主要取决于经验，但戏剧性的巅峰表现只能由具有某些罕见的先天素质的人实现；几乎任何人都可以学会成为一名优秀的游泳者，但要成为奥运会游泳选手，你需要特定的体型。这种解释也暗示了为什么智慧是一个如此难以捉摸的概念：根本没有这样的东西。"
    },
    {
      "original": "\"Wise\" means something—that one is on average good at making the right choice. But giving the name \"wisdom\" to the supposed quality that enables one to do that doesn't mean such a thing exists. To the extent \"wisdom\" means anything, it refers to a grab-bag of qualities as various as self-discipline, experience, and empathy.",
      "translated": "“明智”意味着某种能力——即在大多数情况下能够做出正确的选择。但是，将这种假设能够使人做出正确选择的品质称为“智慧”并不意味着这种东西确实存在。就“智慧”所指的任何意义而言，它指的是包括自律、经验、同理心等在内的各种品质的大杂烩。"
    },
    {
      "original": "[4]Likewise, though \"intelligent\" means something, we're asking for trouble if we insist on looking for a single thing called \"intelligence.\" And whatever its components, they're not all innate. We use the word \"intelligent\" as an indication of ability: a smart person can grasp things few others could.",
      "translated": "同样，尽管“智能”意味着某些东西，如果我们坚持寻找一种称为“智力”的单一事物，那我们就会遇到麻烦。而且，无论其组成部分是什么，它们并非全部是与生俱来的。我们使用“智能”这个词来表示能力：一个聪明的人能够理解其他人很少能够理解的事情。"
    },
    {
      "original": "It does seem likely there's some inborn predisposition to intelligence (and wisdom too), but this predisposition is not itself intelligence.One reason we tend to think of intelligence as inborn is that people trying to measure it have concentrated on the aspects of it that are most measurable.",
      "translated": "确实，似乎有一种与生俱来的智力（以及智慧）倾向，但这种倾向本身并不是智力。我们认为智力是与生俱来的其中一个原因是，那些试图测量智力的人专注于其最可测量的方面。"
    },
    {
      "original": "A quality that's inborn will obviously be more convenient to work with than one that's influenced by experience, and thus might vary in the course of a study. The problem comes when we drag the word \"intelligence\" over onto what they're measuring.",
      "translated": "与受经验影响、因而在研究过程中可能会变化的特质相比，天生的特质显然更容易处理。问题在于，当我们把“智能”这个词用在他们所测量的事物上时。"
    },
    {
      "original": "If they're measuring something inborn, they can't be measuring intelligence. Three year olds aren't smart. When we describe one as smart, it's shorthand for \"smarter than other three year olds.\"SplitPerhaps it's a technicality to point out that a predisposition to intelligence is not the same as intelligence.",
      "translated": "如果他们在测量的是与生俱来的东西，那么他们就不可能在测量智力。三岁的孩子并不聪明。当我们形容一个三岁的孩子聪明时，这只是“比其他三岁的孩子更聪明”的简略说法。也许指出智力倾向与智力本身并不相同是一个技术上的细节。"
    },
    {
      "original": "But it's an important technicality, because it reminds us that we can become smarter, just as we can become wiser.The alarming thing is that we may have to choose between the two.If wisdom and intelligence are the average and peaks of the same curve, then they converge as the number of points on the curve decreases.",
      "translated": "但这是一个重要的技术细节，因为它提醒我们，我们不仅可以变得更聪明，还可以变得更智慧。令人担忧的是，我们可能不得不在这两者之间做出选择。如果智慧和智力是同一条曲线的平均值和峰值，那么当这条曲线上点的数量减少时，它们就会趋于一致。"
    },
    {
      "original": "If there's just one point, they're identical: the average and maximum are the same. But as the number of points increases, wisdom and intelligence diverge. And historically the number of points on the curve seems to have been increasing: our ability is tested in an ever wider range of situations.In the time of Confucius and Socrates, people seem to have regarded wisdom, learning, and intelligence as more closely related than we do.",
      "translated": "如果只有一个点，它们是相同的：平均值和最大值是一样的。但随着点的数量增加，智慧和智力开始分道扬镳。从历史上看，曲线上的点似乎在不断增加：我们的能力在越来越多的不同情境中受到考验。在孔子和苏格拉底的时代，人们似乎认为智慧、学识和智力之间的关系比我们现在认为的更为密切。"
    },
    {
      "original": "Distinguishing between \"wise\" and \"smart\" is a modern habit. [5] And the reason we do is that they've been diverging. As knowledge gets more specialized, there are more points on the curve, and the distinction between the spikes and the average becomes sharper, like a digital image rendered with more pixels.One consequence is that some old recipes may have become obsolete.",
      "translated": "区分“智慧”和“聪明”是一种现代习惯。[5] 我们这样做的原因是这两者已经出现了分歧。随着知识变得更加专业化，曲线上的点越来越多，尖峰与平均水平之间的区别变得更加明显，就像用更多像素渲染的数字图像一样。其中一个后果是，一些旧的方法可能已经过时了。"
    },
    {
      "original": "At the very least we have to go back and figure out if they were really recipes for wisdom or intelligence. But the really striking change, as intelligence and wisdom drift apart, is that we may have to decide which we prefer.",
      "translated": "至少我们得回去弄清楚，那些真的是智慧的配方还是智能的配方。但更引人注目的是，随着智能和智慧逐渐分离，我们可能不得不决定自己更倾向于哪一种。"
    },
    {
      "original": "We may not be able to optimize for both simultaneously.Society seems to have voted for intelligence. We no longer admire the sage—not the way people did two thousand years ago. Now we admire the genius.",
      "translated": "我们可能无法同时优化两者。社会似乎选择了智慧。我们不再仰慕圣人——不像两千年前的人们那样。现在我们仰慕天才。"
    },
    {
      "original": "Because in fact the distinction we began with has a rather brutal converse: just as you can be smart without being very wise, you can be wise without being very smart. That doesn't sound especially admirable.",
      "translated": "其实，我们一开始就提到的区别有一个相当残酷的反面：就像你可以聪明而不智慧一样，你也可以智慧而不聪明。这听起来并不特别令人钦佩。"
    },
    {
      "original": "That gets you James Bond, who knows what to do in a lot of situations, but has to rely on Q for the ones involving math.Intelligence and wisdom are obviously not mutually exclusive. In fact, a high average may help support high peaks.",
      "translated": "这让你想到了詹姆斯·邦德，他在很多情况下都知道该怎么办，但涉及到数学问题时就不得不依赖Q。智力和智慧显然不是相互排斥的。事实上，较高的平均水平有助于支持较高的峰值。"
    },
    {
      "original": "But there are reasons to believe that at some point you have to choose between them. One is the example of very smart people, who are so often unwise that in popular culture this now seems to be regarded as the rule rather than the exception.",
      "translated": "但有理由相信，在某个时候你必须在两者之间做出选择。其中一个原因是，非常聪明的人往往缺乏智慧，以至于在流行文化中，这现在似乎被视为常态而非例外。"
    },
    {
      "original": "Perhaps the absent-minded professor is wise in his way, or wiser than he seems, but he's not wise in the way Confucius or Socrates wanted people to be. [6]NewFor both Confucius and Socrates, wisdom, virtue, and happiness were necessarily related.",
      "translated": "或许，这位心不在焉的教授以他自己的方式是明智的，或者比表面看起来更明智，但他不是以孔子或苏格拉底希望人们成为的那种方式明智。对于孔子和苏格拉底而言，智慧、美德和幸福是必然相联的。"
    },
    {
      "original": "The wise man was someone who knew what the right choice was and always made it; to be the right choice, it had to be morally right; he was therefore always happy, knowing he'd done the best he could.",
      "translated": "智者是一个知道正确选择并始终做出正确选择的人；要成为正确的选择，它必须在道德上是正确的；因此，他总是快乐的，因为他知道自己已经尽了最大的努力。"
    },
    {
      "original": "I can't think of many ancient philosophers who would have disagreed with that, so far as it goes.\"The superior man is always happy; the small man sad,\" said Confucius. [7]Whereas a few years ago I read an interview with a mathematician who said that most nights he went to bed discontented, feeling he hadn't made enough progress.",
      "translated": "我想不到有多少古代哲学家会不同意这一点。“君子坦荡荡，小人常戚戚”，孔子如是说。[7]而几年前，我读到一篇对数学家的采访，他说大多数晚上他都是怀着不满入睡，感觉进展不够。"
    },
    {
      "original": "[8] The Chinese and Greek words we translate as \"happy\" didn't mean exactly what we do by it, but there's enough overlap that this remark contradicts them.Is the mathematician a small man because he's discontented?",
      "translated": "我们翻译成“幸福”的中文和希腊词汇，并不完全等同于我们现在的意思，但有足够的重合之处，使这一评论与之相悖。数学家会因为不满而成为一个小人物吗？"
    },
    {
      "original": "No; he's just doing a kind of work that wasn't very common in Confucius's day.Human knowledge seems to grow fractally. Time after time, something that seemed a small and uninteresting area—experimental error, even—turns out, when examined up close, to have as much in it as all knowledge up to that point.",
      "translated": "不；他只是在做一种在孔子时代并不常见的工作。人类的知识似乎是以分形的方式增长的。一次又一次，一些看似渺小而不引人注目的领域——甚至是实验误差——在仔细研究后，竟然包含了与当时所有知识一样多的内容。"
    },
    {
      "original": "Several of the fractal buds that have exploded since ancient times involve inventing and discovering new things. Math, for example, used to be something a handful of people did part-time. Now it's the career of thousands.",
      "translated": "自古以来，有几个分形芽已经爆发，涉及发明和发现新事物。例如，数学曾经是少数人兼职做的事情，现在已经成为成千上万人的职业。"
    },
    {
      "original": "And in work that involves making new things, some old rules don't apply.Recently I've spent some time advising people, and there I find the ancient rule still works: try to understand the situation as well as you can, give the best advice you can based on your experience, and then don't worry about it, knowing you did all you could.",
      "translated": "而在涉及创造新事物的工作中，一些旧的规则并不适用。最近我花了一些时间去指导别人，在这方面我发现古老的原则依然有效：尽力理解情况，根据你的经验给出最好的建议，然后就不要担心了，知道你已经尽力而为。"
    },
    {
      "original": "But I don't have anything like this serenity when I'm writing an essay. Then I'm worried. What if I run out of ideas? And when I'm writing, four nights out of five I go to bed discontented, feeling I didn't get enough done.Advising people and writing are fundamentally different types of work.",
      "translated": "但当我写文章时，我却无法拥有这样的平静。那时我会感到担忧。万一我思路枯竭了怎么办？而且，当我写作时，五天中有四天晚上我会带着不满上床，觉得没有完成足够的工作。给人提建议和写作是两种根本不同的工作。"
    },
    {
      "original": "When people come to you with a problem and you have to figure out the right thing to do, you don't (usually) have to invent anything. You just weigh the alternatives and try to judge which is the prudent choice.",
      "translated": "当人们向你提出问题，而你需要找出正确的解决办法时，你通常不需要发明什么新东西。你只需要权衡各种选择，并尽量判断哪个是明智的决定。"
    },
    {
      "original": "But prudence can't tell me what sentence to write next. The search space is too big.Someone like a judge or a military officer can in much of his work be guided by duty, but duty is no guide in making things.",
      "translated": "但谨慎无法告诉我下一步该写什么句子。搜索的空间太大了。像法官或军官这样的人，在其大部分工作中可以由职责引导，但在创造事物时，职责却无法提供指导。"
    },
    {
      "original": "Makers depend on something more precarious: inspiration. And like most people who lead a precarious existence, they tend to be worried, not contented. In that respect they're more like the small man of Confucius's day, always one bad harvest (or ruler) away from starvation.",
      "translated": "创造者依赖于更加不稳定的东西：灵感。而像大多数生活在不稳定状态中的人一样，他们倾向于担忧，而不是满足。在这方面，他们更像孔子时代的小民，总是距离因一次歉收（或暴政）而陷入饥荒仅一步之遥。"
    },
    {
      "original": "Except instead of being at the mercy of weather and officials, they're at the mercy of their own imagination.LimitsTo me it was a relief just to realize it might be ok to be discontented. The idea that a successful person should be happy has thousands of years of momentum behind it.",
      "translated": "除了不受天气和官员的支配，他们现在受自己想象力的支配。对我来说，意识到不满可能是正常的，这本身就是一种解脱。成功的人应该幸福这一观念有着数千年的历史惯性。"
    },
    {
      "original": "If I was any good, why didn't I have the easy confidence winners are supposed to have? But that, I now believe, is like a runner asking \"If I'm such a good athlete, why do I feel so tired?\" Good runners still get tired; they just get tired at higher speeds.People whose work is to invent or discover things are in the same position as the runner.",
      "translated": "如果我足够优秀，为什么我没有那些成功者应有的从容自信？但现在我认为，这就像一个运动员会问：“如果我这么优秀，为什么我会感到如此疲惫？”优秀的运动员也会感到疲惫；只是他们会在更高的速度下感到疲惫。那些以发明或发现为工作的人，就像这位运动员一样。"
    },
    {
      "original": "There's no way for them to do the best they can, because there's no limit to what they could do. The closest you can come is to compare yourself to other people. But the better you do, the less this matters.",
      "translated": "他们无法做到最好，因为他们的潜力是无限的。最接近的做法是将自己与他人比较。但你做得越好，这种比较就越不重要。"
    },
    {
      "original": "An undergrad who gets something published feels like a star. But for someone at the top of the field, what's the test of doing well? Runners can at least compare themselves to others doing exactly the same thing; if you win an Olympic gold medal, you can be fairly content, even if you think you could have run a bit faster.",
      "translated": "一个本科生如果能发表作品，就会觉得自己像明星。但对于领域顶尖的人士来说，如何判断自己是否做得好呢？至少运动员可以与做同样事情的其他人进行比较；如果你赢得了奥运金牌，即使认为自己还能跑得更快一些，也完全可以感到满意。"
    },
    {
      "original": "But what is a novelist to do?Whereas if you're doing the kind of work in which problems are presented to you and you have to choose between several alternatives, there's an upper bound on your performance: choosing the best every time.",
      "translated": "但小说家该怎么办呢？如果你从事的是那种问题摆在你面前，而你必须在几个选项中做出选择的工作，你的表现有一个上限：每次都选择最好的。"
    },
    {
      "original": "In ancient societies, nearly all work seems to have been of this type. The peasant had to decide whether a garment was worth mending, and the king whether or not to invade his neighbor, but neither was expected to invent anything.",
      "translated": "在古代社会，几乎所有的工作似乎都是这种类型。农民需要决定一件衣服是否值得修补，国王则需要决定是否入侵邻国，但没有人期望他们去发明任何东西。"
    },
    {
      "original": "In principle they could have; the king could have invented firearms, then invaded his neighbor. But in practice innovations were so rare that they weren't expected of you, any more than goalkeepers are expected to score goals.",
      "translated": "原则上他们是可以的；国王可以发明火器，然后入侵邻国。但实际上，创新如此罕见，以至于人们对国王并没有这样的期望，就像人们不期望守门员去进球一样。"
    },
    {
      "original": "[9] In practice, it seemed as if there was a correct decision in every situation, and if you made it you'd done your job perfectly, just as a goalkeeper who prevents the other team from scoring is considered to have played a perfect game.In this world, wisdom seemed paramount.",
      "translated": "在实践中，似乎每种情况都有一个正确的决定，如果你做出了这个决定，就等于完美地完成了任务，就像一个阻止对方进球的守门员被认为打了一场完美的比赛一样。在这个世界里，智慧似乎至关重要。"
    },
    {
      "original": "[10] Even now, most people do work in which problems are put before them and they have to choose the best alternative. But as knowledge has grown more specialized, there are more and more types of work in which people have to make up new things, and in which performance is therefore unbounded.",
      "translated": "即使在今天，大多数人所做的工作仍然是面对问题，需要从中选择最佳的解决方案。但随着知识的日益专业化，越来越多的工作类型要求人们必须创造新事物，因此这些工作的表现是没有上限的。"
    },
    {
      "original": "Intelligence has become increasingly important relative to wisdom because there is more room for spikes.RecipesAnother sign we may have to choose between intelligence and wisdom is how different their recipes are.",
      "translated": "智能相对于智慧变得越来越重要，因为有更多的空间可以突飞猛进。另一个表明我们可能必须在智能和智慧之间做出选择的迹象是，它们的形成方式大相径庭。"
    },
    {
      "original": "Wisdom seems to come largely from curing childish qualities, and intelligence largely from cultivating them.Recipes for wisdom, particularly ancient ones, tend to have a remedial character. To achieve wisdom one must cut away all the debris that fills one's head on emergence from childhood, leaving only the important stuff.",
      "translated": "智慧似乎主要来自于纠正孩童般的特质，而智力则主要来自于培养这些特质。智慧的配方，尤其是古代的智慧配方，往往具有补救的性质。要获得智慧，就必须剔除童年结束后充斥头脑的所有杂乱无章的东西，只留下重要的部分。"
    },
    {
      "original": "Both self-control and experience have this effect: to eliminate the random biases that come from your own nature and from the circumstances of your upbringing respectively. That's not all wisdom is, but it's a large part of it.",
      "translated": "自律和经验都有这样的作用：分别消除源于自身本性和成长环境的随机偏见。这并不是智慧的全部，但却是其中的重要部分。"
    },
    {
      "original": "Much of what's in the sage's head is also in the head of every twelve year old. The difference is that in the head of the twelve year old it's mixed together with a lot of random junk.The path to intelligence seems to be through working on hard problems.",
      "translated": "智者头脑中的许多东西，也存在于每个十二岁孩子的头脑中。区别在于，十二岁孩子的头脑中这些东西与许多杂乱无章的东西混杂在一起。通向智慧的道路似乎在于解决难题。"
    },
    {
      "original": "You develop intelligence as you might develop muscles, through exercise. But there can't be too much compulsion here. No amount of discipline can replace genuine curiosity. So cultivating intelligence seems to be a matter of identifying some bias in one's character—some tendency to be interested in certain types of things—and nurturing it.",
      "translated": "你培养智力就像锻炼肌肉一样，通过练习来提高。但这里不能有太多的强迫。再多的纪律也无法替代真正的 curiosity。因此，培养智力似乎在于识别自己性格中的某种偏见——对某些类型的事物有感兴趣的趋势——并加以培养。"
    },
    {
      "original": "Instead of obliterating your idiosyncrasies in an effort to make yourself a neutral vessel for the truth, you select one and try to grow it from a seedling into a tree.The wise are all much alike in their wisdom, but very smart people tend to be smart in distinctive ways.Most of our educational traditions aim at wisdom.",
      "translated": "与其为了使自己成为一个中立的真理载体而抹去你的个性，不如选择其中一个个性并尝试将其从幼苗培养成大树。智者们的智慧大多相似，但非常聪明的人往往以独特的方式展现他们的聪明才智。我们的大多数教育传统都旨在追求智慧。"
    },
    {
      "original": "So perhaps one reason schools work badly is that they're trying to make intelligence using recipes for wisdom. Most recipes for wisdom have an element of subjection. At the very least, you're supposed to do what the teacher says.",
      "translated": "所以，学校教育效果不佳的一个原因可能是它们试图用智慧的配方来培养智力。大多数智慧的配方都包含了一定程度的服从。最起码，你应该听从老师的吩咐。"
    },
    {
      "original": "The more extreme recipes aim to break down your individuality the way basic training does. But that's not the route to intelligence. Whereas wisdom comes through humility, it may actually help, in cultivating intelligence, to have a mistakenly high opinion of your abilities, because that encourages you to keep working.",
      "translated": "更极端的食谱旨在像基础训练一样瓦解你的个性。但这并不是通向智慧的道路。虽然智慧来源于谦逊，但在培养智慧的过程中，对自己能力有过高的评价实际上可能有所帮助，因为这会鼓励你继续努力。"
    },
    {
      "original": "Ideally till you realize how mistaken you were.(The reason it's hard to learn new skills late in life is not just that one's brain is less malleable. Another probably even worse obstacle is that one has higher standards.)I realize we're on dangerous ground here.",
      "translated": "理想的情况是直到你意识到自己错得有多离谱。（人到晚年难以学习新技能的原因不仅在于大脑的可塑性降低。另一个可能是更糟糕的障碍是，人的标准提高了。）我意识到我们正在进入一个危险的领域。"
    },
    {
      "original": "I'm not proposing the primary goal of education should be to increase students' \"self-esteem.\" That just breeds laziness. And in any case, it doesn't really fool the kids, not the smart ones. They can tell at a young age that a contest where everyone wins is a fraud.A teacher has to walk a narrow path: you want to encourage kids to come up with things on their own, but you can't simply applaud everything they produce.",
      "translated": "我并不是在提议教育的主要目标应该是提高学生的“自尊”。那只会滋生懒惰。而且，无论如何，这并不能真正欺骗孩子们，尤其是那些聪明的孩子。他们很小的时候就能看出，一个所有人都能获胜的比赛是骗人的。教师必须走一条狭窄的道路：你希望鼓励孩子们自己想出东西，但不能对他们所做的一切都简单地鼓掌称赞。"
    },
    {
      "original": "You have to be a good audience: appreciative, but not too easily impressed. And that's a lot of work. You have to have a good enough grasp of kids' capacities at different ages to know when to be surprised.That's the opposite of traditional recipes for education.",
      "translated": "你必须成为一个好的观众：欣赏，但不要轻易被 impress。这需要很多努力。你必须对不同年龄段的孩子的能力有足够的了解，才能知道何时该感到惊讶。这与传统的教育方法恰恰相反。"
    },
    {
      "original": "Traditionally the student is the audience, not the teacher; the student's job is not to invent, but to absorb some prescribed body of material. (The use of the term \"recitation\" for sections in some colleges is a fossil of this.) The problem with these old traditions is that they're too much influenced by recipes for wisdom.DifferentI deliberately gave this essay a provocative title; of course it's worth being wise.",
      "translated": "传统上，学生是听众，而不是教师；学生的任务不是去创造，而是去吸收某些规定的知识体系。（在某些大学中，将某些课程部分称为“朗诵课”就是这种传统的遗迹。）这些旧传统的问题是，它们过多地受到智慧配方的影响。我故意给这篇文章起了一个挑衅性的标题；当然，拥有智慧是值得的。"
    },
    {
      "original": "But I think it's important to understand the relationship between intelligence and wisdom, and particularly what seems to be the growing gap between them. That way we can avoid applying rules and standards to intelligence that are really meant for wisdom.",
      "translated": "但是，我认为理解智力与智慧之间的关系很重要，尤其是它们之间似乎日益扩大的差距。这样，我们就可以避免将原本适用于智慧的规则和标准应用于智力。"
    },
    {
      "original": "These two senses of \"knowing what to do\" are more different than most people realize. The path to wisdom is through discipline, and the path to intelligence through carefully selected self-indulgence.",
      "translated": "这两种“知道该做什么”的含义比大多数人意识到的要不同得多。智慧的途径在于自律，而智力的提升则通过精心选择的自我放纵。"
    },
    {
      "original": "Wisdom is universal, and intelligence idiosyncratic. And while wisdom yields calmness, intelligence much of the time leads to discontentment.That's particularly worth remembering. A physicist friend recently told me half his department was on Prozac.",
      "translated": "智慧是普遍的，而才智是个性化的。智慧带来宁静，而才智很多时候却导致不满。这一点尤其值得记住。最近，一位物理学家朋友告诉我，他们系有一半的人在服用百忧解。"
    },
    {
      "original": "Perhaps if we acknowledge that some amount of frustration is inevitable in certain kinds of work, we can mitigate its effects. Perhaps we can box it up and put it away some of the time, instead of letting it flow together with everyday sadness to produce what seems an alarmingly large pool.",
      "translated": "或许，如果我们承认在某些类型的工作中，一定程度的挫败感是不可避免的，我们就能减轻其影响。或许我们可以在某些时候将其限制并收起来，而不是任由它与日常的悲伤交织，形成看似令人担忧的大片情绪。"
    },
    {
      "original": "At the very least, we can avoid being discontented about being discontented.If you feel exhausted, it's not necessarily because there's something wrong with you. Maybe you're just running fast.Notes[1] Gauss was supposedly asked this when he was 10.",
      "translated": "至少，我们可以避免对不满感到不满。如果你感到疲惫，并不一定是因为你有什么问题。也许你只是跑得太快了。注[1] 据说高斯在10岁时就被问到这个问题。"
    },
    {
      "original": "Instead of laboriously adding together the numbers like the other students, he saw that they consisted of 50 pairs that each summed to 101 (100 + 1, 99 + 2, etc), and that he could just multiply 101 by 50 to get the answer, 5050.[2] A variant is that intelligence is the ability to solve problems, and wisdom the judgement to know how to use those solutions.",
      "translated": "他没有像其他学生那样费力地将这些数字相加，而是发现这些数字可以组成50对，每对的和都是101（100 + 1，99 + 2，等等），因此他只需将101乘以50就能得到答案，即5050。[2] 另一个说法是，智慧是解决问题的能力，而明智则是判断如何运用这些解决方案的见识。"
    },
    {
      "original": "But while this is certainly an important relationship between wisdom and intelligence, it's not the distinction between them. Wisdom is useful in solving problems too, and intelligence can help in deciding what to do with the solutions.[3] In judging both intelligence and wisdom we have to factor out some knowledge.",
      "translated": "但虽然智慧和智力之间确实存在这种重要的关系，但这并不是它们之间的区别。智慧在解决问题时同样有用，而智力则有助于决定如何处理这些解决方案。[3] 在评估智力和智慧时，我们必须排除某些知识。"
    },
    {
      "original": "People who know the combination of a safe will be better at opening it than people who don't, but no one would say that was a test of intelligence or wisdom.But knowledge overlaps with wisdom and probably also intelligence.",
      "translated": "知道保险箱组合密码的人比不知道的人更擅长打开它，但没有人会说这是一种智力或智慧的测试。然而，知识与智慧重叠，可能也与智力有关。"
    },
    {
      "original": "A knowledge of human nature is certainly part of wisdom. So where do we draw the line?Perhaps the solution is to discount knowledge that at some point has a sharp drop in utility. For example, understanding French will help you in a large number of situations, but its value drops sharply as soon as no one else involved knows French.",
      "translated": "了解人性当然是智慧的一部分。那么，我们该如何划清界限呢？或许解决办法是忽略那些在某个点上效用急剧下降的知识。例如，懂法语会在很多情况下对你有帮助，但是一旦其他人都不懂法语，它的价值就会急剧下降。"
    },
    {
      "original": "Whereas the value of understanding vanity would decline more gradually.The knowledge whose utility drops sharply is the kind that has little relation to other knowledge. This includes mere conventions, like languages and safe combinations, and also what we'd call \"random\" facts, like movie stars' birthdays, or how to distinguish 1956 from 1957 Studebakers.[4] People seeking some single thing called \"wisdom\" have been fooled by grammar.",
      "translated": "理解虚荣的价值会逐渐下降。而效用急剧下降的知识是指那些与其他知识关系不大的知识。这包括纯粹的惯例，如语言和保险箱的组合密码，以及我们所谓的“随机”事实，比如电影明星的生日，或者如何区分1956年和1957年的斯图贝克汽车。[4] 寻求某种称为“智慧”的单一事物的人被语法愚弄了。"
    },
    {
      "original": "Wisdom is just knowing the right thing to do, and there are a hundred and one different qualities that help in that. Some, like selflessness, might come from meditating in an empty room, and others, like a knowledge of human nature, might come from going to drunken parties.Perhaps realizing this will help dispel the cloud of semi-sacred mystery that surrounds wisdom in so many people's eyes.",
      "translated": "智慧就是知道该做什么，而有一百零一种不同的品质能在这方面提供帮助。有些品质，比如无私，可能来自在空房间里冥想；而另一些，比如对人性的了解，可能来自参加醉酒的聚会。也许认识到这一点有助于驱散许多人眼中围绕智慧的那层半神圣的神秘面纱。"
    },
    {
      "original": "The mystery comes mostly from looking for something that doesn't exist. And the reason there have historically been so many different schools of thought about how to achieve wisdom is that they've focused on different components of it.When I use the word \"wisdom\" in this essay, I mean no more than whatever collection of qualities helps people make the right choice in a wide variety of situations.[5] Even in English, our sense of the word \"intelligence\" is surprisingly recent.",
      "translated": "神秘感大多源自寻找不存在的事物。历史上有如此多不同的思想流派关于如何获得智慧，原因是它们关注的是智慧的不同组成部分。在这篇文章中，当我使用“智慧”这个词时，我的意思仅仅是那些有助于人们在各种情况下做出正确选择的品质集合。即使在英语中，我们对“智力”这个词的理解也是相当近代的。"
    },
    {
      "original": "Predecessors like \"understanding\" seem to have had a broader meaning.[6] There is of course some uncertainty about how closely the remarks attributed to Confucius and Socrates resemble their actual opinions.",
      "translated": "像“理解”这样的先驱概念似乎有着更广泛的含义。当然，关于归于孔子和苏格拉底的言论在多大程度上反映了他们的真实观点，还存在一些不确定性。"
    },
    {
      "original": "I'm using these names as we use the name \"Homer,\" to mean the hypothetical people who said the things attributed to them.[7] Analects VII:36, Fung trans.Some translators use \"calm\" instead of \"happy.\" One source of difficulty here is that present-day English speakers have a different idea of happiness from many older societies.",
      "translated": "我使用这些名字的方式就像我们使用“荷马”这个名字一样，指的是那些被归功于他们言行的假想人物。[7] 《论语》第七章第36节，冯译。有些译者用“平静”来代替“快乐”。这里的一个难点在于，现代英语使用者对快乐的理解与许多古代社会有所不同。"
    },
    {
      "original": "Every language probably has a word meaning \"how one feels when things are going well,\" but different cultures react differently when things go well. We react like children, with smiles and laughter. But in a more reserved society, or in one where life was tougher, the reaction might be a quiet contentment.[8] It may have been Andrew Wiles, but I'm not sure.",
      "translated": "每种语言可能都有一个词表示“事情进展顺利时的感受”，但不同的文化在事情顺利时的反应各不相同。我们像孩子一样，带着笑容和笑声反应。但在更为内敛的社会，或是在生活更为艰辛的社会中，反应可能是一种平静的满足。这可能是安德鲁·怀尔斯说的，但我不确定。"
    },
    {
      "original": "If anyone remembers such an interview, I'd appreciate hearing from you.[9] Confucius claimed proudly that he had never invented anything—that he had simply passed on an accurate account of ancient traditions.",
      "translated": "如果有人记得这样的采访，请您告诉我。[9] 孔子自豪地宣称，他从未发明过任何东西——他只是准确地传递了古代的传统。"
    },
    {
      "original": "[Analects VII:1] It's hard for us now to appreciate how important a duty it must have been in preliterate societies to remember and pass on the group's accumulated knowledge. Even in Confucius's time it still seems to have been the first duty of the scholar.[10] The bias toward wisdom in ancient philosophy may be exaggerated by the fact that, in both Greece and China, many of the first philosophers (including Confucius and Plato) saw themselves as teachers of administrators, and so thought disproportionately about such matters.",
      "translated": "《论语·述而第七》：我们现在很难理解，在没有文字的社会里，记住并传承群体积累的知识是一项多么重要的职责。即使在孔子的时代，这似乎仍然是学者的首要职责。古代哲学对智慧的偏重，可能因为无论是希腊还是中国，许多最早的哲学家（包括孔子和柏拉图）都将自己视为管理者教师，因此对这类问题给予了过多的关注。"
    },
    {
      "original": "The few people who did invent things, like storytellers, must have seemed an outlying data point that could be ignored.Thanks to Trevor Blackwell, Sarah Harlin, Jessica Livingston, and Robert Morris for reading drafts of this.Polish TranslationFrench TranslationRussian TranslationRussian Translation",
      "translated": "像讲故事的人这样少数发明东西的人，一定像是可以忽略的边缘数据点。感谢 Trevor Blackwell、Sarah Harlin、Jessica Livingston 和 Robert Morris 阅读本文的草稿。波兰语翻译法语翻译俄语翻译俄语翻译"
    }
  ],
  "translation_completed": "2025-07-29T01:51:15.571327",
  "translation_stats": {
    "total_paragraphs": 75,
    "success_count": 75,
    "success_rate": "100.0%"
  }
}