{
  "title": "The Origins of Wokeness",
  "title_zh": "觉醒主义的起源",
  "url": "https://www.paulgraham.com/woke.html",
  "filename": "woke.html",
  "date": "2025-01-01",
  "id": 4,
  "content": {
    "success": true,
    "paragraphs": [
      "January 2025The word \"prig\" isn't very common now, but if you look up the definition, it will sound familiar. Google's isn't bad: A self-righteously moralistic person who behaves as if superior to others.",
      "This sense of the word originated in the 18th century, and its age is an important clue: it shows that although wokeness is a comparatively recent phenomenon, it's an instance of a much older one.There's a certain kind of person who's attracted to a shallow, exacting kind of moral purity, and who demonstrates his purity by attacking anyone who breaks the rules.",
      "Every society has these people. All that changes is the rules they enforce. In Victorian England it was Christian virtue. In Stalin's Russia it was orthodox Marxism-Leninism. For the woke, it's social justice.So if you want to understand wokeness, the question to ask is not why people behave this way.",
      "Every society has prigs. The question to ask is why our prigs are priggish about these ideas, at this moment. And to answer that we have to ask when and where wokeness began.The answer to the first question is the 1980s.",
      "Wokeness is a second, more aggressive wave of political correctness, which started in the late 1980s, died down in the late 1990s, and then returned with a vengeance in the early 2010s, finally peaking after the riots of 2020.What was political correctness, exactly?",
      "I'm often asked to define both this term and wokeness by people who think they're meaningless labels, so I will. They both have the same definition: An aggressively performative focus on social justice.",
      "In other words, it's people being prigs about social justice. And that's the real problem — the performativeness, not the social justice. [0]Racism, for example, is a genuine problem. Not a problem on the scale that the woke believe it to be, but a genuine one.",
      "I don't think any reasonable person would deny that. The problem with political correctness was not that it focused on marginalized groups, but the shallow, aggressive way in which it did so. Instead of going out into the world and quietly helping members of marginalized groups, the politically correct focused on getting people in trouble for using the wrong words to talk about them.As for where political correctness began, if you think about it, you probably already know the answer.",
      "Did it begin outside universities and spread to them from this external source? Obviously not; it has always been most extreme in universities. So where in universities did it begin? Did it begin in math, or the hard sciences, or engineering, and spread from there to the humanities and social sciences?",
      "Those are amusing images, but no, obviously it began in the humanities and social sciences.Why there? And why then? What happened in the humanities and social sciences in the 1980s?A successful theory of the origin of political correctness has to be able to explain why it didn't happen earlier.",
      "Why didn't it happen during the protest movements of the 1960s, for example? They were concerned with much the same issues. [1]The reason the student protests of the 1960s didn't lead to political correctness was precisely that — they were student movements.",
      "They didn't have any real power. The students may have been talking a lot about women's liberation and black power, but it was not what they were being taught in their classes. Not yet.But in the early 1970s the student protestors of the 1960s began to finish their dissertations and get hired as professors.",
      "At first they were neither powerful nor numerous. But as more of their peers joined them and the previous generation of professors started to retire, they gradually became both.The reason political correctness began in the humanities and social sciences was that these fields offered more scope for the injection of politics.",
      "A 1960s radical who got a job as a physics professor could still attend protests, but his political beliefs wouldn't affect his work. Whereas research in sociology and modern literature can be made as political as you like.",
      "[2]I saw political correctness arise. When I started college in 1982 it was not yet a thing. Female students might object if someone said something they considered sexist, but no one was getting reported for it.",
      "It was still not a thing when I started grad school in 1986. It was definitely a thing in 1988 though, and by the early 1990s it seemed to pervade campus life.What happened? How did protest become punishment?",
      "Why were the late 1980s the point at which protests against male chauvinism (as it used to be called) morphed into formal complaints to university authorities about sexism? Basically, the 1960s radicals got tenure.",
      "They became the Establishment they'd protested against two decades before. Now they were in a position not just to speak out about their ideas, but to enforce them.A new set of moral rules to enforce was exciting news to a certain kind of student.",
      "What made it particularly exciting was that they were allowed to attack professors. I remember noticing that aspect of political correctness at the time. It wasn't simply a grass-roots student movement.",
      "It was faculty members encouraging students to attack other faculty members. In that respect it was like the Cultural Revolution. That wasn't a grass-roots movement either; that was Mao unleashing the younger generation on his political opponents.",
      "And in fact when Roderick MacFarquhar started teaching a class on the Cultural Revolution at Harvard in the late 1980s, many saw it as a comment on current events. I don't know if it actually was, but people thought it was, and that means the similarities were obvious.",
      "[3]College students larp. It's their nature. It's usually harmless. But larping morality turned out to be a poisonous combination. The result was a kind of moral etiquette, superficial but very complicated.",
      "Imagine having to explain to a well-meaning visitor from another planet why using the phrase \"people of color\" is considered particularly enlightened, but saying \"colored people\" gets you fired. And why exactly one isn't supposed to use the word \"negro\" now, even though Martin Luther King used it constantly in his speeches.",
      "There are no underlying principles. You'd just have to give him a long list of rules to memorize. [4] The danger of these rules was not just that they created land mines for the unwary, but that their elaborateness made them an effective substitute for virtue.",
      "Whenever a society has a concept of heresy and orthodoxy, orthodoxy becomes a substitute for virtue. You can be the worst person in the world, but as long as you're orthodox you're better than everyone who isn't.",
      "This makes orthodoxy very attractive to bad people.But for it to work as a substitute for virtue, orthodoxy must be difficult. If all you have to do to be orthodox is wear some garment or avoid saying some word, everyone knows to do it, and the only way to seem more virtuous than other people is to actually be virtuous.",
      "The shallow, complicated, and frequently changing rules of political correctness made it the perfect substitute for actual virtue. And the result was a world in which good people who weren't up to date on current moral fashions were brought down by people whose characters would make you recoil in horror if you could see them.One big contributing factor in the rise of political correctness was the lack of other things to be morally pure about.",
      "Previous generations of prigs had been prigs mostly about religion and sex. But among the cultural elite these were the deadest of dead letters by the 1980s; if you were religious, or a virgin, this was something you tended to conceal rather than advertise.",
      "So the sort of people who enjoy being moral enforcers had become starved of things to enforce. A new set of rules was just what they'd been waiting for.Curiously enough, the tolerant side of the 1960s left helped create the conditions in which the intolerant side prevailed.",
      "The relaxed social rules advocated by the old, easy-going hippy left became the dominant ones, at least among the elite, and this left nothing for the naturally intolerant to be intolerant about.Another possibly contributing factor was the fall of the Soviet empire.",
      "Marxism had been a popular focus of moral purity on the left before political correctness emerged as a competitor, but the pro-democracy movements in Eastern Bloc countries took most of the shine off it.",
      "Especially the fall of the Berlin Wall in 1989. You couldn't be on the side of the Stasi. I remember looking at the moribund Soviet Studies section of a used bookshop in Cambridge in the late 1980s and thinking \"what will those people go on about now?\" As it turned out the answer was right under my nose.One thing I noticed at the time about the first phase of political correctness was that it was more popular with women than men.",
      "As many writers (perhaps most eloquently George Orwell) have observed, women seem more attracted than men to the idea of being moral enforcers. But there was another more specific reason women tended to be the enforcers of political correctness.",
      "There was at this time a great backlash against sexual harassment; the mid 1980s were the point when the definition of sexual harassment was expanded from explicit sexual advances to creating a \"hostile environment.\" Within universities the classic form of accusation was for a (female) student to say that a professor made her \"feel uncomfortable.\" But the vagueness of this accusation allowed the radius of forbidden behavior to expand to include talking about heterodox ideas.",
      "Those make people uncomfortable too. [5]Was it sexist to propose that Darwin's greater male variability hypothesis might explain some variation in human performance? Sexist enough to get Larry Summers pushed out as president of Harvard, apparently.",
      "One woman who heard the talk in which he mentioned this idea said it made her feel \"physically ill\" and that she had to leave halfway through. If the test of a hostile environment is how it makes people feel, this certainly sounds like one.",
      "And yet it does seem plausible that greater male variability explains some of the variation in human performance. So which should prevail, comfort or truth? Surely if truth should prevail anywhere, it should be in universities; that's supposed to be their specialty; but for decades starting in the late 1980s the politically correct tried to pretend this conflict didn't exist.",
      "[6]Political correctness seemed to burn out in the second half of the 1990s. One reason, perhaps the main reason, was that it literally became a joke. It offered rich material for comedians, who performed their usual disinfectant action upon it.",
      "Humor is one of the most powerful weapons against priggishness of any sort, because prigs, being humorless, can't respond in kind. Humor was what defeated Victorian prudishness, and by 2000 it seemed to have done the same thing to political correctness.Unfortunately this was an illusion.",
      "Within universities the embers of political correctness were still glowing brightly. After all, the forces that created it were still there. The professors who started it were now becoming deans and department heads.",
      "And in addition to their departments there were now a bunch of new ones explicitly focused on social justice. Students were still hungry for things to be morally pure about. And there had been an explosion in the number of university administrators, many of whose jobs involved enforcing various forms of political correctness.In the early 2010s the embers of political correctness burst into flame anew.",
      "There were several differences between this new phase and the original one. It was more virulent. It spread further into the real world, although it still burned hottest within universities. And it was concerned with a wider variety of sins.",
      "In the first phase of political correctness there were really only three things people got accused of: sexism, racism, and homophobia (which at the time was a neologism invented for the purpose). But between then and 2010 a lot of people had spent a lot of time trying to invent new kinds of -isms and -phobias and seeing which could be made to stick.The second phase was, in multiple senses, political correctness metastasized.",
      "Why did it happen when it did? My guess is that it was due to the rise of social media, particularly Tumblr and Twitter, because one of the most distinctive features of the second wave of political correctness was the cancel mob: a mob of angry people uniting on social media to get someone ostracized or fired.",
      "Indeed this second wave of political correctness was originally called \"cancel culture\"; it didn't start to be called \"wokeness\" till the 2020s.One aspect of social media that surprised almost everyone at first was the popularity of outrage.",
      "Users seemed to like being outraged. We're so used to this idea now that we take it for granted, but really it's pretty strange. Being outraged is not a pleasant feeling. You wouldn't expect people to seek it out.",
      "But they do. And above all, they want to share it. I happened to be running a forum from 2007 to 2014, so I can actually quantify how much they want to share it: our users were about three times more likely to upvote something if it outraged them.This tilt toward outrage wasn't due to wokeness.",
      "It's an inherent feature of social media, or at least this generation of it. But it did make social media the perfect mechanism for fanning the flames of wokeness. [7]It wasn't just public social networks that drove the rise of wokeness though.",
      "Group chat apps were also critical, especially in the final step, cancellation. Imagine if a group of employees trying to get someone fired had to do it using only email. It would be hard to organize a mob.",
      "But once you have group chat, mobs form naturally.Another contributing factor in this second wave of political correctness was the dramatic increase in the polarization of the press. In the print era, newspapers were constrained to be, or at least seem, politically neutral.",
      "The department stores that ran ads in the New York Times wanted to reach everyone in the region, both liberal and conservative, so the Times had to serve both. But the Times didn't regard this neutrality as something forced upon them.",
      "They embraced it as their duty as a paper of record — as one of the big newspapers that aimed to be chronicles of their times, reporting every sufficiently important story from a neutral point of view.When I grew up the papers of record seemed timeless, almost sacred institutions.",
      "Papers like the New York Times and Washington Post had immense prestige, partly because other sources of news were limited, but also because they did make some effort to be neutral.Unfortunately it turned out that the paper of record was mostly an artifact of the constraints imposed by print.",
      "[8] When your market was determined by geography, you had to be neutral. But publishing online enabled — in fact probably forced — newspapers to switch to serving markets defined by ideology instead of geography.",
      "Most that remained in business fell in the direction they'd already been leaning: left. On October 11, 2020 the New York Times announced that \"The paper is in the midst of an evolution from the stodgy paper of record into a juicy collection of great narratives.\" [9] Meanwhile journalists, of a sort, had arisen to serve the right as well.",
      "And so journalism, which in the previous era had been one of the great centralizing forces, now became one of the great polarizing ones.The rise of social media and the increasing polarization of journalism reinforced one another.",
      "In fact there arose a new variety of journalism involving a loop through social media. Someone would say something controversial on social media. Within hours it would become a news story. Outraged readers would then post links to the story on social media, driving further arguments online.",
      "It was the cheapest source of clicks imaginable. You didn't have to maintain overseas news bureaus or pay for month-long investigations. All you had to do was watch Twitter for controversial remarks and repost them on your site, with some additional comments to inflame readers further.For the press there was money in wokeness.",
      "But they weren't the only ones. That was one of the biggest differences between the two waves of political correctness: the first was driven almost entirely by amateurs, but the second was often driven by professionals.",
      "For some it was their whole job. By 2010 a new class of administrators had arisen whose job was basically to enforce wokeness. They played a role similar to that of the political commissars who got attached to military and industrial organizations in the USSR: they weren't directly in the flow of the organization's work, but watched from the side to ensure that nothing improper happened in the doing of it.",
      "These new administrators could often be recognized by the word \"inclusion\" in their titles. Within institutions this was the preferred euphemism for wokeness; a new list of banned words, for example, would usually be called an \"inclusive language guide.\" [10]This new class of bureaucrats pursued a woke agenda as if their jobs depended on it, because they did.",
      "If you hire people to keep watch for a particular type of problem, they're going to find it, because otherwise there's no justification for their existence. [11] But these bureaucrats also represented a second and possibly even greater danger.",
      "Many were involved in hiring, and when possible they tried to ensure their employers hired only people who shared their political beliefs. The most egregious cases were the new \"DEI statements\" that some universities started to require from faculty candidates, proving their commitment to wokeness.",
      "Some universities used these statements as the initial filter and only even considered candidates who scored high enough on them. You're not hiring Einstein that way; imagine what you get instead.Another factor in the rise of wokeness was the Black Lives Matter movement, which started in 2013 when a white man was acquitted after killing a black teenager in Florida.",
      "But this didn't launch wokeness; it was well underway by 2013.Similarly for the Me Too Movement, which took off in 2017 after the first news stories about Harvey Weinstein's history of raping women. It accelerated wokeness, but didn't play the same role in launching it that the 80s version did in launching political correctness.The election of Donald Trump in 2016 also accelerated wokeness, particularly in the press, where outrage now meant traffic.",
      "Trump made the New York Times a lot of money: headlines during his first administration mentioned his name at about four times the rate of previous presidents.In 2020 we saw the biggest accelerant of all, after a white police officer asphyxiated a black suspect on video.",
      "At this point the metaphorical fire became a literal one, as violent protests broke out across America. But in retrospect this turned out to be peak woke, or close to it. By every measure I've seen, wokeness peaked in 2020 or 2021.Wokeness is sometimes described as a mind-virus.",
      "What makes it viral is that it defines new types of impropriety. Most people are afraid of impropriety; they're never exactly sure what the social rules are or which ones they might be breaking. Especially if the rules change rapidly.",
      "And since most people already worry that they might be breaking rules they don't know about, if you tell them they're breaking a rule, their default reaction is to believe you. Especially if multiple people tell them.",
      "Which in turn is a recipe for exponential growth. Zealots invent some new impropriety to avoid. The first people to adopt it are fellow zealots, eager for new ways to signal their virtue. If there are enough of these, the initial group of zealots is followed by a much larger group, motivated by fear.",
      "They're not trying to signal virtue; they're just trying to avoid getting in trouble. At this point the new impropriety is now firmly established. Plus its success has increased the rate of change in social rules, which, remember, is one of the reasons people are nervous about which rules they might be breaking.",
      "So the cycle accelerates. [12]What's true of individuals is even more true of organizations. Especially organizations without a powerful leader. Such organizations do everything based on \"best practices.\" There's no higher authority; if some new \"best practice\" achieves critical mass, they must adopt it.",
      "And in this case the organization can't do what it usually does when it's uncertain: delay. It might be committing improprieties right now! So it's surprisingly easy for a small group of zealots to capture this type of organization by describing new improprieties it might be guilty of.",
      "[13]How does this kind of cycle ever end? Eventually it leads to disaster, and people start to say enough is enough. The excesses of 2020 made a lot of people say that.Since then wokeness has been in gradual but continual retreat.",
      "Corporate CEOs, starting with Brian Armstrong, have openly rejected it. Universities, led by the University of Chicago and MIT, have explicitly confirmed their commitment to free speech. Twitter, which was arguably the hub of wokeness, was bought by Elon Musk in order to neutralize it, and he seems to have succeeded — and not, incidentally, by censoring left-wing users the way Twitter used to censor right-wing ones, but without censoring either.",
      "[14] Consumers have emphatically rejected brands that ventured too far into wokeness. The Bud Light brand may have been permanently damaged by it. I'm not going to claim Trump's second victory in 2024 was a referendum on wokeness; I think he won, as presidential candidates always do, because he was more charismatic; but voters' disgust with wokeness must have helped.So what do we do now?",
      "Wokeness is already in retreat. Obviously we should help it along. What's the best way to do that? And more importantly, how do we avoid a third outbreak? After all, it seemed to be dead once, but came back worse than ever.In fact there's an even more ambitious goal: is there a way to prevent any similar outbreak of aggressively performative moralism in the future — not just a third outbreak of political correctness, but the next thing like it?",
      "Because there will be a next thing. Prigs are prigs by nature. They need rules to obey and enforce, and now that Darwin has cut off their traditional supply of rules, they're constantly hungry for new ones.",
      "All they need is someone to meet them halfway by defining a new way to be morally pure, and we'll see the same phenomenon again.Let's start with the easier problem. Is there a simple, principled way to deal with wokeness?",
      "I think there is: to use the customs we already have for dealing with religion. Wokeness is effectively a religion, just with God replaced by protected classes. It's not even the first religion of this kind; Marxism had a similar form, with God replaced by the masses.",
      "[15] And we already have well-established customs for dealing with religion within organizations. You can express your own religious identity and explain your beliefs, but you can't call your coworkers infidels if they disagree, or try to ban them from saying things that contradict its doctrines, or insist that the organization adopt yours as its official religion.If we're not sure what to do about any particular manifestation of wokeness, imagine we were dealing with some other religion, like Christianity.",
      "Should we have people within organizations whose jobs are to enforce woke orthodoxy? No, because we wouldn't have people whose jobs were to enforce Christian orthodoxy. Should we censor writers or scientists whose work contradicts woke doctrines?",
      "No, because we wouldn't do this to people whose work contradicted Christian teachings. Should job candidates be required to write DEI statements? Of course not; imagine an employer requiring proof of one's religious beliefs.",
      "Should students and employees have to participate in woke indoctrination sessions in which they're required to answer questions about their beliefs to ensure compliance? No, because we wouldn't dream of catechizing people in this way about their religion.",
      "[16]One shouldn't feel bad about not wanting to watch woke movies any more than one would feel bad about not wanting to listen to Christian rock. In my twenties I drove across America several times, listening to local radio stations.",
      "Occasionally I'd turn the dial and hear some new song. But the moment anyone mentioned Jesus I'd turn the dial again. Even the tiniest bit of being preached to was enough to make me lose interest.But by the same token we should not automatically reject everything the woke believe.",
      "I'm not a Christian, but I can see that many Christian principles are good ones. It would be a mistake to discard them all just because one didn't share the religion that espoused them. It would be the sort of thing a religious zealot would do.If we have genuine pluralism, I think we'll be safe from future outbreaks of woke intolerance.",
      "Wokeness itself won't go away. There will for the foreseeable future continue to be pockets of woke zealots inventing new moral fashions. The key is not to let them treat their fashions as normative.",
      "They can change what their coreligionists are allowed to say every few months if they like, but they mustn't be allowed to change what we're allowed to say. [17]The more general problem — how to prevent similar outbreaks of aggressively performative moralism — is of course harder.",
      "Here we're up against human nature. There will always be prigs. And in particular there will always be the enforcers among them, the aggressively conventional-minded. These people are born that way. Every society has them.",
      "So the best we can do is to keep them bottled up.The aggressively conventional-minded aren't always on the rampage. Usually they just enforce whatever random rules are nearest to hand. They only become dangerous when some new ideology gets a lot of them pointed in the same direction at once.",
      "That's what happened during the Cultural Revolution, and to a lesser extent (thank God) in the two waves of political correctness we've experienced.We can't get rid of the aggressively conventional-minded.",
      "[18] And we couldn't prevent people from creating new ideologies that appealed to them even if we wanted to. So if we want to keep them bottled up, we have to do it one step downstream. Fortunately when the aggressively conventional-minded go on the rampage they always do one thing that gives them away: they define new heresies to punish people for.",
      "So the best way to protect ourselves from future outbreaks of things like wokeness is to have powerful antibodies against the concept of heresy.We should have a conscious bias against defining new forms of heresy.",
      "Whenever anyone tries to ban saying something that we'd previously been able to say, our initial assumption should be that they're wrong. Only our initial assumption of course. If they can prove we should stop saying it, then we should.",
      "But the burden of proof is on them. In liberal democracies, people trying to prevent something from being said will usually claim they're not merely engaging in censorship, but trying to prevent some form of \"harm\".",
      "And maybe they're right. But once again, the burden of proof is on them. It's not enough to claim harm; they have to prove it.As long as the aggressively conventional-minded continue to give themselves away by banning heresies, we'll always be able to notice when they become aligned behind some new ideology.",
      "And if we always fight back at that point, with any luck we can stop them in their tracks.The number of true things we can't say should not increase. If it does, something is wrong.Notes[0] This was not the original meaning of \"woke,\" but it's rarely used in the original sense now.",
      "Now the pejorative sense is the dominant one.[1] Why did 1960s radicals focus on the causes they did? One of the people who reviewed drafts of this essay explained this so well that I asked if I could quote him: The middle-class student protestors of the New Left rejected the socialist/Marxist left as unhip.",
      "They were interested in sexier forms of oppression uncovered by cultural analysis (Marcuse) and abstruse \"Theory\". Labor politics became stodgy and old-fashioned. This took a couple generations to work through.",
      "The woke ideology's conspicuous lack of interest in the working class is the tell-tale sign. Such fragments as are, er, left of the old left are anti-woke, and meanwhile the actual working class shifted to the populist right and gave us Trump.",
      "Trump and wokeness are cousins.The middle-class origins of wokeness smoothed its way through the institutions because it had no interest in \"seizing the means of production\" (how quaint such phrases seem now), which would quickly have run up against hard state and corporate power.",
      "The fact that wokeness only expressed interest in other kinds of class (race, sex, etc) signalled compromise with existing power: give us power within your system and we'll bestow the resource we control — moral rectitude — upon you.",
      "As an ideological stalking horse for gaining control over discourse and institutions, this succeeded where a more ambitious revolutionary program would not have. [2] It helped that the humanities and social sciences also included some of the biggest and easiest undergrad majors.",
      "If a political movement had to start with physics students, it could never get off the ground; there would be too few of them, and they wouldn't have the time to spare.At the top universities these majors are not as big as they used to be, though.",
      "A 2022 survey found that only 7% of Harvard undergrads plan to major in the humanities, vs nearly 30% during the 1970s. I expect wokeness is at least part of the reason; when undergrads consider majoring in English, it's presumably because they love the written word and not because they want to listen to lectures about racism.[3] The puppet-master-and-puppet character of political correctness became clearly visible when a bakery near Oberlin College was falsely accused of race discrimination in 2016.",
      "In the subsequent civil trial, lawyers for the bakery produced a text message from Oberlin Dean of Students Meredith Raimondo that read \"I'd say unleash the students if I wasn't convinced this needs to be put behind us.\"[4] The woke sometimes claim that wokeness is simply treating people with respect.",
      "But if it were, that would be the only rule you'd have to remember, and this is comically far from being the case. My younger son likes to imitate voices, and at one point when he was about seven I had to explain which accents it was currently safe to imitate publicly and which not.",
      "It took about ten minutes, and I still hadn't covered all the cases.[5] In 1986 the Supreme Court ruled that creating a hostile work environment could constitute sex discrimination, which in turn affected universities via Title IX.",
      "The court specified that the test of a hostile environment was whether it would bother a reasonable person, but since for a professor merely being the subject of a sexual harassment complaint would be a disaster whether the complainant was reasonable or not, in practice any joke or remark remotely connected with sex was now effectively forbidden.",
      "Which meant we'd now come full circle to Victorian codes of behavior, when there was a large class of things that might not be said \"with ladies present.\"[6] Much as they tried to pretend there was no conflict between diversity and quality.",
      "But you can't simultaneously optimize for two things that aren't identical. What diversity actually means, judging from the way the term is used, is proportional representation, and unless you're selecting a group whose purpose is to be representative, like poll respondents, optimizing for proportional representation has to come at the expense of quality.",
      "This is not because of anything about representation; it's the nature of optimization; optimizing for x has to come at the expense of y unless x and y are identical.[7] Maybe societies will eventually develop antibodies to viral outrage.",
      "Maybe we were just the first to be exposed to it, so it tore through us like an epidemic through a previously isolated population. I'm fairly confident that it would be possible to create new social media apps that were less driven by outrage, and an app of this type would have a good chance of stealing users from existing ones, because the smartest people would tend to migrate to it.[8] I say \"mostly\" because I have hopes that journalistic neutrality will return in some form.",
      "There is some market for unbiased news, and while it may be small, it's valuable. The rich and powerful want to know what's really going on; that's how they became rich and powerful.[9] The Times made this momentous announcement very informally, in passing in the middle of an article about a Times reporter who'd been criticized for inaccuracy.",
      "It's quite possible no senior editor even approved it. But it's somehow appropriate that this particular universe ended with a whimper rather than a bang.[10] As the acronym DEI goes out of fashion, many of these bureaucrats will try to go underground by changing their titles.",
      "It looks like \"belonging\" will be a popular option.[11] If you've ever wondered why our legal system includes protections like the separation of prosecutor, judge, and jury, the right to examine evidence and cross-examine witnesses, and the right to be represented by legal counsel, the de facto parallel legal system established by Title IX makes that all too clear.[12] The invention of new improprieties is most visible in the rapid evolution of woke nomenclature.",
      "This is particularly annoying to me as a writer, because the new names are always worse. Any religious observance has to be inconvenient and slightly absurd; otherwise gentiles would do it too. So \"slaves\" becomes \"enslaved individuals.\" But web search can show us the leading edge of moral growth in real time: if you search for \"individuals experiencing slavery\" you will as of this writing find five legit attempts to use the phrase, and you'll even find two for \"individuals experiencing enslavement.\"[13] Organizations that do dubious things are particularly concerned with propriety, which is how you end up with absurdities like tobacco and oil companies having higher ESG ratings than Tesla.[14] Elon did something else that tilted Twitter rightward though: he gave more visibility to paying users.",
      "Paying users lean right on average, because people on the far left dislike Elon and don't want to give him money. Elon presumably knew this would happen. On the other hand, the people on the far left have only themselves to blame; they could tilt Twitter back to the left tomorrow if they wanted to.[15] It even, as James Lindsay and Peter Boghossian pointed out, has a concept of original sin: privilege.",
      "Which means unlike Christianity's egalitarian version, people have varying degrees of it. An able-bodied straight white American male is born with such a load of sin that only by the most abject repentance can he be saved.Wokeness also shares something rather funny with many actual versions of Christianity: like God, the people for whose sake wokeness purports to act are often revolted by the things done in their name.[16] There is one exception to most of these rules: actual religious organizations.",
      "It's reasonable for them to insist on orthodoxy. But they in turn should declare that they're religious organizations. It's rightly considered shady when something that appears to be an ordinary business or publication turns out to be a religious organization.[17] I don't want to give the impression that it will be simple to roll back wokeness.",
      "There will be places where the fight inevitably gets messy — particularly within universities, which everyone has to share, yet which are currently the most pervaded by wokeness of any institutions.[18] You can however get rid of aggressively conventional-minded people within an organization, and in many if not most organizations this would be an excellent idea.",
      "Even a handful of them can do a lot of damage. I bet you'd feel a noticeable improvement going from a handful to none.Thanks to Sam Altman, Ben Miller, Daniel Gackle, Robin Hanson, Jessica Livingston, Greg Lukianoff, Harj Taggar, Garry Tan, and Tim Urban for reading drafts of this."
    ],
    "word_count": 6083,
    "paragraph_count": 123
  },
  "processed_at": "2025-07-26T19:01:31.237078",
  "paragraphs": [
    {
      "original": "January 2025The word \"prig\" isn't very common now, but if you look up the definition, it will sound familiar. Google's isn't bad: A self-righteously moralistic person who behaves as if superior to others.",
      "translated": "2025年1月\n“道学先生”这个词现在不怎么常用了，但如果你查一下它的定义，听起来会很熟悉。谷歌的定义还不错：一个自以为道德高尚、行为举止仿佛比别人优越的人。"
    },
    {
      "original": "This sense of the word originated in the 18th century, and its age is an important clue: it shows that although wokeness is a comparatively recent phenomenon, it's an instance of a much older one.There's a certain kind of person who's attracted to a shallow, exacting kind of moral purity, and who demonstrates his purity by attacking anyone who breaks the rules.",
      "translated": "这个词的这种用法起源于18世纪，其年代是一个重要的线索：它表明，尽管“觉醒”是一种相对较新的现象，但它是一个更为古老的现象的例证。有一种人被一种肤浅、严格意义上的道德纯洁所吸引，并通过攻击任何违反规则的人来展示自己的纯洁。"
    },
    {
      "original": "Every society has these people. All that changes is the rules they enforce. In Victorian England it was Christian virtue. In Stalin's Russia it was orthodox Marxism-Leninism. For the woke, it's social justice.So if you want to understand wokeness, the question to ask is not why people behave this way.",
      "translated": "每个社会都有这样的人。变化的只是他们所执行的规则。在维多利亚时代的英国，那是基督教的美德。在斯大林的俄国，那是正统的马克思主义-列宁主义。对于觉醒者来说，那是社会正义。所以，如果你想理解觉醒主义，需要问的问题不是为什么人们会有这样的行为。"
    },
    {
      "original": "Every society has prigs. The question to ask is why our prigs are priggish about these ideas, at this moment. And to answer that we have to ask when and where wokeness began.The answer to the first question is the 1980s.",
      "translated": "每个社会都有道学家。问题在于，为什么我们现在的道学家会对这些思想表现出道学气，而且是在这个时刻。要回答这个问题，我们必须追问觉醒主义是在何时何地开始的。对于第一个问题，答案是20世纪80年代。"
    },
    {
      "original": "Wokeness is a second, more aggressive wave of political correctness, which started in the late 1980s, died down in the late 1990s, and then returned with a vengeance in the early 2010s, finally peaking after the riots of 2020.What was political correctness, exactly?",
      "translated": "觉醒主义是政治正确的一种第二波、更为激进的形式，始于20世纪80年代末，90年代末逐渐消退，然后在21世纪10年代初卷土重来，并在2020年骚乱之后达到顶峰。那么，政治正确到底是什么？"
    },
    {
      "original": "I'm often asked to define both this term and wokeness by people who think they're meaningless labels, so I will. They both have the same definition: An aggressively performative focus on social justice.",
      "translated": "我经常被要求定义这两个术语，而提问的人通常认为它们只是没有实际意义的标签，所以我来解释一下。这两个词的定义是相同的：一种对社会正义表现出强烈表演性的关注。"
    },
    {
      "original": "In other words, it's people being prigs about social justice. And that's the real problem — the performativeness, not the social justice. [0]Racism, for example, is a genuine problem. Not a problem on the scale that the woke believe it to be, but a genuine one.",
      "translated": "换句话说，这是人们在社会正义问题上自以为是。而真正的问题在于表现主义，而不是社会正义本身。种族主义，例如，确实是一个问题。虽然问题的严重程度不像那些觉醒者认为的那样，但确实是一个真实的问题。"
    },
    {
      "original": "I don't think any reasonable person would deny that. The problem with political correctness was not that it focused on marginalized groups, but the shallow, aggressive way in which it did so. Instead of going out into the world and quietly helping members of marginalized groups, the politically correct focused on getting people in trouble for using the wrong words to talk about them.As for where political correctness began, if you think about it, you probably already know the answer.",
      "translated": "我认为任何一个理智的人都不会否认这一点。政治正确的问题不在于它关注了边缘化群体，而在于它以一种肤浅、激进的方式去关注。政治正确的人没有走出去，默默地帮助边缘化群体的成员，而是专注于因为别人用错了词来谈论他们而让别人陷入麻烦。至于政治正确是从哪里开始的，如果你仔细想想，你可能已经知道答案了。"
    },
    {
      "original": "Did it begin outside universities and spread to them from this external source? Obviously not; it has always been most extreme in universities. So where in universities did it begin? Did it begin in math, or the hard sciences, or engineering, and spread from there to the humanities and social sciences?",
      "translated": "它是否起源于大学之外，然后从这个外部来源传播到大学？显然不是；它在大学里一直最为极端。那么，它是在大学的哪个领域开始的？是在数学、自然科学或工程学开始，然后从那里传播到人文和社会科学的吗？"
    },
    {
      "original": "Those are amusing images, but no, obviously it began in the humanities and social sciences.Why there? And why then? What happened in the humanities and social sciences in the 1980s?A successful theory of the origin of political correctness has to be able to explain why it didn't happen earlier.",
      "translated": "这些图像确实有趣，但显然它起源于人文和社会科学。为什么会在那里？为什么会在那个时期？20世纪80年代人文和社会科学领域发生了什么？一个成功的政治正确起源理论必须能够解释为什么这种现象没有更早出现。"
    },
    {
      "original": "Why didn't it happen during the protest movements of the 1960s, for example? They were concerned with much the same issues. [1]The reason the student protests of the 1960s didn't lead to political correctness was precisely that — they were student movements.",
      "translated": "为什么在20世纪60年代的抗议运动中没有发生这种情况，例如？它们关注的正是类似的问题。20世纪60年代的学生抗议没有导致政治正确性的原因恰恰在于——它们是学生运动。"
    },
    {
      "original": "They didn't have any real power. The students may have been talking a lot about women's liberation and black power, but it was not what they were being taught in their classes. Not yet.But in the early 1970s the student protestors of the 1960s began to finish their dissertations and get hired as professors.",
      "translated": "他们并没有真正的权力。学生们可能在大量谈论女性解放和黑人权力，但这并不是他们在课堂上所学的内容。还不到时候。但到了20世纪70年代初，20世纪60年代的学生抗议者开始完成他们的博士论文，并被聘为教授。"
    },
    {
      "original": "At first they were neither powerful nor numerous. But as more of their peers joined them and the previous generation of professors started to retire, they gradually became both.The reason political correctness began in the humanities and social sciences was that these fields offered more scope for the injection of politics.",
      "translated": "起初，他们既不强大也不多。但随着更多的同行加入，以及老一代教授开始退休，他们逐渐变得既强大又多。政治正确之所以首先在人文和社会科学领域兴起，是因为这些领域为注入政治提供了更多的空间。"
    },
    {
      "original": "A 1960s radical who got a job as a physics professor could still attend protests, but his political beliefs wouldn't affect his work. Whereas research in sociology and modern literature can be made as political as you like.",
      "translated": "20世纪60年代的激进分子如果成为物理教授，仍然可以参加抗议活动，但他的政治信仰不会影响他的工作。然而，社会学和现代文学的研究则可以变得非常政治化。"
    },
    {
      "original": "[2]I saw political correctness arise. When I started college in 1982 it was not yet a thing. Female students might object if someone said something they considered sexist, but no one was getting reported for it.",
      "translated": "我见证了政治正确的兴起。1982年我上大学时，这还不是一个流行的概念。女学生可能会对被认为是性别歧视的言论提出异议，但没有人因此被举报。"
    },
    {
      "original": "It was still not a thing when I started grad school in 1986. It was definitely a thing in 1988 though, and by the early 1990s it seemed to pervade campus life.What happened? How did protest become punishment?",
      "translated": "1986年我开始读研究生时，这还不算什么。但到了1988年，这确实成了一种现象，到了20世纪90年代初，似乎已经渗透到了校园生活的方方面面。发生了什么？抗议是如何变成惩罚的？"
    },
    {
      "original": "Why were the late 1980s the point at which protests against male chauvinism (as it used to be called) morphed into formal complaints to university authorities about sexism? Basically, the 1960s radicals got tenure.",
      "translated": "为什么20世纪80年代末反对男性沙文主义（当时所称的）的抗议活动转变为向大学当局正式投诉性别歧视？基本上，20世纪60年代的激进分子获得了终身教职。"
    },
    {
      "original": "They became the Establishment they'd protested against two decades before. Now they were in a position not just to speak out about their ideas, but to enforce them.A new set of moral rules to enforce was exciting news to a certain kind of student.",
      "translated": "他们成了二十年前曾抗议过的那个既得利益集团。如今，他们不仅能够畅所欲言地表达自己的观点，还能强制执行这些观点。对于某些类型的学生来说，有一套新的道德规则可以强制执行，这无疑是一个令人兴奋的消息。"
    },
    {
      "original": "What made it particularly exciting was that they were allowed to attack professors. I remember noticing that aspect of political correctness at the time. It wasn't simply a grass-roots student movement.",
      "translated": "特别令人兴奋的是，他们被允许攻击教授。我记得当时注意到了这种政治正确的表现。这不仅仅是一场自下而上的学生运动。"
    },
    {
      "original": "It was faculty members encouraging students to attack other faculty members. In that respect it was like the Cultural Revolution. That wasn't a grass-roots movement either; that was Mao unleashing the younger generation on his political opponents.",
      "translated": "这是教师们鼓动学生去攻击其他教师。在这方面，它就像文革一样。那也不是一场自下而上的运动；那是毛泽东利用年轻一代对付他的政治对手。"
    },
    {
      "original": "And in fact when Roderick MacFarquhar started teaching a class on the Cultural Revolution at Harvard in the late 1980s, many saw it as a comment on current events. I don't know if it actually was, but people thought it was, and that means the similarities were obvious.",
      "translated": "事实上，当罗德里克·麦克法夸尔在20世纪80年代末在哈佛大学开始教授关于文化大革命的课程时，许多人认为这是对当前事件的评论。我不知道这是否真的是这样，但人们确实这样认为，这意味着这些相似之处是显而易见的。"
    },
    {
      "original": "[3]College students larp. It's their nature. It's usually harmless. But larping morality turned out to be a poisonous combination. The result was a kind of moral etiquette, superficial but very complicated.",
      "translated": "[3]大学生玩角色扮演游戏。这是他们的天性。通常这没什么害处。但扮演道德却成了一种有毒的组合。结果产生了一种道德礼仪，表面化但非常复杂。"
    },
    {
      "original": "Imagine having to explain to a well-meaning visitor from another planet why using the phrase \"people of color\" is considered particularly enlightened, but saying \"colored people\" gets you fired. And why exactly one isn't supposed to use the word \"negro\" now, even though Martin Luther King used it constantly in his speeches.",
      "translated": "想象一下，你得向一位来自另一个星球的善意访客解释为什么使用“有色人种”这个短语被认为是非常开明的，而说“有色人”则会让你被解雇。以及为什么现在不建议使用“黑人”这个词，尽管马丁·路德·金在他的演讲中经常使用这个词。"
    },
    {
      "original": "There are no underlying principles. You'd just have to give him a long list of rules to memorize. [4] The danger of these rules was not just that they created land mines for the unwary, but that their elaborateness made them an effective substitute for virtue.",
      "translated": "没有基本原则。你只能给他一个长长的规则列表让他去记忆。[4] 这些规则的危险不仅在于它们为不谨慎的人埋下了地雷，还在于它们的繁琐使它们成为了美德的有效替代品。"
    },
    {
      "original": "Whenever a society has a concept of heresy and orthodoxy, orthodoxy becomes a substitute for virtue. You can be the worst person in the world, but as long as you're orthodox you're better than everyone who isn't.",
      "translated": "每当一个社会存在异端和正统的概念时，正统就成为了美德的替代品。你可能是世界上最坏的人，但只要你保持正统，就比所有不正统的人要好。"
    },
    {
      "original": "This makes orthodoxy very attractive to bad people.But for it to work as a substitute for virtue, orthodoxy must be difficult. If all you have to do to be orthodox is wear some garment or avoid saying some word, everyone knows to do it, and the only way to seem more virtuous than other people is to actually be virtuous.",
      "translated": "这使得正统对坏人非常有吸引力。但要使正统成为美德的替代品，它必须是困难的。如果要成为正统只需穿某种衣服或避免说某些话，每个人都知道该怎么做，而要显得比别人更 virtuous 唯一的方法就是真正具备美德。"
    },
    {
      "original": "The shallow, complicated, and frequently changing rules of political correctness made it the perfect substitute for actual virtue. And the result was a world in which good people who weren't up to date on current moral fashions were brought down by people whose characters would make you recoil in horror if you could see them.One big contributing factor in the rise of political correctness was the lack of other things to be morally pure about.",
      "translated": "浅薄、复杂且经常变化的政治正确规则使其成为实际美德的完美替代品。其结果是一个世界，在这个世界里，那些没有跟上当前道德时尚的好人被那些如果你能看到他们的真实面目就会感到恐怖的人所摧毁。政治正确的兴起的一个重要原因是对其他事物保持道德纯洁的缺乏。"
    },
    {
      "original": "Previous generations of prigs had been prigs mostly about religion and sex. But among the cultural elite these were the deadest of dead letters by the 1980s; if you were religious, or a virgin, this was something you tended to conceal rather than advertise.",
      "translated": "上一代的道学先生们大多在宗教和性方面表现出道学态度。但到了20世纪80年代，这些在文化精英中已经是过时的话题；如果你是宗教信徒，或仍是处子之身，这往往是你会隐藏而不是宣扬的事情。"
    },
    {
      "original": "So the sort of people who enjoy being moral enforcers had become starved of things to enforce. A new set of rules was just what they'd been waiting for.Curiously enough, the tolerant side of the 1960s left helped create the conditions in which the intolerant side prevailed.",
      "translated": "因此，那些喜欢扮演道德执法者的人发现缺乏可以执法的对象。一套新的规则正是他们所期待的。有趣的是，20世纪60年代左派中的宽容一方帮助创造了条件，使不宽容的一方得以胜出。"
    },
    {
      "original": "The relaxed social rules advocated by the old, easy-going hippy left became the dominant ones, at least among the elite, and this left nothing for the naturally intolerant to be intolerant about.Another possibly contributing factor was the fall of the Soviet empire.",
      "translated": "老一代随和的嬉皮士左派所倡导的宽松社会规则成为了主流，至少在精英阶层是这样，这使得那些本性不容忍的人无处发泄他们的不容忍。另一个可能的因素是苏联帝国的解体。"
    },
    {
      "original": "Marxism had been a popular focus of moral purity on the left before political correctness emerged as a competitor, but the pro-democracy movements in Eastern Bloc countries took most of the shine off it.",
      "translated": "在政治正确出现之前，马克思主义曾是左派道德纯洁的热门焦点，但东欧国家的民主运动使它失去了大部分光彩。"
    },
    {
      "original": "Especially the fall of the Berlin Wall in 1989. You couldn't be on the side of the Stasi. I remember looking at the moribund Soviet Studies section of a used bookshop in Cambridge in the late 1980s and thinking \"what will those people go on about now?\" As it turned out the answer was right under my nose.One thing I noticed at the time about the first phase of political correctness was that it was more popular with women than men.",
      "translated": "特别是1989年柏林墙的倒塌。你不可能站在史塔西那一边。我还记得在20世纪80年代末，我在剑桥的一家旧书店里看着那些奄奄一息的苏联研究书籍，心想“这些人以后会谈论些什么呢？”事实证明，答案就在我眼前。当时，我注意到政治正确的第一阶段的一个特点是，它更受女性欢迎，而不是男性。"
    },
    {
      "original": "As many writers (perhaps most eloquently George Orwell) have observed, women seem more attracted than men to the idea of being moral enforcers. But there was another more specific reason women tended to be the enforcers of political correctness.",
      "translated": "正如许多作家（或许最雄辩的是乔治·奥威尔）所观察到的，女性似乎比男性更倾向于成为道德的执行者。但还有另一个更为具体的原因，使得女性倾向于成为政治正确的执行者。"
    },
    {
      "original": "There was at this time a great backlash against sexual harassment; the mid 1980s were the point when the definition of sexual harassment was expanded from explicit sexual advances to creating a \"hostile environment.\" Within universities the classic form of accusation was for a (female) student to say that a professor made her \"feel uncomfortable.\" But the vagueness of this accusation allowed the radius of forbidden behavior to expand to include talking about heterodox ideas.",
      "translated": "当时，反对性骚扰的浪潮非常强烈；20世纪80年代中期是性骚扰定义从明确的性暗示扩大到创造“敌对环境”的转折点。在大学里，典型的指控是一名（女性）学生说教授让她“感到不舒服”。但这种指控的模糊性使得禁止行为的范围扩展到了包括谈论异端思想。"
    },
    {
      "original": "Those make people uncomfortable too. [5]Was it sexist to propose that Darwin's greater male variability hypothesis might explain some variation in human performance? Sexist enough to get Larry Summers pushed out as president of Harvard, apparently.",
      "translated": "这些也会让人们感到不适。[5]提出达尔文的男性更大变异假说可能解释人类表现的一些差异，这是否构成性别歧视？显然，这种观点性别歧视到足以让拉里·萨默斯被赶出哈佛校长的位置。"
    },
    {
      "original": "One woman who heard the talk in which he mentioned this idea said it made her feel \"physically ill\" and that she had to leave halfway through. If the test of a hostile environment is how it makes people feel, this certainly sounds like one.",
      "translated": "一位听到他提到这个想法的女性说，这让她感到“身体不适”，以至于她不得不中途离开。如果衡量敌对环境的标准是它让人有何感受，这无疑听起来像是一个。"
    },
    {
      "original": "And yet it does seem plausible that greater male variability explains some of the variation in human performance. So which should prevail, comfort or truth? Surely if truth should prevail anywhere, it should be in universities; that's supposed to be their specialty; but for decades starting in the late 1980s the politically correct tried to pretend this conflict didn't exist.",
      "translated": "然而，更大的男性变异性似乎确实可以解释人类表现中的一些差异。那么，应该优先考虑舒适还是真相？当然，如果真相应该在任何地方占上风，那应该是大学；这本应是他们的专长；但从20世纪80年代末开始的几十年里，政治正确的势力试图假装这种冲突不存在。"
    },
    {
      "original": "[6]Political correctness seemed to burn out in the second half of the 1990s. One reason, perhaps the main reason, was that it literally became a joke. It offered rich material for comedians, who performed their usual disinfectant action upon it.",
      "translated": "[6]政治正确似乎在20世纪90年代后半期逐渐消退。其中一个原因，也许是主要的原因，是它实际上变成了一个笑柄。它为喜剧演员提供了丰富的素材，而这些演员则像往常一样对它进行了讽刺性的消毒。"
    },
    {
      "original": "Humor is one of the most powerful weapons against priggishness of any sort, because prigs, being humorless, can't respond in kind. Humor was what defeated Victorian prudishness, and by 2000 it seemed to have done the same thing to political correctness.Unfortunately this was an illusion.",
      "translated": "幽默是对抗任何形式的道学气的最有力武器，因为道学气的人缺乏幽默感，无法以同样的方式回应。幽默曾击败了维多利亚时代的虚伪，到了2000年，似乎也对政治正确做了同样的事。不幸的是，这只是一个幻觉。"
    },
    {
      "original": "Within universities the embers of political correctness were still glowing brightly. After all, the forces that created it were still there. The professors who started it were now becoming deans and department heads.",
      "translated": "在大学里，政治正确的余烬仍然燃烧得十分旺盛。毕竟，创造这一现象的力量依然存在。那些最初倡导政治正确的教授们，现在正逐渐成为院长和系主任。"
    },
    {
      "original": "And in addition to their departments there were now a bunch of new ones explicitly focused on social justice. Students were still hungry for things to be morally pure about. And there had been an explosion in the number of university administrators, many of whose jobs involved enforcing various forms of political correctness.In the early 2010s the embers of political correctness burst into flame anew.",
      "translated": "除了原有的系别外，现在还增加了一批专门关注社会正义的新系别。学生们仍然渴望追求道德上的纯洁。大学行政人员的数量激增，其中许多人的工作涉及执行各种形式的政治正确。2010年代初，政治正确的余烬再次燃起熊熊大火。"
    },
    {
      "original": "There were several differences between this new phase and the original one. It was more virulent. It spread further into the real world, although it still burned hottest within universities. And it was concerned with a wider variety of sins.",
      "translated": "这个新阶段与原来有几个不同之处。它更具传染性。虽然它在大学里仍最为盛行，但已经进一步扩散到现实世界。而且，它关注的“罪行”种类更多。"
    },
    {
      "original": "In the first phase of political correctness there were really only three things people got accused of: sexism, racism, and homophobia (which at the time was a neologism invented for the purpose). But between then and 2010 a lot of people had spent a lot of time trying to invent new kinds of -isms and -phobias and seeing which could be made to stick.The second phase was, in multiple senses, political correctness metastasized.",
      "translated": "在政治正确性的第一阶段，人们真正被指责的只有三件事：性别歧视、种族歧视和同性恋恐惧症（当时这是为了这一目的而创造的一个新词）。但在这段时间和2010年之间，许多人花了大量时间试图发明新的-主义和-恐惧症，并看哪些能够被广泛接受。第二阶段在多个意义上可以说是政治正确性扩散了。"
    },
    {
      "original": "Why did it happen when it did? My guess is that it was due to the rise of social media, particularly Tumblr and Twitter, because one of the most distinctive features of the second wave of political correctness was the cancel mob: a mob of angry people uniting on social media to get someone ostracized or fired.",
      "translated": "为什么它会在那个时间发生？我认为这是由于社交媒体的兴起，尤其是Tumblr和Twitter，因为第二波政治正确浪潮中最显著的特征之一就是“取消文化”：一群愤怒的人在社交媒体上联合起来，目的是让某人被排斥或解雇。"
    },
    {
      "original": "Indeed this second wave of political correctness was originally called \"cancel culture\"; it didn't start to be called \"wokeness\" till the 2020s.One aspect of social media that surprised almost everyone at first was the popularity of outrage.",
      "translated": "确实，这第二波政治正确最初被称为“取消文化”；直到2020年代才开始被称为“觉醒主义”。社交媒体的一个方面最初几乎让所有人感到惊讶的是，人们对愤怒的追捧。"
    },
    {
      "original": "Users seemed to like being outraged. We're so used to this idea now that we take it for granted, but really it's pretty strange. Being outraged is not a pleasant feeling. You wouldn't expect people to seek it out.",
      "translated": "用户似乎喜欢感到愤怒。我们现在对这个想法已经习以为常，以至于认为这是理所当然的，但实际上这相当奇怪。感到愤怒并不是一种愉快的感觉。你不会期望人们会主动寻求这种感受。"
    },
    {
      "original": "But they do. And above all, they want to share it. I happened to be running a forum from 2007 to 2014, so I can actually quantify how much they want to share it: our users were about three times more likely to upvote something if it outraged them.This tilt toward outrage wasn't due to wokeness.",
      "translated": "但他们确实如此。而且最重要的是，他们想要分享。我从2007年到2014年恰好经营着一个论坛，因此我可以量化他们想要分享的程度：如果某件事让他们感到愤怒，我们的用户将其点赞的可能性大约是其他情况的三倍。这种倾向于愤怒的倾向并不是因为觉醒意识。"
    },
    {
      "original": "It's an inherent feature of social media, or at least this generation of it. But it did make social media the perfect mechanism for fanning the flames of wokeness. [7]It wasn't just public social networks that drove the rise of wokeness though.",
      "translated": "这是社交媒体的固有特性，至少是这一代的社交媒体。但这确实使社交媒体成为煽动觉醒主义的完美机制。[7]不过，推动觉醒主义兴起的不仅仅是公共社交网络。"
    },
    {
      "original": "Group chat apps were also critical, especially in the final step, cancellation. Imagine if a group of employees trying to get someone fired had to do it using only email. It would be hard to organize a mob.",
      "translated": "群聊应用也至关重要，尤其是在最后一步，即解雇阶段。试想，如果一群员工想要开除某人，却只能通过电子邮件来协调，那将很难组织起联合行动。"
    },
    {
      "original": "But once you have group chat, mobs form naturally.Another contributing factor in this second wave of political correctness was the dramatic increase in the polarization of the press. In the print era, newspapers were constrained to be, or at least seem, politically neutral.",
      "translated": "但是一旦有了群聊，群体就会自然形成。促成这次政治正确性浪潮的另一个因素是媒体极化的急剧增加。在印刷时代，报纸受制于必须保持或至少显得政治中立。"
    },
    {
      "original": "The department stores that ran ads in the New York Times wanted to reach everyone in the region, both liberal and conservative, so the Times had to serve both. But the Times didn't regard this neutrality as something forced upon them.",
      "translated": "在《纽约时报》上刊登广告的百货公司希望接触到该地区的所有人，无论是自由派还是保守派，因此《纽约时报》必须同时服务这两类人群。但《纽约时报》并不认为这种中立性是被迫的。"
    },
    {
      "original": "They embraced it as their duty as a paper of record — as one of the big newspapers that aimed to be chronicles of their times, reporting every sufficiently important story from a neutral point of view.When I grew up the papers of record seemed timeless, almost sacred institutions.",
      "translated": "他们将其视为自己作为记录时代的报纸的职责——作为一家旨在成为时代编年史的大报，以中立的角度报道每一个足够重要的故事。在我成长的过程中，这些记录时代的报纸似乎永恒不变，几乎是神圣的机构。"
    },
    {
      "original": "Papers like the New York Times and Washington Post had immense prestige, partly because other sources of news were limited, but also because they did make some effort to be neutral.Unfortunately it turned out that the paper of record was mostly an artifact of the constraints imposed by print.",
      "translated": "像《纽约时报》和《华盛顿邮报》这样的报纸享有极高的声望，部分原因是其他新闻来源有限，但也因为他们确实努力保持中立。不幸的是，事实证明，作为“记录报纸”的地位主要是由于印刷媒介带来的限制所致。"
    },
    {
      "original": "[8] When your market was determined by geography, you had to be neutral. But publishing online enabled — in fact probably forced — newspapers to switch to serving markets defined by ideology instead of geography.",
      "translated": "当你的市场由地理位置决定时，你必须保持中立。但在线出版使得——事实上可能是迫使——报纸转向为由意识形态而非地理位置定义的市场服务。"
    },
    {
      "original": "Most that remained in business fell in the direction they'd already been leaning: left. On October 11, 2020 the New York Times announced that \"The paper is in the midst of an evolution from the stodgy paper of record into a juicy collection of great narratives.\" [9] Meanwhile journalists, of a sort, had arisen to serve the right as well.",
      "translated": "大多数继续营业的媒体朝着他们原来倾向的方向进一步倾斜：左倾。2020年10月11日，《纽约时报》宣布，“报纸正在经历从陈旧的记录者向精彩叙述的集合体的转变。”[9] 同时，也出现了服务于右翼的记者。"
    },
    {
      "original": "And so journalism, which in the previous era had been one of the great centralizing forces, now became one of the great polarizing ones.The rise of social media and the increasing polarization of journalism reinforced one another.",
      "translated": "因此，新闻业在前一个时代曾是重要的集中力量之一，现在却成为加剧分裂的力量之一。社交媒体的兴起和新闻业的日益极化相互强化。"
    },
    {
      "original": "In fact there arose a new variety of journalism involving a loop through social media. Someone would say something controversial on social media. Within hours it would become a news story. Outraged readers would then post links to the story on social media, driving further arguments online.",
      "translated": "事实上，一种新的新闻形式出现了，它涉及通过社交媒体形成的一个循环。某人在社交媒体上发表争议性言论。几小时内，这就会成为一则新闻。愤怒的读者随后会在社交媒体上发布该新闻的链接，从而引发更多的在线争论。"
    },
    {
      "original": "It was the cheapest source of clicks imaginable. You didn't have to maintain overseas news bureaus or pay for month-long investigations. All you had to do was watch Twitter for controversial remarks and repost them on your site, with some additional comments to inflame readers further.For the press there was money in wokeness.",
      "translated": "这是最便宜的点击来源。你不必维护海外新闻分社，也不必支付长达一个月的调查费用。你只需要在推特上关注争议性言论，并将它们转载到你的网站上，再加上一些煽动性的评论，以进一步激起读者的情绪。对媒体而言，觉醒主义有利可图。"
    },
    {
      "original": "But they weren't the only ones. That was one of the biggest differences between the two waves of political correctness: the first was driven almost entirely by amateurs, but the second was often driven by professionals.",
      "translated": "但它们并不是唯一的。这两次政治正确浪潮之间最大的差异之一在于：第一次几乎完全是由业余人士推动的，而第二次则经常是由专业人士推动的。"
    },
    {
      "original": "For some it was their whole job. By 2010 a new class of administrators had arisen whose job was basically to enforce wokeness. They played a role similar to that of the political commissars who got attached to military and industrial organizations in the USSR: they weren't directly in the flow of the organization's work, but watched from the side to ensure that nothing improper happened in the doing of it.",
      "translated": "对一些人来说，这成了他们的全部工作。到2010年，出现了一类新的管理者，他们的工作基本上就是推行觉醒意识。他们的角色类似于苏联时期附属于军事和工业组织的政治委员：他们并不直接参与组织的工作流程，而是从旁监督，确保在工作过程中不发生任何不当行为。"
    },
    {
      "original": "These new administrators could often be recognized by the word \"inclusion\" in their titles. Within institutions this was the preferred euphemism for wokeness; a new list of banned words, for example, would usually be called an \"inclusive language guide.\" [10]This new class of bureaucrats pursued a woke agenda as if their jobs depended on it, because they did.",
      "translated": "这些新任管理者通常可以通过其头衔中的“包容”一词来辨认。在机构内部，这是对觉醒主义的首选委婉语；例如，新的禁用词汇列表通常被称为“包容性语言指南”。[10]这批新的官僚们仿佛他们的职位取决于推动觉醒议程，实际上确实如此。"
    },
    {
      "original": "If you hire people to keep watch for a particular type of problem, they're going to find it, because otherwise there's no justification for their existence. [11] But these bureaucrats also represented a second and possibly even greater danger.",
      "translated": "如果你雇用人员来关注某一类问题，他们就会发现这些问题，因为否则他们的存在就没有理由。[11] 但这些官僚还代表了第二种可能更大的危险。"
    },
    {
      "original": "Many were involved in hiring, and when possible they tried to ensure their employers hired only people who shared their political beliefs. The most egregious cases were the new \"DEI statements\" that some universities started to require from faculty candidates, proving their commitment to wokeness.",
      "translated": "许多人参与了招聘工作，尽可能确保雇主只雇用与他们政治观点相同的人。最严重的情况是一些大学开始要求教职候选人提交新的“多元化、公平与包容性”（DEI）声明，以证明他们对觉醒运动的承诺。"
    },
    {
      "original": "Some universities used these statements as the initial filter and only even considered candidates who scored high enough on them. You're not hiring Einstein that way; imagine what you get instead.Another factor in the rise of wokeness was the Black Lives Matter movement, which started in 2013 when a white man was acquitted after killing a black teenager in Florida.",
      "translated": "一些大学将这些声明作为初步筛选的标准，只考虑那些得分足够高的候选人。这样你雇不到爱因斯坦；想象一下你会得到什么吧。觉醒主义的兴起的另一个因素是“黑人的命也是命”运动，该运动始于2013年，当时一名白人在佛罗里达州枪杀了一名黑人青少年后被宣告无罪。"
    },
    {
      "original": "But this didn't launch wokeness; it was well underway by 2013.Similarly for the Me Too Movement, which took off in 2017 after the first news stories about Harvey Weinstein's history of raping women. It accelerated wokeness, but didn't play the same role in launching it that the 80s version did in launching political correctness.The election of Donald Trump in 2016 also accelerated wokeness, particularly in the press, where outrage now meant traffic.",
      "translated": "但这并没有启动觉醒主义；事实上，到2013年它已经相当盛行了。同样，2017年关于哈维·温斯坦性侵女性的历史新闻报道引发了#MeToo运动。它加速了觉醒主义的发展，但并没有像80年代的版本在启动政治正确性方面所起的作用那样重要。2016年唐纳德·特朗普的当选也加速了觉醒主义的发展，尤其是在媒体领域，因为愤怒现在意味着流量。"
    },
    {
      "original": "Trump made the New York Times a lot of money: headlines during his first administration mentioned his name at about four times the rate of previous presidents.In 2020 we saw the biggest accelerant of all, after a white police officer asphyxiated a black suspect on video.",
      "translated": "特朗普为《纽约时报》赚了很多钱：在他第一个任期内，头版头条提到他的名字的频率大约是前任总统的四倍。2020年，我们见证了最大的加速器之一，一名白人警察在视频中窒息了一名黑人嫌疑人。"
    },
    {
      "original": "At this point the metaphorical fire became a literal one, as violent protests broke out across America. But in retrospect this turned out to be peak woke, or close to it. By every measure I've seen, wokeness peaked in 2020 or 2021.Wokeness is sometimes described as a mind-virus.",
      "translated": "此时，比喻性的火焰变成了实际的火焰，因为暴力抗议在美国各地爆发。但事后看来，这实际上是“觉醒”运动的顶峰，或者接近顶峰。根据我所看到的每一项指标，觉醒运动在2020年或2021年达到了顶点。觉醒运动有时被描述为一种思想病毒。"
    },
    {
      "original": "What makes it viral is that it defines new types of impropriety. Most people are afraid of impropriety; they're never exactly sure what the social rules are or which ones they might be breaking. Especially if the rules change rapidly.",
      "translated": "让它具有病毒性的是它定义了新的不当行为类型。大多数人害怕不当行为；他们从来不确定社会规则是什么，或者他们会违反哪些规则。尤其是当规则迅速变化时。"
    },
    {
      "original": "And since most people already worry that they might be breaking rules they don't know about, if you tell them they're breaking a rule, their default reaction is to believe you. Especially if multiple people tell them.",
      "translated": "而且，由于大多数人已经担心自己可能在违反一些他们不了解的规则，如果你告诉他们他们在违规，他们的第一反应往往是相信你。特别是如果有多个人告诉他们时。"
    },
    {
      "original": "Which in turn is a recipe for exponential growth. Zealots invent some new impropriety to avoid. The first people to adopt it are fellow zealots, eager for new ways to signal their virtue. If there are enough of these, the initial group of zealots is followed by a much larger group, motivated by fear.",
      "translated": "这反过来成为了指数增长的配方。狂热者发明了一些新的不当行为来避免。第一批采用这些新规则的人是志同道合的狂热者，他们热衷于通过新方式来展示自己的美德。如果有足够多这样的人，最初的狂热者群体就会被一个规模大得多的群体所跟随，而后者主要是出于恐惧的动机。"
    },
    {
      "original": "They're not trying to signal virtue; they're just trying to avoid getting in trouble. At this point the new impropriety is now firmly established. Plus its success has increased the rate of change in social rules, which, remember, is one of the reasons people are nervous about which rules they might be breaking.",
      "translated": "他们并不是想要标榜自己的美德；他们只是想避免惹上麻烦。此时，新的不当行为已经牢固确立。此外，它的成功加快了社会规则的变化速度，而这一点正是人们担心自己可能违反哪些规则的原因之一。"
    },
    {
      "original": "So the cycle accelerates. [12]What's true of individuals is even more true of organizations. Especially organizations without a powerful leader. Such organizations do everything based on \"best practices.\" There's no higher authority; if some new \"best practice\" achieves critical mass, they must adopt it.",
      "translated": "因此，这一循环加速了。[12]对于个人而言如此，对于组织而言更是如此。尤其是那些没有强大领导者的组织。这样的组织做一切事情都依赖于“最佳实践”。没有更高的权威；如果某个新的“最佳实践”达到了临界点，他们就必须采纳它。"
    },
    {
      "original": "And in this case the organization can't do what it usually does when it's uncertain: delay. It might be committing improprieties right now! So it's surprisingly easy for a small group of zealots to capture this type of organization by describing new improprieties it might be guilty of.",
      "translated": "在这种情况下，组织无法像以往在不确定时那样：拖延。它可能正在犯下不当行为！因此，一小群狂热分子通过描述组织可能犯下的新不当行为，很容易就能控制这类组织。"
    },
    {
      "original": "[13]How does this kind of cycle ever end? Eventually it leads to disaster, and people start to say enough is enough. The excesses of 2020 made a lot of people say that.Since then wokeness has been in gradual but continual retreat.",
      "translated": "这种循环是如何结束的？最终它会导致灾难，人们开始说够了。2020年的过度行为让很多人开始这样说。自那以后，“觉醒主义”一直在逐渐但持续地退潮。"
    },
    {
      "original": "Corporate CEOs, starting with Brian Armstrong, have openly rejected it. Universities, led by the University of Chicago and MIT, have explicitly confirmed their commitment to free speech. Twitter, which was arguably the hub of wokeness, was bought by Elon Musk in order to neutralize it, and he seems to have succeeded — and not, incidentally, by censoring left-wing users the way Twitter used to censor right-wing ones, but without censoring either.",
      "translated": "公司首席执行官们，以Brian Armstrong为首，公开拒绝了这一趋势。大学方面，芝加哥大学和麻省理工学院等明确重申了他们对言论自由的承诺。推特，曾经是觉醒文化的核心阵地，被埃隆·马斯克收购以中和这种趋势，而且他似乎已经成功了——而且顺便说一句，他并不是通过像推特过去审查右翼用户那样审查左翼用户来实现的，而是两者都不审查。"
    },
    {
      "original": "[14] Consumers have emphatically rejected brands that ventured too far into wokeness. The Bud Light brand may have been permanently damaged by it. I'm not going to claim Trump's second victory in 2024 was a referendum on wokeness; I think he won, as presidential candidates always do, because he was more charismatic; but voters' disgust with wokeness must have helped.So what do we do now?",
      "translated": "[14] 消费者强烈抵制了那些过于涉足觉醒主义的品牌。百威淡啤品牌可能因此而永久受损。我不会声称特朗普在2024年的第二次胜利是对觉醒主义的公投；我认为他之所以胜出，就像历任总统候选人一样，是因为他更具魅力；但选民对觉醒主义的反感肯定有所帮助。那么现在我们该怎么办？"
    },
    {
      "original": "Wokeness is already in retreat. Obviously we should help it along. What's the best way to do that? And more importantly, how do we avoid a third outbreak? After all, it seemed to be dead once, but came back worse than ever.In fact there's an even more ambitious goal: is there a way to prevent any similar outbreak of aggressively performative moralism in the future — not just a third outbreak of political correctness, but the next thing like it?",
      "translated": "觉醒主义已经在退潮。显然，我们应该助其一臂之力。最好的方法是什么？更重要的是，我们如何避免第三次爆发？毕竟，它似乎曾经已经消亡，但卷土重来时却比以往更糟。事实上，还有一个更加宏伟的目标：是否有可能防止任何类似激进表演式道德主义的未来爆发——不仅仅是一次第三次政治正确的爆发，而是类似现象的下一次出现？"
    },
    {
      "original": "Because there will be a next thing. Prigs are prigs by nature. They need rules to obey and enforce, and now that Darwin has cut off their traditional supply of rules, they're constantly hungry for new ones.",
      "translated": "因为总会有下一件事。道学家天生就是道学家。他们需要规则去遵守和执行，现在达尔文切断了他们传统上的规则来源，他们就不断渴望新的规则。"
    },
    {
      "original": "All they need is someone to meet them halfway by defining a new way to be morally pure, and we'll see the same phenomenon again.Let's start with the easier problem. Is there a simple, principled way to deal with wokeness?",
      "translated": "他们只需要有人在半路相迎，通过定义一种新的道德纯洁方式，我们就会再次看到同样的现象。让我们从比较简单的问题开始。是否有一种简单而有原则的方法来应对觉醒主义？"
    },
    {
      "original": "I think there is: to use the customs we already have for dealing with religion. Wokeness is effectively a religion, just with God replaced by protected classes. It's not even the first religion of this kind; Marxism had a similar form, with God replaced by the masses.",
      "translated": "我认为可以使用我们已有的处理宗教的方式。觉醒主义实际上是一种宗教，只不过把上帝换成了受保护群体。这甚至不是第一种此类宗教；马克思主义也有类似的形式，只不过把上帝换成了群众。"
    },
    {
      "original": "[15] And we already have well-established customs for dealing with religion within organizations. You can express your own religious identity and explain your beliefs, but you can't call your coworkers infidels if they disagree, or try to ban them from saying things that contradict its doctrines, or insist that the organization adopt yours as its official religion.If we're not sure what to do about any particular manifestation of wokeness, imagine we were dealing with some other religion, like Christianity.",
      "translated": "[15] 我们已经建立了处理组织内宗教事务的成熟惯例。你可以表达自己的宗教身份并解释你的信仰，但不能因为同事不同意你的观点就称他们为异教徒，或试图禁止他们说出与你信仰教义相悖的话，也不能坚持要求组织将你的宗教作为官方宗教。如果我们不确定如何应对任何形式的觉醒主义，想象一下我们是在处理其他宗教，比如基督教。"
    },
    {
      "original": "Should we have people within organizations whose jobs are to enforce woke orthodoxy? No, because we wouldn't have people whose jobs were to enforce Christian orthodoxy. Should we censor writers or scientists whose work contradicts woke doctrines?",
      "translated": "组织内是否应该有专门负责维护政治正确正统性的人？不应该，因为我们也并不会设立专门负责维护基督教正统性的人。是否应该审查那些作品与政治正确教义相矛盾的作家或科学家？"
    },
    {
      "original": "No, because we wouldn't do this to people whose work contradicted Christian teachings. Should job candidates be required to write DEI statements? Of course not; imagine an employer requiring proof of one's religious beliefs.",
      "translated": "不，因为我们不会对那些工作与基督教教义相悖的人这样做。招聘时是否应该要求候选人撰写DEI声明？当然不应该；想象一下，雇主要求证明个人的宗教信仰。"
    },
    {
      "original": "Should students and employees have to participate in woke indoctrination sessions in which they're required to answer questions about their beliefs to ensure compliance? No, because we wouldn't dream of catechizing people in this way about their religion.",
      "translated": "学生和员工是否应该被迫参加觉醒灌输课程，在这些课程中，他们必须回答有关自己信念的问题以确保合规？不，因为我们不会以这种方式对人们的宗教信仰进行教义问答。"
    },
    {
      "original": "[16]One shouldn't feel bad about not wanting to watch woke movies any more than one would feel bad about not wanting to listen to Christian rock. In my twenties I drove across America several times, listening to local radio stations.",
      "translated": "[16]不喜欢看觉醒电影的人不应该感到难过，就像不喜欢听基督教摇滚乐的人不会感到难过一样。在我二十多岁的时候，我多次驾车穿越美国，收听当地的广播电台。"
    },
    {
      "original": "Occasionally I'd turn the dial and hear some new song. But the moment anyone mentioned Jesus I'd turn the dial again. Even the tiniest bit of being preached to was enough to make me lose interest.But by the same token we should not automatically reject everything the woke believe.",
      "translated": "有时候我会转动收音机的旋钮，听到一些新歌。但只要有人提到耶稣，我就会再次转动旋钮。即使是最轻微的布道也会让我失去兴趣。但同样，我们也不应自动拒绝觉醒者所相信的一切。"
    },
    {
      "original": "I'm not a Christian, but I can see that many Christian principles are good ones. It would be a mistake to discard them all just because one didn't share the religion that espoused them. It would be the sort of thing a religious zealot would do.If we have genuine pluralism, I think we'll be safe from future outbreaks of woke intolerance.",
      "translated": "我不是基督徒，但我能看出来许多基督教的原则是好的。仅仅因为不认同宣扬这些原则的宗教就把它们全部抛弃，这将是一个错误。这正是宗教狂热者会做的事情。如果我们真正实现了多元主义，我认为我们将能够避免未来再次出现觉醒主义的不容忍现象。"
    },
    {
      "original": "Wokeness itself won't go away. There will for the foreseeable future continue to be pockets of woke zealots inventing new moral fashions. The key is not to let them treat their fashions as normative.",
      "translated": "觉醒主义本身不会消失。在可预见的未来，将会继续有觉醒狂热者制造新的道德风尚。关键在于不要让他们将这些风尚视为规范。"
    },
    {
      "original": "They can change what their coreligionists are allowed to say every few months if they like, but they mustn't be allowed to change what we're allowed to say. [17]The more general problem — how to prevent similar outbreaks of aggressively performative moralism — is of course harder.",
      "translated": "他们可以每隔几个月就改变同教信徒被允许说什么的内容，但如果他们喜欢，绝不能允许他们改变我们被允许说什么的内容。[17]更普遍的问题——如何防止类似的激进表演式道德主义的爆发——当然更难解决。"
    },
    {
      "original": "Here we're up against human nature. There will always be prigs. And in particular there will always be the enforcers among them, the aggressively conventional-minded. These people are born that way. Every society has them.",
      "translated": "这里我们面对的是人性。总会有自以为是的人。特别是其中总会有那些强迫他人遵守常规的人，那些思想激进地维护传统的人。这样的人天生如此。每个社会都有这样的人。"
    },
    {
      "original": "So the best we can do is to keep them bottled up.The aggressively conventional-minded aren't always on the rampage. Usually they just enforce whatever random rules are nearest to hand. They only become dangerous when some new ideology gets a lot of them pointed in the same direction at once.",
      "translated": "所以我们能做的最好的就是把他们压制住。那些思想保守的人并不总是处于疯狂状态。通常他们只是执行手头最接近的那些随意规则。只有当某种新意识形态将他们中的许多人同时指向同一个方向时，他们才会变得危险。"
    },
    {
      "original": "That's what happened during the Cultural Revolution, and to a lesser extent (thank God) in the two waves of political correctness we've experienced.We can't get rid of the aggressively conventional-minded.",
      "translated": "这就是文化大革命期间发生的事情，以及在我们经历的两次政治 correctness 波动中，虽然程度较轻（谢天谢地）。我们无法摆脱那些思想激进却 conventional 的人。"
    },
    {
      "original": "[18] And we couldn't prevent people from creating new ideologies that appealed to them even if we wanted to. So if we want to keep them bottled up, we have to do it one step downstream. Fortunately when the aggressively conventional-minded go on the rampage they always do one thing that gives them away: they define new heresies to punish people for.",
      "translated": "[18] 即便我们想阻止人们创造新的、吸引他们的意识形态，我们也无法做到。因此，如果我们想把它们压制住，我们必须采取下游一步的措施。幸运的是，当那些思想激进保守的人发起攻击时，他们总是会做一件事，使自己暴露无遗：他们会定义新的异端，以便惩罚人们。"
    },
    {
      "original": "So the best way to protect ourselves from future outbreaks of things like wokeness is to have powerful antibodies against the concept of heresy.We should have a conscious bias against defining new forms of heresy.",
      "translated": "因此，保护我们免受未来类似“觉醒主义”等现象爆发的最佳方式是拥有强大的反对异端概念的抗体。我们应该有意识地反对定义新的异端形式。"
    },
    {
      "original": "Whenever anyone tries to ban saying something that we'd previously been able to say, our initial assumption should be that they're wrong. Only our initial assumption of course. If they can prove we should stop saying it, then we should.",
      "translated": "每当有人试图禁止我们说一些以前可以自由表达的内容时，我们的初步假设应该是他们错了。当然，这只是初步假设。如果他们能够证明我们应该停止说这些内容，那么我们就应该停止。"
    },
    {
      "original": "But the burden of proof is on them. In liberal democracies, people trying to prevent something from being said will usually claim they're not merely engaging in censorship, but trying to prevent some form of \"harm\".",
      "translated": "但举证责任在他们身上。在自由民主国家，试图阻止某些言论的人通常会声称他们不仅仅是进行审查，而是试图防止某种形式的“伤害”。"
    },
    {
      "original": "And maybe they're right. But once again, the burden of proof is on them. It's not enough to claim harm; they have to prove it.As long as the aggressively conventional-minded continue to give themselves away by banning heresies, we'll always be able to notice when they become aligned behind some new ideology.",
      "translated": "也许他们是正确的。但又一次，举证责任在他们身上。仅仅声称有危害是不够的；他们必须证明这一点。只要那些思想保守的人继续通过禁止异端来暴露自己，我们就能始终察觉到他们何时在某种新意识形态背后结成同盟。"
    },
    {
      "original": "And if we always fight back at that point, with any luck we can stop them in their tracks.The number of true things we can't say should not increase. If it does, something is wrong.Notes[0] This was not the original meaning of \"woke,\" but it's rarely used in the original sense now.",
      "translated": "如果我们总是在那个时刻反击，或许我们就能阻止他们。我们无法说出的真相数量不应该增加。如果增加了，就说明有问题。注[0] “觉醒”这个词最初的含义并非如此，但现在很少有人在原来的意义上使用它了。"
    },
    {
      "original": "Now the pejorative sense is the dominant one.[1] Why did 1960s radicals focus on the causes they did? One of the people who reviewed drafts of this essay explained this so well that I asked if I could quote him: The middle-class student protestors of the New Left rejected the socialist/Marxist left as unhip.",
      "translated": "现在贬义的用法占主导地位。[1] 为什么20世纪60年代的激进分子关注他们关注的原因？一位审阅了这篇论文草稿的人对此解释得非常好，我询问是否可以引用他的话：中产阶级学生抗议者在新左派中拒绝了被视为不酷的社会主义/马克思主义左派。"
    },
    {
      "original": "They were interested in sexier forms of oppression uncovered by cultural analysis (Marcuse) and abstruse \"Theory\". Labor politics became stodgy and old-fashioned. This took a couple generations to work through.",
      "translated": "他们对文化分析（马尔库塞）揭示的更具吸引力的压迫形式和深奥的“理论”感兴趣。劳动政治变得沉闷过时。这一转变经历了几代人的时间。"
    },
    {
      "original": "The woke ideology's conspicuous lack of interest in the working class is the tell-tale sign. Such fragments as are, er, left of the old left are anti-woke, and meanwhile the actual working class shifted to the populist right and gave us Trump.",
      "translated": "觉醒主义对工人阶级明显的缺乏兴趣是其明显的标志。那些左翼残余现在反而反觉醒，而实际上，工人阶级已经转向民粹右翼，从而造就了特朗普。"
    },
    {
      "original": "Trump and wokeness are cousins.The middle-class origins of wokeness smoothed its way through the institutions because it had no interest in \"seizing the means of production\" (how quaint such phrases seem now), which would quickly have run up against hard state and corporate power.",
      "translated": "特朗普和觉醒主义是表兄弟。觉醒主义的中产阶级起源使其在机构中畅通无阻，因为它对“夺取生产资料”（这样的说法现在听起来多么过时）毫无兴趣，这很快就会遇到强硬的国家和企业权力的阻挠。"
    },
    {
      "original": "The fact that wokeness only expressed interest in other kinds of class (race, sex, etc) signalled compromise with existing power: give us power within your system and we'll bestow the resource we control — moral rectitude — upon you.",
      "translated": "事实证明，觉醒意识仅对其他类别的阶层（如种族、性别等）表现出兴趣，这标志着与现有权力的妥协：在你们的体系内给予我们权力，我们将把我们所控制的资源——道德正直——赐予你们。"
    },
    {
      "original": "As an ideological stalking horse for gaining control over discourse and institutions, this succeeded where a more ambitious revolutionary program would not have. [2] It helped that the humanities and social sciences also included some of the biggest and easiest undergrad majors.",
      "translated": "作为夺取话语和机构控制权的思想马前卒，这一策略在更为雄心勃勃的革命计划未能成功的地方取得了成效。[2] 人文学科和社会科学也包括了一些最大且最容易的本科专业，这一点也起到了帮助作用。"
    },
    {
      "original": "If a political movement had to start with physics students, it could never get off the ground; there would be too few of them, and they wouldn't have the time to spare.At the top universities these majors are not as big as they used to be, though.",
      "translated": "如果一个政治运动必须从物理系学生开始，那它永远也发展不起来；他们的数量太少，而且也没有多余的时间。不过，现在顶级大学里这些专业的学生人数已经不像以前那么多了。"
    },
    {
      "original": "A 2022 survey found that only 7% of Harvard undergrads plan to major in the humanities, vs nearly 30% during the 1970s. I expect wokeness is at least part of the reason; when undergrads consider majoring in English, it's presumably because they love the written word and not because they want to listen to lectures about racism.[3] The puppet-master-and-puppet character of political correctness became clearly visible when a bakery near Oberlin College was falsely accused of race discrimination in 2016.",
      "translated": "2022年的一项调查显示，只有7%的哈佛本科生计划主修人文学科，而在20世纪70年代这一比例接近30%。我认为，觉醒主义至少是其中一部分原因；当本科生考虑主修英语时，这大概是因为他们热爱文字，而不是因为他们想听关于种族主义的讲座。2016年，欧柏林学院附近的一家面包店被错误地指控种族歧视，这一事件清楚地揭示了政治正确的操纵者与被操纵者之间的关系。"
    },
    {
      "original": "In the subsequent civil trial, lawyers for the bakery produced a text message from Oberlin Dean of Students Meredith Raimondo that read \"I'd say unleash the students if I wasn't convinced this needs to be put behind us.\"[4] The woke sometimes claim that wokeness is simply treating people with respect.",
      "translated": "在随后的民事审判中，面包店的律师出示了一条来自欧柏林学生事务院长梅雷迪思·雷蒙多的短信，内容是：“如果我不认为这件事需要被翻篇的话，我就会说让学生们行动起来。”[4] 有些觉醒者有时声称，觉醒只不过是尊重他人。"
    },
    {
      "original": "But if it were, that would be the only rule you'd have to remember, and this is comically far from being the case. My younger son likes to imitate voices, and at one point when he was about seven I had to explain which accents it was currently safe to imitate publicly and which not.",
      "translated": "但若真是如此，那将是唯一需要记住的规则，而这与实际情况相去甚远。我的小儿子喜欢模仿声音，有一次在他大约七岁的时候，我不得不向他解释现在哪些口音可以公开模仿，哪些则不行。"
    },
    {
      "original": "It took about ten minutes, and I still hadn't covered all the cases.[5] In 1986 the Supreme Court ruled that creating a hostile work environment could constitute sex discrimination, which in turn affected universities via Title IX.",
      "translated": "这花了大约十分钟，而我还未涵盖所有案例。1986年，最高法院裁定，制造敌对工作环境可以构成性别歧视，这反过来又通过第九条影响了大学。"
    },
    {
      "original": "The court specified that the test of a hostile environment was whether it would bother a reasonable person, but since for a professor merely being the subject of a sexual harassment complaint would be a disaster whether the complainant was reasonable or not, in practice any joke or remark remotely connected with sex was now effectively forbidden.",
      "translated": "法院明确规定，判断敌意环境的标准是它是否会让一个理性的人感到困扰，但由于对教授而言，仅仅成为性骚扰投诉的对象，无论投诉人是否理性，都是一场灾难，因此在实际操作中，任何与性稍微有些关联的笑话或言论现在实际上都被禁止了。"
    },
    {
      "original": "Which meant we'd now come full circle to Victorian codes of behavior, when there was a large class of things that might not be said \"with ladies present.\"[6] Much as they tried to pretend there was no conflict between diversity and quality.",
      "translated": "这意味着我们又回到了维多利亚时代的礼仪规范，当时有很多话题在“有女士在场”的情况下是不能提及的。尽管他们努力假装多样性与质量之间不存在冲突。"
    },
    {
      "original": "But you can't simultaneously optimize for two things that aren't identical. What diversity actually means, judging from the way the term is used, is proportional representation, and unless you're selecting a group whose purpose is to be representative, like poll respondents, optimizing for proportional representation has to come at the expense of quality.",
      "translated": "但你不能同时优化两个不相同的目标。从该术语的使用情况来看，“多样性”实际上意味着比例代表性，除非你选择的群体的目的是为了具有代表性，比如调查对象，否则优化比例代表性必然会牺牲质量。"
    },
    {
      "original": "This is not because of anything about representation; it's the nature of optimization; optimizing for x has to come at the expense of y unless x and y are identical.[7] Maybe societies will eventually develop antibodies to viral outrage.",
      "translated": "这并不是因为表征的问题；而是优化的本质；除非 x 和 y 完全相同，否则优化 x 必然会以牺牲 y 为代价。[7] 也许社会最终会发展出对病毒式愤怒的抗体。"
    },
    {
      "original": "Maybe we were just the first to be exposed to it, so it tore through us like an epidemic through a previously isolated population. I'm fairly confident that it would be possible to create new social media apps that were less driven by outrage, and an app of this type would have a good chance of stealing users from existing ones, because the smartest people would tend to migrate to it.[8] I say \"mostly\" because I have hopes that journalistic neutrality will return in some form.",
      "translated": "也许我们只是最早接触到它的人，所以它像瘟疫一样在我们中间迅速蔓延，就像在先前隔绝的人群中一样。我相当有信心，可以创建新的社交媒体应用程序，这些应用不那么依赖于激愤，而这样的应用有很大的机会从现有的应用中抢走用户，因为最聪明的人往往会迁移到这样的平台。[8] 我说“大部分”是因为我抱有希望，希望某种形式的新闻中立性能够回归。"
    },
    {
      "original": "There is some market for unbiased news, and while it may be small, it's valuable. The rich and powerful want to know what's really going on; that's how they became rich and powerful.[9] The Times made this momentous announcement very informally, in passing in the middle of an article about a Times reporter who'd been criticized for inaccuracy.",
      "translated": "有些市场需要公正的新闻，尽管它可能很小，但很有价值。富人和有权势的人想知道真正发生了什么；这就是他们变得富有的原因之一。《泰晤士报》在一篇关于一位因不准确报道而受到批评的《泰晤士报》记者的文章中，非常随意地宣布了这一重要消息。"
    },
    {
      "original": "It's quite possible no senior editor even approved it. But it's somehow appropriate that this particular universe ended with a whimper rather than a bang.[10] As the acronym DEI goes out of fashion, many of these bureaucrats will try to go underground by changing their titles.",
      "translated": "很可能根本没有任何高级编辑批准过。但恰巧的是，这个特定的宇宙以呜咽而非巨响宣告终结，倒也合乎情理。随着DEI这一缩写逐渐失宠，许多这样的官僚将会通过更换头衔来试图转入地下。"
    },
    {
      "original": "It looks like \"belonging\" will be a popular option.[11] If you've ever wondered why our legal system includes protections like the separation of prosecutor, judge, and jury, the right to examine evidence and cross-examine witnesses, and the right to be represented by legal counsel, the de facto parallel legal system established by Title IX makes that all too clear.[12] The invention of new improprieties is most visible in the rapid evolution of woke nomenclature.",
      "translated": "看起来“归属感”将成为一个受欢迎的选择。[11] 如果你曾经疑惑过为什么我们的法律体系中包含了如检察官、法官和陪审团的分离、审查证据和质证证人的权利以及被律师代表的权利等保护措施，那么《第九条》实际上建立的平行法律体系就让这一切变得显而易见。[12] 新的不当行为的发明在觉醒词汇的快速演变中最为明显。"
    },
    {
      "original": "This is particularly annoying to me as a writer, because the new names are always worse. Any religious observance has to be inconvenient and slightly absurd; otherwise gentiles would do it too. So \"slaves\" becomes \"enslaved individuals.\" But web search can show us the leading edge of moral growth in real time: if you search for \"individuals experiencing slavery\" you will as of this writing find five legit attempts to use the phrase, and you'll even find two for \"individuals experiencing enslavement.\"[13] Organizations that do dubious things are particularly concerned with propriety, which is how you end up with absurdities like tobacco and oil companies having higher ESG ratings than Tesla.[14] Elon did something else that tilted Twitter rightward though: he gave more visibility to paying users.",
      "translated": "这对我来说尤其令人烦恼，因为我是一个作家，新的名字总是更糟糕。任何宗教仪式都必须不方便且略显荒谬；否则，外邦人也会这么做。所以“奴隶”变成了“被奴役的个体”。但网络搜索可以实时向我们展示道德进步的最前沿：如果你搜索“经历奴隶制的个体”，到目前为止你会找到五次真正尝试使用这个短语的实例，甚至能找到两次“经历被奴役的个体”[13]。做可疑事情的组织特别关心体面，这就是为什么你会看到烟草和石油公司比特斯拉有更高的ESG评级[14]。埃隆还做了另一件让推特右倾的事情：他给了付费用户更多的可见度。"
    },
    {
      "original": "Paying users lean right on average, because people on the far left dislike Elon and don't want to give him money. Elon presumably knew this would happen. On the other hand, the people on the far left have only themselves to blame; they could tilt Twitter back to the left tomorrow if they wanted to.[15] It even, as James Lindsay and Peter Boghossian pointed out, has a concept of original sin: privilege.",
      "translated": "付费用户平均倾向于右翼，因为远左翼的人不喜欢埃隆，不愿意给他钱。埃隆显然预料到了这一点。另一方面，远左翼的人只能怪自己；如果他们愿意，明天就可以让推特重新左倾。甚至如詹姆斯·林赛和彼得·博格西安所指出的那样，推特还有一个原罪的概念：特权。"
    },
    {
      "original": "Which means unlike Christianity's egalitarian version, people have varying degrees of it. An able-bodied straight white American male is born with such a load of sin that only by the most abject repentance can he be saved.Wokeness also shares something rather funny with many actual versions of Christianity: like God, the people for whose sake wokeness purports to act are often revolted by the things done in their name.[16] There is one exception to most of these rules: actual religious organizations.",
      "translated": "这意味着，与基督教的平等观念不同，人们在这一点上有着不同的程度。一个身体健全、异性恋、白人、美国男性，生来就背负着如此多的原罪，只有通过最卑微的忏悔才能得到拯救。觉醒主义还与许多实际的基督教版本有着一个颇为有趣的一致之处：就像上帝一样，觉醒主义声称为之行动的人们，往往对其名义下所做的事情感到厌恶。[16] 对于这些规则，有一个例外：真正的宗教组织。"
    },
    {
      "original": "It's reasonable for them to insist on orthodoxy. But they in turn should declare that they're religious organizations. It's rightly considered shady when something that appears to be an ordinary business or publication turns out to be a religious organization.[17] I don't want to give the impression that it will be simple to roll back wokeness.",
      "translated": "他们坚持正统是可以理解的。但他们也应该声明自己是宗教组织。当一个看似普通的商业机构或出版物实际上是宗教组织时，人们理所当然地会认为这是可疑的。[17] 我不想给人一种印象，即逆转觉醒运动将是一件简单的事情。"
    },
    {
      "original": "There will be places where the fight inevitably gets messy — particularly within universities, which everyone has to share, yet which are currently the most pervaded by wokeness of any institutions.[18] You can however get rid of aggressively conventional-minded people within an organization, and in many if not most organizations this would be an excellent idea.",
      "translated": "有些地方的争斗不可避免地会变得混乱——尤其是在大学里，每个人都必须共享这些地方，而这些地方目前是所有机构中最受觉醒主义影响的。然而，你可以清除组织内那些过于传统思维的人，在许多，如果不是大多数组织中，这将是一个非常好的主意。"
    },
    {
      "original": "Even a handful of them can do a lot of damage. I bet you'd feel a noticeable improvement going from a handful to none.Thanks to Sam Altman, Ben Miller, Daniel Gackle, Robin Hanson, Jessica Livingston, Greg Lukianoff, Harj Taggar, Garry Tan, and Tim Urban for reading drafts of this.",
      "translated": "即使是一小撮人也能造成很大的伤害。我敢打赌，从有一小撮人到一个都没有，你会感到明显的改善。感谢Sam Altman、Ben Miller、Daniel Gackle、Robin Hanson、Jessica Livingston、Greg Lukianoff、Harj Taggar、Garry Tan和Tim Urban审阅本文的草稿。"
    }
  ],
  "translation_completed": "2025-07-29T12:33:07.552910",
  "translation_stats": {
    "total_paragraphs": 123,
    "success_count": 123,
    "success_rate": "100.0%"
  }
}